Repository: uyuni-project/uyuni-docs
Catalog: l10n/po/*/ROOT/pages/index.po
Languages: es

source: {productname} {productnumber} Documentation
es: Documentación de {productname} {productnumber}

source: What is {productname}?
es: ¿Qué es {productname}?

source: {productname} is a solution for organizations that require absolute control over maintenance and package deployment on their servers. {productname} enables you to manage large sets of Linux systems and keep them up to date, with automated software management, asset management, and system provisioning. {productname} allows you to maintain a high level of security while effectively managing system life-cycle requirements.
es: {productname} es una solución para organizaciones que requieren control absoluto sobre el mantenimiento y despliegue de paquetes en sus servidores. {productname} permite gestionar un gran número de sistemas Linux y mantenerlos actualizados, con gestión automatizada del software, gestión de activos, y provisionado de sistemas. {productname} permite mantener un alto nivel de seguridad y al mismo tiempo gestionar de forma efectiva los requerimientos de la gestión del ciclo de vida de los sistemas.

source: {productname} uses Salt to provide event-driven configuration and management control. The Salt-master orchestrates tens of thousands of Salt clients ({productname} Clients) using remote execution.
es: {productname} usa Salt para proporcionar configuración dirigida por eventos y control de la gestión. El servidor Salt maestro puede orquestar decenas de miles de clientes Salt (clientes {productname}) usando ejecución remota.

source: {productname} offers seamless management of {sle}, {opensuse}, {rhel}, {centos}, {oracle} and {ubuntu} client systems, no matter if on-premise, on public cloud, private cloud, hybrid cloud or even multi-cloud environments.
es: {productname} ofrece gestión sin esfuerzo de sistemas cliente {sle}, {opensuse}, {rhel}, {centos}, {oracle} y {ubuntu}, sin importar si se encuentran en instalaciones propias, en nube pública, nube privada, nube híbrida o incluso en entornos multinube.

source: Accessibility
es: Accesibilidad

source: If you cannot use the {productname} {webui}, almost all functionality (with the exception of virtualization tasks) is available from the command prompt. All command line tools can be used with assistive technology tools. Text readers ``orca`` and ``espeak`` can be enabled in the Desktop Applications Module. Speech recognition ``mycroft-core`` and ``sphinx`` are available in PackageHub. Additionally, you can interact with {productname} using the XML-RPC API.
es: Si no puede usar la interfaz web de {productname}, casi toda la funcionalidad (con la excepción de las tareas de virtualización) está disponible desde la línea de comandos. Todas las herramientas de línea de comandos se pueden usar en combinación con herramientas de tecnología asistiva. El Módulo de Aplicación de Escritorio provee lectores de texto como ``orca`` y ``espeak``. Las herramientas de reconocimiento de voz ``mycroft-core`` y ``sphinx`` están disponibles en PackageHub. Adicionalmente, se puede interactuar con {productname} usando la API XML-RPC.

source: For more information about [command]``spacecmd``, see xref:reference:spacecmd-intro.adoc[].
es: Para más información sobre [command]``spacecmd``, vea xref:reference:spacecmd-intro.adoc[].

source: For more information about other command line tools, see xref:reference:command-line-tools.adoc[].
es: Para más información sobre otras herramientas de línea de comandos, vea xref:reference:command-line-tools.adoc[].

source: For more information about the API, see https://documentation.suse.com/external-tree/en-us/suma/4.1/pdf/susemanager_api_doc_color_en.pdf.
es: Para más información sobre la API, vea https://documentation.suse.com/external-tree/en-us/suma/4.1/pdf/susemanager_api_doc_color_en.pdf.

source: For the latest information about all command line tools, see the release notes available from https://www.suse.com/releasenotes/.
es: Para conocer las últimas informaciones sobre todas las herramientas de línea de comandos, vea las Notas de Publicación disponibles en https://www.suse.com/releasenotes/.

source: Available Documentation
es: Documentación disponible

source: The following documentation is available for {productname} version {productnumber}.
es: La siguiente documentación está disponible para {productname} versión {productnumber}.

source: {productname} documentation is available in several locations and formats. For the most up-to-date version of this documentation, see https://documentation.suse.com/suma/.
es: La documentación de {productname} está disponible en varios lugares y formatos. Vea la versión más actualizada de esta documentación en https://documentation.suse.com/suma/.

source: Download All PDFs icon:caret-right[] icon:file-archive[link="../susemanager-docs_en-pdf.tar.gz"]
es: Descargar todos los PDFs icon:caret-right[] icon:file-archive[link="../susemanager-docs_es-pdf.tar.gz"]

source: | View HTML | View PDF | View HTML | View PDF | xref:installation:install-overview.adoc[Installation Guide] | icon:file-pdf[link="../pdf/suse_manager_installation_guide.pdf", window="_blank" role="green"] | xref:client-configuration:client-config-overview.adoc[Client Configuration Guide] | icon:file-pdf[link="../pdf/suse_manager_client-configuration_guide.pdf", window="_blank" role="green"] | xref:upgrade:upgrade-overview.adoc[Upgrade Guide] | icon:file-pdf[link="../pdf/suse_manager_upgrade_guide.pdf", window="_blank" role="green"] | xref:reference:reference-overview.adoc[Reference Guide] | icon:file-pdf[link="../pdf/suse_manager_reference_guide.pdf", window="_blank" role="green"] | xref:administration:admin-overview.adoc[Administration Guide] | icon:file-pdf[link="../pdf/suse_manager_administration_guide.pdf", window="_blank" role="green"] | xref:salt:salt-overview.adoc[Salt Guide] | icon:file-pdf[link="../pdf/suse_manager_salt_guide.pdf", window="_blank" role="green"] | xref:retail:retail-overview.adoc[Retail Guide] | icon:file-pdf[link="../pdf/suse_manager_retail_guide.pdf", window="_blank" role="green"] | xref:quickstart-public-cloud:qs-publiccloud-overview.adoc[Quick Start Guide - Public Cloud] | icon:file-pdf[link="../pdf/suse_manager_quickstart-public-cloud_guide.pdf", window="_blank" role="green"] | xref:large-deployments:large-deployments-overview.adoc[Large Deployments Guide] | icon:file-pdf[link="../pdf/suse_manager_large-deployments_guide.pdf", window="_blank" role="green"] | |
es: | Ver HTML | Ver PDF | Ver HTML | Ver PDF | xref:installation:install-overview.adoc[Manual de Instalación] | icon:file-pdf[link="../pdf/suse_manager_installation_guide.pdf", window="_blank" role="green"] | xref:client-configuration:client-config-overview.adoc[Manual de Configuración de Clientes] | icon:file-pdf[link="../pdf/suse_manager_client-configuration_guide.pdf", window="_blank" role="green"] | xref:upgrade:upgrade-overview.adoc[Manual de Actualización] | icon:file-pdf[link="../pdf/suse_manager_upgrade_guide.pdf", window="_blank" role="green"] | xref:reference:reference-overview.adoc[Guía de Referencia] | icon:file-pdf[link="../pdf/suse_manager_reference_guide.pdf", window="_blank" role="green"] | xref:administration:admin-overview.adoc[Manual de Administración] | icon:file-pdf[link="../pdf/suse_manager_administration_guide.pdf", window="_blank" role="green"] | xref:salt:salt-overview.adoc[Manual de Salt] | icon:file-pdf[link="../pdf/suse_manager_salt_guide.pdf", window="_blank" role="green"] | xref:retail:retail-overview.adoc[Manual de Retail] | icon:file-pdf[link="../pdf/suse_manager_retail_guide.pdf", window="_blank" role="green"] | xref:quickstart-public-cloud:qs-publiccloud-overview.adoc[Guía de Inicio Rápido - Nube Pública] | icon:file-pdf[link="../pdf/suse_manager_quickstart-public-cloud_guide.pdf", window="_blank" role="green"] | xref:large-deployments:large-deployments-overview.adoc[Guía para Grandes Despliegues] | icon:file-pdf[link="../pdf/suse_manager_large-deployments_guide.pdf", window="_blank" role="green"] | |

source: Download All PDFs icon:caret-right[] icon:file-archive[link="../uyuni-docs_en-pdf.tar.gz"]
es: Descargar todos los PDFs icon:caret-right[] icon:file-archive[link="../uyuni-docs_en-pdf.tar.gz"]

source: | View HTML | View PDF | View HTML | View PDF | xref:installation:install-overview.adoc[Installation Guide] | icon:file-pdf[link="../pdf/uyuni_installation_guide.pdf", window="_blank" role="green"] | xref:client-configuration:client-config-overview.adoc[Client Configuration Guide] | icon:file-pdf[link="../pdf/uyuni_client-configuration_guide.pdf", window="_blank" role="green"] | xref:upgrade:upgrade-overview.adoc[Upgrade Guide] | icon:file-pdf[link="../pdf/uyuni_upgrade_guide.pdf", window="_blank" role="green"] | xref:reference:reference-overview.adoc[Reference Guide] | icon:file-pdf[link="../pdf/uyuni_reference_guide.pdf", window="_blank" role="green"] | xref:administration:admin-overview.adoc[Administration Guide] | icon:file-pdf[link="../pdf/uyuni_administration_guide.pdf", window="_blank" role="green"] | xref:salt:salt-overview.adoc[Salt Guide] | icon:file-pdf[link="../pdf/uyuni_salt_guide.pdf", window="_blank" role="green"] | xref:retail:retail-overview.adoc[Retail Guide] | icon:file-pdf[link="../pdf/uyuni_retail_guide.pdf", window="_blank" role="green"] | xref:quickstart-public-cloud:qs-publiccloud-overview.adoc[Quick Start Guide - Public Cloud] | icon:file-pdf[link="../pdf/uyuni_quickstart-public-cloud_guide.pdf", window="_blank" role="green"] | xref:large-deployments:large-deployments-overview.adoc[Large Deployments Guide] | icon:file-pdf[link="../pdf/uyuni_large-deployments_guide.pdf", window="_blank" role="green"] | |
es: | Ver HTML | Ver PDF | Ver HTML | Ver PDF | xref:installation:install-overview.adoc[Manual de Instalación] | icon:file-pdf[link="../pdf/uyuni_installation_guide.pdf", window="_blank" role="green"] | xref:client-configuration:client-config-overview.adoc[Manual de Configuración de Clientes] | icon:file-pdf[link="../pdf/uyuni_client-configuration_guide.pdf", window="_blank" role="green"] | xref:upgrade:upgrade-overview.adoc[Manual de Actualización] | icon:file-pdf[link="../pdf/uyuni_upgrade_guide.pdf", window="_blank" role="green"] | xref:reference:reference-overview.adoc[Guía de Referencia] | icon:file-pdf[link="../pdf/uyuni_reference_guide.pdf", window="_blank" role="green"] | xref:administration:admin-overview.adoc[Manual de Administración] | icon:file-pdf[link="../pdf/uyuni_administration_guide.pdf", window="_blank" role="green"] | xref:salt:salt-overview.adoc[Manual de Salt] | icon:file-pdf[link="../pdf/uyuni_salt_guide.pdf", window="_blank" role="green"] | xref:retail:retail-overview.adoc[Manual de Retail] | icon:file-pdf[link="../pdf/uyuni_retail_guide.pdf", window="_blank" role="green"] | xref:quickstart-public-cloud:qs-publiccloud-overview.adoc[Guía de Inicio Rápido - Nube Pública] | icon:file-pdf[link="../pdf/uyuni_quickstart-public-cloud_guide.pdf", window="_blank" role="green"] | xref:large-deployments:large-deployments-overview.adoc[Guía de Grandes Despliegues] | icon:file-pdf[link="../pdf/uyuni_large-deployments_guide.pdf", window="_blank" role="green"] | |
