Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: Enter the email address of the administration account. Press btn:[Enter].
ja: 管理者アカウントの電子メールアドレスを入力します。btn:[Enter (入力)]を押します。
ko: 관리 계정의 이메일 주소를 입력합니다. btn:[Enter]를 누릅니다.
zh_cn: 输入管理帐户的电子邮件地址。按 btn:[Enter]。

source: Wait for deployment to complete.
ja: 配備が完了するまで待ちます。
ko: 배포가 완료될 때까지 기다립니다.
zh_cn: 等待部署完成。

source: Open a browser and proceed to your servers FQDN.
ja: ブラウザを開き、サーバのFQDNに進みます。
ko: 브라우저를 열고 서버 FQDN으로 이동합니다.
zh_cn: 打开浏览器并访问您的服务器 FQDN。

source: Enter your username (default is [literal]``admin``) and the password you set during the deployment process.
ja: ユーザ名(デフォルトは[literal]``admin``)と、配備プロセス中に設定したパスワードを入力します。
ko: 사용자 이름(기본값은 [literal]``admin``)과 배포 프로세스 중에 설정한 비밀번호를 입력합니다.
zh_cn: 输入您的用户名（默认为 [literal]``admin``）以及在部署过程中设置的口令。

source: In this guide you deployed {productname} {productnumber} Server as a container. Proceed to the next section to add your organization credentials for syncing with {scclongform}.
ja: このガイドでは、{productname} {productnumber}サーバをコンテナとして配備します。次のセクションに進み、{scclongform}と同期するために組織の資格情報を追加します。
zh_cn: 在本指南中，您已将 {productname} {productnumber} 服务器部署为容器。请继续阅读下一节来添加您的组织身份凭证，以便与 {scclongform} 同步。

source: Connect {productname} {productnumber} to {scclongform}
ja: {scclongform}への{productname} {productnumber}の接続
zh_cn: 将 {productname} {productnumber} 连接到 {scclongform}

source: This section covers synchronizing with {scc} from the {webui} and adding your first client channel.
ja: このセクションでは、{webui}から{scc}と同期を取り、最初のクライアントチャンネルを追加する方法について説明します。
zh_cn: 本节介绍如何通过 {webui} 与 {scc} 同步，以及如何添加第一个客户端通道。

source: Procedure: Entering Organization Credentials
cs: Postup: Zadání pověření organizace
ja: プロシージャ: 組織の資格情報の入力
ko: 절차: 조직 인증서 입력
zh_cn: 过程：输入组织身份凭证

source: In the {productname} {webui}, select menu:Admin[Setup Wizard].
ja: {productname}の{webui}で、menu:管理[セットアップウィザード]を選択します。
ko: {productname} {webui}에서 menu:관리[설정 마법사]를 선택합니다.
zh_cn: 在 {productname} {webui} 中，选择menu:管理[安装向导]。

source: From the [guimenu]``Setup Wizard`` page select the btn:[Organization Credentials] tab.
cs: Na stránce [guimenu]``Průvodce nastavením`` vyberte záložku a kartu btn:[Organization Credentials] (Pověření organizace).
ja: ［[guimenu]``セットアップウィザード``］ページから、btn:[組織の資格情報]タブを選択します。
ko: [guimenu]``설정 마법사`` 페이지에서 btn:[조직 인증서] 탭을 선택합니다.
zh_cn: 在[guimenu]``安装向导``页中，选择 btn:[组织身份凭证] 选项卡。

source: Click btn:[Add a new credential].
cs: Stiskněte btn:[Add a new credential] (Přidat nové pověření).
ja: btn:[Add a new credential]（新しい資格情報の追加）をクリックします。
ko: btn:[새 인증서 추가]를 클릭합니다.
zh_cn: 单击 btn:[添加新身份凭证]。

source: Point your browser to the {scclongform}.
ja: ブラウザで{scclongform}にアクセスします。
zh_cn: 在浏览器中访问 {scclongform}。

source: Select your organization from the left navigation.
ja: 左側のナビゲーションから自分の組織を選択します。
ko: 왼쪽 탐색에서 조직을 선택합니다.
zh_cn: 在左侧导航栏中选择您的组织。

source: Select the users tab from the top of the page then btn:[Organization Credentials].
ja: ページの上部から［ユーザ］タブを選択し、btn:[組織の資格情報]を選択します。
ko: 페이지 상단에서 사용자 탭을 선택한 다음 btn:[조직 자격 증명]을 선택합니다.
zh_cn: 在页面顶部选择用户选项卡，然后单击 btn:[组织身份凭证]。

source: Make a note of your **Mirroring credentials**.
ja: **ミラーリング資格情報**をメモします。
ko: **미러링 자격 증명**을 기록해 둡니다.
zh_cn: 记下您的**镜像身份凭证**。

source: Back in the {productname} {webui} enter your [guimenu]``Username`` and [guimenu]``Password``, and confirm with btn:[Save].
ja: {productname}の{webui}に戻り［[guimenu]``ユーザ名``］と［[guimenu]``パスワード``］に入力し、btn:[保存]を押して確定します。
ko: {productname} {webui}에 [guimenu]``사용자 이름`` 및 [guimenu]``비밀번호``를 다시 입력한 다음 btn:[저장]을 눌러 확인합니다.
zh_cn: 返回 {productname} {webui}，输入[guimenu]``用户名``和[guimenu]``口令``，然后单击 btn:[保存] 确认。

source: When the credentials are confirmed with a green check-mark icon, proceed with <<proc-quickstart-first-channel-sync>>.
ja: 緑色のチェックマークアイコンで資格情報を確認したら、<<proc-quickstart-first-channel-sync>>に進みます。
ko: 체크 표시 아이콘으로 인증서가 확인되면 <<proc-quickstart-first-channel-sync>>를 진행합니다.
zh_cn: 在系统以绿色打勾图标的形式确认身份凭证后，请继续执行<<proc-quickstart-first-channel-sync>>。

source: Procedure: Synchronizing with {scclongform}
ja: プロシージャ: {scclongform}と同期する
zh_cn: 过程：与 {scclongform} 同步

source: In the {webui}, navigate to menu:Admin[Setup Wizard].
cs: Ve {webui} přejděte do menu:Admin[Setup Wizard] (Správce [Průvodce nastavením]).
ja: {webui}で、menu:管理[セットアップウィザード]に移動します。
ko: {webui}에서 menu:관리[설정 마법사]로 이동합니다.
zh_cn: 在 {webui} 中，导航到menu:管理[安装向导]。

source: From the [guimenu]``Setup Wizard`` page select the [guimenu]``SUSE Products`` tab. If you recently registered with {scclongform} a list of products will begin populating the table. This operation could take up to a few minutes. You can monitor the progress of the operation in section on the right ``Refresh the product catalog from {scclongform}``. The table of products lists architecture, channels, and status information. For more information, see xref:reference:admin/setup-wizard.adoc[Wizard].
ja: ［[guimenu]``セットアップウィザード``］ページから［[guimenu]``SUSE製品``］タブを選択します。以前に{scclongform}で登録したことがある場合、製品の一覧が表に入力され始めます。この操作には数分かかる場合があります。右側の［``{scclongform}から製品カタログを更新``］セクションで、操作の進行状況を監視できます。この表は、アーキテクチャ、チャンネル、状態の各情報を一覧表示します。詳細については、xref:reference:admin/setup-wizard.adoc[ウィザード]を参照してください。
zh_cn: 在[guimenu]``安装向导``页面中选择 [guimenu]``SUSE 产品``选项卡。如果您最近在 {scclongform} 中注册过产品，则表格中将开始填充产品列表。此操作可能需要几分钟时间才会完成。您可在右侧的``从 {scclongform} 刷新产品目录``部分监控该操作的进度。该产品表格会列出体系结构、通道和状态信息。有关详细信息，请参见 xref:reference:admin/setup-wizard.adoc[向导]。

source: Use the ``Filter by product description`` and ``Filter by architecture`` to filter the list of displayed products. The channels listed on the btn:[Products] page provide repositories for clients.
ja: 表示されている製品のリストをフィルタするには、［``製品説明でフィルタ``］および［``アーキテクチャでフィルタ``］を使用します。btn:[製品]ページに一覧表示されたチャンネルによって、クライアントのリポジトリが提供されます。
ko: ``제품 설명으로 필터링`` 및 ``아키텍처로 필터링``을 사용하여 표시되는 제품 목록을 필터링할 수 있습니다. btn:[제품] 페이지에 나열된 채널은 클라이언트를 위한 리포지토리를 제공합니다.
zh_cn: 使用``按产品说明过滤``和``按体系结构过滤``来过滤显示的产品列表。btn:[产品] 页面上列出的通道将为客户端提供储存库。

source: Add channels to {productname} by selecting the check box to the left of each channel. Click the arrow symbol to the left of the description to unfold a product and list available modules.
ja: 各チャンネルの左側にあるチェックボックスをオンにして、チャンネルを{productname}に追加します。説明の左にある矢印をクリックして、製品を展開し、使用できるモジュールを一覧表示します。
ko: 각 채널 왼쪽의 확인란을 선택하여 {productname}에 채널을 추가합니다. 설명 왼쪽의 화살표 기호를 클릭하면 제품이 펼쳐지고 사용 가능한 모듈이 나열됩니다.
zh_cn: 选中每个通道左侧的复选框将相应通道添加到 {productname}。单击说明左侧的箭头符号可以展开产品并列出可用模块。

source: Click btn:[Add Products] at the top of the page to start product synchronization.
ja: ページの上部のbtn:[製品の追加]をクリックして、製品の同期を開始します。
ko: 페이지 상단의 btn:[제품 추가]를 클릭하여 제품 동기화를 시작합니다.
zh_cn: 单击页面顶部的 btn:[添加产品] 开始产品同步。

source: After adding the channel, {productname} will schedule the channel to be synchronized. This can take a long time as {productname} will copy channel software sources from the {suse} repositories located at {scclongform} to the local [path]``/var/lib/containers/storage/volumes/var-spacewalk/`` directory of your server.
ja: チャンネルを追加した後、{productname}は、チャンネルの同期をスケジュールします。この処理には時間がかかる場合があります。その理由は、{scclongform}にある{suse}リポジトリからサーバのローカル[path]``/var/lib/containers/storage/volumes/var-spacewalk/``ディレクトリにチャンネルソフトウェアソースを{productname}でコピーするためです。
zh_cn: 添加通道后，{productname} 将安排该通道的同步。这可能需要较长时间，因为 {productname} 会将通道软件源从 {scclongform} 中的 {suse} 储存库复制到您服务器本地的 [path]``/var/lib/containers/storage/volumes/var-spacewalk/`` 目录。

source: When the channel is fully synchronized, a bootstrap repository for it will be automatically generated. This step is crucial for successfully bootstrapping clients, ensuring that the channel synchronization and distribution are operational on the client side. This completes the installation and configuration of {productname}, along with preparing the channels necessary for bootstrapping clients.
ja: チャンネルが完全に同期されると、そのブートストラップリポジトリが自動的に生成されます。このステップは、クライアントを正常にブートストラップし、チャンネルの同期と配布がクライアント側で正常に機能していることを確認するために非常に重要です。これで、{productname}のインストールと設定、およびクライアントのブートストラップに必要なチャンネルの準備は完了です。
ko: 채널이 완전히 동기화되면 채널에 대한 부트스트랩 리포지토리가 자동으로 생성됩니다. 이 단계는 클라이언트를 성공적으로 부트스트랩하기 위해 매우 중요한 단계로, 클라이언트 측에서 채널 동기화 및 배포가 작동하는지 확인합니다. 이를 통해 {productname}의 설치 및 구성이 완료되고 클라이언트 부트스트랩에 필요한 채널이 준비됩니다.
zh_cn: 通道完全同步后，将自动为其生成引导储存库。此步骤对于成功引导客户端至关重要，可确保通道同步和分发能够在客户端正常运行。{productname} 的安装和配置，以及为引导客户端准备所需通道的过程到此完成。

source: When the channel synchronization process is complete, you can proceed with registering the {productname} {productnumber} Proxy or additional clients.
ja: チャンネル同期プロセスが完了したら、{productname} {productnumber}プロキシまたは他のクライアントの登録に進むことができます。
ko: 채널 동기화 프로세스가 완료되면 클라이언트를 등록할 수 있습니다. 자세한 지침은 xref:client-configuration:registration-overview.adoc[]을 참조하십시오.
zh_cn: 通道同步过程完成后，可以继续注册 {productname} {productnumber} 代理或其他客户端。

source: For more instructions, see xref:client-configuration:registration-overview.adoc[].
ja: 詳細手順については、xref:client-configuration:registration-overview.adoc[]を参照してください。
ko: 자세한 지침은 xref:client-configuration:registration-overview.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关详细说明，请参见 xref:client-configuration:registration-overview.adoc[]。

source: Entering the Container for Management
ja: 管理のためにコンテナに移動する
ko: 관리용 컨테이너 입력
zh_cn: 进入容器进行管理

source: {productname} {productnumber} Server Deployment as a Virtual Machine - KVM
ja: 仮想マシンとしての{productname} {productnumber}サーバの配備 - KVM
zh_cn: 将 {productname} {productnumber} 服务器部署为虚拟机 - KVM

source: This chapter provides the required Virtual Machine settings for deployment of {productname} {productnumber} as an image. KVM will be combined with Virtual Machine Manager (_virt-manager_) as a sandbox for this installation.
ja: この章では、{productname} {productnumber}をイメージとして配備するために必要な仮想マシン設定について説明します。このインストールでは、KVMを仮想マシンマネージャ(_virt-manager_)と組み合わせてサンドボックスとして使用します。
zh_cn: 本节提供用于将 {productname} {productnumber} 部署为映像所需的虚拟机设置。KVM 将与虚拟机管理器 (_virt-manager_) 结合使用，作为此安装的沙箱。

source: The preferred method for deploying {productname} {productnumber} Server is to use one of the following available images. All tools are included in these images greatly simplifying deployment.
ja: {productname} {productnumber}サーバを配備する際に推奨される方法は、利用可能な次のイメージの1つを使用することです。これらのイメージにはすべてのツールが含まれており、配備が大幅に容易になります。
ko: {productname} {productnumber} 서버의 배포를 위해 선호되는 방법은 다음 사용 가능한 이미지 중 하나를 사용하는 것입니다. 이러한 이미지에는 배포를 크게 간소화하는 모든 도구가 포함되어 있습니다.
zh_cn: 部署 {productname} {productnumber} 服务器的首选方法是使用以下可用映像之一。所有工具都已包含在这些映像中，因而大大简化了部署。

source: Images for {productname} {productnumber} are available at link:https://www.suse.com/download/suse-manager/[{productname} {productnumber} VM images].
ja: {productname} {productnumber}のイメージはlink:https://www.suse.com/download/suse-manager/[{productname} {productnumber} VM images]で入手できます。
ko: {productname} {productnumber}에 대한 이미지는 link:https://www.suse.com/download/suse-manager/[{productname} {productnumber} VM 이미지]에서 제공됩니다.
zh_cn: {productname} {productnumber} 的映像可在 link:https://www.suse.com/download/suse-manager/[{productname} {productnumber} VM 映像]中找到。

source: Available Server Images
ja: 利用可能なサーバイメージ
ko: 사용할 수 있는 서버 이미지
zh_cn: 可用服务器映像

source: | Architecture | Image Format | aarch64| qcow2, vmdk | x86_64 | qcow2, vmdk, raw, Self Installer | ppc64le | raw, Self Installer | s390x * | qcow2, raw
ja: | アーキテクチャ | イメージの形式 | aarch64| qcow2、vmdk | x86_64 | qcow2、vmdk、raw、セルフインストーラ | ppc64le | raw、セルフインストーラ | s390x * | qcow2、raw
ko: | 아키텍처 | 이미지 형식 | aarch64| qcow2, vmdk | x86_64 | qcow2, vmdk, 원시, 자체 설치 프로그램 | ppc64le | 원시, 자체 설치 프로그램 | s390x * | qcow2, 원시
zh_cn: | 体系结构 | 映像格式 | aarch64| qcow2、vmdk | x86_64 | qcow2、vmdk、raw、自安装程序 | ppc64le | raw、自安装程序 | s390x * | qcow2、raw

source: __* Two storage options are available for s390x: CDL DASD and FBA.__
ja: __* s390xでは、CDL DASDとFBAの2つのストレージオプションが利用可能です。__
ko: __* s390x용으로 사용할 수 있는 2개의 스토리지 옵션: CDL DASD 및 FBA.__
zh_cn: __* s390x 有两个可用存储选项：CDL DASD 和 FBA。__

source: This table specifies the minimum requirements. These are suitable for a quick test installation, such as a server with one client. If you want to use a production environment and need background information about disk space, see xref:installation-and-upgrade:hardware-requirements.adoc[].
ja: 次の表は、最低要件を指定しています。これらは、クライアントが1つある1つのサーバなど、テスト用の簡易的なインストールに適しています。運用環境を使用する場合、ディスク容量に関する背景情報が必要な場合は、xref:installation-and-upgrade:hardware-requirements.adoc[]を参照してください。
zh_cn: 下表指定了最低要求。这些要求适用于快速测试安装，例如具有一个客户端的服务器。如果您想要使用生产环境，并且需要有关磁盘空间的背景信息，请参见 xref:installation-and-upgrade:hardware-requirements.adoc[]。

source: 2+<| KVM Settings | Installation Method | Import Existing Disk Image | OS: | Linux | Version: | {productname}-Server.x86_64-{productnumber}.*.qcow2 | Memory: | Minimum *) | CPU's: | Minimum *) | Storage Format: | _.qcow2_ 40 GB (Default) Root Partition | Name: | test-setup | Network | Bridge _br0_
ko: 2+<| KVM 설정 | 설치 방법 | 기존 디스크 이미지 임포트 | OS: | Linux | 버전: | {productname}-Server.x86_64-{productnumber}.*.qcow2 | 메모리: | 최소 *) | CPU: | 최소 *) | 저장소 형식: | _.qcow2_ 40GB(기본) 루트 파티션 | 이름: | test-setup | 네트워크 | Bridge _br0_
zh_cn: 2+<| KVM 设置 | 安装方法 | 导入现有磁盘映像 | 操作系统： | Linux | 版本： | {productname}-Server.x86_64-{productnumber}.*.qcow2 | 内存： | 至少 *) | CPU 数量： | 至少 *) | 存储格式： | _.qcow2_ 40 GB（默认）根分区 | 名称： | test-setup | 网络： | 网桥 _br0_

source: *) For minimum values, see xref:installation-and-upgrade:hardware-requirements.adoc#server-hardware-requirements[].
zh_cn: *) 最低要求值请参见 xref:installation-and-upgrade:hardware-requirements.adoc#server-hardware-requirements[]。

source: Configure RAM and number of CPUs.
ko: RAM 및 CPU 수를 구성합니다.
zh_cn: 配置 RAM 和 CPU 数量。

source: Name your KVM machine.
ja: KVMマシンに名前を付けます。
ko: KVM 머신의 이름을 지정합니다.
zh_cn: 为您的 KVM 计算机命名。

source: Register {sl-micro} and {productname} {productnumber} Server
ko: {sl-micro} 및 {productname} {productnumber} 서버 등록
zh_cn: 注册 {sl-micro} 和 {productname} {productnumber} 服务器

source: The {sl-micro} {microversion} entitlement is included within the {productname} entitlement, so it does not require a separate registration code.
zh_cn: {sl-micro} {microversion} 权利包含在 {productname} 权利中，因此不需要单独的注册代码。

source: Procedure: Registering {sl-micro} and {productname} {productnumber}
ko: 절차: {sl-micro} 및 {productname} {productnumber} 등록
zh_cn: 过程：注册 {sl-micro} 和 {productname} {productnumber}

source: Boot the virtual machine.
ja: 仮想マシンをブートします。
ko: 가상 머신을 부팅합니다.
zh_cn: 引导虚拟机。

source: Log in as `root`.
cs: Přihlaste se jako `root`.
ja: ``root``としてログインします。
ko: **`root`** 로 로그인합니다.
zh_cn: 以 `root` 身份登录。

source: Register {sl-micro} with SCC.
ko: SCC를 사용하여 {sl-micro}를 등록합니다.
zh_cn: 在 SCC 中注册 {sl-micro}。

source: transactional-update register -r <REGCODE> -e <your_email>
zh_cn: transactional-update register -r <注册代码> -e <您的电子邮件地址>

source: Register {productname} {productnumber} with {scclongform}.
ja: {scclongform}で{productname} {productnumber}を登録します。
zh_cn: 在 {scclongform} 中注册 {productname} {productnumber}。

source: transactional-update register -p Multi-Linux-Manager-Server/5.1/x86_64 -r <REGCODE>
zh_cn: transactional-update register -p Multi-Linux-Manager-Server/5.1/x86_64 -r <注册代码>

source: Update the system:
ja: システムを更新します。
ko: 시스템 업데이트:
zh_cn: 更新系统：

source: If updates were applied reboot.
ja: 更新が適用されていた場合は再起動します。
ko: 업데이트가 적용된 경우 재부팅합니다.
zh_cn: 如果已应用更新，请重引导。

source: This step is optional. However, if custom persistent storage is required for your infrastructure, use the [command]``mgr-storage-server`` tool.
ja: このステップはオプションです。ただし、ご使用のインフラストラクチャでカスタム永続ストレージが必要な場合は、[command]``mgr-storage-server``ツールを使用します。
ko: 이 단계는 선택 사항입니다. 그러나 인프라에 사용자 정의 영구 스토리지가 필요한 경우 [command]``mgr-storage-server`` 도구를 사용하십시오.
zh_cn: 此步骤是可选的。但是，如果您的基础架构需要自定义的永久性存储，请使用 [command]``mgr-storage-server`` 工具。

source: For more information, see [command]``mgr-storage-server --help``. This tool simplifies creating the container storage and database volumes. Use the command in the following manner:
ko: 자세한 내용은 [command]``mgr-storage-server --help``를 참조하십시오. 이 도구는 컨테이너 스토리지 및 데이터베이스 볼륨 생성을 간소화합니다. 이 명령은 다음 방법으로 사용하십시오.
zh_cn: 有关详细信息，请参见 [command]``mgr-storage-server --help``。此工具可以简化容器存储和数据库卷的创建流程。请按以下方式使用该命令：

source: This command will move the persistent storage volumes at [path]``/var/lib/containers/storage/volumes`` to specified storage devices.
ja: このコマンドは、[path]``/var/lib/containers/storage/volumes``にある永続ストレージボリュームを指定されたストレージデバイスに移動します。
zh_cn: 此命令会将 [path]``/var/lib/containers/storage/volumes`` 中的永久性存储卷移动到指定的存储设备。

source: {productname} {productnumber} Server Deployment as a Virtual Machine - VMware
ja: {productname} {productnumber}サーバの仮想マシンとしての配備 - VMware
zh_cn: 将 {productname} {productnumber} 服务器部署为虚拟机 - VMware

source: This chapter provides the required Virtual Machine settings for deployment of {productname} {productnumber} as an Image. VMware will be used as a sandbox for this installation.
ja: この章では、{productname} {productnumber} をイメージとして配備するために必要な仮想マシン設定について説明します。このインストールでは、VMwareをサンドボックスとして使用します。
zh_cn: 本章提供用于将 {productname} {productnumber} 部署为映像的虚拟机设置。将使用 VMware 作为此安装的沙箱。

source: {productname} Virtual Machine Settings - VMware
ja: {productname} 仮想マシン設定 - VMware
ko: {productname} 가상 머신 설정 - VMware
zh_cn: {productname} 虚拟机设置 - VMware

source: This sections describes VMware configurations, focusing on the creation of an extra virtual disk essential for the {productname} storage partition within VMware environments.
ja: このセクションでは、VMware環境内の{productname}ストレージパーティションに不可欠な追加の仮想ディスクの作成に重点を置いて、 VMware設定について説明します。
ko: 이 섹션에서는 VMware 환경 내 {productname} 스토리지 파티션에 필수인 추가 가상 디스크 생성을 중심으로 VMware 구성을 설명합니다.
zh_cn: 本节说明 VMware 配置，重点介绍如何在 VMware 环境中创建对 {productname} 存储分区至关重要的额外虚拟磁盘。

source: Download {productname} Server [filename]``.vmdk`` file then transfer a copy to your VMware storage.
ja: {productname} Server [filename]``.vmdk``ファイルをダウンロードし、コピーをVMwareストレージに移動します。
ko: {productname} 서버 [filename]``.vmdk`` 파일을 다운로드한 다음 사본을 VMware 스토리지로 전송합니다.
zh_cn: 下载 {productname} Server [filename]``.vmdk`` 文件，然后将该文件副本传输到您的 VMware 存储区。

source: Add an additional [systemitem]``Hard Disk 2`` of 500 GB (or more).
ja: 500GB以上の[systemitem]``Hard Disk 2``を追加します。
ko: 500GB(또는 그 이상)의 추가적인 [systemitem]``Hard Disk 2``를 추가합니다.
zh_cn: 额外添加一个 500 GB（或更多空间）的[systemitem]``硬盘 2``。

source: Before starting obtain your {productname} Registration Code from {scclongform} - https://scc.suse.com.
ja: 開始する前に、{scclongform} (https://scc.suse.com)から{productname}登録コードを入手してください。
ko: 시작하기 전에 {scclongform} - https://scc.suse.com[]에서 {productname} 등록 코드를 받으십시오.
zh_cn: 开始之前，从 {scclongform} (https://scc.suse.com) 获取您的 {productname} 注册代码。

source: Register {sl-micro} with {scc}.
zh_cn: 在 {scc} 中注册 {sl-micro}。

source: Requirements and Considerations
ja: 要件と考慮事項
zh_cn: 要求和注意事项

source: Troubleshooting
cs: Řešení problémů
ko: 문제 해결
zh_cn: 查错

source: Legacy {productname} Server Migration to Container
ko: 레거시 {productname} 서버를 컨테이너로 마이그레이션
zh_cn: 将旧版 {productname} 服务器迁移到容器

source: To migrate a legacy {productname} Server to a container, a new machine is required.
ko: 레거시 {productname} 서버를 컨테이너로 마이그레이션하려면 새 시스템이 필요합니다.
zh_cn: 要将旧版 {productname} 服务器迁移到容器，需要准备一台新计算机。

source: In the context of this migration, the legacy {productname} Server (RPM installation) is sometimes also called _old server_.
ko: 이 마이그레이션의 맥락에서 레거시 {productname} 서버(RPM 설치)를 _old server_라고도 합니다.
zh_cn: 在该迁移场景中，旧版 {productname} 服务器（RPM 安装方式）有时也被称为_旧服务器_。

source: Neither in-place migration is not possible nor allows the migration procedure currently any hostname renaming functionality.
ko: 인플레이스 마이그레이션은 불가능할 뿐만 아니라, 현재 마이그레이션 절차는 호스트 이름 변경 기능을 허용하지 않습니다.
zh_cn: 目前，该迁移过程既不支持就地迁移，也不提供主机名重命名功能。

source: Thus the fully qualified domain name (FQDN) on the new server will remain identical to that on the legacy server.
ko: 따라서 새 서버의 FQDN(정규화된 도메인 이름)은 레거시 서버의 FQDN과 동일하게 유지됩니다.
zh_cn: 因此，新服务器的完全限定域名 (FQDN) 将与旧版服务器保持一致。

source: After migration, it is necessary to update the DHCP and DNS records to point to the new server.
ko: 마이그레이션 후에는 새 서버를 가리키도록 DHCP 및 DNS 레코드를 업데이트해야 합니다.
zh_cn: 迁移之后，需要更新 DHCP 和 DNS 记录以指向新的服务器。

source: For more information, see <<migration-finalization>>.
ko: 자세한 내용은 <<migration-finalization>>에서 확인할 수 있습니다.
zh_cn: 有关详细信息，请参见 <<migration-finalization>>。

source: Self trusted GPG keys are not migrated.
ja: 自己信頼GPGキーは移行されません。
zh_cn: 自信任 GPG 密钥不会被迁移。

source: GPG keys that are trusted in the RPM database only are not migrated. Thus synchronizing channels with [command]``spacewalk-repo-sync`` can fail.
ja: RPMデータベースで信頼されているGPGキーのみが移行されます。したがって、[command]``spacewalk-repo-sync``でチャンネルを同期すると失敗する可能性があります。
zh_cn: 仅在 RPM 数据库中可信的 GPG 密钥不会迁移。因此，使用 [command]``spacewalk-repo-sync`` 同步通道可能会失败。

source: The administrator must migrate these keys manually from the legacy {productname} installation to the container host after the actual server migration.
ko: 관리자는 실제 서버 마이그레이션을 수행한 후 이러한 키를 레거시 {productname} 설치에서 컨테이너 호스트로 수동으로 마이그레이션해야 합니다.
zh_cn: 在完成服务器的实际迁移后，管理员必须手动将这些密钥从旧版 {productname} 系统迁移到容器主机。

source: Procedure: Manual Migration of the GPG Keys to New Server
ko: 절차: 새 서버로 GPG 키를 수동으로 마이그레이션
zh_cn: 过程：将 GPG 密钥手动迁移到新服务器

source: Copy the keys from the legacy Uyuni server to the container host of the new server.
ko: 레거시 Uyuni 서버의 키를 새 서버의 컨테이너 호스트로 복사합니다.
zh_cn: 将旧版 Uyuni 服务器中的密钥复制到新服务器的容器主机。

source: Initial Preparation on the Legacy Server
ko: 레거시 서버에서의 초기 준비
zh_cn: 旧版服务器上的初始准备工作

source: The migration can take a very long time depending on the amount of data that needs to be replicated. To reduce downtime it is possible to run the migration multiple times in a process of _initial replication_, _re-replication_, or _final replication and switch over_ while all the services on the legacy server can stay up and running.
ko: 복제해야 할 데이터의 양에 따라 마이그레이션은 매우 오랜 시간이 소요될 수 있습니다. 다운타임을 줄이기 위해, 레거시 서버의 모든 서비스가 가동된 상태를 유지하면서 _initial replication_, _re-replication_ 또는 _final replication and switch over_ 프로세스로 마이그레이션을 여러 번 실행할 수 있습니다.
zh_cn: 迁移可能需要很长时间，具体时长取决于需要复制的数据量。为了减少停机时间，可以在初始复制、重新复制或最终复制和切换过程中多次执行迁移，同时旧版服务器上的所有服务都可以保持正常运行。

source: Only during the final migration the processes on the legacy server need to be stopped.
ko: 기존 서버의 프로세스는 최종 마이그레이션 중에만 중지해야 합니다.
zh_cn: 只有在最终迁移期间才需要停止旧版服务器上的进程。

source: For all non-final replications add the parameter [command]``--prepare`` to prevent the automatic stopping the services on the legacy server. For example:
ko: 최종이 아닌 모든 복제 작업에 [command]``--prepare`` 파라미터를 추가하여 레거시 서버에서 서비스가 자동으로 중지되는 것을 방지하십시오. 예:
zh_cn: 对于最终复制以外的所有复制，请添加参数 [command]``--prepare``，以防止自动停止旧版服务器上的服务。例如：

source: Procedure: Initial Preparation on the Legacy Server
ko: 절차: 레거시 서버에서 초기 준비
zh_cn: 过程：旧版服务器上的初始准备工作

source: Stop the {productname} services:
ja: {productname}サービスを停止します。
ko: {productname} 서비스를 중지합니다.
zh_cn: 停止 {productname} 服务：

source: Stop the PostgreSQL service:
ja: PostgreSQLサービスを停止します。
ko: PostgreSQL 서비스를 중지합니다.
zh_cn: 停止 PostgreSQL 服务：

source: SSH Connection Preparation
ja: SSH接続の準備
zh_cn: SSH 连接准备

source: Ensure that for [systemitem]``root`` an SSH key exists on the new {productnumber} server. If a key does not exist, create it with the command:
ko: 새 {productnumber} 서버에 [systemitem]``root``에 대한 SSH 키가 있는지 확인합니다. 키가 없는 경우 다음 명령을 사용하여 만듭니다.
zh_cn: 确保新 {productnumber} 服务器上的 [systemitem]``root`` 已存在 SSH 密钥。如果密钥不存在，请使用以下命令创建一个：

source: The SSH configuration and agent should be ready on the new server host for a connection to the legacy server that does not prompt for a password.
ko: 새 서버 호스트에서 비밀번호를 묻지 않는 레거시 서버에 연결할 수 있도록 SSH 구성 및 에이전트가 준비되어 있어야 합니다.
zh_cn: 新服务器上的 SSH 配置和代理应准备就绪，这样在连接旧版服务器时，就不会出现输入口令的提示。
