Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: You can replace a proxy at any time, as it does not store any information about the clients that are connected to it. This process is handled using a reactivation key, which prevents you from losing the history of the proxy. If you do not use a reactivation key, the replacement proxy will become a new one with a new ID. The replacement proxy must have the same name and IP address as its predecessor.
cs: Proxy server můžete nahradit kdykoli, neboť neukládá žádné informace o klientech, kteří jsou k němu připojeni. Tento proces je zpracován pomocí reaktivačního klíče, který vám zabrání ve ztrátě historie serveru proxy. Nepoužijete-li reaktivační klíč, náhradní proxy bude považován za nový s novým ID. Nahrazený proxy musí mít stejný název a IP adresu jako jeho předchůdce.

source: You can also reinstall a proxy to change it from a traditional proxy to a Salt proxy.
cs: Můžete také přeinstalovat server proxy, abyste jej mohli změnit z tradičního proxy na Salt proxy.

source: Replace a Proxy
cs: Nahrazení proxy

source: Procedure: Replacing a Traditional Proxy and Keeping the Clients Registered
cs: Postup: Výměna tradičního proxy a zachování registrace klientů

source: Before starting the migration, save the data from the old proxy, if needed. Consider copying important or custom data to a central place that can also be accessed by the new proxy.
cs: Před zahájením migrace uložte, je-li třeba, data původního proxy. Zvažte kopírování důležitých nebo vlastních dat uživatele do centrálního umístění, ke kterému může přistupovat také nový proxy server.

source: Shut down the old proxy.
cs: Vypněte původní proxy.

source: Install a new {productname} Proxy. For installation instructions, see xref:install-proxy-unified.adoc[Proxy Installation].
cs: Instalujte nový {productname} Proxy. Pokyny k instalaci viz xref:install-proxy-unified.adoc[Proxy Installation].

source: In the {webui}, create a reactivation key for the old proxy system. On the [guimenu]``System Details`` tab of the old proxy click [guimenu]``Reactivation``. Click [guimenu]``Generate New Key``, and make a note of the new key.
cs: Ve {webui} vytvořte reaktivační klíč pro starý proxy systém. Na záložce [guimenu]``System Details`` (podrobnosti systému) starého proxy klikněte na [guimenu]``Reactivation`` (re-aktivace). Klikněte [guimenu]``Generate New Key`` (generovat nový klíč) a nový klíč si poznamenejte.

source: Restore the proxy data from the backup you made earlier. See step 1 of this procedure.
cs: Obnovte data proxy ze zálohy, kterou jste provedli dříve (v kroku 1 tohoto postupu).

source: For Salt proxies, you need to do some additional steps before you bootstrap the new proxy.
cs: Před bootstrapem nového Salt proxy je třeba provést určité dodatečné kroky.

source: Procedure: Replacing a Salt Proxy and Keeping the Clients Registered
cs: Postup: Výměna Salt proxy a zachování registrace klientů

source: In the {webui}, navigate to menu:Salt[Keys], locate the Salt key associated with the old proxy, and click btn:[delete].
cs: Ve {Webui} navigujte do menu:Salt[Keys], vyhledejte klíč Salt spojený s původním proxy a stiskněte btn:[delete] (Smazat).

source: For more information about using reactivation keys, see xref:client-configuration:activation-keys.adoc[].
cs: Další informace o použití re-aktivačních klíčů viz xref:client-configuration:activation-keys.adoc[].

source: After the installation of the new proxy, you might also need to:
cs: Po instalaci nového serveru proxy možná budete muset:

source: Change a Proxy from Traditional to Salt
cs: Změňte proxy z tradičního na Salt

source: You can reinstall the proxy to switch from a traditional to a Salt proxy. In this method, instead of a reactivation key, reuse the same activation key you used to originally register the proxy. This means you do not have to re-register the clients.
cs: Proxy můžete přeinstalovat a tak přepnout z tradičního na Salt proxy. V této metodě namísto reaktivačního klíče znovu použijte stejný aktivační klíč, který jste použili k původní registraci proxy. To znamená, že nemusíte znovu registrovat klienty.

source: Procedure: Replacing a Traditional Proxy with a Salt Proxy
cs: Postup: Výměna tradičního proxy za Salt proxy

source: Install a new {productname} Proxy, and ensure it has the same IP address as the proxy you are replacing. For installation instructions, see xref:install-proxy-unified.adoc[Proxy Installation].
cs: Nainstalujte nový server {productname} Proxy a zajistěte, aby měl stejnou IP adresu jako ten, který nahrazujete. Pokyny k instalaci viz xref:install-proxy-unified.adoc[Proxy Installation].

source: Serving big files
cs: Obsluha velkých souborů

source: Proxy - Major Version Upgrade (X Upgrade)
cs: Proxy - upgrade hlavní verze (upgrade X)

source: Proxy - Minor Version or Patch Level Upgrade (Y or Z Upgrade)
cs: Proxy - menší verze (modifikace) nebo upgrade na úrovni opravy/záplaty (upgrade Y nebo Z)

source: Update the Proxy (Y)
cs: Aktualizace proxy (Y)

source: To update a proxy use the [guimenu]``Product Migration``:
cs: Pro aktualizaci proxy použijte [guimenu]``Product Migration``:

source: Proxy Product Migration (Target)
cs: Migrace Proxy Product (cíl)

source: Proxy Product Migration (Channels)
cs: Migrace proxy Product (kanály)

source: Update the Proxy (Z)
cs: Aktualizace proxy (Z)

source: Select packages to be updated on the proxy, and then apply the selection.
cs: Vyberte balíčky, které se mají na serveru proxy aktualizovat, a pak výběr použijte.

source: If you are attempting to bootstrap traditional clients, check that you can resolve the host name of the server while you are logged in to the client. You might need to add the FQDN of the server to [path]``/etc/hosts`` local resolution file on the client. Check using the [command]``hostname -f`` command with the local IP address of the server.
cs: Pokoušíte-li se zavést tradiční klienty, zkontrolujte, zda můžete při přihlášení ke klientovi vyřešit název hostitele serveru. Možná budete muset přidat plně kvalifikovaný název domény serveru do souboru lokálního řešení [cesta]``/etc/hosts`` v klientovi. Zkontrolujte to příkazem [command]``název hostitele -f`` s místní IP adresou serveru.

source: Network requirements
cs: Požadavky na síť

source: When you run {productname} on public clouds, you must apply security measures to limit access to the instance. A world-accessible {productname} instance violates the terms of the {productname} EULA, and is not supported by {suse}.
cs: Když spustíte {productname} na veřejných cloudech, musíte omezit přístup k instanci pomocí bezpečnostních opatření. Světově dostupná instance {productname} porušuje podmínky smlouvy EULA {productname} a {suse} ji nepodporuje.

source: Prepare storage volumes
cs: Připravte svazky úložiště

source: We recommend that the repositories and the database for {productname} are stored on separate storage devices to the root volume. This will help to avoid data loss. Do not use logical volume management (LVM) for public cloud installations.
cs: Doporučujeme, aby úložiště a databáze produktu {productname} byly uloženy na samostatných paměťových zařízeních do kořenového svazku. To pomůže vyhnout se ztrátě dat. Nepoužívejte správu logických svazků (LVM) pro veřejné cloudové instalace.

source: You must set up the storage devices before you run the YaST {productname} setup procedure.
cs: Před vlastní instalací YaST {productname} musíte nastavit paměťová zařízení.

source: You can set up the external disk with the [command]``suma-storage`` command. This creates an XFS partition mounted at ``/manager_storage`` and uses it as the location for the database and repositories:
cs: Externí disk nastavíte příkazem [command]``suma-storage``. Tím se vytvoří oddíl XFS připojený k ``/manager_storage`` a použije se pro umístění databáze a úložišť:

source: /usr/bin/suma-storage <devicename>
cs: /usr/bin/suma-storage <název_zařízení>

source: Public Cloud Setup
cs: Nastavení veřejného cloudu

source: {productname} Server needs to be registered with {scc} to receive updates before you can sign in.
cs: {productname} Server je třeba před přihlášením registrovat u {scc} pro získání aktualizací.

source: Follow the cloud providers instructions to SSH into the instance, and run this command to start set up:
cs: Postupujte podle pokynů poskytovatelů cloudu k SSH do instance a spusťte nastavení tímto příkazem:

source: Follow the prompts, and wait for the setup to finish.
cs: Postupujte podle pokynů a počkejte na dokončení instalace.

source: Activate the public cloud module
cs: Aktivujte modul veřejného cloudu

source: To use {productname} on a public cloud instance, you need to activate the public cloud module.
cs: Pro použití {productname} jako instance veřejného cloudu aktivujte moduly pro veřejný cloud.

source: Procedure: Activating the public cloud module
cs: Postup: Aktivace modulu veřejného cloudu

source: On the {productname} Server, open the {yast} management tool, and navigate to menu:Software[Software Repositories].
cs: Na serveru {productname} otevřete nástroj pro správu {yast} a přejděte do menu:Software[Software Repositories].

source: Click btn:[Add] and select [guimenu]``Extensions and Modules from Registration Server``.
cs: Klikněte na btn:[Add] (Přidat) a vyberte [guimenu]``Extensions and Modules from Registration Server`` (Rozšíření a moduly z registračního serveru).

source: In the [guimenu]``Available extensions`` field, select [guimenu]``Public Cloud Module``.
cs: V poli [guimenu]``Available extensions`` (Dostupné rozšíření) vyberte [guimenu]``Public Cloud Module`` (Modul veřejného cloudu).

source: If you prefer to use the command line, you can add the module with this command:
cs: Dáváte-li přednost příkazovému řádku, můžete modul přidat pomocí tohoto příkazu:

source: For {productname} Server on a public cloud, the expected modules are:
cs: Očekávané moduly pro server {productname} ve veřejném cloudu jsou:

source: Public Cloud Module
cs: Modul veřejného cloudu

source: Complete setup in the {webui}
cs: Úplné nastavení na {webui}

source: Open the {productname} {webui} with a web browser, using an address like this:
cs: Otevřete {productname} {webui} pomocí webového prohlížeče použitím adresy podobné této:

source: https://<public_IP>
cs: https://<veřejná_IP>

source: Sign in to the {productname} {webui} with the administrator account. The username and password varies depending on your provider.
cs: Přihlaste se k {productname} {webui} účtem správce. Uživatelské jméno a heslo se liší v závislosti na poskytovateli.

source: Default Administrator Account Details
cs: Podrobnosti výchozího účtu správce

source: | Provider | Default Username | Default Password | Amazon EC2 | ``admin`` | ``<instance-ID>`` | Google Compute Engine | ``admin`` | ``<instance-ID>`` | Microsoft Azure | ``admin`` | ``<instance-name>-suma``
cs: | Poskytovatel | Výchozí jm. uživ. | Výchozí heslo | Amazon EC2 | ``admin`` | ``<ID-instance>`` | Google Compute Engine | ``admin`` | ``<ID-instance>`` | Microsoft Azure | ``admin`` |``<název-instance> -suma``

source: You can retrieve the instance name or ID from the public cloud instance web console, or from the command prompt:
cs: Název instance nebo ID můžete získat z webové konzoly instance veřejného cloudu nebo z příkazového řádku:

source: When you sign in to the administrator account for the first time, you are given an automatically generated organization name. Change this by navigating to menu:Admin[Organizations], and editing the organization name.
cs: Při prvním přihlášení k účtu správce dostanete automaticky generovaný název organizace. Změňte to tak, že přejdete do menu:Admin[Organizace] a upravíte název organizace.

source: When you have signed in to the administrator account for the first time, change the default password to protect your account.
cs: Po prvním přihlášení k účtu správce změňte výchozí heslo, aby byl Váš účet chráněn.

source: Use the {productname} {webui} to add the required software products, and schedule a repository synchronization. The best way to do this is to navigate to menu:Admin[Setup Wizard] and follow the prompts.
cs: Použitím {productname} {webui} přidejte požadované softwarové produkty a naplánujte synchronizaci úložiště. Nejlepším způsobem je přejít do menu:Admin[Průvodce nastavením] a postupovat podle pokynů.

source: If you are intending to register {ubuntu} or {rhel} clients, you need to set up custom repositories and channels. For more information, see the relevant section in xref:client-configuration:registration-overview.adoc[].
cs: Máte-li v úmyslu registrovat klienty {ubuntu} nebo {rhel}, musíte vytvořit vlastní úložiště a kanály. Další údaje viz příslušný oddíl xref:client-configuration:registration-overview.adoc[].

source: To synchronize your channels, navigate to menu:Software[Manage > Channels]. Click each channel you created, navigate to the menu:Repositories[Sync] tab, and click btn:[Sync Now]. You can also schedule synchronization from this screen.
cs: Chcete-li synchronizovat kanály, přejděte do menu:Software[Manage > Channels] (Správa > Kanály). Klikněte na každý kanál, který jste vytvořili, přejděte do menu:Repositories[Sync] a klikněte na btn:[Sync Now]. Na této obrazovce můžete také synchronizaci naplánovat.

source: Before bootstrapping a client, make sure all the selected channels for that product are synchronized.
cs: Před zavedením systému klienta se ujistěte, že jsou synchronizovány všechny vybrané kanály pro daný produkt.

source: Synchronization can sometimes take several hours, in particular for openSUSE, SLES ES, and RHEL channels.
cs: Synchronizace může někdy trvat několik hodin, zejména u kanálů openSUSE, SLES ES a RHEL.

source: When you have your {productname} Server set up, you are ready to start registering clients. For more information about registering clients on a public cloud, see xref:client-configuration:clients-pubcloud.adoc[].
cs: Když máte {productname} Server nastavený, jste připraveni začít registrovat klienty. Další informace o registraci klientů ve veřejném cloudu najdete v dokumentu xref:client-configuration:clients-pubcloud.adoc[].

source: You will not be able to fix issues that arise during the migration. Ensure you have created a backup before you start the migration. If you are running {productname} Server on a virtual machine, we recommend that you create a snapshot before you start.
cs: Nebudete moci opravit problémy, které vzniknou během migrace. Před zahájením migrace se ujistěte, že jste vytvořili zálohu. Používáte-li {productname} Server na virtuálním počítači, doporučujeme vám před začátkem vytvořit snímek.

source: To migrate the database to the latest database version run the migrate script:
cs: Chcete-li migrovat databázi na nejnovější verzi, spusťte migrační skript:

source: For more information about PostgreSQL database migration, see xref:db-migration-xy.adoc[].
cs: Další informace o migraci databáze PostgreSQL viz xref:db-migration-xy.adoc[].

source: Some additional manual steps might be required, and this information is only available in the release notes. For important extra information about your upgrade, see the release notes at https://www.uyuni-project.org/pages/stable-version.html.
cs: Mohou být potřebné další manuální kroky, k nimž najdete informace pouze v poznámkách k verzi. Další důležité informace o upgradu najdete v poznámkách k verzi na https://www.uyuni-project.org/pages/stable-version.html.

source: SUSE Manager Server Setup
cs: Nastavení serveru SUSE Manager

source: Start {productname} setup with YaST
cs: Spusťte instalaci {productname} pomocí YaST

source: Synchronize the {sle} product channel from {scc}
cs: Synchronizujte produktový kanál {sle} z {scc}

source: {productname} is part of the {sle} product family and thus compatible with the software shipped with {sles}.
cs: {productname} je součástí rodiny produktů {sle} a je tedy kompatibilní se softwarem dodávaným se {sles}.

source: {productname} is a complex system, and therefore installing third party software is not allowed. Installing monitoring software provided by a third party vendor is allowed only if you do not exchange basic libraries such as SSL, cryptographic software, and similar tools. As part of providing product support, SUSE reserves the right to ask to remove any third party software (and associated configuration changes) and then to reproduce the problem on a clean system.
cs: {productname} je složitý systém, a proto není instalace softwaru třetích stran povolena. Instalace monitorovacího softwaru poskytovaného prodejcem třetí strany je povolena pouze v případě, že nevyměňuje základní knihovny, jako je SSL, kryptografický software a podobné nástroje. V rámci poskytování podpory produktu si společnost SUSE vyhrazuje právo požádat o odstranění veškerého softwaru třetích stran (a souvisejících změn konfigurace) a poté problém reprodukovat v čistém systému.

source: Set up {productname} with YaST
cs: Nastavte {productname} programem YaST

source: This section guides you through {productname} setup using {yast}.
cs: Tato část vás provede nastavením {productname} nástrojem {yast}.

source: On the {productname} Server, at the command line, use the [command]``yast2 susemanager_setup`` command to begin setup.
cs: Na serveru {productname} z příkazového řádku spusťte instalaci příkazem [command]``yast2 susemanager_setup``.

source: From the introduction screen select menu:SUSE Manager Setup[Setup SUSE Manager from scratch] and click btn:[Next] to continue.
cs: Na úvodní obrazovce vyberte menu:SUSE Manager Setup[Setup SUSE Manager from scratch] (Nastavení správce SUSE[Nastavení správce SUSE od začátku]) a pokračujte stisknutím btn:[Next] (Další).

source: {productname} can sometimes send a large volume of notification emails. You can disable email notifications in the {webui} after setup, if you need to. For more information on disabling email notifications, see xref:reference:users/user-details.adoc[].
cs: {productname} může někdy posílat velké množství e-mailů s oznámeními. Je-li třeba, můžete po nastavení deaktivovat e-mailová oznámení na {webui}. Další údaje o vypnutí e-mailových upozornění viz xref:reference:users/user-details.adoc[].

source: If you intend to use a custom SSL certificate, you need to have set this up first. For more information about SSL certificates, see xref:administration:ssl-certs.adoc[].
cs: Chcete-li použít vlastní certifikát SSL, musíte jej nejprve nastavit. Další informace o certifikátech SSL viz xref:administration:ssl-certs.adoc[].

source: From the menu:SUSE Manager Setup[Database Settings] screen, enter a database user and password and click btn:[Next] to continue.
cs: Z obrazovky menu:SUSE Manager Setup[Database Settings] (Nastavení správce SUSE [Nastavení databáze]) zadejte uživatele a heslo databáze a pokračujte stisknutím btn:[Next] (Další).

source: Click btn:[Yes] to run setup when prompted, and wait for it to complete.
cs: Stisknutím btn:[Yes] (Ano) spustíte instalaci po zobrazení výzvy a počkejte na dokončení.

source: Take a note of the address of the {productname} {webui}.
cs: Poznamenejte si adresu {productname} {webui}.

source: When you create your certificate password, ensure it is at least seven characters in length. It must not contain spaces, single or double quotation marks (``'`` or ``"``), exclamation marks (``!``), or dollar signs (``$``). Always store your passwords in a secure location. Without this password it will not be possible to set up the {productname} Proxy.
cs: Při vytváření hesla k certifikátu se ujistěte, že má délku alespoň sedm znaků. Nesmí obsahovat mezery, jednoduché nebo dvojité uvozovky (``'`` nebo ``"``), vykřičníky (``!``) ani znaky dolaru (``$``). Hesla si vždy ukládejte na bezpečném místě. Bez tohoto hesla nebude možné nastavit proxy {productname}.

source: Creating the Main Administration Account
cs: Vytvoření hlavního účtu pro správu

source: This section guides you through creating your organization's main administration account for {productname}.
cs: Tato část vás provede vytvořením hlavního účtu správy {productname} vaší organizace.

source: The main administration account is the _highest authority account_ within {productname} and therefore account access information should be stored in a secure location.
cs: Hlavní účet pro správu {productname} Vaší organizace je _účet nejvyšší autority_, a proto by informace o přístupu k účtu měly být uloženy na bezpečném nebo zabezpečeném místě.

source: For security it is recommended that the main administrator creates _low level admin accounts_ designated for administration of organizations and individual groups.
cs: Kvůli bezpečnosti se doporučuje, aby hlavní správce vytvořil _správcovské účty nízké úrovně_ určené pro správu organizací a jednotlivých skupin.

source: In the browser, enter the address provided after completing setup.
cs: Po dokončení nastavení zadejte do prohlížeče poskytnutou adresu.

source: With this address you open the {productname} {webui}.
cs: Na této adrese otevřete {productname} {webui}.

source: In the {webui}, navigate to the menu:Create Organization[Organization Name] field and enter your organization name.
cs: Ve {webui} přejděte do pole menu:Create Organization[Organization Name] (Vytvořit organizaci [Název organizace]) a zadejte název vaší organizace.

source: You are now presented with the {productname} menu:Home[Overview] page.
cs: Nyní se vám zobrazuje {productname} menu:Home[Overview] (Domů[Přehled]).

source: Synchronizing Products from {scc}
cs: Synchronizace produktů ze {scc}

source: {scc} (SCC) maintains a collection of repositories which contain packages, software and updates for all supported enterprise client systems. These repositories are organized into channels each of which provide software specific to a distribution, release, and architecture. After synchronizing with SCC clients may receive updates, and be organized into groups and assigned to specific product software channels.
cs: {scc} (SCC) udržuje sbírku úložišť, která obsahují balíčky, software a aktualizace pro všechny podporované podnikové klientské systémy. Tato úložiště jsou uspořádána do kanálů, z nichž každý poskytuje software specifický pro distribuci, vydání a architekturu. Po synchronizaci se SCC mohou klienty dostávat aktualizace a mohou být organizovány do skupin a přiřazeny ke konkrétním softwarovým kanálům produktu.

source: This section covers synchronizing with SCC from the {webui} and adding your first client channel.
cs: Tato část pojednává o synchronizaci se SCC z webu {webui} a o přidání vašeho prvního klientského kanálu.

source: Before you can synchronize software repositories with SCC, you will need to enter organization credentials in {susemgr}. In previous versions, so-called mirror credentials were used instead. The organization credentials give you access to the SUSE product downloads. You will find your organization credentials in https://scc.suse.com/organizations.
cs: Než budete moci synchronizovat softwarová úložiště se SCC, budete muset zadat pověření organizace v {susemgr}. V předchozích verzích se místo toho používala takzvaná Zrcadlová pověření. Pověření organizace vám umožňují přístup ke stažení produktu SUSE. Pověření vaší organizace najdete na https://scc.suse.com/organizations.

source: Enter your organization credentials in the {susemgr} {webui}:
cs: Zadejte přihlašovací údaje své organizace do {susemgr} {webui}:

source: In the {susemgr} {webui}, select menu:Admin[Setup Wizard].
cs: V {susemgr} {webui} vyberte menu:Admin[Setup Wizard] (Správce[Průvodce nastavením]).
