Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: | Hardware | Details | Recommendation | CPU | {x86_64}, {arm} | Minimum 2 dedicated 64-bit CPU cores | | Recommended | The same as minimum values | RAM | Minimum | 2 GB | | Recommended | 8 GB | Disk Space | [path]``/`` (root directory) | Minimum 40 GB | | [path]``/var/lib/containers/storage/volumes`` | Minimum 100 GB | Swap space | Systems can benefit from additional swap space. {suse} recommends using a swap file instead of a swap partition. For more information about swap space, see xref:installation-and-upgrade:hardware-requirements.adoc#installation-swap-space[]. | 4 to 8 GB
ko: | 하드웨어 | 세부 정보 | 권장 | CPU | {x86_64}, {arm} | 최소 2개의 전용 64비트 CPU 코어 | | 권장 | 최소값과 동일 | RAM | 최소 | 2GB | | 권장 | 8GB | 디스크 공간 | [path]``/`` (루트 디렉토리) | 최소 40GB | | [path]``/var/lib/containers/storage/volumes`` | 최소 100GB | 스왑 공간 | 시스템은 추가 스왑 공간의 이점을 누릴 수 있습니다. {suse}는 스왑 파티션 대신 스왑 파일을 사용할 것을 권장합니다. 스왑 공간에 대한 자세한 내용은 xref:installation-and-upgrade:hardware-requirements.adoc#installation-swap-space[]에서 확인할 수 있습니다. | 4~8GB
zh_cn: | 硬件 | 详细信息 | 建议 | CPU | {x86_64}、{arm} | 至少 2 个专用 64 位 CPU 核心 | | 建议 | 与最低要求相同 | RAM | 至少 | 2 GB | | 建议 | 8 GB | 磁盘空间 | [path]``/``（根目录） | 至少 40 GB | | [path]``/var/lib/containers/storage/volumes`` | 至少 100 GB | 交换空间 | 额外配置交换空间有助于提升系统性能。{suse} 建议使用交换文件而非交换分区。有关交换空间的详细信息，请参见 xref:installation-and-upgrade:hardware-requirements.adoc#installation-swap-space[]。 | 4 到 8 GB

source: By default the {productname} Proxy container caches packages in the [path]``/var/lib/containers/storage/volumes/uyuni-proxy-squid-cache/`` directory. If there is not enough space available, the proxy will remove old, unused packages and replace them with newer packages.
ja: デフォルトでは、{productname}プロキシコンテナは、[[path]``/var/lib/containers/storage/volumes/uyuni-proxy-squid-cache/``ディレクトリにパッケージをキャッシュします。容量が不足している場合、プロキシは、使用されていない古いパッケージを削除し、新しいパッケージに置き換えます。
zh_cn: 默认情况下，{productname} 代理容器将软件包缓存在 [path]``/var/lib/containers/storage/volumes/uyuni-proxy-squid-cache/`` 目录中。如果可用空间不足，代理将去除旧的未使用软件包，并将其替换为较新的软件包。

source: As a result of this behavior:
cs: V důsledku tohoto chování:
ja: この動作の結果は以下のとおりです。
ko: 이 동작의 결과:
zh_cn: 鉴于这种行为：

source: The larger [path]``/var/lib/containers/storage/volumes/uyuni-proxy-squid-cache/`` directory is on the proxy, the less traffic will be between the proxy and the {productname} Server.
ja: プロキシ上の[path]``/var/lib/containers/storage/volumes/uyuni-proxy-squid-cache/``ディレクトリの容量を大きくすると、プロキシと{productname}サーバ間のトラフィックが少なくなります。
zh_cn: 代理上的 [path]``/var/lib/containers/storage/volumes/uyuni-proxy-squid-cache/`` 目录越大，代理与 {productname} 服务器之间的流量就越少。

source: By making the [path]``/var/lib/containers/storage/volumes/uyuni-proxy-squid-cache/`` directory on the proxy the same size as [path]``/var/lib/containers/storage/volumes/var-spacewalk/`` on the {productname} Server, you avoid a large amount of traffic after the first synchronization.
ja: プロキシ上の[path]``/var/lib/containers/storage/volumes/uyuni-proxy-squid-cache/``ディレクトリを{productname}サーバ上の[path]``/var/lib/containers/storage/volumes/var-spacewalk/``と同じサイズにすることで、最初に同期した後のトラフィック量の増大が防止されます。
zh_cn: 使代理上的 [path]``/var/lib/containers/storage/volumes/uyuni-proxy-squid-cache/`` 目录与 {productname} 服务器上的 [path]``/var/lib/containers/storage/volumes/var-spacewalk/`` 保持相同的大小，可以避免在首次同步后出现大量的流量。

source: The [path]``/var/lib/containers/storage/volumes/uyuni-proxy-squid-cache/`` directory can be small on the {productname} Server compared to the proxy. For a guide to size estimation, see the <<server-hardware-requirements>> section.
ja: [path]``/var/lib/containers/storage/volumes/uyuni-proxy-squid-cache/``ディレクトリは、{productname}サーバ上ではプロキシと比べて小さくできます。サイズの推定のガイドについては、<<server-hardware-requirements>>のセクションを参照してください。
zh_cn: {productname} 服务器上的 [path]``/var/lib/containers/storage/volumes/uyuni-proxy-squid-cache/`` 目录可能比代理上的目录要小。有关大小估算的指导，请参见<<server-hardware-requirements>>一节。

source: In general, {suse} recommends to adjust the value for the cache directory to about 80 % of available free space. The [option]``cache_dir`` value is set when generating proxy configuration on the server. You cannot set the option directly in [path]``squid.conf``.
ja: 一般的に、{suse}では、キャッシュディレクトリの値を、利用可能な空き容量の約80%に調整することを推奨しています。[option]``cache_dir``の値は、サーバ上でプロキシ設定を生成する際に設定されます。[path]``squid.conf``で直接オプションを設定することはできません。
zh_cn: 一般情况下，{suse} 建议将缓存目录的值调整为可用空间的 80 %。在服务器上生成代理配置时会设置 [option]``cache_dir`` 值。无法直接在 [path]``squid.conf`` 中设置该选项。

source: Swap space
ko: 스왑 공간
zh_cn: 交换空间

source: Workloads differ from system to system. Systems with heavy or unpredictable workloads can benefit from additional swap space, regardless of total RAM. It is recommended to place swap on the fastest available storage (for example, SSD). {suse} recommends using a swap file instead of a swap partition.
ko: 작업 부하는 시스템마다 다릅니다. 작업 부하가 많거나 예측 불가능한 시스템은 총 RAM 용량과 무관하게 추가 스왑 공간을 활용하는 것이 좋습니다. 스왑은 사용 가능한 가장 빠른 저장소(예: SSD)에 배치하는 것이 권장됩니다. {suse}는 스왑 파티션 대신 스왑 파일을 사용할 것을 권장합니다.
zh_cn: 不同系统的工作负载各不相同。无论 RAM 总容量是多少，对于工作负载较大或波动不定的系统而言，额外配置交换空间均有助于提升性能。建议将交换空间部署在可用的最快存储设备上（例如 SSD）。{suse} 建议使用交换文件而非交换分区。

source: For size recommendations, see the tables above.
ko: 크기 권장 사항은 위 표를 참조하십시오.
zh_cn: 有关交换空间大小建议，请参见上文表格。

source: The following shell command snippet creates a 8GiB swap file.
ko: 다음 셸 명령 조각은 8GiB 스왑 파일을 생성합니다.
zh_cn: 以下外壳命令片段可创建一个 8GiB 大小的交换文件。

source: A swap file on BtrFS filesystem prevent creating of a snapshot of that volume. [path]``/var`` in the following example is already excluded from the snapper snapshots, so it is safe to use [path]``/var/swap``.
ko: BtrFS 파일 시스템상의 스왑 파일은 해당 볼륨의 스냅샷 생성을 방해합니다. [path]``/var``은 다음 예시에서 이미 snapper 스냅샷에서 제외되어 있으므로, [path]``/var/swap``을 안전하게 사용할 수 있습니다.
zh_cn: BtrFS 文件系统中的交换文件会导致无法创建该卷的快照。在下面的示例中，[path]``/var`` 已排除在 Snapper 快照范围之外，因此使用 [path]``/var/swap`` 创建交换文件是安全的。

source: Database Requirement
ja: データベースの要件
ko: 데이터베이스 요구사항
zh_cn: 数据库要求

source: {postgresql} is the only supported database. Using a remote {postgresql} database or remote file systems (such as NFS) with the {postgresql} database is not supported. In other words, {postgresql} should be on the fastest available storage device for {productname}.
ja: {postgresql}はサポートされている唯一のデータベースです。{postgresql}データベースとともにリモートの{postgresql}データベースやリモートのファイルシステム(NFS など)を使用することはサポートされていません。つまり、{postgresql}は、{productname}で使用可能な最速のストレージデバイス上に存在する必要があります。
ko: {postgresql} 데이터베이스만 지원됩니다. 원격 {postgresql} 데이터베이스 또는 원격 파일 시스템(예: NFS)을 {postgresql} 데이터베이스와 함께 사용하는 기능은 지원되지 않습니다. 즉, {postgresql}은 {productname}에 대해 사용 가능한 가장 빠른 저장소 장치에 있어야 합니다.
zh_cn: {postgresql} 是唯一受支持的数据库。不支持使用远程 {postgresql} 数据库或装有 {postgresql} 数据库的远程文件系统（例如 NFS）。换句话说，{postgresql} 应该位于 {productname} 可用的最快的存储设备上。

source: Because of potential performance issues, running a {postgresql} database remotely from {productname} is discouraged. While such an environment is possible and even stable in many cases, there is always a risk of data loss if something goes wrong.
ja: パフォーマンスの問題が発生する可能性があるため、{postgresql}データベースを{productname}からリモートで実行することは推奨されません。このような環境は可能であり、さらには多くの場合安定していますが、何か問題が発生した場合、データ損失のリスクが常にあります。
ko: 잠재적인 성능 문제로 인해 {postgresql} 데이터베이스를 {productname}에서 원격으로 실행하는 것은 일반적으로 권장하지 않습니다. 이러한 환경은 많은 경우에 사용할 수 있고 안정적이지만, 문제가 발생하면 데이터가 손실될 위험이 항상 있습니다.
zh_cn: 由于存在潜在性能问题，我们不建议从 {productname} 远程运行 {postgresql} 数据库。虽然这种环境在很多情况下是可行的甚至非常稳定，但如果发生问题，始终存在丢失数据的风险。

source: {suse} might not be able to provide assistance in such cases.
ja: このような場合、{suse}は支援を提供できないことがあります。
ko: 그러한 경우 {suse}에서 지원을 제공하지 못할 수 있습니다.
zh_cn: 如果发生这种情况，{suse} 可能无法提供帮助。

source: Persistent Storage and Permissions
ja: 永続ストレージとパーミッション
ko: 영구 스토리지 및 권한
zh_cn: 永久性存储和权限

source: Persistent volumes are created by default when deploying the container.
ja: 永続ボリュームは、コンテナの配備時にデフォルトで作成されます。
ko: 컨테이너를 배포할 때 기본적으로 영구 볼륨이 생성됩니다.
zh_cn: 默认情况下，在部署容器时会创建永久性卷。

source: However, it is recommended that the volumes are stored on one or more separate storage devices. Such a setup helps avoid data loss in production environments. This can be done after container deployment.
ja: ただし、ボリュームは1つ以上の個別のストレージデバイスに保存することをお勧めします。このようなセットアップにすると、運用環境でのデータの損失が防止されます。これは、コンテナの配備後に実行できます。
zh_cn: 但建议您将卷存储在一个或多个单独的存储设备上。这种设置有助于避免生产环境中丢失数据。此操作可在部署容器后再进行。

source: Storage devices best should be set up after first deploying the container. For more details, see xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[Persistent Container Volumes].
ja: ストレージデバイスは最初にコンテナを配備した後にセットアップする必要があります。詳細については、xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[永続コンテナのボリューム]を参照してください。
zh_cn: 最好在首次部署容器之后设置存储设备。有关更多细节，请参见 xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[永久性容器卷]。

source: We recommend you use XFS as the filesystem type for all volumes. The size of the disk for repositories storage is dependent on the number of distributions and channels you intend to manage with {productname}. See the tables in this section for guides to estimate the size required.
ja: すべてのボリュームで、ファイルシステムの種類にはXFSを使用することをお勧めします。リポジトリストレージのディスクのサイズは、{productname}で管理するディストリビューションおよびチャンネルの数によって決まります。必要サイズを推測するガイドについては、このセクションの表を参照してください。
zh_cn: 我们建议使用 XFS 作为所有卷的文件系统类型。用于存储储存库的磁盘大小取决于您要使用 {productname} 管理的发行套件和通道数目。请参见本节中的表格来估算所需大小。

source: Do not use NFS for {cobbler} or {postgresql} storage, neither NFS on SELinux environments. These scenarios are not supported.
zh_cn: 请勿为 {cobbler} 或 {postgresql} 使用 NFS 格式的存储空间，此外在 SELinux 环境中也不要使用 NFS。这些场景不受支持。

source: On the {productname} Server, use this command to find all available storage devices:
ja: {productname}サーバで、次のコマンドを使用して、利用できるすべてのストレージデバイスを検索します。
ko: {productname} 서버에서 이 명령을 사용하여 사용할 수 있는 모든 스토리지 장치를 찾습니다.
zh_cn: 在 {productname} 服务器上，使用以下命令找到所有可用的存储设备：

source: Use the [command]``lsblk`` command to see the name and size of each device.
cs: Příkazem [command]``lsblk`` zobrazíte název a velikost každého zařízení.
ja: [command]``lsblk``コマンドを使用して、各デバイスの名前とサイズを表示します。
ko: [command]``lsblk`` 명령을 사용하여 각 장치의 이름 및 크기를 확인합니다.
zh_cn: 使用 [command]``lsblk`` 命令查看每个设备的名称和大小。

source: Use the [command]``mgr-storage-server`` command with the device names to set up the external disks as the locations for the storage and, optionally on a disk of its own, for the database:
ja: [command]``mgr-storage-server``コマンドにデバイス名を付けて、外部ディスクをストレージの場所に設定し、オプションでデータベース用の独自のディスク上に設定することもできます。
zh_cn: 使用 [command]``mgr-storage-server`` 命令并加上设备名，可将外部磁盘设置为数据存储位置，您还可以选择指定服务器自身的磁盘用于数据库：

source: The external storage volumes are set up as XFS partitions mounted at [path]``/manager_storage`` and [path]``/pgsql_storage``.
cs: Svazky externího úložiště jsou nastaveny jako oddíly XFS připojené na [path] ``/manager_storage`` a [path] ``/pgsql_storage``.
ja: 外部ストレージボリュームは、[path]``/manager_storage``および[path]``/pgsql_storage``にマウントされているXFSパーティションとして設定されます。
ko: 외부 저장소 볼륨은 [path]``/manager_storage`` 및 [path]``/pgsql_storage``에 마운트된 XFS 파티션으로 설정됩니다.
zh_cn: 外部存储卷将设置为挂载到 [path]``/manager_storage`` 和 [path]``/pgsql_storage`` 的 XFS 分区。

source: It is possible to use the same storage device for both channel data and the database. This is not recommended, as growing channel repositories might fill up the storage, which poses a risk to database integrity. Using separate storage devices may also increase performance. If you want to use a single storage device, run [command]``mgr-storage-server`` with a single device name parameter.
ja: チャンネルデータとデータベースの両方に同じストレージデバイスを使用できます。これはお勧めしません。その理由は、チャンネルリポジトリが大きくなると、ストレージがいっぱいになり、データベースの一貫性が損なわれるリスクが生じるためです。別々のストレージデバイスを使用すると、パフォーマンスが向上する場合もあります。1つのストレージデバイスを使用する場合、1つのデバイス名パラメータを指定して[command]``mgr-storage-server``を実行します。
ko: 채널 데이터 및 데이터베이스 모두에서 동일한 스토리지 장치를 사용할 수 있습니다. 채널 리포지토리가 증가하여 스토리지가 가득 차 데이터베이스 무결성이 손상될 수 있으므로 이 방법은 권장되지 않습니다. 별도의 스토리지 장치를 사용하면 성능도 향상할 수 있습니다. 1개의 스토리지 장치를 사용하려면 단일 장치 이름 파라미터와 함께 [command]``mgr-storage-server``를 실행합니다.
zh_cn: 可对通道数据和数据库使用同一个存储设备。但不建议这样做，因为不断增长的通道储存库可能会填满存储，从而给数据库完整性带来风险。使用独立的存储设备还可以提高性能。如果您想要使用单个存储设备，请结合单个设备名参数运行 [command]``mgr-storage-server``。

source: If you are installing a proxy, the [command]``mgr-storage-proxy`` command takes only one device name parameter and will set up the external storage location as the Squid cache.
ja: プロキシをインストールしている場合、[command]``mgr-storage-proxy``コマンドはデバイス名パラメータを1つだけ取り、外部ストレージの場所をSquidキャッシュとして設定します。
zh_cn: 如果您安装的是代理，[command]``mgr-storage-proxy`` 命令只接受单个设备名参数，并将外部存储位置设置为 Squid 缓存。

source: Logical Volume Management (LVM)
ja: 論理ボリューム管理(LVM)
zh_cn: 逻辑卷管理 (LVM)

source: For all kind of virtual machines (VM), LVM is generally not needed and not recommended. The disk setup is virtual and separate disks for volumes are possible and recommended.
ja: すべての種類の仮想マシン(VM)では、LVMは一般的に必要なく、推奨されません。ディスクのセットアップは仮想的であり、ボリュームごとに個別のディスクが可能であり、推奨されます。
zh_cn: 对于所有类型的虚拟机 (VM)，通常都不需要 LVM，也不建议使用。磁盘设置是虚拟的，因此卷可以使用单独的磁盘，这也是建议的做法。

source: For other deployments, separate disks for volumes are also recommended.
ja: その他の配備については、ボリュームごとに個別のディスクも推奨されます。
ko: 다른 배포의 경우 볼륨에 대한 별도의 디스크도 권장됩니다.
zh_cn: 对于其他部署，也建议为卷使用单独的磁盘。

source: On the container host of the {productname} Server, the [command]``mgr-storage-server`` command moves the complete content of the [path]``/var/lib/containers/storage/volumes`` directory to a separate disk and remounts it to [path]``/var/lib/containers/storage/volumes``.
ko: {productname} 서버의 컨테이너 호스트에서 [command]``mgr-storage-server`` 명령은 [path]``/var/lib/containers/storage/volumes`` 디렉토리의 전체 내용을 별도의 디스크로 이동한 후 [path]``/var/lib/containers/storage/volumes``에 다시 마운트합니다.
zh_cn: 在 {productname} 服务器的容器主机上，[command]``mgr-storage-server`` 命令会将 [path]``/var/lib/containers/storage/volumes`` 目录的完整内容迁移到单独的磁盘，并将其重新挂载到 [path]``/var/lib/containers/storage/volumes``。

source: Optionally, if a second device name is specified, [command]``mgr-storage-server`` moves the content of the [path]``/var/lib/containers/storage/volumes/var-pgsql`` database directory to a second separate disk and remounts it to [path]``/var/lib/containers/storage/volumes/var-pgsql``.
ko: 선택 사항으로, 두 번째 장치 이름이 지정된 경우, [command]``mgr-storage-server``는 [path]``/var/lib/containers/storage/volumes/var-pgsql`` 데이터베이스 디렉토리의 컨텐트를 두 번째 별도 디스크로 이동한 후 이를 [path]``/var/lib/containers/storage/volumes/var-pgsql``에 다시 마운트합니다.
zh_cn: （可选）如果指定了第二个设备名称，[command]``mgr-storage-server`` 会将 [path]``/var/lib/containers/storage/volumes/var-pgsql`` 数据库目录的内容迁移到另一块单独的磁盘，并将该磁盘重新挂载到 [path]``/var/lib/containers/storage/volumes/var-pgsql``。

source: Similarly, on the container host of the {productname} Proxy, the [command]``mgr-storage-proxy`` command moves the complete content of the [path]``/var/lib/containers/storage/volumes`` directory to a separate disk and remounts it to [path]``/var/lib/containers/storage/volumes``.
ja: 同様に{productname}プロキシのコンテナホストでは、 [command]``mgr-storage-proxy``コマンドは[path]``/var/lib/containers/storage/volumes``ディレクトリの完全なコンテンツを個別のディスクに移動し、[path]``/var/lib/containers/storage/volumes``に再マウントします。
zh_cn: 同样地，在 {productname} 代理的容器主机上，[command]``mgr-storage-proxy`` 命令会将 [path]``/var/lib/containers/storage/volumes`` 目录的完整内容迁移到单独的磁盘，并将该磁盘重新挂载到 [path]``/var/lib/containers/storage/volumes``。

source: Install {productname} Proxy
ja: {productname}プロキシのインストール
zh_cn: 安装 {productname} 代理

source: There are various scenarios to deploy a {productname} Proxy. All these scenarios presume you have already successfully deployed a {productname} {productnumber} Server.
ja: {productname}プロキシを配備するさまざまなシナリオがあります。これらのシナリオはすべて、すでに{productname} {productnumber}サーバが正常に配備済みであることを前提としています。
zh_cn: 部署 {productname} 代理的场景多种多样。所有这些场景都假定您已成功部署 {productname} {productnumber} 服务器。

source: Public Cloud Deployment
ja: パブリッククラウドの配備
zh_cn: 公有云部署

source: Public clouds provide {productname} under a {byoslongform} ({byos}) or {payglongform} ({payg}) models.
ja: パブリッククラウドでは、{productname}は{byoslongform} ({byos})モデルまたは{payglongform} ({payg})に基づいて提供されます。
ko: 공용 클라우드는 {byoslongform}({byos}) 또는 {payglongform}({payg}) 모델에 따라 {productname}을(를) 제공합니다.
zh_cn: 公有云通过 {byoslongform} ({byos}) 或 {payglongform} ({payg}) 模式提供 {productname}。

source: For more information about using {productname} in the public cloud, see xref:specialized-guides:public-cloud-guide/overview.adoc[Public Cloud Guide].
ja: パブリッククラウドでの{productname}の使用の詳細については、xref:specialized-guides:public-cloud-guide/overview.adoc[パブリッククラウドガイド]を参照してください。
ko: 공용 클라우드에서 {productname} 사용에 대한 자세한 내용은 xref:specialized-guides:public-cloud-guide/overview.adoc[공용 클라우드 가이드]에서 확인할 수 있습니다.
zh_cn: 有关在公有云中使用 {productname} 的详细信息，请参见xref:specialized-guides:public-cloud-guide/overview.adoc[公有云指南]。

source: Install {productname} Server
ko: {productname} 서버 설치
zh_cn: 安装 {productname} 服务器

source: There are various scenarios to deploy a {productname} Server.
ko: {productname} 서버를 배포하는 데는 다양한 시나리오가 있습니다.
zh_cn: 部署 {productname} 服务器的场景多种多样。

source: Installation, Deployment and Upgrade
zh_cn: 安装、部署和升级

source: **Publication Date:** {docdate}
ko: **게시 날짜:** {docdate}
zh_cn: **发布日期：**{docdate}

source: Preface
zh_cn: 前言

source: This guide provides comprehensive, step-by-step instructions for deploying, upgrading, and managing {productname} Server and Proxy.
zh_cn: 本指南提供了部署、升级和管理 {productname} 服务器及代理的详尽分步说明。

source: It is organized into the following sections:
zh_cn: 指南分为以下几个章节：

source: **Requirements:** Outlines the essential hardware, software, and networking prerequisites to ensure a smooth setup.
zh_cn: **要求**：概述确保安装流程顺畅进行的必要硬件、软件和网络前提条件。

source: **Deployment and Installation:** Guides you through deploying {productname} as a container and completing the initial configuration.
zh_cn: **部署与安装**：指导您将 {productname} 部署为容器并完成初始配置。

source: **Upgrade and Migration:** Details the process for upgrading and migrating {productname} while minimizing downtime.
zh_cn: **升级与迁移**：详细说明升级和迁移 {productname} 的过程，同时最大限度减少停机时间。

source: **Basic Server Management:** Covers fundamental server operations, helping you get started with {productname} efficiently.
zh_cn: **基本的服务器管理**：涵盖基本的服务器操作，帮助您高效上手使用 {productname}。

source: Copyright Notice
ko: 저작권 고지
zh_cn: 版权声明

source: Copyright © {copyrightdate} SUSE LLC and contributors. All rights reserved. Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.2 or (at your option) version 1.3; with the Invariant Section being this copyright notice and license. A copy of the license version 1.2 is included in the section entitled xref:legal:license.adoc[GNU Free Documentation License].
ko: Copyright © {copyrightdate} SUSE LLC and contributors. All rights reserved. 복사, 배포 및/또는 수정할 수 있는 권한은 GNU 자유 문서 라이선스 버전 1.2 또는 (사용자의 선택에 따라) 버전 1.3의 조건에 따라 부여됩니다. 불변 섹션은 본 저작권 고지 및 라이선스입니다. 라이선스 버전 1.2의 사본은 xref:legal:license.adoc[GNU 자유 문서 라이선스]라는 제목의 섹션에 포함되어 있습니다.
zh_cn: 版权所有 © {copyrightdate} SUSE LLC 和撰稿人。保留所有权利。根据 GNU ⾃由⽂档许可证 (GNU Free Documentation License) 版本 1.2 或（根据您的选择）版本 1.3 中的条款，在此授予您复制、分发和/或修改本⽂档的权限；本版权声明和许可证附带不可变部分。许可版本 1.2 的副本包含在 xref:legal:license.adoc[GNU Free Documentation License] 章节。

source: Trademarks
ko: 상표
zh_cn: 商标

source: For SUSE trademarks, see https://www.suse.com/company/legal/ . All third-party trademarks are the property of their respective owners. Trademark symbols (®, ™ etc.) denote trademarks of SUSE and its affiliates. Asterisks (*) denote third-party trademarks. All information found in this book has been compiled with utmost attention to detail. However, this does not guarantee complete accuracy. Neither SUSE LLC, its affiliates, the authors nor the translators shall be held liable for possible errors or the consequences thereof.
ko: SUSE 상표에 대해서는 https://www.suse.com/company/legal/[]을 참조하십시오. 모든 제3자 상표는 해당 소유자의 자산입니다. 상표 기호(®, ™ 등)는 SUSE 및 그 계열사의 상표를 나타냅니다. 별표(*)는 타사 상표를 나타냅니다. 본 문서의 모든 정보는 세심한 주의를 기울여 편집되었습니다. 하지만 이는 완벽하게 정확함을 보장하지 않습니다. SUSE LLC, 그 계열사, 작성자 및 번역자는 발생할 수 있는 오류나 그로 인한 결과에 대해 책임을 지지 않습니다.
zh_cn: 有关 SUSE 商标，请参⻅ https://www.suse.com/company/legal/[]。所有第三⽅商标分别为相应所有者的财产。商标符号（®、™ 等）代表 SUSE 及其关联公司的商标。星号 (*) 代表第三⽅商标。本指南⼒求涵盖所有细节，但这不能确保本指南准确⽆误。SUSE LLC 及其关联公司、作者和译者对于可能出现的错误或由此造成的后果皆不承担责任。

source: Preface
ko: 서문
zh_cn: 前言

source: Network Requirements
cs: Požadavky na síť
ja: ネットワーク要件
ko: 네트워크 요구사항
zh_cn: 网络要求

source: This section details the networking and port requirements for {productname}.
cs: Tato část podrobně popisuje požadavky na síť a porty pro {productname}.
ja: このセクションでは、{productname}のネットワークとポートの要件について詳しく説明します。
ko: 이 섹션에서는 {productname}의 네트워크 및 포트 요구사항에 대한 자세한 설명을 제공합니다.
zh_cn: 本节详细说明 {productname} 的网络和端口要求。

source: IP forwarding will be enabled by containerized installation. This means {productname} Server and Proxies will behave as a router. This behavior is done by podman directly. Podman containers do not run if IP forwarding is disabled.
zh_cn: IP 转发将通过容器化安装来实现。这意味着 {productname} 服务器和代理将充当路由器。此行为由 podman 直接完成。如果禁用 IP 转发，podman 容器将不会运行。

source: Consider achieving network isolation of the {productname} environment according to your policies.
ja: ポリシーに従って、{productname}環境のネットワーク分離を実現することを検討してください。
zh_cn: 您可以考虑根据您的策略实现 {productname} 环境的网络隔离。

source: For more information, see https://www.suse.com/support/kb/doc/?id=000020166.
ja: 詳細については、https://www.suse.com/support/kb/doc/?id=000020166を参照してください。
zh_cn: 有关详细信息，请参见 https://www.suse.com/support/kb/doc/?id=000020166[]。

source: Fully Qualified Domain Name (FQDN)
cs: Fully Qualified Domain Name (FQDN, plně kvalifikovaný doménový název)
ja: 完全修飾ドメイン名(FQDN)
ko: FQDN(정규화된 도메인 이름)
zh_cn: 完全限定的域名 (FQDN)

source: The {productname} server must resolve its FQDN correctly. If the FQDN cannot be resolved, it can cause serious problems in a number of different components.
cs: FQDN serveru {productname} musí DNS správně vyřešit (přeložit na IP-adresu). Pokud nelze plně kvalifikovaný doménový název vyřešit, může to způsobit vážné problémy v řadě různých komponent.
ja: {productname}サーバは、そのFQDNを正しく解決する必要があります。FQDNを解決できない場合、多数のコンポーネントで重大な問題の原因になる場合があります。
ko: {productname} 서버는 FQDN이 올바르게 확인되어야 합니다. FQDN을 확인할 수 없는 경우 여러 다른 구성 요소에서 심각한 문제가 발생할 수 있습니다.
zh_cn: {productname} 服务器必须正确解析其 FQDN。如果无法解析 FQDN，可能会导致许多不同的组件出现严重问题。

source: For more information about configuring the hostname and DNS, see {sles-base-os-documentation}/cha-network.html#sec-network-yast-change-host.
ja: ホスト名とDNSの設定の詳細については、link:{sles-base-os-documentation}/cha-network.html#sec-network-yast-change-host[]を参照してください。
ko: 호스트 이름 및 DNS 구성에 대한 자세한 내용은 link:{sles-base-os-documentation}/cha-network.html#sec-network-yast-change-host[]에서 확인할 수 있습니다.
zh_cn: 有关配置主机名和 DNS 的详细信息，请参见 link:{sles-base-os-documentation}/cha-network.html#sec-network-yast-change-host[]。

source: Hostname and IP Address
cs: Název hostitele (počítače v síti) a IP adresa
ja: ホスト名とIPアドレス
ko: 호스트 이름 및 IP 주소
zh_cn: 主机名和 IP 地址

source: To ensure that the {productname} domain name can be resolved by its clients, both server and client machines must be connected to a working DNS server. You also need to ensure that reverse lookups are correctly configured.
cs: Aby bylo zajištěno, že doménový název serveru {productname} může být vyřešen jeho klienty, musí být server i klientské počítače připojeny k funkčnímu serveru DNS. Musíte také zajistit, aby i zpětné vyhledávání (z IP-adresy na FQDN) bylo správně konfigurováno.
ja: {productname}のドメイン名をそのクライアントで解決できることを確認するには、サーバとクライアントの両方のマシンを動作中のDNSサーバに接続する必要があります。リバース参照が正しく設定されていることも確認する必要があります。
ko: 클라이언트가 {productname} 도메인 이름을 올바르게 확인하도록 하려면, 서버 및 클라이언트 머신 모두 작동하는 DNS 서버에 연결되어야 합니다. 또한, 역방향 조회도 올바르게 구성되었는지 확인해야 합니다.
zh_cn: 为确保 {productname} 域名可由其客户端解析，服务器和客户端计算机都必须连接到一台正常工作的 DNS 服务器。还需要确保正确配置反向查找。

source: For more information about setting up a DNS server, see {sles-base-os-documentation}/cha-dns.html.
ja: DNSサーバの設定の詳細については、link:{sles-base-os-documentation}/cha-dns.html[]を参照してください。
ko: DNS 서버 설정에 대한 자세한 내용은 link:{sles-base-os-documentation}/cha-dns.html[]에서 확인할 수 있습니다.
zh_cn: 有关设置 DNS 服务器的详细信息，请参见 link:{sles-base-os-documentation}/cha-dns.html[]。

source: Reenable router advertisements
zh_cn: 重新启用路由器通告
