Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: Proxy extensions are listed under [literal]``Basesystem Module 15 SP7` > `Containers Module 15 SP7``.
ko: 프록시 확장은 [literal]``Basesystem Module 15 SP7` > `Containers Module 15 SP7`` 아래에 나열됩니다.
zh_cn: 代理扩展列于 [literal]``Basesystem Module 15 SP7`` > ``Containers Module 15 SP7`` 下。

source: Navigate to the proxy system and select menu:Systems[Overview > Software > Product Migration].
ko: 프록시 시스템으로 이동하여 menu:시스템[개요 > 소프트웨어 > 제품 마이그레이션]을 선택합니다.
zh_cn: 导航至代理系统，选择menu:系统[概览 > 软件 > 产品迁移]。

source: When prompted, **do not select** optional channels unless you have confirmed they are required.
ko: 메시지가 표시되면 필수 채널인지 확인하지 않은 경우 선택 채널을 선택하지 마십시오.
zh_cn: 出现提示时，**请勿选择**可选通道，除非您已确认必须使用这些通道。

source: Perform post-reboot checks:
ko: 재부팅 후 점검 수행:
zh_cn: 执行重引导后的检查：

source: Verify upgraded OS and {productname} extension.
ko: 업그레이드된 운영 체제와 {productname} 확장을 확인합니다.
zh_cn: 校验升级后的操作系统和 {productname} 扩展。

source: [literal]``mgrpxy version 5.1.11`` or higher
ko: [literal]``mgrpxy version 5.1.11`` 이상
zh_cn: [literal]``mgrpxy version 5.1.11`` 或更高版本

source: The proxy host system is now running {sles} 15 SP7 with updated {productname} {productnumber} Proxy packages and synchronized product channels.
ko: 이제 프록시 호스트 시스템이 업데이트된 {productname} {productnumber} 프록시 패키지와 동기화된 제품 채널로 {sles} 15 SP7을 실행 중입니다.
zh_cn: 代理主机系统现已运行 {sles} 15 SP7，且配备了更新后的 {productname} {productnumber} 代理软件包及已同步的产品通道。

source: {productname} Server Migration to a Containerized Environment
ja: コンテナ化された環境への{productname}サーバの移行
zh_cn: 将 {productname} 服务器迁移到容器化环境

source: General requirements
ko: 일반 요구사항
zh_cn: 一般要求

source: To migrate a {productname} 4.3 Server to a container, you require a new machine with {sl-micro} {microversion} or {sles} {bci-mlm} and [literal]``mgradm`` installed.
ko: {productname} 4.3 서버를 컨테이너로 마이그레이션하려면 {sl-micro} {microversion} 또는 {sles} {bci-mlm} 및 [literal]``mgradm``이 설치된 새 시스템이 필요합니다.
zh_cn: 要将 {productname} 4.3 服务器迁移到容器，需要一台安装了 {sl-micro} {microversion} 或 {sles} {bci-mlm} 和 [literal]``mgradm`` 的新计算机。

source: An in-place migration from {productname} 4.3 to {productnumber} is not supported, regardless of whether the chosen host operating system is {sl-micro} {microversion} or {sles} {bci-mlm}.
ko: {productname} 4.3에서 {productnumber}(으)로의 인플레이스 마이그레이션은 선택한 호스트 운영 체제가 {sl-micro} {microversion}이든 {sles} {bci-mlm}이든 관계없이 지원되지 않습니다.
zh_cn: 无论所选主机操作系统是 {sl-micro} {microversion} 还是 {sles} {bci-mlm}，均不支持从 {productname} 4.3 就地迁移到 {productnumber}。

source: Before migrating from {productname} 4.3 to {productnumber}, any existing traditional clients including the traditional proxies must be migrated to {salt}. For more information about migrating traditional {productname} 4.3 clients to {salt} clients, see https://documentation.suse.com/suma/4.3/en/suse-manager/client-configuration/contact-methods-migrate-traditional.html[Migrate Traditional Clients to Salt Clients].
ko: {productname} 4.3에서 {productnumber}(으)로 마이그레이션하기 전에, 기존 클라이언트(기존 프록시 포함)를 모두 {salt}로 마이그레이션해야 합니다. 기존 {productname} 4.3 클라이언트를 {salt} 클라이언트로 마이그레이션하는 방법에 대한 자세한 내용은 https://documentation.suse.com/suma/4.3/en/suse-manager/client-configuration/contact-methods-migrate-traditional.html[기존 클라이언트를 Salt 클라이언트로 마이그레이션]에서 확인할 수 있습니다.
zh_cn: 在从 {productname} 4.3 迁移到 {productnumber} 之前，必须将所有现有的传统客户端（包括传统代理）迁移到 {salt}。有关将传统 {productname} 4.3 客户端迁移到 {salt} 客户端的详细信息，请参见 link:https://documentation.suse.com/suma/4.3/en/suse-manager/client-configuration/contact-methods-migrate-traditional.html[将传统客户端迁移到 {salt} 客户端]。

source: This guide only covers the migration from {productname} 4.3 to {productnumber}.
ko: 절차: {sl-micro} 및 {productname} {productnumber} 등록
zh_cn: 本指南仅涵盖从 {productname} 4.3 到 {productnumber} 的迁移流程。

source: Migrating an existing {productname} {productnumber} instance to the same version while switching the host operating system from {sl-micro} {microversion} to {sles} {bci-mlm}, or vice versa, is not handled by the [command]``mgradm migrate`` command.
ko: 기존 {productname} {productnumber} 인스턴스를 동일한 버전으로 마이그레이션하면서 호스트 운영 체제를 {sl-micro} {microversion}에서 {sles} {bci-mlm}(으)로 전환하거나 그 반대의 경우, [command]``mgradm migrate`` 명령으로는 처리되지 않습니다.
zh_cn: [command]``mgradm migrate`` 命令无法在迁移主机操作系统（从 {sl-micro} {microversion} 迁移到 {sles} {bci-mlm} 或反向迁移）时将现有 {productname} {productnumber} 实例的版本保持不变。

source: Hostnames
ja: ホスト名
zh_cn: 主机名

source: Current migration procedure does not include functionality for renaming hostnames. As a result, fully qualified domain name (FQDN) of the new server will remain the same as that of the old server.
ko: 현재 마이그레이션 절차에는 호스트 이름 변경 기능이 포함되어 있지 않습니다. 따라서 새 서버의 FQDN(정규화된 도메인 이름)은 이전 서버와 동일하게 유지됩니다.
zh_cn: 当前的迁移过程不包含重命名主机名的功能。因此，新服务器的完全限定域名 (FQDN) 将与旧服务器的一样。

source: The IP address must remain unchanged to ensure that the clients can contact the server.
ja: クライアントがサーバに確実に接続できるよう、IPアドレスは変更しないままにする必要があります。
zh_cn: IP 地址必须保持不变，以确保客户端可以连接到服务器。

source: After the migration, it is necessary to manually update the DHCP and DNS records to point to the new server.
ko: 마이그레이션 후에는 DHCP 및 DNS 레코드를 수동으로 업데이트하여 새 서버를 가리키도록 해야 합니다.
zh_cn: 迁移之后，需要手动更新 DHCP 和 DNS 记录以指向新的服务器。

source: GPG keys
ko: GPG 키
zh_cn: GPG 密钥

source: Self-trusted GPG keys are not migrated.
ko: 자체 신뢰 GPG 키는 마이그레이션되지 않습니다.
zh_cn: 自信任 GPG 密钥不会迁移。

source: GPG keys that are trusted in the RPM database only are not migrated. Thus, synchronizing channels with [command]``spacewalk-repo-sync`` can fail.
ko: RPM 데이터베이스에서만 신뢰되는 GPG 키는 마이그레이션되지 않습니다. 따라서 [command]``spacewalk-repo-sync``로 채널을 동기화하면 실패할 수 있습니다.
zh_cn: 仅在 RPM 数据库中可信的 GPG 密钥不会迁移。因此，使用 [command]``spacewalk-repo-sync`` 同步通道可能会失败。

source: The administrator must migrate these keys manually from the 4.3 installation to the container host after the actual server migration.
ja: 管理者は、サーバを実際に移行した後にこれらのキーを4.3のインストールからコンテナホストに手動で移行する必要があります。
ko: 관리자는 실제 서버 마이그레이션을 수행한 후 이러한 키를 4.3 설치에서 컨테이너 호스트로 수동으로 마이그레이션해야 합니다.
zh_cn: 在完成服务器的实际迁移后，管理员必须手动将这些密钥从所安装的 4.3 系统迁移到容器主机。

source: Procedure: Manual migration of the 4.3 GPG keys to the new server
ko: 절차: 4.3 GPG 키를 새 서버로 수동 마이그레이션
zh_cn: 过程：手动将 4.3 GPG 密钥迁移到新服务器

source: Copy the keys from the 4.3 server to the container host of the new server.
ja: 4.3サーバから新しいサーバのコンテナホストにキーをコピーします。
ko: 4.3 서버의 키를 새 서버의 컨테이너 호스트로 복사합니다.
zh_cn: 将 4.3 服务器中的密钥复制到新服务器的容器主机。

source: Later, add each key to the migrated server with the command [command]``mgradm gpg add <PATH_TO_KEY_FILE>``.
ja: その後、コマンド[command]``mgradm gpg add <PATH_TO_KEY_FILE>``を使用して、移行したサーバに各キーを追加します。
ko: 그 후, [command]``mgradm gpg add <PATH_TO_KEY_FILE>`` 명령을 사용하여 마이그레이션된 서버에 각 키를 추가합니다.
zh_cn: 稍后，使用命令 [command]``mgradm gpg add <PATH_TO_KEY_FILE>`` 将每个密钥添加到迁移的服务器。

source: SSL certificates
ko: SSL 인증서
zh_cn: SSL 证书

source: During a migration the server SSL certificate and CA chain are copied from the source server, meaning that only the database certificates are required
ko: 마이그레이션 중에 서버 SSL 인증서와 CA 체인은 소스 서버에서 복사되므로, 데이터베이스 인증서만 필요합니다.
zh_cn: 迁移过程中，会从源服务器复制服务器 SSL 证书和 CA 链，这意味着您只需准备数据库证书即可

source: Migration
ja: 移行
ko: 마이그레이션
zh_cn: 迁移

source: Prepare {productname} {productnumber} server host
ko: {productname} {productnumber} 서버 호스트 준비
zh_cn: 准备 {productname} {productnumber} 服务器主机

source: Do not pre-install {productname} on the prepared {sl-micro} {microversion} or {sles} {bci-mlm} system.
ko: 준비된 {sl-micro} {microversion} 또는 {sles} {bci-mlm} 시스템에 {productname}을(를) 미리 설치하지 마십시오.
zh_cn: 请勿在已准备好的 {sl-micro} {microversion} 或 {sles} {bci-mlm} 系统上预先安装 {productname}。

source: The migration process is designed to perform the server installation automatically. Running [command]``mgradm install`` and then [command]``mgradm migrate`` is not supported and will lead to an unsupported system state.
ko: 마이그레이션 프로세스는 서버 설치를 자동으로 수행하도록 설계되었습니다. [command]``mgradm install``을 실행한 후 [command]``mgradm migrate``를 실행하는 것은 지원되지 않으며, 지원되지 않는 시스템 상태로 이어질 수 있습니다.
zh_cn: 迁移流程设计为自动执行服务器安装。不支持先运行 [command]``mgradm install`` 再运行 [command]``mgradm migrate``，此操作将导致系统处于不受支持的状态。

source: In the following steps, we are only preparing the host system, not installing the actual {productname} {productnumber} Server.
zh_cn: 在以下步骤中，我们只会准备主机系统，而不实际安装 {productname} {productnumber} 服务器。

source: You can use VM images based on {sl-micro} {microversion} as a migration target. In such a scenario, you can prepare the host system as described in
ko: {sl-micro} {microversion} 기반 VM 이미지를 마이그레이션 타겟으로 사용할 수 있습니다. 이러한 시나리오에서는 다음에 설명된 대로 호스트 시스템을 준비할 수 있습니다.
zh_cn: 您可使用基于 {sl-micro} {microversion} 的 VM 映像作为迁移目标。在此场景下，您可按照以下指南中的说明准备主机系统：

source: or
cs: nebo
ja: または
ko: 또는
zh_cn: 或

source: However, at the end the last step is executing the command [command]``mgradm migrate <FQDN>`` instead of [command]``mgradm install <FQDN>``.
ko: 하지만 마지막 단계에서는 [command]``mgradm install <FQDN>`` 대신 [command]``mgradm migrate <FQDN>`` 명령을 실행합니다.
zh_cn: 但请注意，最后一步需要执行命令 [command]``mgradm migrate <FQDN>``，而非 [command]``mgradm install <FQDN>``。

source: SSH connection preparation
ko: SSH 연결 준비
zh_cn: SSH 连接准备

source: This step ensures that the new {productname} {productnumber} Server can connect to the existing 4.3 Server over SSH without requiring a password. It involves generating and configuring SSH keys, setting up an SSH agent, and copying the public key to the old server. This setup is required for the migration process to run without manual intervention.
ko: 이 단계를 통해 새 {productname} {productnumber} 서버가 기존 4.3 서버에 비밀번호 없이 SSH로 연결할 수 있습니다. 이 단계에는 SSH 키 생성 및 구성, SSH 에이전트 설정, 공개 키를 기존 서버로 복사하는 작업이 포함됩니다. 이 설정은 마이그레이션 프로세스가 수동 개입 없이 실행되도록 필수적입니다.
zh_cn: 此步骤可确保新的 {productname} {productnumber} 服务器无需口令便可通过 SSH 连接至现有 4.3 服务器。操作包括生成和配置 SSH 密钥、设置 SSH 代理，以及将公共密钥复制到旧服务器。要使迁移流程在没有人工干预的情况下运行，必须进行该设置。

source: Procedure: Preparing the SSH connection
ja: プロシージャ: SSH接続を準備する
ko: 절차: SSH 연결 준비
zh_cn: 过程：准备 SSH 连接

source: Ensure that for [systemitem]``root`` an SSH key exists on the new {productnumber} server. If a key does not exist, create it with:
ja: [systemitem]``root``に対して、新しい{productnumber}サーバ上にSSHキーが存在することを確認します。存在しない場合は、次のコマンドを使用して作成します。
ko: 새 {productnumber} 서버에 [systemitem]``root``에 대한 SSH 키가 있는지 확인합니다. 키가 없는 경우 다음을 사용하여 키를 만듭니다.
zh_cn: 确保对于 [systemitem]``root``，新 {productnumber} 服务器上存在 SSH 密钥。如果不存在密钥，请使用以下命令创建一个：

source: The SSH configuration and agent should be ready on the new server for a connection to the 4.3 server that does not prompt for a password.
ja: パスワードを要求しない4.3サーバへの接続のために、新しいサーバ上でSSH設定とエージェントを準備する必要があります。
zh_cn: 新服务器上的 SSH 配置和代理应准备就绪，这样在连接 4.3 服务器时就不会提示输入口令。

source: To establish a connection that does not prompt for a password, the migration script relies on an SSH agent running on the new server. If the agent is not active yet, initiate it by running [command]``eval $(ssh-agent)``. Then add the SSH key to the running agent with [command]``ssh-add`` followed by the path to the private key. You will be prompted to enter the password for the private key during this process.
ja: パスワードを要求しない接続を確立するために、移行スクリプトは新しいサーバで実行されているSSHエージェントに依存します。このエージェントがまだアクティブではない場合は、[command]``eval $(ssh-agent)``を実行して開始します。その後、[command]``ssh-add``に続けて機密鍵へのパスを指定し、実行中のエージェントにSSHキーを追加します。このプロセス中に、機密鍵のパスワードの入力を求められます。
zh_cn: 迁移脚本依赖新服务器上运行的 SSH 代理来建立不提示输入口令的连接。如果该代理尚未激活，请运行 [command]``eval $(ssh-agent)`` 将其启动。然后，使用 [command]``ssh-add``（后跟私用密钥的路径）将 SSH 密钥添加到正在运行的代理。在此过程中，系统将提示您输入私用密钥的口令。

source: Copy the public SSH key to the {productname} 4.3 Server ([literal]``<oldserver.fqdn>``) with [command]``ssh-copy-id``. Replace [literal]``<oldserver.fqdn>`` with the FQDN of the 4.3 server:
ja: [command]``ssh-copy-id``を使用して、SSH公開鍵を{productname} 4.3サーバ([literal]``<oldserver.fqdn>``)にコピーします。[literal]``<oldserver.fqdn>``は、4.3サーバのFQDNに置き換えてください。
ko: [command]``ssh-copy-id``를 사용하여 {productname} 4.3 서버([literal]``<oldserver.fqdn>``)에 공개 SSH 키를 복사합니다. [literal]``<oldserver.fqdn>``을 4.3 서버의 FQDN으로 바꿉니다.
zh_cn: 使用 [command]``ssh-copy-id`` 将公共 SSH 密钥复制到 {productname} 4.3 服务器 ([literal]``<oldserver.fqdn>``)。将 [literal]``<oldserver.fqdn>`` 替换为 4.3 服务器的 FQDN：

source: The SSH key will be copied into the old server's [path]``~/.ssh/authorized_keys`` file. For more information, see the [literal]``ssh-copy-id`` manpage.
ja: SSHキーは、古いサーバの[path]``~/.ssh/authorized_keys``ファイルにコピーされます。 詳細については、[literal]``ssh-copy-id``のマニュアルページを参照してください。
zh_cn: SSH 密钥将会被复制到旧服务器的 [path]``~/.ssh/authorized_keys`` 文件中。有关详细信息，请参见 [literal]``ssh-copy-id`` 手册页。

source: Establish an SSH connection from the new server to the old {productname} Server to check that no password is needed. Also there must not by any problem with the host fingerprint. In case of trouble, remove old fingerprints from the [path]``~/.ssh/known_hosts`` file. Then try again. The fingerprint will be stored in the local [path]``~/.ssh/known_hosts`` file.
ja: 新しいサーバから古い{productname}サーバへのSSH接続を確立し、パスワードが不要であることを確認します。また、ホストの指紋に問題がないことも確認します。問題がある場合は、古い指紋を[path]``~/.ssh/known_hosts``ファイルから削除して、もう一度実行します。指紋はローカルの[path]``~/.ssh/known_hosts``ファイルに保存されます。
ko: 새 서버에서 기존 {productname} 서버로 SSH 연결을 설정하여 비밀번호가 필요하지 않은지 확인합니다. 호스트 지문에도 문제가 없어야 합니다. 문제가 있는 경우 [path]``~/.ssh/known_hosts`` 파일에서 기존 지문을 제거합니다. 그런 다음 다시 시도합니다. 지문은 로컬 [path]``~/.ssh/known_hosts`` 파일에 저장됩니다.
zh_cn: 在新服务器上与旧的 {productname} 服务器建立 SSH 连接，检查是否不需要口令。此外，主机指纹不得有任何问题。如果遇到问题，请从 [path]``~/.ssh/known_hosts`` 文件中去除旧指纹。然后重试。指纹将存储在本地 [path]``~/.ssh/known_hosts`` 文件中。

source: Perform the migration
ko: 마이그레이션 수행
zh_cn: 执行迁移

source: When planning your migration from SUSE Manager 4.3 to {productname} {productnumber}, ensure that your target instance meets or exceeds the specifications of the old setup.
ko: SUSE Manager 4.3에서 {productname} {productnumber}(으)로 마이그레이션할 때는 대상 인스턴스가 기존 설정의 사양을 충족하거나 초과하는지 확인해야 합니다.
zh_cn: 在规划从 SUSE Manager 4.3 到 {productname} {productnumber} 的迁移时，请确保您的目标实例达到或超出旧设置的规格。

source: This includes, but is not limited to, memory (RAM), CPU Cores, Storage, and Network Bandwidth.
ja: これには、メモリ(RAM)、CPUコア、ストレージ、ネットワーク帯域幅が含まれますが、これらに限定されません。
zh_cn: 这包括但不限于内存 (RAM)、CPU 核心、存储和网络带宽。

source: When migrating from SUSE Manager 4.3, you will be prompted for the [guimenu]``Password for the CA key to generate``. It is essential to enter the same CA password that was used in your SUSE Manager 4.3 installation.
ko: SUSE Manager 4.3에서 마이그레이션할 때 [guimenu]``CA 키 생성용 비밀번호``를 입력하라는 메시지가 표시됩니다. SUSE Manager 4.3 설치 시 사용했던 것과 동일한 CA 비밀번호를 입력해야 합니다.
zh_cn: 从 SUSE Manager 4.3 迁移时，系统会提示您输入[guimenu]``用于生成证书的 CA 密钥口令``。请务必输入此前安装 SUSE Manager 4.3 时使用的相同 CA 口令。

source: Entering the wrong password will result in a failure to generate the database certificate and will cause the migration to abort with the following error:
ko: 잘못된 비밀번호를 입력하면 데이터베이스 인증서 생성에 실패하며, 다음과 같은 오류로 마이그레이션이 중단됩니다.
zh_cn: 输入错误口令会导致数据库证书生成失败，进而使迁移中止并显示以下错误：

source: Error: cannot configure db container: Cannot generate database certificate: CA validation failed!
ko: 오류: DB 컨테이너를 구성할 수 없음: 데이터베이스 인증서를 생성할 수 없음: CA 유효성 검사에 실패했습니다!
zh_cn: 错误：无法配置数据库容器：无法生成数据库证书：CA 验证失败！

source: Make sure the correct CA password is available before starting the migration process.
ko: 마이그레이션 프로세스를 시작하기 전에 올바른 CA 비밀번호가 준비되어 있는지 확인합니다.
zh_cn: 请在启动迁移流程前，确认已准备好正确的 CA 口令。

source: Procedure: Performing the migration
ko: 절차: 마이그레이션 수행
zh_cn: 过程：执行迁移

source: This step is optional. If custom persistent storage is required for your infrastructure, use the [command]``mgr-storage-server`` tool. For more information about [command]``mgr-storage-server``, see xref:installation-and-upgrade:hardware-requirements.adoc#install-hardware-requirements-storage[].
zh_cn: 此步骤并非强制性步骤。如果您的基础架构需要自定义的永久性存储空间，请使用 [command]``mgr-storage-proxy`` 工具。有关 [command]``mgr-storage-server`` 的详细信息，请参见 xref:installation-and-upgrade:hardware-requirements.adoc#install-hardware-requirements-storage[]。

source: Execute the following command to migrate and set up a new {productname} {productnumber} server. Replace [literal]``<oldserver.fqdn>`` with the FQDN of the 4.3 server:
ko: 다음 명령을 실행하여 새 {productname} {productnumber} 서버를 마이그레이션하고 설정합니다. [literal]``<oldserver.fqdn>``을 4.3 서버의 FQDN으로 바꿉니다.
zh_cn: 执行以下命令来迁移并设置新的 {productname} {productnumber} 服务器。请将 [literal]``<oldserver.fqdn>`` 替换为 4.3 服务器的 FQDN：

source: Make sure to upgrade your 4.3 server and apply all available updates before starting the migration process. Additionally, remove any unnecessary channels to help reduce the overall migration time.
zh_cn: 请务必在开始迁移前升级 4.3 服务器并应用所有可用更新。此外，还需去除所有不必要的通道，以便缩短总迁移时间。

source: The migration can take a very long time depending on the amount of data that needs to be replicated. To reduce downtime it is possible to run the migration multiple times in a process of _initial replication_, _re-replication_, or _final replication and switch over_ while all the services on the old 4.3 server can stay up and running.
ko: 마이그레이션은 복제해야 하는 데이터의 양에 따라 시간이 매우 오래 걸릴 수 있습니다. 작동 중지 시간을 줄이기 위해 이전 4.3 서버의 모든 서비스가 계속 가동되는 동안 마이그레이션을 _initial replication_, _re-replication_ 또는 _final replication and switch over_ 프로세스로 여러 번 실행할 수 있습니다.
zh_cn: 迁移可能需要很长时间，具体取决于需要复制的数据量。为了减少停机时间，可以在初始复制、重新复制或最终复制和切换过程中多次运行迁移，同时旧 4.3 服务器上的所有服务都可以保持正常运行。

source: Only during the final migration, the processes on the old 4.3 server need to be stopped.
ko: 최종 마이그레이션 중에만 이전 4.3 서버의 프로세스를 중지하면 됩니다.
zh_cn: 只有在最终迁移期间才需要停止旧 4.3 服务器上的进程。

source: For all non-final replications add the parameter [command]``--prepare`` to prevent the automatic stopping of services on the old 4.3 server.
ko: 최종 복제가 아닌 모든 복제에 대해 이전 4.3 서버의 서비스가 자동으로 중지되지 않도록 [command]``--prepare`` 파라미터를 추가합니다.
zh_cn: 对于最终复制以外的所有复制，请添加参数 [command]``--prepare``，以防止自动停止旧 4.3 服务器上的服务。

source: Procedure: Final migration
ko: 절차: 최종 마이그레이션
zh_cn: 过程：最终迁移

source: Stop the SUSE Manager services on 4.3 Server:
ko: 4.3 서버에서 SUSE Manager 서비스를 중지합니다.
zh_cn: 停止 4.3 服务器上的 SUSE Manager 服务：

source: Stop the PostgreSQL service on 4.3 Server:
ko: 4.3 서버에서 PostgreSQL 서비스를 중지합니다.
zh_cn: 停止 4.3 服务器上的 PostgreSQL 服务：

source: Perform the final migration on {productname} {productnumber} Server
ko: {productname} {productnumber} 서버에서 최종 마이그레이션 수행
zh_cn: 在 {productname} {productnumber} 服务器上执行迁移

source: Migrate trusted SSL CA certificates.
ja: 信頼されているSSL CA証明書を移行します。
ko: 신뢰할 수 있는 SSL CA 인증서를 마이그레이션합니다.
zh_cn: 迁移可信 SSL CA 证书。

source: Migration of the certificates
ko: 인증서 마이그레이션
zh_cn: 证书的迁移

source: Trusted SSL CA certificates that were installed as part of an RPM and stored on {productname} 4.3 in the [path]``/usr/share/pki/trust/anchors/`` directory will not be migrated. Because {suse} does not install RPM packages in the container, the administrator must migrate these certificate files manually from the SUSE Manager 4.3 server after the migration.
ko: RPM의 일부로 설치되고 {productname} 4.3의 [path]``/usr/share/pki/trust/anchors/`` 디렉토리에 저장된 신뢰할 수 있는 SSL CA 인증서는 마이그레이션되지 않습니다. {suse}는 컨테이너에 RPM 패키지를 설치하지 않으므로 관리자는 마이그레이션 후 SUSE Manager 4.3 서버에서 이러한 인증서 파일을 수동으로 마이그레이션해야 합니다.
zh_cn: 作为 RPM 的一部分安装并存储在 {productname} 4.3 上 [path]``/usr/share/pki/trust/anchors/`` 目录中的可信 SSL CA 证书将不会迁移。由于 {suse} 不会在容器中安装 RPM 软件包，因此迁移完成后，管理员必须手动从 SUSE Manager 4.3 服务器迁移这些证书文件。

source: Procedure: Migrating the certificates
ko: 절차: 인증서 마이그레이션
zh_cn: 过程：迁移证书

source: Copy the file from the SUSE Manager 4.3 Server to the new {productname} {productnumber} Server.
ko: SUSE Manager 4.3 서버에서 새 {productname} {productnumber} 서버로 파일을 복사합니다.
zh_cn: 将 SUSE Manager 4.3 服务器中的该文件复制到新 {productname} {productnumber} 服务器。

source: For example, as [path]``/local/ca.file``.
ja: たとえば、[path]``/local/ca.file``です。
ko: 예를 들어 [path]``/local/ca.file``일 수 있습니다.
zh_cn: 例如，复制为 [path]``/local/ca.file``。

source: Copy the file into the container with:
ja: 次のコマンドを使用してファイルをコンテナにコピーします。
ko: 다음을 사용하여 파일을 컨테이너에 복사합니다.
zh_cn: 使用以下命令将文件复制到容器中：

source: After successfully running the [command]``mgradm migrate`` command, the {salt} setup on all clients will still point to the old 4.3 server.
ja: [command]``mgradm migrate``コマンドの実行が正常に完了した後も、すべてのクライアント上の{salt}セットアップはまだ古い4.3サーバを指したままです。
ko: [command]``mgradm migrate`` 명령을 성공적으로 실행한 후에도 모든 클라이언트의 {salt} 설정은 계속해서 기존 4.3 서버를 가리킵니다.
zh_cn: 成功运行 [command]``mgradm migrate`` 命令后，所有客户端上的 {salt} 设置仍会指向旧的 4.3 服务器。

source: To redirect them to the {productnumber} server, it is required to rename the new server at the infrastructure level (DHCP and DNS) to use the same FQDN and IP address as 4.3 server.
ja: これらを{productnumber}サーバにリダイレクトするために、新しいサーバの名前をインフラストラクチャレベル(DHCPおよびDNS)で変更し、4.3サーバと同じFQDNとIPアドレスを使用する必要があります。
zh_cn: 要将其重定向到 {productnumber} 服务器，需要在基础架构级别（DHCP 和 DNS）重命名新服务器，以使用与 4.3 服务器相同的 FQDN 和 IP 地址。

source: Adjusting the IP address can be avoided if the latest version of the minion is installed on the clients, as the newer version can automatically re-connect with the server using only the FQDN.
ko: 최신 버전은 FQDN만 사용하여 서버와 자동으로 다시 연결할 수 있으므로 최신 버전의 미니언이 클라이언트에 설치되어 있다면 IP 주소 조정을 수행하지 않아도 됩니다.
zh_cn: 如果客户端上安装了最新版本的受控端，则无需调整 IP 地址，因为较新版本仅通过 FQDN 就能自动重新连接服务器。

source: Client tools rebranding
ko: 클라이언트 도구 리브랜딩
zh_cn: 客户端工具品牌更新

source: {productname} {productnumber} introduces a rebranded set of client tools for all supported operating systems. This transition is seamless, and users performing a new product synchronization should only notice the updated channel names.
ko: {productname} {productnumber}은(는) 지원되는 모든 운영 체제에 대한 일련의 클라이언트 도구를 리브랜딩했습니다. 이 전환은 원활하게 수행되며, 새 제품 동기화를 수행하는 사용자는 업데이트된 채널 이름만 확인할 수 있습니다.
zh_cn: {productname} {productnumber} 为所有受支持的操作系统推出了一套重新命名的客户端工具。此过渡过程无缝衔接，执行新产品同步的用户仅会注意到通道名称已更新。

source: Channels named [literal]``SUSE Manager Client Tools for XYZ``, used by clients previously registered with {productname} 4.3 or 5.0, are no longer available in version 5.1 and will no longer receive updates in 5.1.
ko: 버전 5.1에서는 {productname} 4.3 또는 5.0에 이전에 등록된 클라이언트가 사용하던 [literal]``SUSE Manager Client Tools for XYZ`` 채널을 더 이상 사용할 수 없으며, 버전 5.1에서는 더 이상 업데이트를 수신하지 않습니다.
zh_cn: 此前注册到 {productname} 4.3 或 5.0 的客户端所使用的 [literal]``SUSE Manager Client Tools for XYZ`` 通道在版本 5.1 中已不再提供，且不会在 5.1 中继续接收更新。

source: Although the legacy channels remain assigned to existing clients after migration, the corresponding repositories have been removed.
ko: 이전 채널은 마이그레이션 후에도 기존 고객에게 할당된 상태로 유지되지만, 해당 리포지토리는 제거되었습니다.
zh_cn: 尽管迁移后旧版通道仍会分配给现有客户端，但对应的储存库已被去除。

source: To ensure continued updates, users must:
ko: 지속적인 업데이트를 보장하기 위해 사용자는 다음을 수행해야 합니다.
zh_cn: 为确保客户端能持续接收更新，用户必须执行以下操作：

source: Mirror the new [literal]``SUSE Multi-Linux Manager Client Tools for XYZ`` channels for the relevant products and assign them to the appropriate clients.
ko: 관련 제품의 새 [literal]``SUSE Multi-Linux Manager Client Tools for XYZ`` 채널을 미러링하고 적절한 클라이언트에 할당합니다.
zh_cn: 为相关产品同步新的 [literal]``SUSE Multi-Linux Manager Client Tools for XYZ`` 通道，并将其分配给相应的客户端。

source: Unassign the outdated [literal]``SUSE Manager Client Tools for XYZ`` channels.
ko: 사용 중지된 [literal]``SUSE Manager Client Tools for XYZ`` 채널의 할당을 해제합니다.
zh_cn: 取消分配过时的 [literal]``SUSE Manager Client Tools for XYZ`` 通道。

source: This also means that any CLM projects based on the old client tools must be adjusted accordingly.
ko: 이는 또한 기존 클라이언트 도구를 기반으로 한 모든 CLM 프로젝트도 이에 맞춰 조정되어야 함을 의미합니다.
zh_cn: 这也意味着，任何基于旧客户端工具的 CLM 项目都必须相应调整。

source: For example workflow, see xref:common-workflows:workflow-switch-to-new-client-tools-channels.adoc[].
ko: 예시 워크플로는 xref:common-workflows:workflow-switch-to-new-client-tools-channels.adoc[]에서 확인할 수 있습니다.
zh_cn: 示例工作流程请参见 xref:common-workflows:workflow-switch-to-new-client-tools-channels.adoc[]。

source: Distribution Upgrade and Server Migration
ko: 배포 업그레이드 및 서버 마이그레이션
zh_cn: 发行套件升级和服务器迁移

source: {productname} 5.0 must be stopped before the upgrade.
ko: {productname} 5.0은 업그레이드 전에 중지해야 합니다.
zh_cn: 升级前必须停止 {productname} 5.0。

source: {productname} 5.0 is not supported on top of {sl-micro} 6.1 & {sles} 15 SP7 as host OS.
ko: {productname} 5.0은 {sl-micro} 6.1 및 {sles} 15 SP7에서 호스트 OS로 지원되지 않습니다.
zh_cn: {productname} 5.0 不支持使用 {sl-micro} 6.1 或 {sles} 15 SP7 作为主机操作系统。
