Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: |Container Name | Description | uyuni-server | Main product container | uyuni-db | Database container for the product | uyuni-hub-xmlrpc | XML-RPC gateway for Hub deployment | uyuni-server-attestation | Server COCO attestation | uyuni-saline | Saline container for Salt observability | uyuni-server-migration | Migration helper container
ko: |컨테이너 이름 | 설명 | uyuni-server | 기본 제품 컨테이너 | uyuni-db | 제품의 데이터베이스 컨테이너 | uyuni-hub-xmlrpc | 허브 배포의 XML-RPC 게이트웨이 | uyuni-server-attestation | 서버 COCO 증명 | uyuni-saline | Salt 옵저버빌리티의 Saline 컨테이너 | uyuni-server-migration | 마이그레이션 헬퍼 컨테이너
zh_cn: |容器名称 | 说明 | uyuni-server | 主产品容器 | uyuni-db | 产品的数据库容器 | uyuni-hub-xmlrpc | 用于 Hub 部署的 XML-RPC 网关 | uyuni-server-attestation | 服务器 COCO 证明容器 | uyuni-saline | 用于实现 Salt 可观测性的 Saline 容器 | uyuni-server-migration | 迁移辅助容器

source: Proxy Containers
zh_cn: 代理容器

source: |Container Name | Description | uyuni-proxy-httpd | Main proxy container handling all HTTP communication | uyuni-proxy-squid | Squid cache | uyuni-proxy-salt-broker | Salt forwarder | uyuni-proxy-ssh | SSH forwarder | uyuni-proxy-tftpd | TFTPd to HTTP translator and forwarder
zh_cn: |容器名称 | 说明 | uyuni-proxy-httpd | 处理所有 HTTP 通信的主代理容器 | uyuni-proxy-squid | Squid 缓存容器 | uyuni-proxy-salt-broker | Salt 转发器容器 | uyuni-proxy-ssh | SSH 转发器容器 | uyuni-proxy-tftpd | TFTP 到 HTTP 的转换器与转发器容器

source: You have the option to create a custom [filename]``mgradm.yaml`` file, which the [command]``mgradm`` tool can utilize during deployment.
ja: カスタムの[filename]``mgradm.yaml``ファイルを作成し、配備時に[command]``mgradm``ツールでこのファイルを利用することができます。
ko: 배포 중에 [command]``mgradm`` 도구가 사용할 수 있는 사용자 지정 [filename]``mgradm.yaml`` 파일을 만들 수 있는 옵션이 제공됩니다.
zh_cn: 您可以选择创建自定义的 [filename]``mgradm.yaml`` 文件，供 [command]``mgradm`` 工具在部署期间使用。

source: [command]``mgradm`` will prompt for basic variables if they are not provided using command line parameters or the [filename]``mgradm.yaml`` configuration file.
ja: コマンドラインパラメータまたは[filename]``mgradm.yaml``設定ファイルで基本的な変数が指定されていない場合、[command]``mgradm``によって入力を求められます。
ko: 명령줄 파라미터 또는 [filename]``mgradm.yaml`` 구성 파일을 사용하여 기본 변수를 제공하지 않은 경우 [command]``mgradm``은 기본 변수를 묻는 메시지를 표시합니다.
zh_cn: 如果未提供基本变量，[command]``mgradm`` 将提示您使用命令行参数或 [filename]``mgradm.yaml`` 配置文件来提供这些变量。

source: For security, **using command line parameters to specify passwords should be avoided**. Use a configuration file with proper permissions instead.
zh_cn: 为了安全起见，**应避免使用命令行参数指定口令**。请改用具有适当权限的配置文件。

source: Procedure: Deploying the {productname} Container with Podman Using a Custom Configuration File
zh_cn: 过程：使用自定义配置文件通过 Podman 部署 {productname} 容器

source: Prepare a configuration file named [filename]``mgradm.yaml`` similar to the following example:
ja: 次の例のような[filename]``mgradm.yaml``という名前の設定ファイルを準備します。
ko: 다음 예제와 유사하게 [filename]``mgradm.yaml``이라는 이름의 구성 파일을 준비합니다.
zh_cn: 准备一个名为 [filename]``mgradm.yaml`` 的配置文件，以以下示例所示：

source: # Database password. Randomly generated by default db: password: MySuperSecretDBPass
ja: # データベースのパスワード。デフォルトでランダムに生成されます db: password: MySuperSecretDBPass
ko: # 데이터베이스 비밀번호. 기본적으로 무작위로 생성됨 db: password: MySuperSecretDBPass
zh_cn: # 数据库口令。默认会随机生成 db: password: MySuperSecretDBPass

source: # Password for the CA certificate ssl: password: MySuperSecretSSLPassword
ja: # CA証明書のパスワード ssl: password: MySuperSecretSSLPassword
ko: # CA 인증서의 비밀번호 ssl: password: MySuperSecretSSLPassword
zh_cn: # CA 证书的口令 ssl: password: MySuperSecretSSLPassword

source: # Your SUSE Customer Center credentials scc: user: ccUsername password: ccPassword
ja: # SUSEカスタマーセンターの資格情報 scc: user: ccUsername password: ccPassword
ko: # SUSE 고객 센터 자격 증명 scc: user: ccUsername password: ccPassword
zh_cn: # 您的 SUSE Customer Center 身份凭证 scc: user: ccUsername password: ccPassword

source: # Organization name organization: YourOrganization
ja: # 組織名 organization: YourOrganization
ko: # 조직 이름 organization: YourOrganization
zh_cn: # 组织名称 organization: YourOrganization

source: # Email address sending the notifications emailFrom: notifications@example.com
ja: # 通知を送信する電子メールアドレス emailFrom: notifications@example.com
ko: # 알림을 전송하는 이메일 주소 emailFrom: notifications@example.com
zh_cn: # 用于发送通知的电子邮件地址 emailFrom: notifications@example.com

source: # Administrators account details admin: password: MySuperSecretAdminPass login: LoginName firstName: Admin lastName: Admin email: email@example.com
ja: # 管理者アカウントの詳細 admin: password: MySuperSecretAdminPass login: LoginName firstName: Admin lastName: Admin email: email@example.com
ko: # 관리자 계정 세부 정보 admin: password: MySuperSecretAdminPass login: LoginName firstName: Admin lastName: Admin email: email@example.com
zh_cn: # 管理员帐户细节 admin: password: MySuperSecretAdminPass login: LoginName firstName: Admin lastName: Admin email: email@example.com

source: From the terminal, as root, run the following command. Entering your server's FQDN is optional.
ja: 端末からrootとして次のコマンドを実行します。サーバのFQDNの入力はオプションです。
ko: 터미널에서 루트 권한으로 다음 명령을 실행합니다. 서버의 FQDN 입력은 선택 사항입니다.
zh_cn: 在终端中，以 root 身份运行以下命令。服务器 FQDN 是选填的。

source: You must deploy the container as sudo or root. The following error will be displayed on the terminal if you miss this step.
ja: コンテナはsudoまたはrootとして配備する必要があります。このステップを省略すると、端末に次のエラーが表示されます。
ko: 컨테이너를 sudo 또는 루트로 배포해야 합니다. 이 단계를 건너뛰면 터미널에 다음 오류가 표시됩니다.
zh_cn: 必须以 sudo 或 root 用户身份部署容器。如果您遗漏此步骤，终端中将显示以下错误。

source: Open a browser and proceed to your server's FQDN or IP address.
ja: ブラウザを開き、FQDNまたはIPアドレスの入力に進みます。
ko: 브라우저를 열고 서버의 FQDN 또는 IP 주소로 이동합니다.
zh_cn: 打开浏览器并访问您的服务器 FQDN 或 IP 地址。

source: Persistent Container Volumes
ko: 영구 컨테이너 볼륨
zh_cn: 永久性容器卷

source: Modifications performed within containers are not retained. Any alterations made outside of persistent volumes will be discarded. Below is a list of persistent volumes for {productname} {productnumber}.
ja: コンテナ内で行った変更は保持されません。永続ボリュームの外部で加えた変更は破棄されます。以下に{productname} {productnumber}の永続ボリュームのリストを示します。
ko: 컨테이너 내에서 수행한 수정 사항은 유지되지 않습니다. 영구 볼륨 외부에서 변경한 내용은 모두 삭제됩니다. 아래는 {productname} {productnumber}에 대한 영구 볼륨 목록입니다.
zh_cn: 在容器中执行的修改不会保留。在永久性卷外部所做的任何更改都将被丢弃。下面列出了 {productname} {productnumber} 的永久性卷。

source: To customize the default volume locations, ensure you create the necessary volumes before launching the pod for the first time, utilizing the [command]``podman volume create`` command.
ja: デフォルトのボリュームの場所をカスタマイズするには、[command]``podman volume create``コマンドを使用して、ポッドの最初の起動前に、必要なボリュームを作成するようにします。
ko: 기본 볼륨 위치를 사용자 정의하려면 Podman을 처음 시작하기 전에 [command]``podman volume create`` 명령을 사용하여 필요한 볼륨을 생성해야 합니다.
zh_cn: 要自定义默认卷位置，请确保在首次启动 Pod 之前使用 [command]``podman volume create`` 命令创建必要的卷。

source: Ensure that this table aligns precisely with the volumes mapping outlined in both the Helm chart and the systemctl services definitions.
ja: この表は、Helmチャートおよびsystemctlサービス定義の両方で示されているボリュームマッピングに正確に従っています。
ko: 이 테이블이 Helm 차트와 systemctl 서비스 정의에 설명된 볼륨 매핑과 세부적으로 일치하는지 확인합니다.
zh_cn: 请确保此表格与 Helm 图表和 systemctl 服务定义中所述的卷映射完全一致。

source: The following volumes are stored under the **Podman** default storage location on the server.
ja: 次のボリュームは、サーバ上の**Podman**のデフォルトのストレージの場所に保存されます。
zh_cn: 以下卷存储在服务器上的 **Podman** 默认存储位置。

source: Persistent Volumes: **Podman Default Storage**
ja: 永続ボリューム: **Podmanのデフォルトストレージ**
ko: 영구 볼륨: **Podman 기본 스토리지**
zh_cn: 永久性卷：**Podman 默认存储**

source: |Volume Name | Volume Directory | **Podman Storage** | [path]``/var/lib/containers/storage/volumes/``
ja: | ボリューム名 | ボリュームディレクトリ | **Podman Storage** | [path]``/var/lib/containers/storage/volumes/``
ko: | 볼륨 이름 | 볼륨 디렉토리 | **Podman 스토리지** | [path]``/var/lib/containers/storage/volumes/``
zh_cn: |卷名称 | 卷目录 | **Podman 存储** | [path]``/var/lib/containers/storage/volumes/``

source: Persistent Volumes: **root**
ja: 永続ボリューム: **root**
ko: 영구 볼륨: **루트**
zh_cn: 永久性卷：**root**

source: |Volume Name | Volume Directory | **root** | [path]``/root``
ja: | ボリューム名 | ボリュームディレクトリ | **root** | [path]``/root``
ko: |볼륨 이름 | 볼륨 디렉토리 | **root** | [path]``/root``
zh_cn: |卷名称 | 卷目录 | **root** | [path]``/root``

source: Persistent Volumes: **var/**
ja: 永続ボリューム: **var/**
ko: 영구 볼륨: **var/**
zh_cn: 永久性卷：**var/**

source: |Volume Name | Volume Directory | **var-cobbler** | [path]``/var/lib/cobbler`` | **var-salt** | [path]``/var/lib/salt`` | **var-pgsql** | [path]``/var/lib/pgsql/data`` | **var-pgsql-backup** | [path]``/var/lib/pgsql-backup`` | **var-cache** | [path]``/var/cache`` | **var-spacewalk** | [path]``/var/spacewalk`` | **var-log** | [path]``/var/log``
ko: |볼륨 이름 | 볼륨 디렉토리 | **var-cobbler** | [path]``/var/lib/cobbler`` | **var-salt** | [path]``/var/lib/salt`` | **var-pgsql** | [path]``/var/lib/pgsql/data`` | **var-pgsql-backup** | [path]``/var/lib/pgsql-backup`` | **var-cache** | [path]``/var/cache`` | **var-spacewalk** | [path]``/var/spacewalk`` | **var-log** | [path]``/var/log``
zh_cn: |卷名称 | 卷目录 | **var-cobbler** | [path]``/var/lib/cobbler`` | **var-salt** | [path]``/var/lib/salt`` | **var-pgsql** | [path]``/var/lib/pgsql/data`` | **var-pgsql-backup** | [path]``/var/lib/pgsql-backup`` | **var-cache** | [path]``/var/cache`` | **var-spacewalk** | [path]``/var/spacewalk`` | **var-log** | [path]``/var/log``

source: Persistent Volumes: **srv/**
ja: 永続ボリューム: **srv/**
ko: 영구 볼륨: **srv/**
zh_cn: 永久性卷：**srv/**

source: | Volume Name | Volume Directory | **srv-salt** | [path]``/srv/salt`` | **srv-www** | [path]``/srv/www/`` | **srv-tftpboot** | [path]``/srv/tftpboot`` | **srv-formulametadata** | [path]``/srv/formula_metadata`` | **srv-pillar** | [path]``/srv/pillar`` | **srv-susemanager** | [path]``/srv/susemanager`` | **srv-spacewalk** | [path]``/srv/spacewalk``
ja: | ボリューム名 | ボリュームディレクトリ | **srv-salt** | [path]``/srv/salt`` | **srv-www** | [path]``/srv/www/`` | **srv-tftpboot** | [path]``/srv/tftpboot`` | **srv-formulametadata** | [path]``/srv/formula_metadata`` | **srv-pillar** | [path]``/srv/pillar`` | **srv-susemanager** | [path]``/srv/susemanager`` | **srv-spacewalk** | [path]``/srv/spacewalk``
ko: | 볼륨 이름 | 볼륨 디렉토리 | **srv-salt** | [path]``/srv/salt`` | **srv-www** | [path]``/srv/www/`` | **srv-tftpboot** | [path]``/srv/tftpboot`` | **srv-formulametadata** | [path]``/srv/formula_metadata`` | **srv-pillar** | [path]``/srv/pillar`` | **srv-susemanager** | [path]``/srv/susemanager`` | **srv-spacewalk** | [path]``/srv/spacewalk``
zh_cn: | 卷名称 | 卷目录 | **srv-salt** | [path]``/srv/salt`` | **srv-www** | [path]``/srv/www/`` | **srv-tftpboot** | [path]``/srv/tftpboot`` | **srv-formulametadata** | [path]``/srv/formula_metadata`` | **srv-pillar** | [path]``/srv/pillar`` | **srv-susemanager** | [path]``/srv/susemanager`` | **srv-spacewalk** | [path]``/srv/spacewalk``

source: Persistent Volumes: **etc/**
ja: 永続ボリューム: **etc/**
ko: 영구 볼륨: **etc/**
zh_cn: 永久性卷：**etc/**

source: Persistent Volumes: **run/**
ko: 영구 볼륨: **run/**
zh_cn: 永久性卷：**run/**

source: |Volume Name | Volume Directory | **run-salt-master** | [path]``/run/salt/master``
ko: |볼륨 이름 | 볼륨 디렉토리 | **run-salt-master** | [path]``/run/salt/master``
zh_cn: |卷名称 | 卷目录 | **run-salt-master** | [path]``/run/salt/master``

source: The following volumes are stored under the **Podman** default storage location on the proxy.
ja: 次のボリュームは、プロキシ上の**Podman**のデフォルトのストレージの場所に保存されます。
zh_cn: 以下卷存储在代理上的 **Podman** 默认存储位置。

source: |Volume Name | Volume Directory | **uyuni-proxy-tftpboot** | [path]``/srv/tftpboot``
ja: | ボリューム名 | ボリュームディレクトリ | **uyuni-proxy-tftpboot** | [path]``/srv/tftpboot``
zh_cn: |卷名称 | 卷目录 | **uyuni-proxy-tftpboot** | [path]``/srv/tftpboot``

source: |Volume Name | Volume Directory | **uyuni-proxy-rhn-cache** | [path]``/var/cache/rhn`` | **uyuni-proxy-squid-cache** | [path]``/var/cache/squid``
ja: |ボリューム名 | ボリュームディレクトリ | **uyuni-proxy-rhn-cache** | [path]``/var/cache/rhn`` | **uyuni-proxy-squid-cache** | [path]``/var/cache/squid``
zh_cn: |卷名称 | 卷目录 | **uyuni-proxy-rhn-cache** | [path]``/var/cache/rhn`` | **uyuni-proxy-squid-cache** | [path]``/var/cache/squid``

source: Starting and Stopping Containers
ja: コンテナの起動と停止
ko: 컨테이너 시작 및 중지
zh_cn: 启动和停止容器

source: The {productname} {productnumber} Server container can be restarted, started, and stopped using the following commands:
ja: 次のコマンドを使用して、{productname} {productnumber}サーバコンテナを再起動、起動、および停止できます。
ko: 다음 명령을 사용하여 {productname} {productnumber} 서버 컨테이너를 재시작, 시작 및 중지할 수 있습니다.
zh_cn: 可使用以下命令重启、启动和停止 {productname} {productnumber} 服务器容器：

source: To [command]``restart`` the {productname} {productnumber} Server execute the following command:
ja: {productname} {productnumber}サーバを再起動([command]``restart``)するには、次のコマンドを実行します。
ko: {productname} {productnumber} 서버를 [command]``restart``하려면 다음 명령을 실행합니다.
zh_cn: 要[command]``重启`` {productname} {productnumber} 服务器，请执行以下命令：

source: To [command]``start`` the server execute the following command:
ja: サーバを起動([command]``start``)するには、次のコマンドを実行します。
ko: 서버를 [command]``start``하려면 다음 명령을 실행합니다.
zh_cn: 要[command]``启动``服务器，请执行以下命令：

source: To [command]``stop`` the server execute the following command:
ja: サーバを停止([command]``stop``)するには、次のコマンドを実行します。
ko: 서버를 [command]``stop``하려면 다음 명령을 실행합니다.
zh_cn: 要[command]``停止``服务器，请执行以下命令：

source: Understanding [command]``mgr-storage-server`` and [command]``mgr-storage-proxy``
ko: [command]``mgr-storage-server`` 및 [command]``mgr-storage-proxy`` 이해하기
zh_cn: 了解 [command]``mgr-storage-server`` 和 [command]``mgr-storage-proxy``

source: [command]``mgr-storage-server`` and [command]``mgr-storage-proxy`` are helper scripts provided with {productname} 5.0 and later.
ko: [command]``mgr-storage-server`` 및 [command]``mgr-storage-proxy``는 {productname} 5.0 이상 버전과 함께 제공되는 헬퍼 스크립트입니다.
zh_cn: [command]``mgr-storage-server`` 和 [command]``mgr-storage-proxy`` 是 {productname} 5.0 及更高版本提供的辅助脚本。

source: [command]``mgr-storage-server`` and [command]``mgr-storage-proxy`` are helper scripts provided with {productname}.
ko: [command]``mgr-storage-server`` 및 [command]``mgr-storage-proxy``는 {productname}과(와) 함께 제공되는 보조 스크립트입니다.
zh_cn: [command]``mgr-storage-server`` 和 [command]``mgr-storage-proxy`` 是 {productname} 提供的辅助脚本。

source: They are designed to configure storage for {productname} Server and Proxy.
ko: 이는 {productname} 서버 및 프록시를 위한 스토리지를 구성하도록 설계되었습니다.
zh_cn: 它们用于为 {productname} 服务器和代理指定存储配置。

source: The scripts take disk devices as arguments. [command]``mgr-storage-proxy`` requires a single argument for the storage disk device. [command]``mgr-storage-server`` requires a storage disk device and can optionally accept a second argument for a dedicated database disk device. While both normal and database storage can reside on the same disk, it is advisable to place the database on a dedicated, high-performance disk to ensure better performance and easier management.
ko: 이 스크립트는 디스크 장치를 인수로 받습니다. [command]``mgr-storage-proxy``에는 스토리지 디스크 장치를 위한 단일 인수가 필요합니다. [command]``mgr-storage-server``에는 스토리지 디스크 장치가 필요하며, 선택적으로 전용 데이터베이스 디스크 장치를 위한 두 번째 인수를 받아들일 수 있습니다. 일반 스토리지와 데이터베이스 스토리지가 동일한 디스크에 존재할 수 있지만, 더 나은 성능과 쉬운 관리를 보장하기 위해 데이터베이스를 전용 고성능 디스크에 배치하는 것이 좋습니다.
zh_cn: 这些脚本以磁盘设备作为参数。[command]``mgr-storage-proxy`` 仅需要一个参数，即存储磁盘设备。[command]``mgr-storage-server`` 需要用户指定存储磁盘设备，此外还可选择传入第二个参数，即专用数据库磁盘设备。虽然普通存储设备和数据库存储设备可位于同一磁盘，但建议将数据库部署在专用的高性能磁盘上，以确保实现更优的性能和更便捷的管理。

source: What these tools do
ko: 이러한 도구의 기능
zh_cn: 这些工具的功能

source: Both [command]``mgr-storage-server`` and [command]``mgr-storage-proxy`` perform standard storage setup operations:
ko: [command]``mgr-storage-server`` 및 [command]``mgr-storage-proxy``는 모두 표준 스토리지 설정 작업을 수행합니다.
zh_cn: [command]``mgr-storage-server`` 和 [command]``mgr-storage-proxy`` 均会执行以下标准存储设置操作：

source: Validate the provided storage devices.
ko: 제공된 저장 장치를 확인합니다.
zh_cn: 验证提供的存储设备。

source: Ensure that devices are empty and suitable for use.
ko: 장치가 비어 있고 사용에 적합한지 확인합니다.
zh_cn: 确保设备为空且适合使用。

source: Create XFS filesystems on the specified devices.
ko: 지정된 장치에 XFS 파일 시스템을 생성합니다.
zh_cn: 在指定设备上创建 XFS 文件系统。

source: Mount the devices temporarily for data migration.
ko: 데이터 마이그레이션을 위해 장치를 임시로 마운트합니다.
zh_cn: 临时挂载设备以进行数据迁移。

source: Move the relevant storage directories to the new devices.
ko: 관련 저장소 디렉토리를 새 장치로 이동합니다.
zh_cn: 将相关存储目录迁移到新设备。

source: Create entries in [path]``/etc/fstab`` so that the storage mounts automatically on boot.
ko: [path]``/etc/fstab``에 항목을 생성하여 부팅 시 저장소가 자동으로 마운트되도록 합니다.
zh_cn: 在 [path]``/etc/fstab`` 中创建条目，确保存储设备在系统引导时自动挂载。

source: Remount the devices at their final locations.
ko: 장치를 최종 위치에 다시 마운트합니다.
zh_cn: 将设备重新挂载到最终位置。

source: Additional tool-specific behavior
ko: 도구별 추가 동작
zh_cn: 工具的专属特性

source: Optionally supports a separate device for database storage.
ko: 선택적으로 데이터베이스 저장을 위한 별도의 장치를 지원합니다.
zh_cn: 选择性支持数据库存储专用设备。

source: Stops SUSE Manager services during migration, restarts them afterward.
ko: 마이그레이션 중 SUSE Manager 서비스를 중지하고, 이후에 다시 시작합니다.
zh_cn: 迁移期间停止 SUSE Manager 服务，迁移完成后会重启服务。

source: Moves Podman volumes directory [path]``/var/lib/containers/storage/volumes`` to the prepared storage, and optionally [path]``/var/lib/containers/storage/volumes/var-pgsql`` to the prepared database storage. | `mgr-storage-proxy` |
ko: podman 볼륨 디렉토리 [path]``/var/lib/containers/storage/volumes``을 준비된 저장소로 이동하고, 선택적으로 [path]``/var/lib/containers/storage/volumes/var-pgsql``를 준비된 데이터베이스 저장소로 이동합니다. | `mgr-storage-proxy` |
zh_cn: 将 Podman 卷目录 [path]``/var/lib/containers/storage/volumes`` 迁移到准备好的存储设备；以及选择性将 [path]``/var/lib/containers/storage/volumes/var-pgsql`` 迁移到准备好的数据库存储设备。 | `mgr-storage-proxy` |

source: Focuses only on proxy storage (no database storage support).
ko: 프록시 저장소에만 집중합니다(데이터베이스 저장소 지원 안 함).
zh_cn: 仅专注于设置代理存储设备（不支持设置数据库存储设备）。

source: Stops and restarts the proxy service during migration.
ko: 마이그레이션 중 프록시 서비스를 중지하고 다시 시작합니다.
zh_cn: 迁移期间停止并重启代理服务。

source: Moves podman volumes directory [path]``/var/lib/containers/storage/volumes`` to the prepared storage.
ko: podman 볼륨 디렉토리 [path]``/var/lib/containers/storage/volumes``를 준비된 저장소로 이동합니다.
zh_cn: 将 Podman 卷目录 [path]``/var/lib/containers/storage/volumes`` 迁移到准备好的存储设备。

source: Both tools automate standard Linux storage operations. There is no hidden or custom logic beyond what a Linux administrator would do manually.
ko: 두 도구 모두 표준 Linux 스토리지 작업을 자동화합니다. Linux 관리자가 수동으로 수행하는 작업 이상의 숨겨진 또는 사용자 정의 논리는 존재하지 않습니다.
zh_cn: 这两个工具均会自动执行标准的 Linux 存储操作，不存在 Linux 管理员手动操作之外的隐藏逻辑或自定义逻辑。

source: What these tools do *not* do
ko: 이러한 도구가 제공하지 *않는* 기능
zh_cn: 这些工具**不**具备的功能

source: They do *not* create or manage LVM volumes.
ko: LVM 볼륨을 생성하거나 관리하지 *않습니다*.
zh_cn: **不会**创建或管理 LVM 卷。

source: They do *not* configure RAID or complex storage topologies.
ko: RAID 또는 복잡한 저장소 토폴로지를 구성하지 *않습니다*.
zh_cn: **不会**配置 RAID 或复杂存储拓扑。

source: They do *not* prevent you from managing storage using normal Linux tools after setup.
ko: 설정 후 일반적인 Linux 도구를 사용하여 저장소를 관리하는 것을 방해하지 *않습니다*.
zh_cn: **不会**阻止您在完成设置后使用常规 Linux 工具管理存储设备。

source: They do *not* provide dynamic resizing or expansion capabilities — these must be handled using standard Linux storage tools.
ko: 동적 크기 조정 또는 확장 기능은 제공하지 *않습니다*. 이러한 작업은 표준 Linux 저장소 도구를 사용하여 처리해야 합니다.
zh_cn: **不**提供动态调整大小或扩展功能 — 这些操作必须通过标准 Linux 存储工具完成。

source: Post-installation storage management
ko: 설치 후 저장소 관리
zh_cn: 安装后的存储管理

source: Once storage has been configured, you can safely manage it using standard Linux commands.
ko: 저장소 구성이 완료되면 표준 Linux 명령을 사용하여 안전하게 관리할 수 있습니다.
zh_cn: 完成存储配置后，您可通过标准 Linux 命令安全地管理存储设备。

source: Examples
zh_cn: 示例

source: Example 1: Extending storage if using LVM
ko: 예시 1: LVM 사용 시 저장소 확장
zh_cn: 示例 1：扩展存储容量（如果使用 LVM）

source: Example 2: Migrating to a larger disk
ko: 예시 2: 더 큰 디스크로 마이그레이션
zh_cn: 示例 2：迁移到更大容量的磁盘

source: Add and format the new disk.
ko: 새 디스크를 추가하고 포맷합니다.
zh_cn: 添加并格式化新磁盘。

source: Mount it temporarily.
ko: 일시적으로 마운트합니다.
zh_cn: 临时挂载新磁盘。

source: Use `rsync` to copy data.
ko: ``rsync``를 사용하여 데이터를 복사합니다.
zh_cn: 使用 `rsync` 复制数据。

source: Update `/etc/fstab`.
ko: ``/etc/fstab``를 업데이트합니다.
zh_cn: 更新 `/etc/fstab`。

source: Remount at the correct location.
ko: 올바른 위치에 다시 마운트합니다.
zh_cn: 将新磁盘重新挂载到适当位置。

source: When to use, or not use
ko: 사용해야 하는 경우 또는 사용하지 않아야 하는 경우
zh_cn: 适用与不适用场景

source: Always take a backup before making changes to your storage setup.
ko: 저장소 설정을 변경하기 전에 항상 백업을 수행하십시오.
zh_cn: 更改存储设置前，务必创建备份。

source: Use these tools *only* during initial storage setup or when migrating to new storage where the tool is expected to handle data migration and update `/etc/fstab`.
ko: 이러한 도구는 초기 저장소 설정 시 또는 데이터 마이그레이션 및 `/etc/fstab` 업데이트를 처리할 것으로 예상되는 새 스토리지로 마이그레이션하는 *경우에만* 사용하십시오.
zh_cn: **仅**在初始存储设置或迁移到新存储设备（需要使用工具处理数据迁移和更新 `/etc/fstab`）时使用这些工具。

source: Do *not* rerun these scripts for resizing or expanding storage. Use standard Linux tools (e.g., [literal]``lvextend``, [literal]``xfs_growfs``) for such operations.
ko: 저장소 크기 조정 또는 확장을 위해 이 스크립트를 다시 실행하지 *마십시오*. 이러한 작업에는 표준 Linux 도구(예: [literal]``lvextend``, [literal]``xfs_growfs``)를 사용하십시오.
zh_cn: **不要**重新运行这些脚本来扩容存储空间或调整其大小。要执行此类操作，请使用标准 Linux 工具（如 [literal]``lvextend``、[literal]``xfs_growfs``）。

source: Summary
zh_cn: 总结

source: [command]``mgr-storage-server`` and [command]``mgr-storage-proxy`` help automate the initial persistent storage setup for {productname} components using standard Linux storage practices. They do not limit or interfere with standard storage management afterward.
ko: [command]``mgr-storage-server`` 및 [command]``mgr-storage-proxy``는 표준 Linux 저장소 관행을 사용하여 {productname} 구성 요소에 대한 초기 영구 저장소 설정을 자동화하는 데 도움을 줍니다. 이후 표준 저장소 관리에 제한을 두거나 간섭하지 않습니다.
zh_cn: [command]``mgr-storage-server`` 和 [command]``mgr-storage-proxy`` 会根据标准 Linux 存储实践，自动完成 {productname} 组件的初始持久化存储设置，且不会限制或干扰后续的标准存储管理操作。

source: After setup, continue managing your storage using familiar Linux tools.
ko: 설정 이후에는 익숙한 Linux 도구를 사용하여 저장소를 계속 관리합니다.
zh_cn: 完成设置后，您可继续使用熟悉的 Linux 工具管理存储设备。

source: A full database volume can cause significant issues with system operation. As disk usage notifications have not yet been adapted for containerized environments, users are encouraged to monitor the disk space used by Podman volumes themselves, either through tools such as Grafana, Prometheus, or any other preferred method. Pay particular attention to the var-pgsql volume, located under [path]``/var/lib/containers/storage/volumes/``.
ko: 데이터베이스 볼륨이 가득 차면 시스템 운영에 심각한 문제가 발생할 수 있습니다. 디스크 사용량 알림 기능이 아직 컨테이너화된 환경에 적용되지 않았으므로, 사용자는 Grafana, Prometheus 등의 도구나 선호하는 다른 방법을 통해 podman 볼륨이 차지하는 디스크 공간을 직접 모니터링할 것을 권장합니다. 특히 [path]``/var/lib/containers/storage/volumes/`` 아래에 위치한 var-pgsql 볼륨에 각별히 유의해야 합니다.
zh_cn: 数据库存储卷空间耗尽会对系统运行造成严重影响。由于容器化环境尚未适配磁盘使用率通知功能，建议用户通过 Grafana、Prometheus 或其他偏好的工具，自行监控 Podman 卷的磁盘空间使用情况，尤其需要关注位于 [path]``/var/lib/containers/storage/volumes/`` 下的 var-pgsql 卷。

source: {productname} Proxy Upgrade
ko: {productname} 프록시 업그레이드
zh_cn: {productname} 代理升级

source: Before running the upgrade command, it is required to update the host operating system. Updating the host operating system will also result in the update of the {productname} tooling such as the [literal]``mgrpxy`` tool.
ko: 업그레이드 명령을 실행하기 전에 호스트 운영 체제를 업데이트해야 합니다. 호스트 운영 체제를 업데이트하면 [literal]``mgrpxy`` 도구와 같은 {productname} 도구도 함께 업데이트됩니다.
zh_cn: 运行升级命令前，需要更新主机操作系统。更新主机操作系统时，{productname} 相关工具（如 [literal]``mgrpxy``）也会同步更新。

source: Procedure: Upgrading Proxy
ko: 절차: 프록시 업그레이드
zh_cn: 过程：升级代理

source: Refresh software repositories with [command]``zypper``:
zh_cn: 使用 [command]``zypper`` 刷新软件储存库：

source: Depending on the host operating system, proceed with these steps:
ko: 호스트 운영 체제에 따라 다음 단계를 진행합니다.
zh_cn: 根据主机操作系统执行以下步骤：

source: For a transactional system such as {sl-micro}:
ko: {sl-micro} 같은 트랜잭션 시스템의 경우:
zh_cn: 对于 {sl-micro} 等事务性系统：

source: Apply available updates with [command]``transactional-update``:
ja: [command]``transactional-update``を使用して利用可能な更新を適用します。
zh_cn: 使用 [command]``transactional-update`` 应用可用的更新:

source: If updates were applied, [literal]``reboot``.
ja: 更新が適用されたら、[literal]``reboot``を実行して再起動します。
ko: 업데이트가 완료되면 [literal]``reboot``를 수행합니다.
zh_cn: 如果已应用更新，请[literal]``重引导``。

source: For {sles}:
zh_cn: 对于 {sles}：
