Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: [.title]#{productname} {productnumber}#: Installation and Upgrade Guide
ja: [.title]#{productname} {productnumber}#: インストールおよびアップグレードガイド
ko: [.title]#{productname} {productnumber}#: 설치 및 업그레이드 가이드
zh_cn: [.title]#{productname} {productnumber}#: 安装和升级指南

source: xref:installation-and-upgrade-overview.adoc[Installation and Upgrade Guide]
ja: xref:installation-and-upgrade-overview.adoc[インストールおよびアップグレードガイド]
ko: xref:installation-and-upgrade-overview.adoc[설치 및 업그레이드 가이드]
zh_cn: xref:installation-and-upgrade-overview.adoc[安装和升级指南]

source: xref:uyuni-installation-and-upgrade-overview.adoc[Installation and Upgrade Guide]
ko: xref:uyuni-installation-and-upgrade-overview.adoc[설치 및 업그레이드 가이드]
zh_cn: xref:uyuni-installation-and-upgrade-overview.adoc[安装和升级指南]

source: Requirements
cs: Požadavky
ja: 要件
ko: 요구사항
zh_cn: 要求

source: xref:general-requirements.adoc[General Requirements]
ja: xref:general-requirements.adoc[一般的な要件]
ko: xref:general-requirements.adoc[일반 요구사항]
zh_cn: xref:general-requirements.adoc[一般要求]

source: xref:hardware-requirements.adoc[Hardware Requirements]
cs: xref:hardware-requirements.adoc[Požadavky na hardware]
ja: xref:hardware-requirements.adoc[ハードウェア要件]
ko: xref:hardware-requirements.adoc[하드웨어 요구사항]
zh_cn: xref:hardware-requirements.adoc[硬件要求]

source: xref:uyuni-install-requirements.adoc[General Requirements]
ja: xref:uyuni-install-requirements.adoc[一般的な要件]
ko: xref:uyuni-install-requirements.adoc[일반 요구사항]
zh_cn: xref:uyuni-install-requirements.adoc[一般要求]

source: xref:network-requirements.adoc[Network Requirements]
cs: xref:network-requirements.adoc[Požadavky na síť]
ja: xref:network-requirements.adoc[ネットワーク要件]
ko: xref:network-requirements.adoc[네트워크 요구사항]
zh_cn: xref:network-requirements.adoc[网络要求]

source: xref:pubcloud-requirements.adoc[Public Cloud Requirements]
cs: xref:pubcloud-requirements.adoc[Požadavky na veřejný cloud]
ja: xref:pubcloud-requirements.adoc[パブリッククラウドの要件]
ko: xref:pubcloud-requirements.adoc[공용 클라우드 요구사항]
zh_cn: xref:pubcloud-requirements.adoc[公有云要求]

source: Deployment and Installation
ja: 配備とインストール
ko: 배포 및 설치
zh_cn: 部署和安装

source: xref:install-server.adoc[Server]
ko: xref:install-server.adoc[서버]
zh_cn: xref:install-server.adoc[服务器]

source: xref:container-deployment/uyuni/server-air-gapped-deployment-uyuni.adoc[Air-gapped Deployment]
ja: xref:container-deployment/uyuni/server-air-gapped-deployment-uyuni.adoc[Air-gapped配備]
ko: xref:container-deployment/uyuni/server-air-gapped-deployment-uyuni.adoc[air-gapped 배포]
zh_cn: xref:container-deployment/uyuni/server-air-gapped-deployment-uyuni.adoc[隔离的部署]

source: xref:install-proxy.adoc[Proxy]
ja: xref:install-proxy.adoc[プロキシ]
zh_cn: xref:install-proxy.adoc[代理]

source: xref:container-deployment/uyuni/proxy-container-setup-uyuni.adoc[Containerized {productname} Proxy Setup]
ja: xref:container-deployment/uyuni/proxy-container-setup-uyuni.adoc[コンテナ化された{productname}プロキシの設定]
zh_cn: xref:container-deployment/uyuni/proxy-container-setup-uyuni.adoc[容器化 {productname} 代理设置]

source: xref:container-deployment/uyuni/proxy-conversion-from-client-uyuni.adoc[{productname} Proxy Conversion From Client]
ko: xref:container-deployment/uyuni/proxy-conversion-from-client-uyuni.adoc[클라이언트에서 {productname} 프록시 전환]
zh_cn: xref:container-deployment/uyuni/proxy-conversion-from-client-uyuni.adoc[将客户端转换为 {productname} 代理]

source: xref:container-deployment/uyuni/proxy-k3s-deployment-uyuni.adoc[Proxy Deployment on K3s]
ja: xref:container-deployment/uyuni/proxy-k3s-deployment-uyuni.adoc[K3sへのプロキシの配備]
zh_cn: xref:container-deployment/uyuni/proxy-k3s-deployment-uyuni.adoc[在 K3s 上部署代理]

source: Installation and Deployment
ja: インストールと配備
ko: 설치 및 배포
zh_cn: 安装和部署

source: xref:container-deployment/mlm/server-deployment-mlm.adoc[{productname} Deployment]
ko: xref:container-deployment/mlm/server-deployment-mlm.adoc[{productname} 배포]
zh_cn: xref:container-deployment/mlm/server-deployment-mlm.adoc[{productname} 部署]

source: xref:container-deployment/mlm/server-deployment-vm-mlm.adoc[Server Deployment as Virtual Machine - KVM]
ko: xref:container-deployment/mlm/server-deployment-vm-mlm.adoc[가상 머신으로 서버 배포 - KVM]
zh_cn: xref:container-deployment/mlm/server-deployment-vm-mlm.adoc[将服务器部署为虚拟机 - KVM]

source: xref:container-deployment/mlm/server-deployment-vmdk-mlm.adoc[Server Deployment as Virtual Machine - VMware]
ko: xref:container-deployment/mlm/server-deployment-vmdk-mlm.adoc[가상 머신으로 서버 배포 - VMware]
zh_cn: xref:container-deployment/mlm/server-deployment-vmdk-mlm.adoc[将服务器部署为虚拟机 - VMWare]

source: xref:container-deployment/mlm/server-air-gapped-deployment-mlm.adoc[Air-gapped Deployment]
ko: xref:container-deployment/mlm/server-air-gapped-deployment-mlm.adoc[air-gapped 배포]
zh_cn: xref:container-deployment/mlm/server-air-gapped-deployment-mlm.adoc[隔离的部署]

source: xref:install-pubcloud.adoc[Public Cloud Deployment]
ja: xref:install-pubcloud.adoc[パブリッククラウドへの配備]
ko: xref:install-pubcloud.adoc[공용 클라우드 배포]
zh_cn: xref:install-pubcloud.adoc[公有云部署]

source: xref:connect-payg.adoc[Connect {payg} Instance]
zh_cn: xref:connect-payg.adoc[连接 {payg} 实例]

source: xref:container-deployment/mlm/proxy-deployment-mlm.adoc[{productname} Proxy Deployment]
ko: xref:container-deployment/mlm/proxy-deployment-mlm.adoc[{productname} 프록시 배포]
zh_cn: xref:container-deployment/mlm/proxy-deployment-mlm.adoc[{productname} 代理部署]

source: xref:container-deployment/mlm/proxy-conversion-from-client-mlm.adoc[{productname} Proxy Conversion From Client]
ko: xref:container-deployment/mlm/proxy-conversion-from-client-mlm.adoc[클라이언트에서 {productname} 프록시 전환]
zh_cn: xref:container-deployment/mlm/proxy-conversion-from-client-mlm.adoc[{将客户端转换为 {productname} 代理]

source: xref:container-deployment/mlm/proxy-deployment-vm-mlm.adoc[Proxy Deployment as Virtual Machine - KVM]
ko: xref:container-deployment/mlm/proxy-deployment-vm-mlm.adoc[가상 머신으로 프록시 배포 - KVM]
zh_cn: xref:container-deployment/mlm/proxy-deployment-vm-mlm.adoc[将服务器部署为虚拟机 - KVM]

source: xref:container-deployment/mlm/proxy-deployment-vmdk-mlm.adoc[Proxy Deployment Virtual Machine - VMware]
ko: xref:container-deployment/mlm/proxy-deployment-vmdk-mlm.adoc[가상 머신으로 프록시 배포 - VMware]
zh_cn: xref:container-deployment/mlm/proxy-deployment-vmdk-mlm.adoc[将代理部署为虚拟机 - VMware]

source: xref:container-deployment/mlm/proxy-k3s-deployment-mlm.adoc[Proxy Deployment on K3s]
ko: xref:container-deployment/mlm/proxy-k3s-deployment-mlm.adoc[K3s에 프록시 배포]
zh_cn: xref:container-deployment/mlm/proxy-k3s-deployment-mlm.adoc[在 K3s 上部署代理]

source: xref:container-deployment/mlm/proxy-air-gapped-deployment-mlm.adoc[Air-gapped Deployment]
ko: xref:container-deployment/mlm/proxy-air-gapped-deployment-mlm.adoc[air-gapped 배포]
zh_cn: xref:container-deployment/mlm/proxy-air-gapped-deployment-mlm.adoc[隔离的部署]

source: Upgrade and Migration
ja: アップグレードと移行
ko: 업그레이드 및 마이그레이션
zh_cn: 升级和迁移

source: Server
ja: サーバ
ko: 서버
zh_cn: 服务器

source: xref:container-deployment/uyuni/migrate-uyuni-to-a-container.adoc[Legacy Server Migration to Container]
ja: xref:container-deployment/uyuni/migrate-uyuni-to-a-container.adoc[レガシサーバのコンテナへの移行]
zh_cn: xref:container-deployment/uyuni/migrate-uyuni-to-a-container.adoc[从旧版服务器迁移到容器]

source: xref:container-management/updating-server-containers.adoc[Server Upgrade]
ja: xref:container-management/updating-server-containers.adoc[サーバのアップグレード]
ko: xref:container-management/updating-server-containers.adoc[서버 업그레이드]
zh_cn: xref:container-management/updating-server-containers.adoc[服务器升级]

source: Proxy
ja: プロキシ
ko: 프록시
zh_cn: 代理

source: xref:container-deployment/uyuni/proxy-migration-uyuni.adoc[Legacy Proxy Migration to Container]
ja: xref:container-deployment/uyuni/proxy-migration-uyuni.adoc[レガシプロキシのコンテナへの移行]
zh_cn: xref:container-deployment/uyuni/proxy-migration-uyuni.adoc[从旧版代理迁移到容器]

source: xref:container-management/updating-proxy-containers.adoc[Proxy Upgrade]
ja: xref:container-management/updating-proxy-containers.adoc[プロキシのアップグレード]
ko: xref:container-management/updating-proxy-containers.adoc[프록시 업그레이드]
zh_cn: xref:container-management/updating-proxy-containers.adoc[代理升级]

source: Clients
ja: クライアント
ko: 클라이언트
zh_cn: 客户端

source: xref:client-intro.adoc[Upgrading Clients]
ja: xref:client-intro.adoc[クライアントのアップグレード]
ko: xref:client-intro.adoc[클라이언트 업그레이드]
zh_cn: xref:client-intro.adoc[升级客户端]

source: xref:container-deployment/mlm/migrations/server/server-mlm-50-51.adoc[Server Migration 5.0 > 5.1]
ko: xref:container-deployment/mlm/migrations/server/server-mlm-50-51.adoc[서버 마이그레이션 5.0 > 5.1]
zh_cn: xref:container-deployment/mlm/migrations/server/server-mlm-50-51.adoc[将服务器 5.0 迁移到 5.1]

source: xref:container-deployment/mlm/migrations/server/server-mlm-43-51.adoc[Server Migration 4.3 > 5.1]
ko: xref:container-deployment/mlm/migrations/server/server-mlm-43-51.adoc[서버 마이그레이션 4.3 > 5.1]
zh_cn: xref:container-deployment/mlm/migrations/server/server-mlm-43-51.adoc[将服务器 4.3 迁移到 5.1]

source: xref:container-deployment/mlm/migrations/proxy/proxy-mlm-50-51.adoc[Proxy Migration 5.0 > 5.1]
ko: xref:container-deployment/mlm/migrations/proxy/proxy-mlm-50-51.adoc[프록시 마이그레이션 5.0 > 5.1]
zh_cn: xref:container-deployment/mlm/migrations/proxy/proxy-mlm-50-51.adoc[将代理 5.0 迁移到 5.1]

source: xref:container-deployment/mlm/migrations/proxy/proxy-mlm-43-51.adoc[Proxy Migration 4.3 > 5.1]
ko: xref:container-deployment/mlm/migrations/proxy/proxy-mlm-43-51.adoc[프록시 마이그레이션 4.3 > 5.1]
zh_cn: xref:container-deployment/mlm/migrations/proxy/proxy-mlm-43-51.adoc[将代理 4.3 迁移到 5.1]

source: Basic Server and Proxy Management
ja: 基本的なサーバとプロキシの管理
zh_cn: 基本的服务器和代理管理

source: xref:container-management/mgradm-yaml-custom-configuration.adoc[Custom YAML Configuration With mgradm]
ja: xref:container-management/mgradm-yaml-custom-configuration.adoc[mgradmを使用したYAMLのカスタム設定]
zh_cn: xref:container-management/mgradm-yaml-custom-configuration.adoc[使用 mgradm 自定义 YAML 配置]

source: xref:container-management/start-and-stop-containers.adoc[Starting and Stopping Containers]
ja: xref:container-management/start-and-stop-containers.adoc[コンテナの起動と停止]
zh_cn: xref:container-management/start-and-stop-containers.adoc[启动和停止容器]

source: xref:container-management/containers.adoc[Server and Proxy Containers]
ko: xref:container-management/containers.adoc[서버 및 프록시 컨테이너]
zh_cn: xref:container-management/containers.adoc[服务器和代理容器]

source: xref:container-management/persistent-container-volumes.adoc[Persistent Container Volumes]
ja: xref:container-management/persistent-container-volumes.adoc[永続コンテナボリューム]
zh_cn: xref:container-management/persistent-container-volumes.adoc[永久性容器卷]

source: xref:container-management/storage-scripts.adoc[Storage Scripts]
ko: xref:container-management/storage-scripts.adoc[저장소 스크립트]
zh_cn: xref:container-management/storage-scripts.adoc[存储脚本]

source: Upgrade Clients
ko: 클라이언트 업그레이드
zh_cn: 升级客户端

source: Clients use the versioning system of their underlying operating system. For clients using {suse} operating systems, you can perform upgrades within the {productname} {webui}.
cs: Klienty používají verzovací systém svého základního operačního systému. Klienty používající operační systémy {suse} můžete povýšit v rámci {productname} {webui}.
ja: クライアントは、基盤となるオペレーティングシステムのバージョン設定システムを使用します。 {suse}オペレーティングシステムを使用するクライアントの場合、{productname}の{webui}内でアップグレードを実行できます。
ko: 클라이언트는 기본 운영 체제의 버전 관리 시스템을 사용합니다. {suse} 운영 체제를 사용하는 클라이언트의 경우, {productname} {webui} 내에서 업그레이드할 수 있습니다.
zh_cn: 客户端采用底层操作系统的版本控制系统。对于运行 {suse} 操作系统的客户端，可在 {productname} {webui} 中进行升级。

source: For more information about upgrading clients, see xref:client-configuration:client-upgrades.adoc[].
cs: Další informace o upgradu klientů viz xref:client-configuration:client-upgrades.adoc[].
ja: クライアントのアップグレードの詳細については、xref:client-configuration:client-upgrades.adoc[]を参照してください。
ko: 클라이언트 업그레이드에 대한 자세한 정보는 xref:client-configuration:client-upgrades.adoc[]에서 참조하십시오.
zh_cn: 有关升级客户端的详细信息，请参见 xref:client-configuration:client-upgrades.adoc[]。

source: Connect {payg} instance
zh_cn: 连接 {payg} 实例

source: In the three major public cloud providers (AWS, GCP and Azure), SUSE:
ja: 大手パブリッククラウドプロバイダ3社(AWS、GCP、Azure)では、SUSEは、
ko: 3곳의 주요 공용 클라우드 공급자(AWS, GCP 및 Azure)에서, SUSE:
zh_cn: 在三大主流公有云提供商（AWS、GCP 和 Azure）中，SUSE：

source: provides customized {payg} product images for SLES, SLES for SAP, etc.
ja: SLES、SLES for SAPなどのカスタマイズされた{payg}製品イメージを提供します。
ko: SLES, SLES for SAP 등을 위한 맞춤형 {payg} 제품 이미지를 제공합니다.
zh_cn: 提供 SLES、SLES for SAP 等产品的自定义 {payg} 产品映像。

source: operates per-region RMT Servers mirroring repositories for products available as {payg}
ja: {payg}として利用可能な製品のリポジトリをミラーリングするリージョンごとのRMTサーバを運用します
ko: {payg}(으)로 제공되는 제품을 위한 영역별 RMT 서버 미러링 리포지토리를 운영합니다.
zh_cn: 为以 {payg} 形式提供的产品操作按区域 RMT 服务器镜像储存库

source: This document describes how to connect existing {payg} instance to {productname} server, and gives basic information about credentials collection from the instance. The goal of this connection is to extract authentication data so the {productname} Server can connect to a cloud RMT host. Then the {productname} Server has access to products on the RMT host that are not already available with the {scc} organization credentials.
zh_cn: 本文介绍如何将现有 {payg} 实例连接到 {productname} 服务器，并提供了有关从实例收集身份凭证的基本信息。此类连接是为了提取身份验证数据，以使 {productname} 服务器能够连接到云 RMT 主机。之后，{productname} 服务器便可以访问 RMT 主机上尚未提供 {scc} 组织身份凭证的产品。

source: Before using {payg} feature make sure that:
zh_cn: 在使用 {payg} 功能之前，请确保：

source: The {payg} instance is launched from the correct SUSE product image (for example, SLES, SLES for SAP, or SLE HPC) to allow access to the desired repositories
ja: {payg}インスタンスが正しいSUSE製品イメージ(例: SLES、SLES for SAP、SLE HPC)から起動され、目的のリポジトリにアクセスできる
ko: 원하는 리포지토리에 액세스할 수 있도록 올바른 SUSE 제품 이미지(예: SLES, SLES for SAP 또는 SLE HPC)에서 {payg} 인스턴스가 시작됩니다.
zh_cn: {payg} 实例是从正确的 SUSE 产品映像（例如 SLES、SLES for SAP、SLE HPC）启动的，以便能够访问所需储存库

source: {productname} Server has connectivity to the {payg} instance (ideally in the same region) either directly or via a bastion
ja: {productname}サーバが直接または要塞経由で{payg}インスタンス(理想的には同じリージョン内)に接続できる
ko: {productname} 서버는 직접 또는 배스천을 통해 {payg} 인스턴스(이상적으로는 동일한 영역에 위치)에 연결됩니다.
zh_cn: {productname} 服务器可以直接或通过堡垒连接到 {payg} 实例（最好位于同一区域）

source: A basic {scc} account is required. Enter your valid {scc} credentials in menu:Admin[Setup Wizard > Organization Credentials]. This account is required for accessing the {productname} client tools for boostrapping regardless of {payg} instances.
zh_cn: 已配置基本的 {scc} 帐户。请在menu:管理[安装向导 > 组织身份凭证]中输入您的有效 {scc} 身份凭证。无论要引导的是哪个 {payg} 实例，都需要使用此帐户来访问 {productname} 客户端工具。

source: If you bootstrap the {payg} instance to SUSE Manager, SUSE Manager will disable its {payg} repositories then add repositories from where it mirrored the data from the RMT server. The final result will be {payg} instances acquiring the same repositories from the RMT servers but through the SUSE Manager server itself. Of course repositories can still be setup primarily from SCC.
zh_cn: 如果您引导 SUSE Manager 的 {payg} 实例，SUSE Manager 将禁用其 {payg} 储存库，然后从其镜像 RMT 服务器中数据的地方添加储存库。最终结果是，{payg} 实例会获得与通过 RMT 服务器添加这种方式相同的储存库，只不过是通过 SUSE Manager 服务器自身获得的。当然，设置储存库的主要方式仍是通过 SCC。

source: Connecting {payg} instance
zh_cn: 连接 {payg} 实例

source: Procedure: Connecting new {payg} instance
zh_cn: 过程：连接新的 {payg} 实例

source: In the {productname} {webui}, navigate to menu:Admin[Setup Wizard > {payg}], and click btn:[Add {payg}].
ja: {productname}の{webui}で、menu:管理[セットアップウィザード > {payg}]に移動し、btn:[{payg}の追加]をクリックします。
ko: {productname} {webui}에서 menu:관리[설치 마법사 > {payg}]으로 이동하고 btn:[{payg} 추가]를 클릭합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:管理[安装向导 > {payg}]，然后单击 btn:[添加 {payg}]。

source: Start with the page section [guimenu]``{payg} connection Description``.
ja: ページセクション［[guimenu]``{payg}の接続の説明``］から始めます。
ko: 페이지 섹션 [guimenu]``{payg} 연결 설명``으로 시작하십시오.
zh_cn: 从页面的 [guimenu]``{payg} 连接说明``部分开始。

source: In the [guimenu]``Description`` field, add the description.
ja: ［[guimenu]``説明``］フィールドに、説明を追加します。
ko: [guimenu]``설명`` 필드에 설명을 추가합니다.
zh_cn: 在[guimenu]``说明``字段中添加说明。

source: Move to the page section [guimenu]``Instance SSH connection data``.
ja: ページセクション［[guimenu]``インスタンスSSH接続データ``］に移動します。
ko: [guimenu]``인스턴스 SSH 연결 데이터`` 페이지 섹션으로 이동합니다.
zh_cn: 转移到页面的[guimenu]``实例 SSH 连接数据``部分。

source: In the [guimenu]``Host`` field, enter the instance DNS or IP address to connect from {productname}.
ja: ［[guimenu]``ホスト``］フィールドに、{productname}から接続するインスタンスのDNSまたはIPアドレスを入力します。
ko: [guimenu]``호스트`` 필드에 {productname}에서 연결할 인스턴스 DNS 또는 IP 주소를 입력합니다.
zh_cn: 在[guimenu]``主机``字段中，键入要从 {productname} 连接的实例 DNS 或 IP 地址。

source: In the [guimenu]``SSH Port`` field, enter the port number or use default value 22.
ja: ［[guimenu]``SSHポート``］フィールドに、ポート番号を入力するか、デフォルト値22を使用します。
ko: [guimenu]``SSH 포트`` 필드에 포트 번호를 입력하거나 기본값 22를 사용합니다.
zh_cn: 在 [guimenu]``SSH 端口``字段中输入端口号或使用默认值 22。

source: In the [guimenu]``User`` field, enter the username as specified in the cloud.
ja: ［[guimenu]``ユーザ``］フィールドに、クラウドで指定されているユーザ名を入力します。
ko: [guimenu]``사용자`` 필드에 클라우드에 지정된 대로 사용자 이름을 입력합니다.
zh_cn: 在[guimenu]``用户``字段中输入云中指定的用户名。

source: In the [guimenu]``Password`` field, enter the password.
ja: ［[guimenu]``パスワード``］フィールドに、パスワードを入力します。
ko: [guimenu]``암호`` 필드에 암호를 입력합니다.
zh_cn: 在[guimenu]``口令``字段中输入口令。

source: In the [guimenu]``SSH Private Key`` field, enter the instance key.
ja: ［[guimenu]``SSH機密鍵``］フィールドに、インスタンスキーを入力します。
ko: [guimenu]``SSH 개인 키`` 필드에 인스턴스 키를 입력합니다.
zh_cn: 在[guimenu]``SSH 私用密钥``字段中输入实例密钥。

source: In the [guimenu]``SSH Private Key Passphrase`` field, enter the key passphrase.
ja: ［[guimenu]``SSH機密鍵のパスフレーズ``］フィールドに、キーパスフレーズを入力します。
ko: [guimenu]``SSH 개인 키 암호 문구`` 필드에 키 암호 문구를 입력합니다.
zh_cn: 在[guimenu]``SSH 私用密钥通行口令``字段中输入密钥通行口令。

source: Authentication keys must always be in PEM format.
ja: 認証キーは常にPEM形式である必要があります。
ko: 인증 키는 항상 PEM 형식이어야 합니다.
zh_cn: 身份验证密钥必须采用 PEM 格式。

source: If you are not connecting directly to the instance, but via SSH bastion, proceed with <<proc-adding-ssh-bastion-connection-data>>.
ja: インスタンスに直接接続していないが、SSH要塞を介して接続している場合は、<<proc-adding-ssh-bastion-connection-data>>に進みます。
ko: 인스턴스에 직접 연결하지 않고 SSH 배스천을 통해 연결하는 경우 <<proc-adding-ssh-bastion-connection-data>>를 진행합니다.
zh_cn: 如果您要通过 SSH 堡垒连接实例而不是直接连接，请执行<<proc-adding-ssh-bastion-connection-data>>。

source: Otherwise, continue with <<proc-finishing-payg-connecting>>.
ja: それ以外の場合は、<<proc-finishing-payg-connecting>>に進みます。
ko: 그 외의 경우, <<proc-finishing-payg-connecting>>을 진행합니다.
zh_cn: 否则，请执行<<proc-finishing-payg-connecting>>。

source: Procedure: Adding SSH bastion connection data
zh_cn: 过程：添加 SSH 堡垒连接数据

source: Navigate to the page section [guimenu]``Bastion SSH connection data``.
ja: ページセクション［[guimenu]``要塞SSH接続データ``］に移動します。
ko: [guimenu]``SSH 배스천 연결 데이터`` 페이지 섹션으로 이동합니다.
zh_cn: 导航到页面的[guimenu]``堡垒 SSH 连接数据``部分。

source: In the [guimenu]``Host`` field, enter the bastion hostname.
ja: ［[guimenu]``ホスト``］フィールドに、要塞のホスト名を入力します。
ko: [guimenu]``호스트`` 필드에 배스천 호스트 이름을 입력합니다.
zh_cn: 在[guimenu]``主机``字段中输入堡垒主机名。

source: In the [guimenu]``SSH Port`` field, enter the bastion port number.
ja: ［[guimenu]``SSHポート``］フィールドに、要塞のポート番号を入力します。
ko: [guimenu]``SSH 포트`` 필드에 배스천 포트 번호를 입력합니다.
zh_cn: 在[guimenu]``SSH 端口``字段中输入堡垒端口号。

source: In the [guimenu]``User`` field, enter the bastion username.
ja: ［[guimenu]``ユーザ``］フィールドに、要塞のユーザ名を入力します。
ko: [guimenu]``사용자`` 필드에 배스천 사용자 이름을 입력합니다.
zh_cn: 在[guimenu]``用户``字段中输入堡垒用户名。

source: In the [guimenu]``Password`` field, enter the bastion password.
ja: ［[guimenu]``パスワード``］フィールドに、要塞のパスワードを入力します。
ko: [guimenu]``암호`` 필드에 배스천 암호를 입력합니다.
zh_cn: 在[guimenu]``口令``字段中输入堡垒口令。

source: In the [guimenu]``SSH Private Key`` field, enter the bastion key.
ja: ［[guimenu]``SSH機密鍵``］フィールドに、要塞キーを入力します。
ko: [guimenu]``SSH 개인 키`` 필드에 배스천 키를 입력합니다.
zh_cn: 在[guimenu]``SSH 私用密钥``字段中输入堡垒密钥。

source: In the [guimenu]``SSH Private Key Passphrase`` field, enter the bastion key passphrase.
ja: ［[guimenu]``SSH機密鍵のパスフレーズ``］フィールドに、要塞キーのパスフレーズを入力します。
ko: [guimenu]``SSH 개인 키 암호 문구`` 필드에 배스천 키 암호 문구를 입력합니다.
zh_cn: 在[guimenu]``SSH 私用密钥通行口令``字段中输入堡垒密钥通行口令。

source: Complete the setup process with with <<proc-finishing-payg-connecting>>.
ja: <<proc-finishing-payg-connecting>>を使用してセットアッププロセスを完了します。
ko: <<proc-finishing-payg-connecting>> 명령으로 설정 프로세스를 완료하십시오.
zh_cn: 执行<<proc-finishing-payg-connecting>>完成设置过程。

source: Procedure: Finishing {payg} connecting
zh_cn: 过程：完成 {payg} 连接

source: To complete adding new {payg} connection data, click btn:[Create].
ja: 新しい{payg}接続データの追加を完了するには、btn:[作成]をクリックします。
ko: 새로운 {payg} 연결 데이터 추가를 완료하려면 btn:[만들기]를 클릭하십시오.
zh_cn: 要完成添加新 {payg} 连接数据的过程，请单击 btn:[创建]。

source: Return to {payg} connection data [guimenu]``Details`` page.
ja: {payg}接続データの［[guimenu]``詳細``］ページに戻ります。
ko: {payg} 연결 데이터 [guimenu]``세부 정보`` 페이지로 돌아갑니다.
zh_cn: 返回 {payg} 连接数据[guimenu]``细节``页面。

source: The updated connection status is displayed on the top section named [guimenu]``Information``.
ja: 更新された接続ステータスは、［[guimenu]``情報``］という名前の上部セクションに表示されます。
ko: 업데이트된 연결 상태는 [guimenu]``정보`` 상단 섹션에 표시됩니다.
zh_cn: 顶部的[guimenu]``信息``部分会显示更新的连接状态。

source: Connection status is shown in [guimenu]``Admin > Setup Wizard > Pay-as-you-go`` screen too.
ja: 接続ステータスは、［ [guimenu]``管理 > セットアップウィザード > Pay-as-you-go``］画面にも表示されます。
ko: 연결 상태는 [guimenu]``관리자 > 설정 마법사 > Pay-as-you-go`` 화면에도 표시됩니다.
zh_cn: [guimenu]``管理 > 安装向导 > Pay-as-you-go`` 屏幕中也会显示连接状态。

source: If the authentication data for the instance are correct, the column [guimenu]``Status`` shows "Credentials successfully updated."
ja: インスタンスの認証データが正しい場合、［[guimenu]``ステータス``］列に「資格情報が正常に更新されました」と表示されます。
ko: 인스턴스에 대한 인증 데이터가 올바르면, [guimenu]``상태`` 열에 "자격 증명이 업데이트됨" 메시지가 표시됩니다.
zh_cn: 如果实例的身份验证数据正确，[guimenu]``状态``列会显示“已成功更新身份凭证”。

source: If the invalid data are entered at any point, the newly created instance is shown in [guimenu]``Admin > Setup Wizard > {payg}``, with column [guimenu]``Status`` displaying error message.
ja: いずれかの時点で無効なデータが入力されると、新しく作成されたインスタンスが［[guimenu]``管理 > セットアップウィザード > {payg}``］に表示され、［[guimenu]``ステータス``］列にエラーメッセージが表示されます。
ko: 언제든 잘못된 데이터를 입력하면 새로 생성된 인스턴스가 [guimenu]``관리자 > 설정 마법사 > {payg}``에 표시되고 [guimenu]``상태`` 열에 오류 메시지가 표시됩니다.
zh_cn: 如果在任何时间输入了无效数据，[guimenu]``管理 > 安装向导 > {payg}`` 中会显示新创建的实例，同时[guimenu]``状态``列会显示错误消息。

source: As soon as the authentication data is available on the server, the list of available products is updated.
ja: サーバで認証データが利用可能になるとすぐに、利用可能な製品のリストが更新されます。
ko: 서버에서 인증 데이터를 사용할 수 있게 되면 사용 가능한 제품 목록이 업데이트됩니다.
zh_cn: 一旦服务器上有可用的身份验证信息，可用产品列表即会更新。

source: Available products are all versions of the same product family and architecture as the one installed in the {payg} instance. For example, if the instance has the {sles}{nbsp}15 SP1 product installed, {sles}{nbsp}15 SP2, {sles}{nbsp}15 SP3, {sles}{nbsp}15 SP4 and {sles}{nbsp}15 SP5 are automatically shown in [guimenu]``Admin > Setup Wizard > Products``.
zh_cn: 可用产品为其产品系列和体系结构与 {payg} 实例中所安装产品的产品系列和体系结构相同的所有版本。例如，如果实例安装了 {sles}{nbsp}15 SP1 产品，[guimenu]``管理 > 安装向导 > 产品``中会自动显示 {sles}{nbsp}15 SP2、{sles}{nbsp}15 SP3、{sles}{nbsp}15 SP4 和 {sles}{nbsp}15 SP5。

source: Once the products are shown as available, the user can add a product to {productname} by selecting the checkbox next to the product name and clicking btn:[Add product].
ja: 製品が利用可能として表示されたら、ユーザは、製品名の横にあるチェックボックスを選択しbtn:[製品の追加]をクリックして、{productname}に製品を追加できます。
ko: 제품이 사용 가능한 것으로 표시되면 사용자는 제품 이름 옆의 확인란을 선택하고 btn:[제품 추가]를 클릭하여 {productname}에 제품을 추가할 수 있습니다.
zh_cn: 当有产品显示为可用时，用户便可选中该产品名称旁边的复选框并单击 btn:[添加产品]，将产品添加到 {productname} 中。

source: After the success message you can verify the newly added channels in the {webui}, by navigating to [guimenu]``Software > Channel List > All``.
ja: 成功メッセージの後、［[guimenu]``ソフトウェア > チャンネル一覧 > すべて``］に移動して、{webui}で新しく追加されたチャンネルを確認できます。
ko: 성공 메시지가 표시되면 [guimenu]``소프트웨어 > 채널 목록 > 전체``로 이동하여 {webui}에서 새로 추가된 채널을 확인할 수 있습니다.
zh_cn: 成功消息显示后，您可以在 {webui} 中导航到[guimenu]``软件 > 通道列表 > 所有``校验新添加的通道。
