Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: When the {productname} is installed using [command]``mgradm install podman`` or [command]``mgrpxy install podman``, it sets up Podman which enables IPv4 and IPv6 forwarding. This is needed for communication from the outside of the container.
zh_cn: 当使用 [command]``mgradm install podman`` 或 [command]``mgrpxy install podman`` 安装 {productname} 时，系统会设置 Podman，后者会启用 IPv4 和 IPv6 转发。这是容器与外部通信的必要条件。

source: However, if your system previously had [literal]``/proc/sys/net/ipv6/conf/eth0/accept_ra`` set to [literal]``1``, it will stop using router advertisements. As a result, the routes are no longer obtained via router advertisements and the default IPv6 route is missing.
zh_cn: 然而，如果系统此前将 [literal]``/proc/sys/net/ipv6/conf/eth0/accept_ra`` 设置为 [literal]``1``，则会停止使用路由器通告 (RA)。这将导致路由无法再通过 RA 获取，且默认 IPv6 路由将会缺失。

source: Create a file in [path]``/etc/sysctl.d``, for example [literal]``99-ipv6-ras.conf``.
zh_cn: 在 [path]``/etc/sysctl.d`` 中创建文件，例如 [literal]``99-ipv6-ras.conf``。

source: Add the following parameter and value to the file:
ko: 다음 파라미터와 값을 파일에 추가:
zh_cn: 向文件中添加以下参数和值：

source: Deployment behind HTTP or HTTPS OSI level 7 proxy
zh_cn: 在 HTTP 或 HTTPS OSI 七层代理后部署

source: Some environments enforce internet access through a HTTP or HTTPS proxy. This could be a Squid server or similar. To allow the {productname} Server internet access in such configuration, you need to configure the following.
zh_cn: 有些环境强制要求通过 HTTP 或 HTTPS 代理（如 Squid 服务器或类似服务器）访问互联网。要在此类配置下允许 {productname} 服务器访问互联网，需进行以下配置。

source: Procedure: Configuring HTTP or HTTPS OSI level 7 proxy
zh_cn: 过程：配置 HTTP 或 HTTPS OSI 七层代理

source: For operating system internet access, modify [path]``/etc/sysconfig/proxy`` according to your needs:
zh_cn: 要进行操作系统互联网访问配置，请根据需求修改 [path]``/etc/sysconfig/proxy``：

source: For ``Podman`` container internet access, modify [path]``/etc/systemd/system/uyuni-server.service.d/custom.conf`` according to your needs. For example, set:
zh_cn: 要进行 podman 容器互联网访问配置，请根据需求修改 [path]``/etc/systemd/system/uyuni-server.service.d/custom.conf``。例如，设置以下内容：

source: For Java application internet access, modify [path]``/etc/rhn/rhn.conf`` according to your needs. On the container host, execute [literal]``mgrctl term`` to open a command line inside the server container:
zh_cn: 要进行 Java 应用程序互联网访问配置，请根据需求修改 [path]``/etc/rhn/rhn.conf``。在容器主机上，执行 [literal]``mgrctl term`` 以打开服务器容器内的命令行：

source: Modify [path]``/etc/rhn/rhn.conf`` according to your needs. For example, set:
zh_cn: 修改 [path]``/etc/rhn/rhn.conf``。例如，设置以下内容：

source: # Use proxy FQDN, or FQDN:port server.satellite.http_proxy = server.satellite.http_proxy_username = server.satellite.http_proxy_password = # no_proxy is a comma seperated list server.satellite.no_proxy =
zh_cn: # 使用代理 FQDN 或 FQDN:端口 server.satellite.http_proxy = server.satellite.http_proxy_username = server.satellite.http_proxy_password = # no_proxy 为逗号分隔的列表 server.satellite.no_proxy =

source: On the container host, restart the server to enforce the new configuration:
zh_cn: 在容器主机上，重启服务器以强制应用新配置：

source: Air-gapped Deployment
ja: Air-gapped配備
ko: air-gapped 배포
zh_cn: 隔离的部署

source: If you are on an internal network and do not have access to {scclongform}, you can use an xref:installation-and-upgrade:container-deployment/mlm/server-air-gapped-deployment-mlm.adoc[Air-gapped Deployment].
ko: 내부 네트워크에 위치하고 {scclongform}에 액세스할 수 없는 경우, xref:installation-and-upgrade:container-deployment/mlm/server-air-gapped-deployment-mlm.adoc[air-gapped 배포]를 사용할 수 있습니다.
zh_cn: 如果您在内部网络中操作，无法访问 {scclongform}，可以使用 xref:installation-and-upgrade:container-deployment/mlm/server-air-gapped-deployment-mlm.adoc[隔离的部署]。

source: In a production environment, the {productname} Server and clients should always use a firewall. For a comprehensive list of the required ports, see xref:installation-and-upgrade:network-requirements.adoc#ports[].
ja: 運用環境では、{productname}サーバおよびクライアントはファイアウォールを常に使用する必要があります。必要なポートの一覧は、xref:installation-and-upgrade:network-requirements.adoc#ports[]を参照してください。
zh_cn: 在生产环境中，{productname} 服务器和客户端始终应使用防火墙。有关所需端口的完整列表，请参见 xref:installation-and-upgrade:network-requirements.adoc#ports[]。

source: Required Network Ports
ja: 必須のネットワークポート
ko: 필수 네트워크 포트
zh_cn: 所需的网络端口

source: This section contains a comprehensive list of ports that are used for various communications within {productname}.
cs: Tato část obsahuje úplný seznam portů, které se používají pro různé komunikace v rámci produktu {productname}.
ja: このセクションには、{productname}内でのさまざまな通信に使用するポートの一覧が記載されています。
ko: 이 섹션에서는 {productname}에서의 다양한 통신을 위해 사용되는 전체 포트 목록이 제공됩니다.
zh_cn: 本节提供了 {productname} 中各种通信使用的端口的综合列表。

source: You will not need to open all of these ports. Some ports only need to be opened if you are using the service that requires them.
cs: Nebudete muset otevírat všechny tyto porty. Některé porty je třeba otevřít, pouze pokud používáte službu, která je vyžaduje.
ja: これらのポートすべてを開く必要はありません。サービスの使用に必要なポートのみを開く必要があります。
ko: 이러한 모든 포트를 열 필요는 없습니다. 사용 중인 서비스에 필요한 포트만 열면 됩니다.
zh_cn: 您不需要打开所有这些端口。某些端口只有在您使用需要这些端口的服务时才需打开。

source: External Inbound Server Ports
cs: Externí příchozí porty serveru
ja: 外部の着信サーバポート
ko: 외부 인바운드 서버 포트
zh_cn: 外部入站服务器端口

source: External inbound ports must be opened to configure a firewall on the {productname} Server to protect the server from unauthorized access.
cs: Aby bylo možné nakonfigurovat bránu firewall na serveru {productname}, je třeba otevřít externí příchozí porty, aby byl server chráněn před neoprávněným přístupem.
ja: 未許可アクセスからサーバを保護するために{productname}サーバでファイアウォールを設定するには、外部の着信ポートが開いている必要があります。
ko: 무단 액세스로부터 서버를 보호하려면 {productname} 서버에서 외부 인바운드 포트를 열어 방화벽을 구성해야 합니다.
zh_cn: 必须打开外部入站端口，以在 {productname} 服务器上配置防火墙用于防范未经授权访问服务器。

source: Opening these ports allows external network traffic to access the {productname} Server.
cs: Otevření těchto portů umožňuje externímu síťovému provozu přístup na server {productname}.
ja: これらのポートを開くと、外部ネットワークトラフィックが{productname}サーバにアクセスできるようになります。
ko: 이러한 포트를 열면 외부 네트워크 트래픽이 {productname} 서버에 액세스할 수 있습니다.
zh_cn: 打开这些端口将允许外部网络流量访问 {productname} 服务器。

source: External Port Requirements for {productname} Server
cs: Požadavky na externí porty pro server {productname}
ja: {productname}サーバの外部ポートの要件
ko: {productname} 서버의 외부 포트 요구사항
zh_cn: {productname} Server 的外部端口要求

source: | Port number | Protocol | Used By | Notes | 67 | TCP/UDP | DHCP | Required only if clients are requesting IP addresses from the server. | 69 | TCP/UDP | TFTP | Required if server is used as a PXE server for automated client installation. | 80 | TCP | HTTP | Required temporarily for some bootstrap repositories and automated installations. | 443 | TCP | HTTPS | Serves the {webui}, client, and server and proxy (``tftpsync``) requests. | 4505 | TCP | salt | Required to accept communication requests from clients. The client initiates the connection, and it stays open to receive commands from the Salt master. | 4506 | TCP | salt | Required to accept communication requests from clients. The client initiates the connection, and it stays open to report results back to the Salt master. | 5432 | TCP | PostgreSQL | Required to access the reporting database. | 5556 | TCP | Prometheus | Required for scraping Taskomatic JMX metrics. | 5557 | TCP | Prometheus | Required for scraping Tomcat JMX metrics. | 9100 | TCP | Prometheus | Required for scraping Node exporter metrics. | 9187 | TCP | Prometheus | Required for scraping PostgreSQL metrics. | 9800 | TCP | Prometheus | Required for scraping Taskomatic metrics. | 25151 | TCP | Cobbler |
ko: | 포트 번호 | 프로토콜 | 사용 대상 | 참고 | 67 | TCP/UDP | DHCP | 클라이언트가 서버의 IP 주소를 요청할 때만 필요합니다. | 69 | TCP/UDP | TFTP | 자동 클라이언트 설치를 위해 서버가 PXE로 사용될 때 필요합니다. | 80 | TCP | HTTP | 일부 부트스트랩 리포지토리 및 자동 설치에서 일시적으로 필요합니다. | 443 | TCP | HTTPS | {webui}, 클라이언트, 서버 및 프록시(``tftpsync``) 요청입니다. | 4505 | TCP | salt | 클라이언트로부터의 통신 요청을 수락하기 위해 필요합니다. 클라이언트가 연결을 시작하며, Salt 마스터로부터 명령을 수신하기 위해 열려 있는 상태를 유지합니다. | 4506 | TCP | salt | 클라이언트로부터의 통신 요청을 수락하기 위해 필요합니다. 클라이언트가 연결을 시작하며, Salt 마스터로 결과를 다시 보고하기 위해 열려 있는 상태를 유지합니다. | 5432 | TCP | PostgreSQL | 보고 데이터베이스에 액세스하는 데 필요합니다. | 5556 | TCP | Prometheus | Taskomatic JMX 메트릭 스크래핑에 필요합니다. | 5557 | TCP | Prometheus | Tomcat JMX 메트릭 스크래핑에 필요합니다. | 9100 | TCP | Prometheus | 노드 익스포터 메트릭 스크래핑에 필요합니다. |9187 | TCP | Prometheus | PostgreSQL 메트릭 스크래핑에 필요합니다. | 9800 | TCP | Prometheus | Taskomatic 메트릭 스크래핑에 필요합니다. | 25151 | TCP | Cobbler |
zh_cn: | 端口号 | 协议 | 使用方 | 备注 | 67 | TCP/UDP | DHCP | 仅当客户端向服务器请求 IP 地址时才需要此端口。 | 69 | TCP/UDP | TFTP | 将服务器用作 PXE 服务器进行自动化客户端安装时需要此端口。 | 80 | TCP | HTTP | 某些引导储存库以及进行自动化安装时需要临时使用此端口。 | 443 | TCP | HTTPS | 处理 {webui}、客户端、服务器和代理 (``tftpsync``) 请求。 | 4505 | TCP | salt | 接受来自客户端的通信请求时需要此端口。 客户端会发起连接，且该连接将保持开启状态以接收 Salt 主控端发出的命令。 | 4506 | TCP | salt | 接受来自客户端的通信请求时需要此端口。 客户端会发起连接，且该连接将保持开启状态以向 Salt 主控端报告结果。 | 5432 | TCP | PostgreSQL | 访问报告数据库时需要此端口。 | 5556 | TCP | Prometheus | 抓取 Taskomatic JMX 指标时需要此端口。 | 5557 | TCP | Prometheus | 抓取 Tomcat JMX 指标时需要此端口。 | 9100 | TCP | Prometheus | 抓取 节点导出器指标时需要此端口。 | 9187 | TCP | Prometheus | 抓取 PostgreSQL 指标时需要此端口。 | 9800 | TCP | Prometheus | 抓取 Taskomatic 指标时需要此端口。 | 25151 | TCP | Cobbler |

source: External Outbound Server Ports
cs: Externí odchozí porty serveru
ja: 外部の送信サーバポート
ko: 외부 아웃바운드 서버 포트
zh_cn: 外部出站服务器端口

source: External outbound ports must be opened to configure a firewall on the {productname} Server to restrict what the server can access.
cs: Aby bylo možné nakonfigurovat bránu firewall na serveru {productname}, je třeba otevřít externí odchozí porty, aby byl omezen přístup serveru.
ja: サーバからアクセスできるアクセス先を制限するために{productname}サーバでファイアウォールを設定するには、外部の送信ポートが開いている必要があります。
ko: 액세스할 수 있는 서버를 제한하려면 {productname} 서버에서 외부 아웃바운드 포트를 열어 방화벽을 구성해야 합니다.
zh_cn: 必须打开外部出站端口，以在 {productname} 服务器上配置防火墙用于限制服务器可访问的内容。

source: Opening these ports allows network traffic from the {productname} Server to communicate with external services.
cs: Otevření těchto portů umožňuje síťovému provozu ze serveru {productname} komunikovat s externími službami.
ja: 次のポートを開くと、{productname}サーバからのネットワークトラフィックで外部サービスに通信できます。
ko: 이러한 포트를 열면 {productname} 서버로부터의 네트워크 트래픽이 외부 서비스와 통신할 수 있습니다.
zh_cn: 打开这些端口将允许来自 {productname} 服务器的网络流量与外部服务通信。

source: | Port number | Protocol | Used By | Notes | 80 | TCP | HTTP | Required for {scclongform}. Port 80 is not used to serve the {webui}. | 443 | TCP | HTTPS | Required for {scclongform}. | 25151 | TCP | Cobbler |
ja: | ポート番号 | プロトコル | 使用元 | 注意 |80 | TCP | HTTP | {scclongform}で必要です。 ポート80は{webui}を操作するためには使用されません。 | 443 | TCP | HTTPS | {scclongform}で必要です。 | 25151 | TCP | Cobbler |
zh_cn: | 端口号 | 协议 | 使用方 | 备注 | 80 | TCP | HTTP | {scclongform} 需要此端口。 端口 80 不用于为 {webui} 传递数据。 | 443 | TCP | HTTPS | {scclongform} 需要此端口。 | 25151 | TCP | Cobbler |

source: Internal Server Ports
cs: Interní porty serveru
ja: 内部サーバポート
ko: 내부 서버 포트
zh_cn: 内部服务器端口

source: Internal ports are used internally by the {productname} Server. Internal ports are only accessible from [literal]``localhost``.
ja: 内部ポートは、{productname}サーバによって内部で使用されます。 内部ポートは[literal]``localhost``のみからアクセスできます。
ko: 내부 포트는 {productname} 서버에 의해 내부적으로 사용됩니다. 내부 포트는 [literal]``localhost``에서만 액세스할 수 있습니다.
zh_cn: 内部端口由 {productname} 服务器在内部使用。只能从 [literal]``localhost`` 访问内部端口。

source: In most cases, you will not need to adjust these ports.
cs: Ve většině případů nebudete muset tyto porty nastavovat.
ja: ほとんどの場合、これらのポートを調整する必要はありません。
ko: 대부분의 경우에는 이러한 포트를 조정할 필요가 없습니다.
zh_cn: 大多数情况下无需调整这些端口。

source: Internal Port Requirements for {productname} Server
cs: Požadavky na interní porty serveru {productname}
ja: {productname}サーバの内部ポートの要件
ko: {productname} 서버의 내부 포트 요구사항
zh_cn: {productname} Server 的内部端口要求

source: | Port number | Notes | 2828 | Satellite-search API, used by the RHN application in Tomcat and Taskomatic. | 2829 | Taskomatic API, used by the RHN application in Tomcat. | 8005 | Tomcat shutdown port. | 8009 | Tomcat to Apache HTTPD (AJP). | 8080 | Tomcat to Apache HTTPD (HTTP). | 9080 | Salt-API, used by the RHN application in Tomcat and Taskomatic. | 25151 | Cobbler's XMLRPC API | 32000 | Port for a TCP connection to the Java Virtual Machine (JVM) that runs Taskomatic and satellite-search.
ja: | ポート番号 | 注意 |2828 | サテライト検索APIであり、TomcatとTaskomaticのRHNアプリケーションで使用されます。 | 2829 | Taskomatic APIであり、TomcatのRHNアプリケーションで使用されます。 | 8005 | Tomcatのシャットダウンポート。 | 8009 | TomcatからApache HTTPD (AJP)。 | 8080 | TomcatからApache HTTPD (HTTP)。 | 9080 | Salt-APIであり、TomcatとTaskomaticのRHNアプリケーションで使用されます。 | 25151 | CobblerのXMLRPC API | 32000 | Taskomaticおよびサテライト検索を実行する仮想マシン(JVM)へのTCP接続用のポート。
ko: | 포트 번호 | 참고 | 2828 | Satellite-search API, Tomcat 및 Taskomatic의 RHN 애플리케이션에서 사용됩니다. | 2829 | Taskomatic API, Tomcat의 RHN 애플리케이션에서 사용됩니다. | 8005 | Tomcat 종료 포트입니다. | 8009 | Tomcat-Apache HTTPD(AJP)입니다. | 8080 | Tomcat-Apache HTTPD(HTTP)입니다. | 9080 | Salt-API, Tomcat 및 Taskomatic의 RHN 애플리케이션에서 사용됩니다. | 25151 | Cobbler의 XMLRPC API | 32000 | Taskomatic 및 satellite-search에서 실행되는 Java 가상 머신(JVM)으로의 TCP 연결을 위한 포트입니다.
zh_cn: | 端口号 | 备注 | 2828 | Satellite-search API，由 Tomcat 和 Taskomatic 中的 RHN 应用程序使用。 | 2829 | Taskomatic API，由 Tomcat 中的 RHN 应用程序使用。 | 8005 | Tomcat 关机端口。 | 8009 | Tomcat 到 Apache HTTPD (AJP)。 | 8080 | Tomcat 到 Apache HTTPD (HTTP)。 | 9080 | Salt-API，由 Tomcat 和 Taskomatic 中的 RHN 应用程序使用。 | 25151 | Cobbler 的 XMLRPC API | 32000 | 与运行 Taskomatic 和 satellite-search 的 Java 虚拟机 (JVM) 建立 TCP 连接时使用此端口。

source: Port 32768 and higher are used as ephemeral ports. These are most often used to receive TCP connections. When a TCP connection request is received, the sender will choose one of these ephemeral port numbers to match the destination port.
ja: ポート32768以上は一時ポートとして使用されます。これらは、TCP接続の受信に最も頻繁に使用されます。TCP接続リクエストが受信されると、送信元はこれらの一時ポート番号のいずれかを選択して、宛先ポートと照合します。
ko: 32768 이상 포트는 사용 후 삭제 포트로 사용됩니다. 이러한 포트는 대부분 TCP 연결을 수신하기 위해 사용됩니다. TCP 연결 요청이 수신되면, 발신자가 이러한 사용 후 삭제 포트 번호 중 하나를 선택하여 대상 포트로 사용합니다.
zh_cn: 32768 和更高的端口用作临时端口。这些端口往往用于接收 TCP 连接。收到 TCP 连接请求后，发送方将选择其中一个临时端口号来与目标端口进行匹配。

source: You can use this command to find out which ports are ephemeral ports:
ja: 次のコマンドを使用して、一時ポートであるポートを確認できます。
ko: 다음 명령을 사용하여 임시 포트인 포트를 찾을 수 있습니다.
zh_cn: 可使用以下命令来确定哪些端口是临时端口：

source: External Inbound Proxy Ports
cs: Externí příchozí porty proxy
ja: 外部の着信プロキシポート
ko: 외부 인바운드 프록시 포트
zh_cn: 外部入站代理端口

source: External inbound ports must be opened to configure a firewall on the {productname} Proxy to protect the proxy from unauthorized access.
cs: Aby bylo možné proxy chránit před neoprávněným přístupem, je třeba otevřít externí příchozí porty, aby bylo možné konfigurovat bránu firewall na serveru {productname}.
ja: 未許可アクセスからプロキシを保護するために{productname}プロキシでファイアウォールを設定するには、外部の着信ポートが開いている必要があります。
ko: 무단 액세스로부터 프록시를 보호하려면 {productname} 프록시에서 외부 인바운드 포트를 열어 방화벽을 구성해야 합니다.
zh_cn: 必须打开外部入站端口，以在 {productname} Proxy 上配置防火墙用于防范未经授权访问代理。

source: Opening these ports allows external network traffic to access the {productname} proxy.
cs: Otevření těchto portů umožňuje externímu síťovému provozu přístup k proxy serveru {productname}.
ja: これらのポートを開くと、外部ネットワークトラフィックが{productname}プロキシにアクセスできるようになります。
ko: 이러한 포트를 열면 외부 네트워크 트래픽이 {productname} 프록시에 액세스할 수 있습니다.
zh_cn: 打开这些端口将允许外部网络流量访问 {productname} Proxy。

source: External Port Requirements for {productname} Proxy
cs: Požadavky na externí porty pro server {productname} Proxy
ja: {productname}プロキシの外部ポートの要件
ko: {productname} 프록시의 외부 포트 요구사항
zh_cn: {productname} Proxy 的外部端口要求

source: | Port number | Protocol | Used By | Notes | 22 | | | Only required if the user wants to manage the proxy host with {salt} SSH. | 67 | TCP/UDP | DHCP | Required only if clients are requesting IP addresses from the server. | 69 | TCP/UDP | TFTP | Required if the server is used as a PXE server for automated client installation. | 443 | TCP | HTTPS | {webui}, client, and server and proxy (``tftpsync``) requests. | 4505 | TCP | salt | Required to accept communication requests from clients. The client initiates the connection, and it stays open to receive commands from the Salt master. | 4506 | TCP | salt | Required to accept communication requests from clients. The client initiates the connection, and it stays open to report results back to the Salt master. | 8022 | | | Required for ssh-push and ssh-push-tunnel contact methods. Clients connected to the proxy initiate check in on the server and hop through to clients.
ko: | 포트 번호 | 프로토콜 | 사용 대상 | 참고 | 22 | | | 사용자가 {salt} SSH로 프록시 호스트를 관리하려는 경우에만 필요합니다. | 67 | TCP/UDP | DHCP | 클라이언트가 서버의 IP 주소를 요청할 때만 필요합니다. | 69 | TCP/UDP | TFTP | 자동 클라이언트 설치를 위해 서버가 PXE로 사용될 때 필요합니다. | 443 | TCP | HTTPS | {webui}, 클라이언트, 서버 및 프록시(``tftpsync``) 요청입니다. | 4505 | TCP | salt | 클라이언트로부터의 통신 요청을 수락하기 위해 필요합니다. 클라이언트가 연결을 시작하며, Salt 마스터로부터 명령을 수신하기 위해 열려 있는 상태를 유지합니다. | 4506 | TCP | salt | 클라이언트로부터의 통신 요청을 수락하기 위해 필요합니다. 클라이언트가 연결을 시작하며, Salt 마스터로 결과를 다시 보고하기 위해 열려 있는 상태를 유지합니다. | 8022 | | | ssh-push 및 ssh-push-tunnel 연락 방법에 필수적입니다. 프록시에 연결된 클라이언트는 서버에 체크인을 시작하고 클라이언트로 홉을 통해 이동합니다.
zh_cn: | 端口号 | 协议 | 使用方 | 备注 | 22 | | | 仅当用户需要通过 {salt} SSH 管理代理主机时才需要此端口。 | 67 | TCP/UDP | DHCP | 仅当客户端向服务器请求 IP 地址时才需要此端口。 | 69 | TCP/UDP | TFTP | 将服务器用作 PXE 服务器进行自动化客户端安装时需要此端口。 | 443 | TCP | HTTPS | {webui}、客户端、服务器和代理 (``tftpsync``) 请求。 | 4505 | TCP | salt | 接受来自客户端的通信请求时需要此端口。 客户端会发起连接，且该连接将保持开启状态以接收 Salt 主控端发出的命令。 | 4506 | TCP | salt | 接受来自客户端的通信请求时需要此端口。 客户端会发起连接，且该连接将保持开启状态以向 Salt 主控端报告结果。 | 8022 | | | 使用 ssh-push 和 ssh-push-tunnel 联系方法时需要此端口。连接至代理的客户端会主动向服务器发起签入请求，并通过该端口跳转至目标客户端。

source: External Outbound Proxy Ports
cs: Externí odchozí porty proxy
ja: 外部の送信プロキシポート
ko: 외부 아웃바운드 프록시 포트
zh_cn: 外部出站代理端口

source: External outbound ports must be opened to configure a firewall on the {productname} Proxy to restrict what the proxy can access.
cs: Externí odchozí porty je nutno otevřít, aby bylo možno konfigurovat bránu firewall na proxy {productname}, aby bylo možno omezit, kam má proxy přístup.
ja: プロキシからアクセスできるアクセス先を制限するために{productname}プロキシでファイアウォールを設定するには、外部の送信ポートが開いている必要があります。
ko: 액세스할 수 있는 프록시를 제한하려면 {productname} 프록시에서 외부 아웃바운드 포트를 열어 방화벽을 구성해야 합니다.
zh_cn: 必须打开外部出站端口，以在 {productname} Proxy 上配置防火墙用于限制代理可访问的内容。

source: Opening these ports allows network traffic from the {productname} Proxy to communicate with external services.
cs: Otevření těchto portů umožňuje síťovou komunikaci z produktu {productname} Proxy s externími službami.
ja: 次のポートを開くと、{productname}プロキシからのネットワークトラフィックで外部サービスに通信できます。
ko: 이러한 포트를 열면 {productname} 프록시로부터의 네트워크 트래픽이 외부 서비스와 통신할 수 있습니다.
zh_cn: 打开这些端口将允许来自 {productname} Proxy 的网络流量与外部服务通信。

source: | Port number | Protocol | Used By | Notes | 80 | | | Used to reach the server. | 443 | TCP | HTTPS | Required for {scclongform}. | 4505 | TCP | Salt | Required to connect to Salt master either directly or via proxy. | 4506 | TCP | Salt | Required to connect to Salt master either directly or via proxy.
zh_cn: | 端口号 | 协议 | 使用方 | 备注 | 80 | | | 用于访问服务器。 | 443 | TCP | HTTPS | {scclongform} 需要此端口。 | 4505 | TCP | Salt | 直接或通过代理连接到 Salt 主控端时需要此端口。 | 4506 | TCP | Salt | 直接或通过代理连接到 Salt 主控端时需要此端口。

source: External Client Ports
cs: Externí porty klientů
ja: 外部クライアントポート
ko: 외부 클라이언트 포트
zh_cn: 外部客户端端口

source: External client ports must be opened to configure a firewall between the {productname} Server and its clients.
cs: Pro konfiguraci brány firewall mezi serverem {productname} a jeho klienty je nutné otevřít externí porty klienta.
ja: {productname}サーバとそのクライアントの間でファイアウォールを設定するには、外部クライアントポートが開いている必要があります。
ko: {productname} 서버와 클라이언트 사이에서 방화벽을 구성하려면 외부 클라이언트 포트가 열려 있어야 합니다.
zh_cn: 必须打开外部客户端端口，以在 {productname} 服务器及其客户端之间配置防火墙。

source: External Port Requirements for {productname} Clients
cs: Požadavky na externí porty pro klienty {productname}
ja: {productname}クライアントの外部ポートの要件
ko: {productname} 클라이언트의 외부 포트 요구사항
zh_cn: {productname} 客户端的外部端口要求

source: | Port number | Direction | Protocol | Notes | 22 | Inbound | SSH | Required for ssh-push and ssh-push-tunnel contact methods. | 80 | Outbound | | Used to reach the server or proxy. | 443 | Outbound | | Used to reach the server or proxy. | 4505 | Outbound | TCP | Required to connect to Salt master either directly or via proxy. | 4506 | Outbound | TCP | Required to connect to Salt master either directly or via proxy. | 9090 | Outbound | TCP | Required for Prometheus user interface. | 9093 | Outbound | TCP | Required for Prometheus alert manager. | 9100 | Outbound | TCP | Required for Prometheus node exporter. | 9117 | Outbound | TCP | Required for Prometheus Apache exporter. | 9187 | Outbound | TCP | Required for Prometheus PostgreSQL.
zh_cn: | 端口号 | 方向 | 协议 | 备注 | 22 | 入站 | SSH | 使用 ssh-push 和 ssh-push-tunnel 联系方法时需要此端口。 | 80 | 出站 | | 用于访问服务器或代理。 | 443 | 出站 | | 用于访问服务器或代理。 | 4505 | 出站 | TCP | 直接或通过代理连接到 Salt 主控端时需要此端口。 | 4506 | 出站 | TCP | 直接或通过代理连接到 Salt 主控端时需要此端口。 | 9090 | 出站 | TCP | Prometheus 用户界面需要此端口。 | 9093 | 出站 | TCP | Prometheus 警报管理器需要此端口。 | 9100 | 出站 | TCP | Prometheus 节点导出器需要此端口。 | 9117 | 出站 | TCP | Prometheus Apache 导出器需要此端口。 | 9187 | 出站 | TCP | Prometheus PostgreSQL 需要此端口。

source: Required URLs
cs: Požadované adresy URL
ja: 必要なURL
ko: 필수 URL
zh_cn: 所需的 URL

source: There are some URLs that {productname} must be able to access to register clients and perform updates. In most cases, allowing access to these URLs is sufficient:
cs: Existuje několik adres URL, ke kterým musí mít {productname} přístup, aby mohl registrovat klienty a provádět aktualizace. Ve většině případů stačí povolit přístup k těmto adresám URL:
ja: クライアントを登録して更新を実行するために{productname}がアクセスできる必要があるURLがあります。ほとんどの場合、次のURLにアクセスできれば十分です。
ko: {productname}에서 클라이언트를 등록하고 업데이트를 수행하기 위해 액세스할 수 있어야 하는 URL이 몇 개 있습니다. 대부분의 경우에는 해당 URL에 대한 액세스를 허용하는 것으로 충분합니다.
zh_cn: {productname} 必须能够访问某些 URL 才能注册客户端和执行更新。大多数情况下，允许访问以下 URL 便已足够：

source: Additionally, you may need access to these URLs for non-SUSE products:
ko: 또한 SUSE 제품이 아닌 제품의 경우 다음 URL에 액세스해야 할 수도 있습니다.
zh_cn: 此外，您可能需要访问以下非 SUSE 产品的 URL：

source: You can find additional details on whitelisting the specified URLs and their associated IP addresses in this article: https://www.suse.com/support/kb/doc/?id=000021034[Accessing {scclongform} and SUSE registry behind a firewall and/or through a proxy].
ja: 指定したURLとそれに関連するIPアドレスをホワイトリストに登録する方法の詳細については、次の記事を参照してください: https://www.suse.com/support/kb/doc/?id=000021034[ファイアウォール内および/またはプロキシ経由で{scclongform}とSUSEレジストリにアクセスする]。
zh_cn: 您可以在以下文章中找到有关将指定 URL 及其关联 IP 地址列入白名单的更多详细信息：link:https://www.suse.com/support/kb/doc/?id=000021034[访问受防火墙和/或代理保护的 {scclongform} 和 SUSE 仓库]。

source: If you are using non-{suse} clients you might also need to allow access to other servers that provide specific packages for those operating systems. For example, if you have {ubuntu} clients, you will need to be able to access the {ubuntu} server.
cs: Pokud používáte jiné než {suse} klienty, možná budete muset povolit přístup k dalším serverům, které poskytují specifické balíčky pro tyto operační systémy. Máte-li například klienty {ubuntu}, budete muset mít přístup na server {ubuntu}.
ja: {suse}以外のクライアントを使用している場合、該当するオペレーティングシステム用の特定のパッケージを提供するその他のサーバにもアクセスできる必要がある場合があります。たとえば、{ubuntu}クライアントがある場合、{ubuntu}サーバにアクセスできる必要があります。
ko: {suse} 이외의 클라이언트를 사용하는 경우에는 해당 운영 체제용 특정 패키지를 제공하는 다른 서버에 대한 액세스도 허용해야 할 수 있습니다. 예를 들어, {ubuntu} 클라이언트가 있는 경우 {ubuntu} 서버에 액세스할 수 있어야 합니다.
zh_cn: 如果您正在使用非 {suse} 客户端，则还可能需要允许访问为这些操作系统提供特定软件包的其他服务器。例如，如果您使用的是 {ubuntu} 客户端，则需要能够访问 {ubuntu} 服务器。

source: For more information about troubleshooting firewall access for non-{suse} clients, see xref:administration:troubleshooting/tshoot-firewalls.adoc[].
ja: {suse}以外のクライアントでファイアウォールアクセスのトラブルシューティングを行う方法の詳細については、xref:administration:troubleshooting/tshoot-firewalls.adoc[]を参照してください。
ko: {suse} 이외의 클라이언트에 대한 방화벽 액세스 문제 해결과 관련한 자세한 내용은 xref:administration:troubleshooting/tshoot-firewalls.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关为非 {suse} 客户端排查防火墙访问权限问题的详细信息，请参见 xref:administration:troubleshooting/tshoot-firewalls.adoc[]。

source: Public Cloud Requirements
cs: Požadavky na veřejný cloud
ja: パブリッククラウドの要件
ko: 공용 클라우드 요구사항
zh_cn: 公有云要求
