Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: For [literal]``Registry URL`` use: [literal]``registry.suse.com/suse/multi-linux-manager/5.1/x86_64``.
ko: [literal]``Registry URL``의 경우 [literal]``registry.suse.com/suse/multi-linux-manager/5.1/x86_64``를 선택합니다.
zh_cn: 在[literal]``仓库 URL`` 中填写 [literal]``registry.suse.com/suse/multi-linux-manager/5.1/x86_64``。

source: Select the tag from the drop-down list.
ko: 드롭다운 목록에서 태그를 선택합니다.
zh_cn: 从下拉列表中选择标记。

source: If [literal]``Advanced`` is selected, an additional section of the form is shown:
ko: [literal]``Advanced``를 선택하면 양식에 추가 섹션이 표시됩니다.
zh_cn: 如果选择[literal]``高级``，表单会显示一个额外的部分：

source: For each individual container URL field, use the registry: [literal]``registry.suse.com/suse/multi-linux-manager/5.1/x86_64`` followed by the corresponding suffix, for example, `_proxy-httpd_` or `_salt-broker_`.
ko: 각 개별 컨테이너 URL 필드에 레지스트리 [literal]``registry.suse.com/suse/multi-linux-manager/5.1/x86_64`` 뒤에 해당 접미사(예: ``_proxy-httpd_`` 또는 ``_salt-broker_``)를 사용합니다.
zh_cn: 对于每个独立容器的 URL 字段，均需填写仓库地址 [literal]``registry.suse.com/suse/multi-linux-manager/5.1/x86_64``，并添加对应的后缀（例如 `_proxy-httpd_` 或 `_salt-broker_`）。

source: Once all fields are filled, click btn:[Apply] to apply the configuration and schedule the proxy installation task.
ko: 모든 필드에 입력한 후에는 btn:[적용]을 클릭하여 구성을 적용하고 프록시 설치 작업을 예약합니다.
zh_cn: 填写完所有字段后，单击 btn:[应用] 按钮保存配置并调度代理安装任务。

source: Verify Proxy Activation
ko: 프록시 활성화 확인
zh_cn: 校验代理激活状态

source: Check the client’s event history to confirm task success.
ko: 클라이언트의 이벤트 기록을 확인하여 작업의 성공 여부를 확인합니다.
zh_cn: 查看客户端的事件历史记录，确认任务执行成功。

source: (Optional) Access the proxy’s HTTP endpoint to validate it shows a welcome page.
ko: (선택 사항) 프록시의 HTTP 엔드포인트에 액세스하여 환영 페이지가 표시되는지 확인합니다.
zh_cn: （可选）访问代理的 HTTP 端点，验证其是否显示欢迎页面。

source: {productname} {productnumber} Proxy Deployment
ja: {productname} {productnumber}プロキシの配備
zh_cn: {productname} {productnumber} 代理部署

source: This guide outlines the deployment process for the {productname} {productnumber} Proxy container on {sl-micro} {microversion} or {sles} {bci-mlm}. This guide presumes you have already successfully deployed a {productname} {productnumber} Server.
ko: 이 안내서에서는 {sl-micro} {microversion} 또는 {sles} {bci-mlm}에서 {productname} {productnumber} 프록시 컨테이너의 배포 절차를 설명합니다. 이 안내서에서는 {productname} {productnumber} 서버가 이미 배포된 상태를 가정합니다.
zh_cn: 本指南将简要介绍在 {sl-micro} {microversion} 或 {sles} {bci-mlm} 上部署 {productname} {productnumber} 代理容器的过程，并假定您已成功部署 {productname} {productnumber} 服务器。

source: {sl-micro} is only supported as regular minion ([systemitem]``default`` contact method) for the time being. We are working on managing it as Salt SSH client ([systemitem]``salt-ssh`` contact method), too.
ko: {sl-micro}는 당분간 일반 미니언([systemitem]``기본`` 연락 방법)으로만 지원됩니다. Salt SSH 클라이언트([systemitem]``salt-ssh`` 연락 방법)로도 관리할 수 있도록 개선하는 중입니다.
zh_cn: 目前，{sl-micro} 仅支持作为常规的受控端（[systemitem]``默认``联系方法）。我们正力求让其也能作为 Salt SSH 客户端（[systemitem]``salt-ssh`` 联系方法）进行管理。

source: To successfully deploy, you will perform the following actions:
ja: 正常に配備するには、次のアクションを実行します。
ko: 배포하려면 다음 작업을 수행합니다.
zh_cn: 要成功完成部署，请执行以下操作：

source: Procedure: Deploying Proxy
ja: プロシージャ: プロキシを配備する
zh_cn: 过程：部署代理

source: Review hardware requirements.
ja: ハードウェア要件を確認します。
ko: 하드웨어 요구사항을 검토합니다.
zh_cn: 查看硬件要求。

source: Synchronize the {sl-micro} {microversion} or {sles} {bci-mlm} parent channel and the proxy extension child channel on the server.
ko: 서버에서 {sl-micro} {microversion} 또는 {sles} {bci-mlm} 상위 채널과 프록시 확장 하위 채널을 동기화합니다.
zh_cn: 在服务器上同步 {sl-micro} {microversion} 或 {sles} {bci-mlm} 父通道和代理扩展子通道。

source: Install {sl-micro} or {sles} on a bare-metal machine.
ko: 베어메탈 머신에 {sl-micro} 또는 {sles}를 설치합니다.
zh_cn: 在裸机上安装 {sl-micro} 或 {sles}。

source: During the installation, register {sl-micro} or {sles} along with the {productname} Proxy extension.
ko: 설치하는 동안 {sl-micro} 또는 {sles}와 함께 {productname} 프록시 확장 프로그램을 등록합니다.
zh_cn: 在安装过程中，将 {sl-micro} 或 {sles} 与 {productname} 代理扩展一起注册。

source: Create a {salt} activation key.
ja: {salt}のアクティベーションキーを作成します。
ko: {salt} 활성화 키를 생성합니다.
zh_cn: 创建 {salt} 激活密钥。

source: Bootstrap the proxy as a client with the [systemitem]``default`` connection method.
ja: [systemitem]``デフォルト``接続メソッドを使用して、プロキシをクライアントとしてブートストラップします。
ko: [systemitem]``기본`` 연결 방법을 사용하여 프록시를 클라이언트로 부트스트랩합니다.
zh_cn: 使用 [systemitem]``default`` 连接方法将代理作为客户端引导。

source: Generate a proxy configuration.
ja: プロキシ設定を生成します。
ko: 프록시 구성을 생성합니다.
zh_cn: 生成代理配置。

source: Transfer the proxy configuration from server to proxy.
ja: サーバからプロキシにプロキシ設定を転送します。
ko: 프록시 구성을 서버에서 프록시로 전송합니다.
zh_cn: 将服务器中的代理配置传输到代理。

source: Use the proxy configuration to register the client as a proxy with {productname}.
ja: プロキシ設定を使用して、クライアントを{productname}にプロキシとして登録します。
ko: 프록시 구성을 사용하여 클라이언트를 {productname}의 프록시로 등록합니다.
zh_cn: 使用代理配置将客户端作为代理注册到 {productname}。

source: Supported operating system for the Proxy Container Host
ja: プロキシコンテナホストでサポートされるオペレーティングシステム
ko: 프록시 컨테이너 호스트에 지원되는 운영 체제
zh_cn: 代理容器主机支持的操作系统

source: The supported operating system for the container host are {sl-micro} {microversion} and {sles} {bci-mlm}.
ko: 컨테이너 호스트용으로 지원되는 운영 체제는 {sl-micro} {microversion} 및 {sles} {bci-mlm}입니다.
zh_cn: 容器主机支持的操作系统为 {sl-micro} {microversion} 和 {sles} {bci-mlm}。

source: Container host
ja: コンテナホスト
ko: 컨테이너 호스트
zh_cn: 容器主机

source: A container host is a server equipped with a container engine like Podman, which lets it manage and deploy containers. These containers hold applications and their essential parts, such as libraries, but not a full operating system, making them lightweight. This setup ensures applications run the same way in different environments. The container host supplies the necessary resources such as CPU, memory, and storage for these containers.
ja: コンテナホストは、コンテナを管理および配備できるPodmanなどのコンテナエンジンを搭載したサーバです。これらのコンテナは、アプリケーションと、ライブラリなどの重要な部品を保持していますが、完全なオペレーティングシステムは保持しないため軽量です。このセットアップにより、アプリケーションは異なる環境でも同じように動作します。CPU、メモリ、ストレージなど、これらのコンテナに必要なリソースはコンテナホストが提供します。
ko: 컨테이너 호스트는 컨테이너를 관리하고 배포할 수 있는 컨테이너 엔진(예: Podman)이 탑재된 서버입니다. 이러한 컨테이너는 필수적인 부분(예: 애플리케이션과 라이브러리)을 보관하지만, 전체 운영 체제는 보관하지 않으므로 경량화됩니다. 이 설정은 애플리케이션이 다양한 환경에서 동일한 방식으로 실행되도록 보장합니다. 컨테이너 호스트는 이러한 컨테이너에 필요한 리소스(예: CPU, 메모리, 스토리지)를 제공합니다.
zh_cn: 容器主机是配备了容器引擎（例如 Podman）的服务器，可用于管理和部署容器。这些容器包含应用程序及其必备组件（例如库），但不包含完整的操作系统，因此体量很小。此设置可确保应用程序能够在不同环境中以一致的方式运行。容器主机为这些容器提供必要的资源，例如 CPU、内存和存储。

source: Hardware Requirements for the Proxy
ja: プロキシのハードウェア要件
ko: 프록시의 하드웨어 요구사항
zh_cn: 代理的硬件要求

source: For more information about hardware requirements for deploying {productname} Proxy, see xref:installation-and-upgrade:hardware-requirements.adoc#proxy-hardware-requirements[].
ja: {productname}プロキシを配備するためのハードウェア要件の詳細については、xref:installation-and-upgrade:hardware-requirements.adoc#proxy-hardware-requirements[]を参照してください。
zh_cn: 有关部署 {productname} 代理的硬件要求，请参见 xref:installation-and-upgrade:hardware-requirements.adoc#proxy-hardware-requirements[]。

source: Synchronize the Parent and Proxy Extension Child Channels
ja: 親とプロキシ拡張機能の子チャンネルの同期
zh_cn: 同步父通道和代理扩展子通道

source: This section presumes that you have already entered your organization credentials under the menu:Admin[Setup Wizard > Organization Credentials] in the server's {webui}. Products are listed on the menu:Admin[Setup Wizard > Products] page. This channel must be fully synchronized on the server, with the child channel [systemitem]``Proxy`` as an extension option selected.
zh_cn: 本节假定您已在服务器 {webui} 中的menu:管理[安装向导 > 组织身份凭证]下输入了组织身份凭证。产品列在menu:管理[安装向导 > 产品]页面上。必须在服务器上完全同步此通道，并选择子通道[systemitem]``代理``作为扩展选项。

source: Procedure: Synchronizing the Parent Channel and Proxy Extension
zh_cn: 过程：同步父通道和代理扩展

source: In the {productname} {webui} select menu:Admin[Products].
ja: {productname}の{webui}で、menu:管理[製品]を選択します。
ko: {productname} {webui}에서 menu:관리[제품]으로 이동합니다.
zh_cn: 在 {productname} {webui} 中，选择menu:管理[产品]。

source: From the products page enter {sl-micro} or {sles} in the filter field.
ko: 제품 페이지에서 필터 필드에 {sl-micro} 또는 {sles}를 입력합니다.
zh_cn: 在产品页面上的过滤字段中输入 {sl-micro} 或 {sles}。

source: Next use the drop-down to select the required architecture. For this example {x86_64}.
ja: 続いて、ドロップダウンを使用して必要なアーキテクチャを選択します。この例では、［{x86_64}］を選択します。
ko: 다음으로 드롭다운을 사용하여 필요한 아키텍처를 선택합니다. 이 예제의 경우 {x86_64}입니다.
zh_cn: 接下来，在下拉列表中选择所需的体系结构，在本示例中为 {x86_64}。

source: In the [systemitem]``Product Description`` field select the {sl-micro} {microversion} or {sles} {bci-mlm} checkbox then use the drop-down to select the [systemitem]``{productname} Proxy Extension 5.1 x86_64`` extension.
ko: [systemitem]``제품 설명`` 필드에서 {sl-micro} {microversion} 또는 {sles} {bci-mlm} 확인란을 선택한 후 드롭다운을 사용하여 [systemitem]``{productname} 프록시 확장 프로그램 5.1 x86_64`` 확장 프로그램을 선택합니다.
zh_cn: 在[systemitem]``产品说明``字段中，选中 {sl-micro} {microversion} 或 {sles} {bci-mlm} 对应的复选框，然后在下拉列表中选择 [systemitem]``{productname} Proxy Extension 5.1 x86_64`` 扩展。

source: Click the btn:[Add products] button.
ja: btn:[製品の追加]をクリックします。
ko: btn:[제품 추가] 버튼을 클릭합니다.
zh_cn: 单击 btn:[添加产品] 按钮。

source: Wait for the synchronization to complete.
ja: 同期が完了するまで待ちます。
ko: 동기화가 완료될 때까지 기다립니다.
zh_cn: 等待同步完成。

source: Prepare {productname} Proxy Host
zh_cn: 准备 {productname} 代理主机

source: In the following subsections, you either prepare the proxy host with {sle-micro} or {sles}.
zh_cn: 在下面的小节中，您需要准备 {sle-micro} 或 {sles} 代理主机。

source: To continue with deployment, see xref:installation-and-upgrade:container-deployment/mlm/proxy-deployment-mlm.adoc#deploy-mlm-proxy-persistent-storage[].
ko: 배포를 계속하려면 xref:installation-and-upgrade:container-deployment/mlm/proxy-deployment-mlm.adoc#deploy-mlm-proxy-persistent-storage[]의 내용을 참조하십시오.
zh_cn: 要继续部署，请参见 xref:installation-and-upgrade:container-deployment/mlm/proxy-deployment-mlm.adoc#deploy-mlm-proxy-persistent-storage[]。

source: Configure Custom Persistent Storage
ja: カスタム永続ストレージの設定
ko: 사용자 정의 영구 스토리지 구성
zh_cn: 配置自定义永久性存储

source: Configuring persistent storage is optional, but it is the only way to avoid serious trouble with container full disk conditions. If custom persistent storage is required for your infrastructure, use the [command]``mgr-storage-proxy`` tool.
zh_cn: 配置永久性存储空间并非强制性要求，但这是唯一可避免在容器全盘空间用尽的情况下出现严重问题的方法。如果您的体系结构要求使用自定义永久性存储空间，请使用 [command]``mgr-storage-proxy`` 工具。

source: For more information, see [command]``mgr-storage-proxy --help``. This tool simplifies creating the container storage and Squid cache volumes.
ja: 詳細については、[command]``mgr-storage-proxy --help``を参照してください。このツールを使用すると、コンテナストレージとSquidキャッシュボリュームの作成が容易になります。
ko: 자세한 내용은 [command]``mgr-storage-proxy --help``를 참조하십시오. 이 도구는 컨테이너 스토리지 및 Squid 캐시 볼륨 생성을 간소화합니다.
zh_cn: 有关详细信息，请参见 [command]``mgr-storage-proxy --help``。此工具可以简化容器存储和 Squid 缓存卷的创建。

source: Use the command in the following manner:
ja: このコマンドは次のように使用します。
ko: 다음 방법으로 명령 사용:
zh_cn: 如下所示使用命令：

source: mgr-storage-proxy <storage-disk-device>
zh_cn: mgr-storage-proxy <存储磁盘设备>

source: For example:
ja: 例:
ko: 예:
zh_cn: 例如：

source: This command will create the persistent storage volumes at [path]``/var/lib/containers/storage/volumes``.
ja: このコマンドは、[path]``/var/lib/containers/storage/volumes``に永続ストレージを作成します。
ko: 이 명령은 [path]``/var/lib/containers/storage/volumes``에 영구 스토리지 볼륨을 생성합니다.
zh_cn: 此命令将在 [path]``/var/lib/containers/storage/volumes`` 中创建永久性存储卷。

source: For more information, see
ja: 詳細については、以下を参照してください。
ko: 자세한 내용은 다음을 참조하십시오.
zh_cn: 有关详细信息，请参见

source: Start the {productname} Proxy
ja: {productname}プロキシの起動
zh_cn: 启动 {productname} 代理

source: Container can now be started with the [literal]`mgrpxy` command:
ja: [literal]``mgrpxy``コマンドを使用してコンテナを起動できます。
ko: 이제 [literal]`mgrpxy` 명령으로 컨테이너를 시작할 수 있습니다.
zh_cn: 现在可以使用 [literal]`mgrpxy` 命令启动容器：

source: Procedure: Starting and Checking Proxy Status
ja: プロシージャ: プロキシを起動してステータスを確認する
zh_cn: 过程：启动代理并检查状态

source: Start the proxy by calling:
ja: 次のコマンドを呼び出してプロキシを起動します。
zh_cn: 调用以下命令启动代理：

source: Check container status by calling:
ja: 次のコマンドを呼び出してコンテナのステータスを確認します。
ko: 다음을 호출하여 컨테이너 상태 확인:
zh_cn: 调用以下命令检查容器状态：

source: Five {productname} Proxy containers should be present and should be part of the [literal]``proxy-pod`` container pod:
ja: 5つの{productname}プロキシコンテナが存在し、また、[literal]``proxy-pod``コンテナポッドの一部である必要があります。
zh_cn: 应该会显示以下五个 {productname} 代理容器，并且它们应该是 [literal]``proxy-pod`` 容器 Pod 的一部分：

source: Use a Custom Container Image for a Service
zh_cn: 为服务使用自定义容器映像

source: By default, the {productname} Proxy suite is configured to use the same image version and registry path for each of its services. However, it is possible to override the default values for a specific service using the install parameters ending with [literal]``-tag`` and [literal]``-image``.
ja: デフォルトでは、{productname}プロキシスイートは、そのサービスごとに同じイメージバージョンとレジストリパスを使用するように設定されています。ただし、[literal]``-tag``および[literal]``-image``で終わるインストールパラメータを使用して、特定のサービスのデフォルト値を上書きすることは可能です。
ko: 기본적으로 {productname} 프록시 제품군은 각 서비스에 대해 동일한 이미지 버전과 레지스트리 경로를 사용하도록 구성됩니다. 그러나 [literal]``-tag`` 및 [literal]``-image``로 끝나는 설치 파라미터를 사용하여 특정 서비스에 대한 기본값을 재정의할 수 있습니다.
zh_cn: 默认情况下，{productname} 代理套件配置为针对其每个服务使用相同的映像版本和仓库路径。但是，可以使用以 [literal]``-tag`` 和 [literal]``-image`` 结尾的 install 参数覆盖特定服务的默认值。

source: It adjusts the configuration file for the httpd service, where [path]``registry.opensuse.org/uyuni/proxy-httpds`` is the image to use and [literal]``0.1.0`` is the version tag, before restarting it.
ja: これは、httpdサービスの設定ファイルを調整してから再起動します。[path]``registry.opensuse.org/uyuni/proxy-httpds``は使用するイメージ、[literal]``0.1.0``はバージョンタグです。
ko: 이는 다시 시작하기 전에 [path]``registry.opensuse.org/uyuni/proxy-httpds``가 사용할 이미지이고 [literal]``0.1.0``이 버전 태그인 httpd 서비스의 구성 파일을 조정합니다.
zh_cn: 该命令会在重启 httpd 服务之前调整其配置文件。其中 [path]``registry.opensuse.org/uyuni/proxy-httpds`` 是要使用的映像，[literal]``0.1.0`` 是版本标记。

source: To reset the values to defaults, run the install command again without those parameters:
ja: 値をデフォルトにリセットするには、これらのパラメータを指定せずにもう一度installコマンドを実行します。
ko: 값을 기본값으로 재설정하려면 해당 파라미터 없이 설치 명령을 다시 실행합니다.
zh_cn: 要重置为默认值，请再次运行 install 命令但不要指定这些参数：

source: This command first resets the configuration of all services to the global defaults and then reloads it.
ja: このコマンドは、すべてのサービスの設定をグローバルデフォルトにリセットして再ロードします。
ko: 이 명령은 먼저 모든 서비스의 구성을 전역 기본값으로 재설정한 다음 다시 로드합니다.
zh_cn: 此命令首先将所有服务的配置重置为全局默认值，然后重新装载配置。

source: {productname} Proxy Deployment as a Virtual Machine - KVM
ja: 仮想マシンとしての{productname}プロキシの配備 - KVM
zh_cn: 将 {productname} 代理部署为虚拟机 - KVM

source: This chapter provides the Virtual Machine settings for deployment of {productname} {productnumber} Proxy as an image. KVM will be combined with Virtual Machine Manager (_virt-manager_) as a sandbox for this installation.
ja: この章では、{productname} {productnumber}プロキシをイメージとして配備するための仮想マシンの設定について説明します。このインストールでは、KVMを仮想マシンマネージャ(_virt-manager_)と組み合わせてサンドボックスとして使用します。
ko: 이 장에서는 {productname} {productnumber} 프록시를 이미지로 배포하기 위한 가상 머신 설정을 제공합니다. 이 설치를 위한 샌드박스로 가상 머신 관리자(_virt-manager_)와 KVM이 결합됩니다.
zh_cn: 本节提供用于将 {productname} {productnumber} 代理部署为映像的虚拟机设置。KVM 将与虚拟机管理器 (_virt-manager_) 结合使用，作为此安装的沙箱。

source: Available Images
ja: 利用可能なイメージ
ko: 사용 가능한 이미지
zh_cn: 可用映像

source: The preferred method for deploying {productname} Proxy is to use one of the following available images. All tools are included in these images simplifying deployment.
zh_cn: 部署 {productname} 代理的首选方法是使用以下可用映像之一。所有工具都已包含在这些映像中，因而大大简化了部署。

source: Images for {productname} {productnumber} Proxy are available at link:https://www.suse.com/download/suse-manager/[{productname} {productnumber} VM images].
ja: {productname} {productnumber}プロキシのイメージはlink:https://www.suse.com/download/suse-manager/[{productname} {productnumber} VM images]で入手できます。
zh_cn: {productname} {productnumber} 代理的映像可在 link:https://www.suse.com/download/suse-manager/[{productname} {productnumber} VM 映像]中找到。

source: For more information on preparing raw images, see https://documentation.suse.com/sle-micro/6.1/html/Micro-deployment-raw-images-virtual-machines/index.html#deployment-preparing-configuration-device[].
ko: Raw 이미지 준비에 대한 자세한 내용은 https://documentation.suse.com/sle-micro/6.1/html/Micro-deployment-raw-images-virtual-machines/index.html#deployment-preparing-configuration-device[]에서 확인할 수 있습니다.
zh_cn: 有关准备原始映像的详细信息，请参见 https://documentation.suse.com/sle-micro/6.1/html/Micro-deployment-raw-images-virtual-machines/index.html#deployment-preparing-configuration-device[]。

source: For additional information on the self install images, see https://documentation.suse.com/sle-micro/6.1/html/Micro-deployment-selfinstall-images/index.html
ko: 이미지 자체 설치에 대한 자세한 내용은 https://documentation.suse.com/sle-micro/6.1/html/Micro-deployment-selfinstall-images/index.html[]에서 확인할 수 있습니다.
zh_cn: 有关自安装映像的详细信息，请参见 https://documentation.suse.com/sle-micro/6.1/html/Micro-deployment-selfinstall-images/index.html

source: Available Proxy Images
ja: 利用可能なプロキシイメージ
ko: 사용할 수 있는 프록시 이미지
zh_cn: 可用代理映像

source: | Architecture | Image Format | aarch64| qcow2, vmdk | x86_64 | qcow2, vmdk, raw, Self Installer
ja: | アーキテクチャ | イメージの形式 | aarch64| qcow2、vmdk | x86_64 | qcow2、vmdk、raw、セルフインストーラ
ko: | 아키텍처 | 이미지 형식 | aarch64| qcow2, vmdk | x86_64 | qcow2, vmdk, 원시, 자체 설치 프로그램
zh_cn: | 体系结构 | 映像格式 | aarch64| qcow2、vmdk | x86_64 | qcow2、vmdk、raw、Self Installer

source: Virtual Machine Manager (virt-manager) Settings
cs: Nastavení Virtual Machine Manager (virt-manager)
ja: 仮想マシンマネージャ(virt-manager)の設定
ko: 가상 머신 관리자(virt-manager) 설정
zh_cn: 虚拟机管理器 (virt-manager) 设置

source: Enter the following settings when creating a new virtual machine using *virt-manager*.
cs: Při vytváření nového virtuálního počítače pomocí *virt-manager* zadejte následující nastavení.
ja: **virt-manager**を使用して、新しい仮想マシンを作成するときに、次の設定を入力します。
ko: *virt-manager* 를 사용하여 새 가상 머신을 생성할 때 다음 설정을 입력합니다.
zh_cn: 使用 *virt-manager* 创建新虚拟机时请输入以下设置。

source: This table specifies the minimum requirements. These are suitable for a quick test installation, such as a proxy with one client.
zh_cn: 下表指定了最低要求。这些要求适用于快速测试安装，例如包含一个客户端的代理。

source: If you want to use a production environment and need background information about disk space, see xref:installation-and-upgrade:hardware-requirements.adoc[].
zh_cn: 如果您想要使用生产环境，并且需要有关磁盘空间的背景信息，请参见 xref:installation-and-upgrade:hardware-requirements.adoc[]。

source: 2+<| KVM Settings | Installation Method | Import Existing Disk Image | OS: | Linux | Version: | {productname}-Proxy.x86_64-5.1.*.qcow2 | Memory: | Minimum *) | CPU's: | Minimum *) | Storage Format: | _.qcow2_ 40 GB (Default) Root Partition | Name: | test-setup | Network | Bridge _br0_
ko: 2+<| KVM 설정 | 설치 방법 | 기존 디스크 이미지 임포트 | OS: | Linux | 버전: | {productname}-Proxy.x86_64-5.1.*.qcow2 | 메모리: | 최소 *) | CPU: | 최소 *) | 저장소 형식: | _.qcow2_ 40GB(기본) 루트 파티션 | 이름: | test-setup | 네트워크 | Bridge _br0_
zh_cn: 2+<| KVM 设置 | 安装方法 | 导入现有磁盘映像 | 操作系统： | Linux | 版本： | {productname}-Proxy.x86_64-5.1.*.qcow2 | 内存： | 至少 *) | CPU 数量： | 至少 *) | 存储格式： | _.qcow2_ 40 GB（默认）根分区 | 名称： | test-setup | 网络： | 网桥 _br0_

source: *) For minimum values, see xref:installation-and-upgrade:hardware-requirements.adoc#proxy-hardware-requirements[].
zh_cn: *) 最低要求值请参见 xref:installation-and-upgrade:hardware-requirements.adoc#proxy-hardware-requirements[]。

source: [path]``/var/lib/containers/storage/volumes`` Minimum 100 GB. Storage requirements should be calculated for the number of ISO distribution images, containers, and bootstrap repositories you will use.
ja: [path]``/var/lib/containers/storage/volumes`` 100GB以上。ストレージ要件は、使用するISOディストリビューションイメージ、コンテナ、およびブートストラップリポジトリの数に合わせて計算する必要があります。
zh_cn: [path]``/var/lib/containers/storage/volumes`` 至少具有 100 GB 空间。应根据您要使用的 ISO 发行套件映像、容器和引导储存库的数量来计算存储要求。

source: Initial KVM Setup
ja: KVMの初期セットアップ
ko: 초기 KVM 설정
zh_cn: 初始 KVM 设置

source: For settings, see xref:installation-and-upgrade:container-deployment/mlm/proxy-deployment-vm-mlm.adoc#proxy-quickstart.sect.kvm.settings[].
ko: 설정에 대해서는 xref:installation-and-upgrade:container-deployment/mlm/proxy-deployment-vm-mlm.adoc#proxy-quickstart.sect.kvm.settings[]에서 확인할 수 있습니다.
zh_cn: 相关设置请参见 xref:installation-and-upgrade:container-deployment/mlm/proxy-deployment-vm-mlm.adoc#proxy-quickstart.sect.kvm.settings[]。

source: Procedure: Creating Initial Setup
ja: プロシージャ: 初期セットアップを作成する
ko: 절차: 초기 설정 생성
zh_cn: 过程：创建初始设置

source: Create a new virtual machine using the downloaded {minimal} KVM image and select [guimenu]``Import existing disk image``.
ja: ダウンロードした{minimal} KVMイメージを使用して新しい仮想マシンを作成し、［[guimenu]``Import existing disk image ``］（既存のディスクイメージをインポート）を選択します。
ko: 다운로드한 {minimal} KVM 이미지를 사용하여 새 가상 머신을 생성하고 [guimenu]``기존 디스크 이미지 임포트``를 선택합니다.
zh_cn: 使用下载的 {minimal} KVM 映像创建一个新虚拟机，然后选择[guimenu]``导入现有磁盘映像``。

source: Configure RAM and number of CPUs with minimum values. *)
zh_cn: 配置满足最低要求的 RAM 和 CPU 数量。*)

source: Name your KVM machine and select the [guimenu]``Customize configuration before install`` check box.
cs: Pojmenujte svůj KVM stroj a zaškrtněte možnost [guimenu]``Přizpůsobit konfiguraci před instalací``.
ja: KVMマシンに名前を付け、［[guimenu]``Customize configuration before install``］（インストール前に設定をカスタマイズ）チェックボックスを選択します。
ko: KVM 머신에 이름을 지정하고 [guimenu]``구성을 사용자 정의한 후 설치`` 확인란을 선택합니다.
zh_cn: 为 KVM 计算机命名，并选中[guimenu]``在安装之前自定义配置``复选框。

source: Click btn:[Begin Installation] to boot from the image.
ja: btn:[Begin Installation]（インストールの開始）をクリックし、イメージからブートします。
ko: btn:[설치 시작]을 클릭하여 이미지에서 부팅합니다.
zh_cn: 单击 btn:[开始安装] 以从映像引导。

source: At the JeOS Firstboot screen select start to continue.
ja: ［JeOS Firstboot］の画面で、［Start］を選択して続行します。
ko: JeOS 첫 부팅 화면에서 시작을 선택하여 계속합니다.
zh_cn: 在 JeOS 首次引导屏幕上选择“开始”以继续。

source: Select keyboard layout.
ja: キーボードレイアウトを選択します。
ko: 키보드 레이아웃을 선택합니다.
zh_cn: 选择键盘布局。

source: Accept the license agreement.
ja: ライセンス契約に同意します。
ko: 라이선스 계약에 동의합니다.
zh_cn: 接受许可协议。

source: Select your time zone.
ja: タイムゾーンを選択します。
ko: 시간대를 선택합니다.
zh_cn: 选择您的时区。

source: Enter a password for root.
ja: rootのパスワードを入力します。
ko: 루트의 비밀번호를 입력합니다.
zh_cn: 输入 root 口令。

source: When installation completes log in as root.
ja: インストールが完了したら、rootとしてログインします。
ko: 설치가 완료되면 루트로 로그인합니다.
zh_cn: 安装完成后，以 root 身份登录。

source: Proceed to the next section.
ja: 次のセクションに進みます。
ko: 다음 섹션을 진행합니다.
zh_cn: 继续阅读下一节。

source: Using a Custom Container Image for a Service
ja: サービスにカスタムコンテナイメージを使用する
ko: 서비스에 사용자 정의 컨테이너 이미지 사용
zh_cn: 为服务使用自定义容器映像

source: By default, the {productname} Proxy suite is set to use the same image version and registry path for each of its services. However, it is possible to override the default values for a specific service using the install parameters ending with [literal]``-tag`` and [literal]``-image``.
ja: デフォルトでは、{productname}プロキシスイートは、その各サービスに対して同じイメージバージョンとレジストリパスを使用するように設定されています。ただし、末尾に[literal]``-tag``および[literal]``-image``を指定してインストールパラメータを使用し、特定のサービスのデフォルト値を上書きすることは可能です。
ko: 기본적으로 {productname} 프록시 제품군은 각 서비스에 대해 동일한 이미지 버전과 레지스트리 경로를 사용하도록 설정되어 있습니다. 그러나 [literal]``-tag`` 및 [literal]``-image``로 끝나는 설치 파라미터를 사용하여 특정 서비스에 대한 기본값을 재정의할 수 있습니다.
zh_cn: 默认情况下，{productname} 代理套件设置为针对其每个服务使用相同的映像版本和仓库路径。但是，可以使用以 [literal]``-tag`` 和 [literal]``-image`` 结尾的 install 参数覆盖特定服务的默认值。

source: For example, use it like this:
ja: たとえば、次のように使用します。
ko: 예를 들어, 다음과 같이 사용합니다.
zh_cn: 例如，可以按如下方式使用此命令：

source: {productname} Proxy Deployment as a Virtual Machine - VMware
ja: {productname}プロキシの仮想マシンとしての配備 - VMware
zh_cn: 将 {productname} 代理部署为虚拟机 - VMware

source: This chapter provides the Virtual Machine settings for deployment of {productname} {productnumber} Proxy as an image. VMware will be used as a sandbox for this installation.
ja: この章では、{productname} {productnumber}プロキシをイメージとして配備するために必要な仮想マシン設定について説明します。このインストールでは、VMwareをサンドボックスとして使用します。
zh_cn: 本节提供用于将 {productname} {productnumber} 代理部署为映像的虚拟机设置。将使用 VMware 作为此安装的沙箱。

source: Virtual Machine Settings - VMware
ja: 仮想マシン設定 - VMware
zh_cn: 虚拟机设置 - VMware

source: This section describes VMware configurations, focusing on the creation of an extra virtual disk essential for the {productname} Proxy storage partition within VMware environments.
zh_cn: 本节说明 VMware 配置，重点介绍如何在 VMware 环境中创建对 {productname} 代理存储分区至关重要的额外虚拟磁盘。
