Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: This section specifies the minimum requirements. These are suitable for a quick test installation, such as a proxy with one client.
zh_cn: 本节指定了最低要求。这些要求适用于快速测试安装，例如包含一个客户端的代理。

source: Procedure: Creating the VMware Virtual Machine
ja: プロシージャ: VMware仮想マシンを作成する
ko: 절차: VMware 가상 머신 생성
zh_cn: 过程：创建 VMware 虚拟机

source: Download {productname} Proxy [filename]``.vmdk`` file then transfer a copy to your VMware storage.
ja: {productname}プロキシ[filename]``.vmdk``ファイルをダウンロードし、コピーをVMwareストレージに転送します。
zh_cn: 下载 {productname} 代理 [filename]``.vmdk`` 文件，然后将该文件副本传输到您的 VMware 存储区。

source: Make a copy of uploaded [filename]``.vmdk`` file using VMware web interface. This will convert provided [filename]``.vmdk`` file to the format suitable for vSphere hypervisor.
ja: VMware Webインタフェースを使用して、アップロードされた[filename]``.vmdk``ファイルのコピーを作成します。 これにより、提供された[filename]``.vmdk``ファイルがvSphereハイパーバイザーに適した形式に変換されます。
zh_cn: 使用 VMware Web 界面复制上载的 [filename]``.vmdk`` 文件。这会将提供的 [filename]``.vmdk`` 文件转换成适合 vSphere 超级管理程序的格式。

source: Create and name a new virtual machine based on the Guest OS Family [systemitem]``Linux`` and Guest OS Version {sle} 15 (64-bit).
ja: ゲストOSファミリ[systemitem]``Linux``およびゲストOSバージョン{sle} 15 (64ビット)に基づいて、新しい仮想マシンを作成し、名前を付けます。
ko: 게스트 OS 제품군 [systemitem]``Linux`` 및 게스트 OS 버전 {sle} 15(64비트)를 기반으로 새 가상 시스템을 생성하고 이름을 지정합니다.
zh_cn: 创建一个新的虚拟机，并根据 Guest 操作系统系列 [systemitem]``Linux`` 和 Guest 操作系统版本 {sle} 15（64 位）为其命名。

source: Add an additional [systemitem]``Hard Disk 2`` of 100 GB (or more).
zh_cn: 额外添加一个 100 GB（或更多空间）的[systemitem]``硬盘 2``。

source: Configure RAM and number of CPUs with minimum values. *)
zh_cn: 配置满足最低要求的 RAM 和 CPU 数量。*)

source: Set the network adapter as required.
ja: 必要に応じてネットワークアダプタを設定します。
ko: 필요에 따라 네트워크 어댑터를 설정합니다.
zh_cn: 根据需要设置网络适配器。

source: Power on the VM, and follow firstboot dialogs (keyboard layout, license agreement, time zone, password for root).
ja: VMの電源を入れ、firstbootダイアログ(キーボードレイアウト、ライセンス契約、タイムゾーン、rootのパスワード)に従います。
ko: VM의 전원을 켜고 최초 부팅 대화 상자(키보드 레이아웃, 사용권 계약, 표준 시간대, 루트 비밀번호)를 따릅니다.
zh_cn: 启动 VM，然后按照首次引导对话框中的提示操作（键盘布局、许可协议、时区、root 的口令）。

source: {productname} {productnumber} Proxy Deployment on K3s
ja: K3sへの{productname} {productnumber}プロキシの配備
zh_cn: 在 K3s 上部署 {productname} {productnumber} 代理

source: Installing K3s
ja: K3sのインストール
zh_cn: 安装 K3s

source: {productname} Proxy is supported on K3s running on top of {sl-micro} in a single node cluster. If you need to deploy it in any other Kubernetes environment, contact support for evaluation.
ko: {productname} 프록시는 단일 노드 클러스터의 {sl-micro} 위에서 실행되는 K3s에서 지원됩니다. 이를 다른 Kubernetes 환경에 배포해야 하는 경우 지원팀에 문의하여 평가를 요청해야 합니다.
zh_cn: 在单节点群集中的 {sl-micro} 上运行的 K3s 支持 {productname} 代理。如果您需要将此代理部署在任何其他 Kubernetes 环境中，请联系支持人员进行评估。

source: On the container host machine, install [literal]``K3s`` (replace [literal]``<K3S_HOST_FQDN>`` with the FQDN of your K3s host):
ja: コンテナホストマシンに[literal]``K3s``をインストールします([literal]``<K3S_HOST_FQDN>``はK3sホストのFQDNに置き換えます)。
zh_cn: 在容器主机计算机上，安装 [literal]``K3s``（请将 [literal]``<K3S_HOST_FQDN>`` 替换为 k3s 主机的 FQDN）：

source: Installing Tools
ja: ツールのインストール
zh_cn: 安装工具

source: The installation requires the [literal]``mgrpxy`` and [literal]``helm`` packages.
ja: インストールには[literal]``mgrpxy``パッケージと[literal]``helm``パッケージが必要です。
ko: 설치하려면 [literal]``mgrpxy`` 및 [literal]``helm`` 패키지가 필요합니다.
zh_cn: 在安装时需要提供 [literal]``mgrpxy`` 和 [literal]``helm`` 软件包。

source: The [literal]``mgrpxy`` and ``helm`` packages are available in the {productname} Proxy product repositories.
ja: [literal]``mgrpxy``および``helm``パッケージは{productname}プロキシの製品リポジトリで利用可能です。
zh_cn: [literal]``mgrpxy`` 和 ``helm`` 软件包可在 {productname} 代理产品储存库中找到。

source: To install it, run:
zh_cn: 要进行安装，请运行以下命令：

source: Reboot
ja: 再起動
ko: 재부팅
zh_cn: 重引导

source: Deploying the {productname} Proxy Helm Chart
ja: {productname}プロキシHelmチャートの配備
zh_cn: 部署 {productname} 代理 helm 图表

source: To configure the storage of the volumes to be used by the {productname} Proxy pod, define persistent volumes for the following claims. If you do not customize the storage configuration, K3s will automatically create the storage volumes for you.
ja: {productname}プロキシポッドで使用するボリュームのストレージを設定するには、次のクレームに対して永続ボリュームを定義します。ストレージ設定をカスタマイズしない場合は、K3sによって自動的にストレージボリュームが作成されます。
zh_cn: 要配置 {productname} 代理 Pod 使用的卷存储空间，请为以下声明定义永久性卷。如果您未自定义存储配置，K3s 将自动为您创建存储卷。

source: The persistent volume claims are named:
ja: 永続ボリュームのクレームの名前は次のとおりです。
ko: 영구 볼륨 클레임의 이름은 다음과 같습니다.
zh_cn: 永久性卷声明已命名为：

source: Create the configuration for the {productname} Proxy as documented in xref:installation-and-upgrade:container-deployment/mlm/proxy-deployment-mlm.adoc[]. Copy the configuration [literal]``tar.gz`` file and then install:
ko: xref:installation-and-upgrade:container-deployment/mlm/proxy-deployment-mlm.adoc[]의 설명과 같이 {productname} 프록시에 대한 구성을 생성합니다. 구성 [literal]``tar.gz`` 파일을 복사한 다음 설치합니다.
zh_cn: 按照 xref:installation-and-upgrade:container-deployment/mlm/proxy-deployment-mlm.adoc[] 中所述创建 {productname} 代理的配置。复制 [literal]``tar.gz`` 配置文件，然后安装：

source: For more information see link:https://kubernetes.io/docs/concepts/storage/persistent-volumes/[] (kubernetes) or link:https://rancher.com/docs/k3s/latest/en/storage/[] (K3s) documentation.
ja: 詳細については、link:https://kubernetes.io/docs/concepts/storage/persistent-volumes/[] (kubernetes)またはlink:https://rancher.com/docs/k3s/latest/en/storage/[] (K3s)のドキュメントを参照してください。
zh_cn: 有关详细信息，请参见 link:https://kubernetes.io/docs/concepts/storage/persistent-volumes/[] (kubernetes) 或 link:https://rancher.com/docs/k3s/latest/en/storage/[] (K3s) 文档。

source: {productname} Server Air-gapped Deployment
ja: {productname}サーバのAir-gapped配備
ko: {productname} 서버 air-gapped 배포
zh_cn: {productname} 服务器隔离的部署

source: What is Air-gapped deployment?
ko: air-gapped 배포란?
zh_cn: 什么是隔离的部署？

source: Deployments
ja: 配備
ko: 배포
zh_cn: 部署

source: {productname} supports two deployment variants.
ja: {productname}は2つの配備バリアントをサポートしています。
ko: {productname}은(는) 두 가지 배포 방식을 지원합니다.
zh_cn: {productname} 支持两种部署变体。

source: For more information about installing {productname} Server Virtual Machine, see xref:container-deployment/mlm/server-deployment-vm-mlm.adoc[Deploy Server as a Virtual Machine].
ko: {productname} 서버 가상 머신 설치에 대한 자세한 내용은 xref:container-deployment/mlm/server-deployment-vm-mlm.adoc[서버를 가상 머신으로 배포]에서 확인할 수 있습니다.
zh_cn: 有关安装 {productname} 服务器虚拟机的详细信息，请参见xref:container-deployment/mlm/server-deployment-vm-mlm.adoc[将服务器部署为虚拟机]。

source: To upgrade {productname} Server, users should upgrade all packages in the system and follow the procedures defined in xref:container-management/updating-server-containers.adoc[Server Upgrade].
ja: {productname}サーバをアップグレードするには、システム内のすべてのパッケージをアップグレードし、 xref:container-management/updating-server-containers.adoc[サーバのアップグレード]で定義されている手順に従う必要があります。
ko: {productname} 서버를 업그레이드하려면 시스템의 모든 패키지를 업그레이드하고 xref:container-management/updating-server-containers.adoc[서버 업그레이드]에 정의된 절차를 따릅니다.
zh_cn: 要升级 {productname} 服务器，用户应升级系统中的所有软件包，并按照xref:container-management/updating-server-containers.adoc[服务器升级]中定义的过程操作。

source: User should make the needed RPM available on the internal network. That can be done by using a second {productname} Server or an RMT server.
ko: 사용자는 필요한 RPM을 내부 네트워크에서 사용할 수 있도록 설정해야 합니다. 이 작업은 보조 {productname} 서버 또는 RMT 서버를 사용하여 수행할 수 있습니다.
zh_cn: 用户应在内部网络中提供所需的 RPM。这可以通过使用第二台 {productname} 服务器或 RMT 服务器来实现。

source: Procedure: Install {productname} on {sl-micro} in air-gapped deployment
ko: 절차: air-gapped 배포로 {sl-micro}에 {productname} 설치
zh_cn: 过程：在隔离部署环境中的 {sl-micro} 上安装 {productname}

source: Install tools packages and image packages (replace $ARCH$ with the correct architecture).
ko: 도구 패키지 및 이미지 패키지 설치($ARCH$를 올바른 아키텍처로 바꿈)
zh_cn: 安装工具软件包和映像软件包（将 $ARCH$ 替换为适当的体系结构）。

source: Deploy {productname} with [command]``mgradm``.
ko: [command]``mgradm``을 사용하여 {productname}을(를) 배포합니다.
zh_cn: 使用 [command]``mgradm`` 部署 {productname}。

source: For more detailed information about installing {productname} Server on {sl-micro}, see xref:container-deployment/mlm/server-deployment-mlm.adoc[Deploy Server as a Virtual Machine].
ko: {productname} 서버를 {sl-micro}에 설치하는 방법에 대한 자세한 내용은 xref:container-deployment/mlm/server-deployment-mlm.adoc[가상 머신으로 서버 배포]에서 확인할 수 있습니다.
zh_cn: 有关在 {sl-micro} 上安装 {productname} 服务器的详细信息，请参见xref:container-deployment/mlm/server-deployment-mlm.adoc[将服务器部署为虚拟机]。

source: PTFs
zh_cn: PTF

source: The PTF images are not available as packages. This means that they should be pulled using [command]``podman`` on a machine with internet access, then saved in an archive, transferred to the air-gapped machine and loaded there.
zh_cn: PTF 映像不以软件包形式提供。这意味着需在连接到互联网的计算机上使用 [command]``podman ``拉取映像，然后将其保存为归档，传输至隔离的计算机并在该计算机上加载。

source: Procedure: Pulling the image on a machine with internet access
zh_cn: 过程：在连接到互联网的计算机上拉取映像

source: Install [command]``podman``.
zh_cn: 安装 [command]``podman``。

source: Authenticate against the {suse} Registry using the SCC credentials:
zh_cn: 使用 SCC 身份凭证向 {suse} 仓库进行身份验证：

source: Create a [path]``/tmp/ptf-images`` temporary file with the URL of the PTF images, one per line. In most of the cases only the server image is needed and it can be created with a command like the following, after replacing the [command]``SCC_USERID`` and [command]``PTFID`` values.
zh_cn: 使用 PTF 映像的 URL 创建临时文件 [path]``/tmp/ptf-images``（每行一个映像）。大多数情况下只需要服务器映像，可以使用下面这样的命令来创建该临时文件。请替换 [command]``SCC_USERID`` 和 [command]``PTFID`` 值。

source: Pull each of the container images of the PTF and save them in a tar archive.
zh_cn: 拉取 PTF 的每个容器映像，然后将其保存为 tar 归档。

source: Transfer the [path]``/tmp/ptf-images.tar`` images archive on the server to patch.
zh_cn: 将 [path]``/tmp/ptf-images.tar`` 映像归档传输到要修补的服务器上。

source: Procedure: Loading the images on the server to patch
zh_cn: 过程：在要修补的服务器上加载映像

source: Ensure the [path]``ptf-images.tar`` file is available on the server.
zh_cn: 确保 [path]``ptf-images.tar`` 文件在服务器上。

source: Load the images from the archive:
zh_cn: 从归档中加载映像：

source: {productname} {productnumber} Server Deployment
ja: {productname} {productnumber}サーバの配備
zh_cn: {productname} {productnumber} 服务器部署

source: This guide shows you how to install and configure a {productname} {productnumber} container on {sl-micro} {microversion} or {sles} {bci-mlm}.
ko: 이 가이드에서는 {sl-micro} {microversion} 또는 {sles} {bci-mlm}에 {productname} {productnumber} 컨테이너를 설치하고 구성하는 방법을 설명합니다.
zh_cn: 本指南介绍如何在 {sl-micro} {microversion} 或 {sles} {bci-mlm} 上安装和配置 {productname} {productnumber} 容器。

source: Hardware Requirements for {productname}
ja: {productname}のハードウェア要件
ko: {productname}의 하드웨어 요구사항
zh_cn: {productname} 的硬件要求

source: This table shows the software and hardware requirements for deploying {productname} Server on your bare metal machine. For the purposes of this guide your machine should have 16 GB of RAM, and at least 200 GB of disk space. For background information about disk space, see xref:installation-and-upgrade:hardware-requirements.adoc[].
ja: 次の表に、{productname}サーバをベースメタルマシンに配備するためのソフトウェアおよびハードウェアの要件を示します。このガイドの目的のためには、マシンに16 GBのRAMと200 GB以上のディスク容量が必要です。ディスク容量に関する背景情報については、xref:installation-and-upgrade:hardware-requirements.adoc[]を参照してください。
ko: 이 테이블은 베어 메탈 머신에 {productname} 서버를 배포하기 위한 소프트웨어 및 하드웨어 요구 사항을 보여줍니다. 이 가이드의 목적에 따라 컴퓨터에는 16GB의 RAM과 최소 200GB의 디스크 공간이 있어야 합니다. 디스크 공간에 대한 배경 정보는 xref:installation-and-upgrade:hardware-requirements.adoc[]에서 확인할 수 있습니다.
zh_cn: 下表显示了在裸机上部署 {productname} 服务器所要满足的软件和硬件要求。在本指南中，您的计算机应具有 16 GB RAM 和至少 200 GB 磁盘空间。有关磁盘空间的背景信息，请参见 xref:installation-and-upgrade:hardware-requirements.adoc[]。

source: Software and Hardware Requirements
ja: ソフトウェアおよびハードウェアの要件
ko: 소프트웨어 및 하드웨어 요구사항
zh_cn: 软件和硬件要求

source: | Software and Hardware | Recommended | Operating System | {sl-micro} {microversion} or {sles} {bci-mlm} | Architecture | {x86_64}, {arm}, {s390x}, {ppc64le} | Processor (CPU) | Minimum of four (4) 64-bit CPU cores | RAM | 16 GB | Disk Space | 200 GB | Channel Requirements | 50 GB per SUSE or openSUSE product 360 GB per Red Hat product | Swap space: | 8 to 12 GB
ko: | 소프트웨어 및 하드웨어 | 권장 | 운영 체제: | {sl-micro} {microversion} 또는 {sles} {bci-mlm} | 아키텍처 | {x86_64}, {arm}, {s390x}, {ppc64le} | 프로세서: (CPU) | 최소 네(4) 개의 64비트 CPU 코어 | RAM: | 16GB | 디스크 공간: | 200GB | 채널 요구 사항 | SUSE 또는 openSUSE 제품당 50GB Red Hat 제품당 360GB | 스왑 공간: | 8~12GB
zh_cn: | 软件和硬件 | 建议 | 操作系统 | {sl-micro} {microversion} 或 {sles} {bci-mlm} | 体系结构 | {x86_64}、{arm}、{s390x}、{ppc64le} | 处理器 (CPU)： | 至少四 (4) 个 64 位 CPU 核心 | RAM： | 16 GB | 磁盘空间： | 200 GB | 通道要求 | 为每个 SUSE 或 openSUSE 产品提供 50 GB 空间 为每个 Red Hat 产品提供 360 GB 空间 | 交换空间： | 8 到 12 GB

source: Supported operating system for the Server Container Host
ja: サーバコンテナホストでサポートされるオペレーティングシステム
ko: 서버 컨테이너 호스트에 지원되는 운영 체제
zh_cn: 服务器容器主机支持的操作系统

source: The supported operating system for the container host is {sl-micro} {microversion} or {sles} {bci-mlm}.
ko: 컨테이너 호스트용으로 지원되는 운영 체제는 {sl-micro} {microversion} 또는 {sles} {bci-mlm}입니다.
zh_cn: 容器主机支持的操作系统为 {sl-micro} {microversion} 和 {sles} {bci-mlm}。

source: A container host is a server equipped with a container engine like [systemitem]``Podman``, which lets it manage and deploy containers. These containers hold applications and their essential parts, such as libraries, but not a full operating system, making them lightweight. This setup ensures applications run the same way in different environments. The container host supplies the necessary resources such as CPU, memory, and storage for these containers.
ja: コンテナホストは、コンテナを管理および配備できる[systemitem]``Podman``などのコンテナエンジンを搭載したサーバです。これらのコンテナは、アプリケーションと、ライブラリなどの重要な部品を保持していますが、完全なオペレーティングシステムは保持しないため軽量です。このセットアップにより、アプリケーションは異なる環境でも同じように動作します。CPU、メモリ、ストレージなど、これらのコンテナに必要なリソースはコンテナホストが提供します。
zh_cn: 容器主机是配备了容器引擎（例如 [systemitem]``Podman``）的服务器，可用于管理和部署容器。这些容器包含应用程序及其必备组件（例如库），但不包含完整的操作系统，因此体量很小。此设置可确保应用程序能够在不同环境中以一致的方式运行。容器主机为这些容器提供必要的资源，例如 CPU、内存和存储空间。

source: Server deployment mandates the use of a fully qualified domain name (FQDN). In the absence of automatic DNS provision of an FQDN by your router or network, the deployment process will not proceed successfully. An FQDN typically follows the format <host>.<domain>.com.
ja: サーバの配備では、必ず完全修飾ドメイン名(FQDN)を使用する必要があります。ルータまたはネットワークにFQDNのDNSの自動プロビジョニング機能がない場合は、配備プロセスは正常に続行されません。FQDNは通常、<host>.<domain>.comの形式に従います。
ko: 서버를 배포하려면 FQDN(정규화된 도메인 이름)을 사용해야 합니다. 라우터 또는 네트워크에서 FQDN을 자동으로 DNS 프로비저닝하지 않으면 배포 프로세스가 성공적으로 진행되지 않습니다. FQDN은 일반적으로 <호스트>.<도메인>.com 형식을 따릅니다.
zh_cn: 必须使用完全限定的域名 (FQDN) 才能完成服务器部署。如果您的路由器或网络无法为 FQDN 提供自动 DNS 置备，则部署过程将无法成功进行。FQDN 通常采用 <主机>.<域>.com 格式。

source: For instance:
ja: 例:
ko: 예:
zh_cn: 例如：

source: For more information, see the section on network requirements in xref:installation-and-upgrade:network-requirements.adoc[].
ja: 詳細については、xref:installation-and-upgrade:network-requirements.adoc[]のネットワーク要件のセクションを参照してください。
ko: 자세한 내용은 xref:installation-and-upgrade:network-requirements.adoc[]의 네트워크 요구사항 섹션을 참조하십시오.
zh_cn: 有关详细信息，请参见 xref:installation-and-upgrade:network-requirements.adoc[] 中有关网络要求的章节。

source: Persistent Volumes
ja: 永続ボリューム
ko: 영구 볼륨
zh_cn: 永久性卷

source: {productname} {productnumber} defines the required persistent storage volumes by default. These are created during installation by the [command]``mgradm`` tool if they do not already exist.
ja: {productname} {productnumber}では、必要な永続ボリュームがデフォルトで定義されます。これらのボリュームは、まだ存在しない場合、[command]``mgradm``ツールによってインストール中に作成されます。
ko: {productname} {productnumber}은(는) 기본적으로 필요한 영구 스토리지 볼륨을 정의합니다. 이러한 볼륨이 아직 없다면 설치 중에 [command]``mgradm`` 도구에 의해 볼륨이 생성됩니다.
zh_cn: {productname} {productnumber} 默认会定义所需的永久性存储卷。如果尚不存在，在安装期间 [command]``mgradm`` 工具将创建这些卷。

source: These volumes are created in [path]``/var/lib/containers/storage/volumes/``, where [systemitem]``Podman`` stores its volumes by default.
ja: これらのボリュームは[path]``/var/lib/containers/storage/volumes/``に作成されます。[systemitem]``Podman``はボリュームをデフォルトでここに保存します。
ko: 이러한 볼륨은 [path]``/var/lib/containers/storage/volumes/``에 생성되며, [systemitem]``Podman``은 기본적으로 해당 볼륨을 저장합니다.
zh_cn: 将在 [path]``/var/lib/containers/storage/volumes/`` 中创建这些卷，默认情况下，[systemitem]``Podman`` 也会将其卷存储到此路径。

source: Recommendations
ja: 推奨事項
ko: 권장
zh_cn: 建议

source: You can leverage the simplicity of storage by mounting an external storage device to this directory. Because it will store the {postgresql} database, binary packages for repositories, caches, operating system images, autoinstallation distributions, and configuration files, we have three recommendations:
ja: 外部ストレージデバイスをこのディレクトリにマウントすると、ストレージを簡単に利用できます。ここには、{postgresql}データベース、リポジトリのバイナリパッケージ、キャッシュ、オペレーティングシステムのイメージ、自動インストールディストリビューション、および設定ファイルが保存されるため、次の3つの推奨事項があります。
ko: 이 디렉토리에 외부 스토리지 장치를 마운트하여 간소화된 스토리지를 활용할 수 있습니다. 여기에는 {postgresql} 데이터베이스, 리포지토리용 이진 패키지, 캐시, 운영 체제 이미지, 자동 설치 배포 및 구성 파일이 저장되므로 다음과 같은 3가지 권장 사항이 있습니다.
zh_cn: 您可以通过将外部存储设备挂载到此目录来利用存储的简便性。由于这样会存储 {postgresql} 数据库、储存库的二进制软件包、缓存、操作系统映像、自动安装发行套件和配置文件，我们提出了三项建议：

source: Fast Storage
ja: 高速なストレージ
ko: 고속 스토리지
zh_cn: 快速存储

source: This mount point should ideally be NVMe or SSD-class devices. Slower storage will adversely affect {productname} performance.
ja: このマウントポイントはNVMeまたはSSDクラスのデバイスにするのが理想的です。低速なストレージは{productname}のパフォーマンスに悪影響を及ぼします。
ko: 이 탑재 지점은 NVMe 또는 SSD급 장치를 사용하는 것이 가장 좋습니다. 스토리지 속도가 느리면 {productname}의 성능에 부정적인 영향을 미칩니다.
zh_cn: 此挂载点最好是 NVMe 或 SSD 级设备。较慢的存储会对 {productname} 性能产生不利影响。

source: Large Capacity
ja: 大容量
ko: 대용량
zh_cn: 大容量

source: Recommended minimum size for this is at least 300 GB, and larger if there will be multiple Linux distributions or architectures to manage.
ja: 管理するLinuxディストリビューションまたはアーキテクチャが複数ある場合、このディレクトリの推奨最小サイズは300 GB以上です。
ko: 이를 위한 최소 권장 크기는 300GB 이상이며, 관리해야 할 Linux 배포 또는 아키텍처가 여러 개일 경우 더 큰 크기가 권장됩니다.
zh_cn: 建议的最小容量为 300 GB，如果需要管理多个 Linux 发行套件或体系结构，则应提供更多容量。

source: Recommended Filesystem
ja: 推奨されるファイルシステム
ko: 권장 파일 시스템
zh_cn: 建议的文件系统

source: XFS (though any supported filesystem for {sl-micro} {microversion} could work).
ko: XFS({sl-micro} {microversion}용으로 지원되는 모든 파일 시스템이 작동할 수도 있음).
zh_cn: XFS（不过也可以使用 {sl-micro} {microversion} 支持的任何文件系统）。

source: Optional
ja: オプション
ko: 선택 사항
zh_cn: 可选

source: You can provide custom storage for the volumes by mounting disks on the expected volume path inside it such as [path]``/var/lib/containers/storage/volumes/var-spacewalk``. This adds to the complexity of a {productname} deployment, and may affect the resilience the default storage recommendation provides.
ja: ボリュームのカスタムストレージを提供できます。そのためには、[path]``/var/lib/containers/storage/volumes/var-spacewalk``など、ボリューム内の予期されるボリュームパスにディスクをマウントします。これにより、{productname}の配備の複雑さが増し、推奨されるデフォルトのストレージで提供される回復性に影響する可能性があります。
ko: [path]``/var/lib/containers/storage/volumes/var-spacewalk``와 같은 예상 볼륨 경로에 디스크를 마운트하여 볼륨에 대한 사용자 지정 스토리지를 제공할 수 있습니다. 이렇게 하면 {productname} 배포의 복잡도가 높아지며 기본 스토리지 권장 사항이 제공하는 복원력에 영향을 줄 수 있습니다.
zh_cn: 可以通过将磁盘挂载到文件系统中的预期卷路径（例如 [path]``/var/lib/containers/storage/volumes/var-spacewalk``）来为卷提供自定义存储。这样会增大 {productname} 部署复杂性，并且可能会影响建议的默认存储配置所提供的弹性。

source: For a list of all persistent volumes in the container, see xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[].
ja: コンテナ内の永続ボリュームのリストについては、xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[]を参照してください。
ko: 컨테이너의 모든 영구 볼륨 목록은 xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关容器中所有永久性卷的列表，请参见 xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[]。

source: Prepare {productname} Server Host
zh_cn: 准备 {productname} 服务器主机

source: You can deploy {productname} on {sl-micro} {microversion} or {sles} {bci-mlm}. {sl-micro} is a transactional system, while {sles} is a full server operating system.
ko: {sl-micro} {microversion} 또는 {sles} {bci-mlm}에 {productname}을(를) 배포할 수 있습니다. {sl-micro}는 트랜잭션 시스템이고 {sles}는 전체 서버 운영 체제입니다.
zh_cn: 您可以在 {sl-micro} {microversion} 或 {sles} {bci-mlm} 上部署 {productname}。{sl-micro} 是事务性系统，而 {sles} 则是完整的服务器操作系统。

source: Depending on your decision, either continue with xref:installation-and-upgrade:container-deployment/mlm/server-deployment-mlm.adoc#deploy-mlm-server-micro[] or with xref:installation-and-upgrade:container-deployment/mlm/server-deployment-mlm.adoc#deploy-mlm-server-sles[] and skip the not selected section.
ko: 원하는 대로 xref:installation-and-upgrade:container-deployment/mlm/server-deployment-mlm.adoc#deploy-mlm-server-micro[] 또는 xref:installation-and-upgrade:container-deployment/mlm/server-deployment-mlm.adoc#deploy-mlm-server-sles[]를 진행하고 선택하지 않은 섹션은 건너뜁니다.
zh_cn: 根据您的决定，继续按照 xref:installation-and-upgrade:container-deployment/mlm/server-deployment-mlm.adoc#deploy-mlm-server-micro[] 或 xref:installation-and-upgrade:container-deployment/mlm/server-deployment-mlm.adoc#deploy-mlm-server-sles[] 中的说明操作，并跳过未选择的部分。

source: To continue with deployment, see xref:installation-and-upgrade:container-deployment/mlm/server-deployment-mlm.adoc#deploy-mlm-server-persistent-storage[].
ko: 배포를 계속하려면 xref:installation-and-upgrade:container-deployment/mlm/server-deployment-mlm.adoc#deploy-mlm-server-persistent-storage[]를 참조하십시오.
zh_cn: 要继续部署，请参见 xref:installation-and-upgrade:container-deployment/mlm/server-deployment-mlm.adoc#deploy-mlm-server-persistent-storage[]。

source: Configuring persistent storage is optional, but it is the only way to avoid serious trouble with container full disk conditions. It is highly recommended to configure custom persistent storage with the [command]``mgr-storage-server`` tool.
ja: 永続ストレージの設定はオプションですが、コンテナのディスクがいっぱいになった状態での深刻な問題を回避する唯一の方法です。[command]``mgr-storage-server``ツールを使用してカスタム永続ストレージを設定することを強くお勧めします。
ko: 영구 스토리지 구성은 선택 사항이지만, 컨테이너 디스크가 가득 찬 상황에 심각한 문제를 방지할 수 있는 유일한 방법입니다. [command]``mgr-storage-server`` 도구를 사용하여 사용자 지정 영구 스토리지를 구성하는 것이 적극 권장됩니다.
zh_cn: 配置永久性存储空间并非强制性要求，但这是唯一可避免在容器全盘空间用尽的情况下出现严重问题的方法。强烈建议您使用 [command]``mgr-storage-server`` 工具来配置自定义永久性存储空间。

source: For more information, see [command]``mgr-storage-server --help``. This tool simplifies creating the container storage and database volumes.
ja: 詳細については、[command]``mgr-storage-server --help``を参照してください。このツールを使用すると、コンテナストレージとデータベースボリュームの作成が容易になります。
ko: 자세한 내용은 [command]``mgr-storage-server --help``를 참조하십시오. 이 도구는 컨테이너 스토리지 및 데이터베이스 볼륨 생성을 간소화합니다.
zh_cn: 有关详细信息，请参见 [command]``mgr-storage-server --help``。此工具可以简化容器存储和数据库卷的创建。

source: Deploy {productname} with [literal]``mgradm``
zh_cn: 使用 [literal]``mgradm`` 部署 {productname}

source: Procedure: Deploying {productname} {productnumber} Using [literal]``mgradm``
ja: プロシージャ: [literal]``mgradm``を使用して{productname} {productnumber}を配備する
zh_cn: 过程：使用 [literal]``mgradm`` 部署 {productname} {productnumber}

source: Log in as root.
ja: rootとしてログインします。
ko: 루트로 로그인합니다.
zh_cn: 以 root 身份登录。

source: If the executed command fails ensure that you have registered {productname} {productnumber}. If you skipped registration during installation and now need to register from the command line, follow the steps below to log in to the registry:
ko: 실행한 명령이 실패하면 {productname} {productnumber}을(를) 등록했는지 확인합니다. 설치 중에 등록을 건너뛰고 이제 명령줄에서 등록해야 하는 경우 아래 단계에 따라 레지스트리에 로그인합니다.
zh_cn: 如果执行的命令失败，请确保已注册 {productname} {productnumber}。如果您在安装期间跳过了注册，则现在需要从命令行注册。按照以下步骤登录仓库：

source: Use the {productname} {productnumber} registration key when prompted.
ja: 入力を求められたら、{productname} {productnumber}の登録キーを使用します。
ko: 메시지가 표시되면 {productname} {productnumber} 등록 키를 사용합니다.
zh_cn: 根据提示使用 {productname} {productnumber} 注册密钥。

source: Enter CA key (certificate authority) and administrator account password when prompted.
zh_cn: 根据提示输入 CA 密钥（证书颁发机构）和管理员帐户口令。

source: The administrator account password must be at least 5 characters and less than 48 characters in length.
ja: 管理者アカウントのパスワードは長さ5文字以上、48文字未満である必要があります。
ko: 관리자 계정 비밀번호는 5자 이상 48자 미만이어야 합니다.
zh_cn: 管理员帐户口令长度必须至少为 5 个字符且不超过 48 个字符。

source: Press btn:[Enter].
ja: btn:[Enter (入力)]を押します。
ko: btn:[Enter]를 누릅니다.
zh_cn: 按 btn:[Enter]。
