Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: After installation, ensure that the {sle-micro} {microversion} Parent channel and Proxy child channels are added and synced from the menu:Admin[Setup Wizard -> Products] page.
ja: インストール後、menu:管理[セットアップウィザード -> 製品]ページから、{sle-micro} {microversion}親チャンネルとプロキシの子チャンネルが追加および同期されていることを確認します。

source: In the {webui}, go to menu:Systems[Activation Keys] and create an activation key linked to the synced {sle-micro} {microversion} channel.
ja: {webui}で、menu:システム[アクティベーションキー]に移動し、同期した{sle-micro} {microversion}チャンネルにリンクされたアクティベーションキーを作成します。

source: Generate Proxy Config with spacecmd and Self-Signed Certificate
ja: spacecmdと自己署名証明書を使用したプロキシ設定の生成

source: Task: Generate Proxy Config with spacecmd and Self-Signed Certificate
ja: タスク: spacecmdと自己署名証明書を使用したプロキシ設定の生成

source: Generate Proxy Config with spacecmd and Custom Certificate
ja: spacecmdとカスタム証明書を使用したプロキシ設定の生成

source: You can generate a Proxy configuration using spacecmd for a custom certificates rather than the default self signed certificates.
ja: デフォルトの自己署名証明書ではなくカスタム証明書に対してspacecmdを使用して、プロキシ設定を生成できます。

source: Task: Generate Proxy Config with spacecmd and Custom Certificate
ja: タスク: spacecmdとカスタム証明書を使用したプロキシ設定の生成

source: Air-gapped deployment refers to the setup and operation of any networked system that is physically isolated from insecure networks, especially the internet. This type of deployment is commonly used in high-security environments such as military installations, financial systems, critical infrastructure, and anywhere sensitive data is handled and must be protected from external threats.
ja: Air-gapped配備とは、安全ではないネットワーク、特にインターネットから物理的に隔離されたネットワークシステムをセットアップおよび運用することです。この種の配備は、一般的に高度なセキュリティ環境で使用されます。たとえば、軍事施設、金融システム、重要インフラストラクチャ、機密データを取り扱っていて外部の脅威から保護する必要がある場所などです。

source: You can easily deploy container images using [systemitem]``Podman``, [systemitem]``Docker``, or [systemitem]``Skopeo`` on a machine with internet access.
ja: [systemitem]``Podman``、[systemitem]``Docker``、または[systemitem]``Skopeo``を使用して、インターネットにアクセスできるマシンにコンテナイメージを簡単に配備できます。

source: Pull the desired image then, save the image as a tar archive. For example:
ja: 目的のイメージをプルしてから、イメージをtarアーカイブとして保存します。例:

source: Transfer the resulting [filename]``server-image.tar`` to the Server container host and load it using the following command:
ja: 生成される[filename]``server-image.tar``をサーバコンテナホストに転送し、次のコマンドを使用してロードします。

source: Load the Server Image
ja: サーバイメージのロード

source: Deploy on {leapmicro} {microversion}
ja: {leapmicro} {microversion}への配備

source: Deployment preparations
ja: 配備の準備

source: This section assumes you have already configured an {leapmicro} {microversion} host server, whether it is running on a physical machine or within a virtual environment.
ja: このセクションでは、{leapmicro} {microversion}ホストサーバを設定済みであることを想定しています。物理マシンまたは仮想環境内のどちらで実行されているかは関係ありません。

source: Container Host general requirements
ja: コンテナホストの一般的な要件

source: An {leapmicro} {microversion} server should be installed from installation media. This procedure is described below.
ja: {leapmicro} {microversion}サーバはインストールメディアからインストールする必要があります。この手順については、以下で説明します。

source: Installing Uyuni tools for use with containers
ja: コンテナで使用するためにUyuniツールをインストールする

source: Procedure: Installing Uyuni Tools on {leapmicro} {microversion}
ja: プロシージャ: Uyuniツールを{leapmicro} {microversion}にインストールする

source: On your local host open a terminal window or start up a virtual machine running {leapmicro} {microversion}.
ja: ローカルホストで、端末のウィンドウを開くか、{leapmicro} {microversion}が実行される仮想マシンを起動します。

source: Login.
ja: ログインします。

source: Enter the [command]``transactional-update shell``:
ja: 「[command]``transactional-update shell``」と入力します。

source: Add the following repository to your {leapmicro} {microversion} server:
ja: 次のリポジトリを{leapmicro} {microversion}サーバに追加します。

source: Exit the transactional shell:
ja: トランザクションシェルを終了します。

source: Reboot the host.
ja: ホストを再起動します。

source: Deploying an Uyuni container with Podman
ja: Podmanを使用したUyuniコンテナの配備

source: mgradm overview
ja: mgradmの概要

source: In this section you learned how to deploy an {productname} Server container.
ja: このセクションでは、{productname}サーバオンテナントの配備方法を学びました。

source: Persistent volumes
ja: 永続ボリューム

source: If you are just testing out {productname} you do not need to specify these volumes. [command]``mgradm`` will setup the correct volumes by default.
ja: {productname}をテストしている場合は、これらのボリュームを指定する必要はありません。[command]``mgradm``によって正しいボリュームがデフォルトでセットアップされます。

source: You can provide custom storage for the volumes by mounting disks on this path or the expected volume path inside it such as: [path]``/var/lib/containers/storage/volumes/var-spacewalk``. This is especially important for the database and package mirrors.
ja: ディスクをこのパスにマウントするか、またはその内部の想定されるパス([path]``/var/lib/containers/storage/volumes/var-spacewalk``など)にマウントすることで、ボリュームにカスタムストレージを指定できます。これは特にデータベースとパッケージのミラーで重要です。

source: For a list of all persistent volumes in the container, see
ja: コンテナ内のすべての永続ボリュームのリストについては、以下を参照してください。

source: Custom YAML Configuration and Deployment with [command]``mgradm``
ja: YAMLのカスタム設定と[command]``mgradm``を使用した配備

source: For security, **using command line parameters to specify passwords should be avoided**: use a configuration file with proper permissions instead.
ja: セキュリティのため、**コマンドラインパラメータを使用してパスワードを指定するのは避けることをお勧めします**。代わりに、適切なパーミッションで設定ファイルを使用します。

source: Procedure: Deploying the {productname} container with Podman using a custom configuration file
ja: プロシージャ: カスタム設定ファイルを使用してPodmanで{productname}コンテナを配備する

source: In this section you learned how to deploy an {productname} {productnumber} Server container using a custom YAML configuration.
ja: このセクションでは、YAMLのカスタム設定を使用して{productname} {productnumber}サーバコンテナを配備する方法について学びました。

source: List of persistent storage volumes
ja: 永続ストレージボリュームのリスト

source: |Volume Name | Volume Directory | **var-cobbler** | [path]``/var/lib/cobbler`` | **var-salt** | [path]``/var/lib/salt`` | **var-pgsql** | [path]``/var/lib/pgsql`` | **var-cache** | [path]``/var/cache`` | **var-spacewalk** | [path]``/var/spacewalk`` | **var-log** | [path]``/var/log``
ja: | ボリューム名 | ボリュームディレクトリ | **var-cobbler** | [path]``/var/lib/cobbler`` | **var-salt** | [path]``/var/lib/salt`` | **var-pgsql** | [path]``/var/lib/pgsql`` | **var-cache** | [path]``/var/cache`` | **var-spacewalk** | [path]``/var/spacewalk`` | **var-log** | [path]``/var/log``

source: |Volume Name | Volume Directory | **etc-apache2** | [path]``/etc/apache2`` | **etc-rhn** | [path]``/etc/rhn`` | **etc-systemd-multi** | [path]``/etc/systemd/system/multi-user.target.wants`` | **etc-systemd-sockets** | [path]``/etc/systemd/system/sockets.target.wants`` | **etc-salt** | [path]``/etc/salt`` | **etc-sssd** | [path]``/etc/sssd`` | **etc-tomcat** | [path]``/etc/tomcat`` | **etc-cobbler** | [path]``/etc/cobbler`` | **etc-sysconfig** | [path]``/etc/sysconfig`` | **etc-tls** | [path]``/etc/pki/tls`` | **etc-postfix** | [path]``/etc/postfix`` | **ca-cert** | [path]``/etc/pki/trust/anchors``
ja: | ボリューム名 | ボリュームディレクトリ | **etc-apache2** | [path]``/etc/apache2`` | **etc-rhn** | [path]``/etc/rhn`` | **etc-systemd-multi** | [path]``/etc/systemd/system/multi-user.target.wants`` | **etc-systemd-sockets** | [path]``/etc/systemd/system/sockets.target.wants`` | **etc-salt** | [path]``/etc/salt`` | **etc-sssd** | [path]``/etc/sssd`` | **etc-tomcat** | [path]``/etc/tomcat`` | **etc-cobbler** | [path]``/etc/cobbler`` | **etc-sysconfig** | [path]``/etc/sysconfig`` | **etc-tls** | [path]``/etc/pki/tls`` | **etc-postfix** | [path]``/etc/postfix`` | **ca-cert** | [path]``/etc/pki/trust/anchors``

source: Proxy Upgrade
ja: プロキシのアップグレード

source: Before running the upgrade command, it is recommended to upgrade the [literal]``mgrpxy`` tool first.
ja: upgradeコマンドを実行する前に、先に[literal]``mgrpxy``ツールをアップグレードすることをお勧めします。

source: Run the command:
ja: 次のコマンドを実行します。

source: The {productname} {productnumber} Proxy containers running on [literal]``podman`` can be updated using the following command:
ja: [literal]``podman``上で実行される{productname} {productnumber}プロキシコンテナは、次のコマンドを使用して更新できます。

source: While there is an option to upgrade a specific container using its specific tag, this feature is intended for applying PTFs only. We highly recommend using the same tag for all proxy containers to ensure consistency under normal circumstances.
ja: 特定のタグを使用して特定のコンテナをアップグレードするオプションはありますが、この機能はPTFの適用のみを意図しています。通常の状況下では、すべてのプロキシコンテナに同じタグを使用して一貫性を確保することを強くお勧めします。

source: Server Upgrade
ja: サーバのアップグレード

source: Before running the upgrade command, it is recommended to upgrade the [literal]``mgradm`` tool first.
ja: upgradeコマンドを実行する前に、まず[literal]``mgradm``ツールをアップグレードすることをお勧めします。

source: Refresh software repository with [command]``zypper``:
ja: [command]``zypper``を使用してソフトウェアリポジトリを更新します。

source: If you do not specify the tag parameter, it will default to upgrading to the most recent version. To upgrade to a specific version, provide the tag parameter with the desired image tag.
ja: タグパラメータを指定しない場合、デフォルトで最新バージョンにアップグレードされます。特定のバージョンにアップグレードするには、タグパラメータと目的のイメージタグを指定します。

source: Upgrade the Database
cs: Upgradovat databázi
ja: データベースのアップグレード

source: To successfully perform a major {productname} update, you might need to upgrade the underlying database.
cs: Abyste úspěšně provedli hlavní aktualizaci produktu {productname}, budete asi muset upgradovat podkladovou databázi.
ja: {productname}のメジャー更新を正常に実行するには、基盤となるデータベースをアップグレードする必要がある場合があります。

source: This table shows the PostgreSQL version required for each version of {productname} and {SLES}:
cs: Tato tabulka ukazuje verzi PostgreSQL požadovanou pro každou verzi produktů {productname} a {SLES}:
ja: 次の表は、{productname}および{SLES}の各バージョンで必要なPostgreSQLのバージョンを示しています。

source: PostgreSQL Versions
cs: Verze PostgreSQL
ja: PostgreSQLのバージョン

source: | {productname} version | Operating System version | PostgreSQL version | {productname} 4.0.0 | SLES 15 SP1 | PostgreSQL 10 | {productname} 4.1.0 | SLES 15 SP2 | PostgreSQL 12 | {productname} 4.2.0 | SLES 15 SP3 | PostgreSQL 13 | {productname} 4.3.0 | SLES 15 SP4 | PostgreSQL 14 | {productname} 5.0 (container) | {sle-micro} {microversion} | PostgreSQL 16
ja: | {productname}のバージョン |オペレーティングシステムのバージョン | PostgreSQLのバージョン | {productname} 4.0.0 | SLES 15 SP1 | PostgreSQL 10 | {productname} 4.1.0 | SLES 15 SP2 | PostgreSQL 12 | {productname} 4.2.0 | SLES 15 SP3 | PostgreSQL 13 | {productname} 4.3.0 | SLES 15 SP4 | PostgreSQL 14 | {productname} 5.0 (container) | {sle-micro} {microversion} | PostgreSQL 16

source: This table shows the PostgreSQL version required for each version of {productname} and {opensuse}:
cs: Tato tabulka ukazuje verzi PostgreSQL požadovanou pro každou verzi produktů {productname} a {opensuse}:
ja: 次の表は、{productname}および{opensuse}の各バージョンで必要なPostgreSQLのバージョンを示しています。

source: | {productname} version | Operating System version | PostgreSQL version | {productname} >= 2020.07 | {opensuse} 15.2 | PostgreSQL 12 | {productname} >= 2021.06 | {opensuse} 15.3 | PostgreSQL 13 | {productname} >= 2022.06 | {opensuse} 15.4 | PostgreSQL 14 | {productname} >= 2023.09 | {opensuse} 15.5 | PostgreSQL 14 | {productname} >= 2024.03 | {opensuse} 15.5 | PostgreSQL 14 (non-container) / PostgreSQL 16 (container)
ja: | {productname}のバージョン | オペレーティングシステムのバージョン | PostgreSQLのバージョン | {productname} >= 2020.07 | {opensuse} 15.2 | PostgreSQL 12 | {productname} >= 2021.06 | {opensuse} 15.3 | PostgreSQL 13 | {productname} >= 2022.06 | {opensuse} 15.4 | PostgreSQL 14 | {productname} >= 2023.09 | {opensuse} 15.5 | PostgreSQL 14 | {productname} >= 2024.03 | {opensuse} 15.5 | PostgreSQL 14 (非コンテナ) / PostgreSQL 16 (コンテナ)

source: If you are using an older database version, such as version 9.4 or 9.6, you must migrate PostgreSQL to version 10 before you begin the {productname} migration. To upgrade from PostgreSQL 9 to version 10, see:
ja: バージョン9.4または9.6などの古いデータベースバージョンを使用している場合は、{productname}の移行を開始する前に、PostgreSQLをバージョン10に移行する必要があります。PostgreSQL 9からバージョン10にアップグレードするには、次を参照してください:

source: This table outlines hardware and software requirements for the {productname} Server and Proxy on {x86_64}, and {arm} architecture.
ja: 以下の表は、{x86_64}および{arm}アーキテクチャの{productname}サーバおよびプロキシのハードウェアとソフトウェアの要件を説明しています。

source: One of {sle-micro} {microversion} or {sles} {sles-version} {sp-version} is the operating system of the container host. In the following, {sles} as the installed host operating system is explicitly mentioned only if it matters. Otherwise we either write {sle-micro} or just host operating system.
ja: {sle-micro} {microversion}または {sles} {sles-version} {sp-version}のいずれかが、コンテナホストのオペレーティングシステムです。以下では、インストールされたホストオペレーティングシステムとして{sles}は、重要な場合にのみ明示的に言及されます。それ以外の場合、{sle-micro}、または単にホストオペレーティングシステムと記述します。

source: The container host with {sle-micro} as operating system requires as free disk space:
ja: オペレーティングシステムとして{sle-micro}を使用するコンテナホストには、次の空きディスク容量が必要です。

source: | Hardware | Details | Recommendation | CPU | {x86_64}, {arm}, {ppc64le}, or {s390x} | Minimum 4 dedicated 64-bit CPU cores | RAM | Minimum | 16 GB | | Recommended | 32 GB | Disk Space | [path]``/`` (root directory) | 20 GB | | [path]``/var/lib/containers/storage/volumes`` | Minimum 150 GB (depending on the number of products) | | [path]``/var/lib/containers/storage/volumes/var-pgsql`` | Minimum 50 GB
ja: | ハードウェア | 詳細 | 推奨 | CPU | {x86_64}、{arm}、{ppc64le}、または{s390x} | 専用64ビットCPUコア数は4つ以上 | RAM | 最小 | 16GB | | 推奨 | 32GB | ディスク容量 | [path]``/`` (ルートディレクトリ) | 20GB | | [path]``/var/lib/containers/storage/volumes`` | 150GB以上(製品数によって異なります) | [path]``/var/lib/containers/storage/volumes/var-pgsql`` | 50GB以上

source: The images by default have a 20 GB [literal]``/`` partition. The cloud image of {sle-micro} 5.5 has just a 5 GB [literal]``/`` partition. Both work flawlessly with {productname}. As long as external storage is mounted to [path]``/var/lib/containers/storage/volumes``, {productname} does not need or use storage on the [literal]``/`` partition, but leaves that to the management of the container host itself.
ja: これらのイメージにはデフォルトで20GBの[literal]``/``パーティションがあります。{sle-micro} 5.5のクラウドイメージの[literal]``/``パーティションは5GB程度です。どちらも{productname}で問題なく動作します。外部ストレージを[path]``/var/lib/containers/storage/volumes``にマウントする限り、{productname}は[literal]``/`` パーティション上のストレージを必要とせず、使用することはありませんがその管理はコンテナホスト自体に任されています。

source: | Hardware | Details | Recommendation | CPU | {x86_64}, {arm} | Minimum 2 dedicated 64-bit CPU cores | RAM | Minimum | 2 GB | | Recommended | 8 GB | Disk Space | [path]``/`` (root directory) | Minimum 40 GB | | [path]``/var/lib/containers/storage/volumes`` | Minimum 100 GB
ja: | ハードウェア | 詳細 | 推奨 | CPU | {x86_64}、{arm} | 専用64ビットCPUコア数は2つ以上 | RAM | 最小 | 2GB | | 推奨 | 8GB | ディスク容量 | [path]``/`` (ルートディレクトリ) | 40GB以上 | | [path]``/var/lib/containers/storage/volumes`` | 100GB以上

source: hwinfo --disk | grep -E "Device File:"
ja: hwinfo --disk | grep -E "デバイスファイル:"
ko: hwinfo --disk | grep -E "장치 파일:"

source: On the container host of the {productname} Server, the [command]``mgr-storage-server`` command moves the complete content of the [path]``/var/lib/containers/storage/volumes`` directory to a separate disk and remounts it to [path]``/var/lib/containers/storage/volumes``. Optionally, if a second device name is specified, [command]``mgr-storage-server`` moves the content of the [path]``/var/lib/containers/storage/volumes/var-pgsql`` database directory to a second separate disk and remounts it to [path]``/var/lib/containers/storage/volumes/var-pgsql``.
ja: {productname}サーバのコンテナホストでは、[command]``mgr-storage-server``コマンドは[path]``/var/lib/containers/storage/volumes``ディレクトリの完全なコンテンツを個別のディスクに移動し、 [path]``/var/lib/containers/storage/volumes``に再マウントします。オプションで、2番目のデバイス名が指定された場合、[command]``mgr-storage-server``は[path]``/var/lib/containers/storage/volumes/var-pgsql``データベースディレクトリのコンテンツを2番目の個別のディスクに移動し、 [path]``/var/lib/containers/storage/volumes/var-pgsql``に再マウントします。

source: Install {productname} Proxy with {opensuse} Leap
cs: Nainstalujte server {productname} Proxy s {opensuse} Leap
ja: {opensuse} Leapを使用した{productname}プロキシのインストール

source: {productname} Proxy can be installed on {opensuse} Leap {opensuse-version}.
cs: {productname} Proxy lze nainstalovat na {opensuse} Leap {opensuse-version}.
ja: {productname}プロキシは、{opensuse} Leap {opensuse-version}にインストールできます。

source: Procedure: Installing {opensuse} Leap with Uyuni Proxy
cs: Postup: Instalace {opensuse} Leap s Uyuni Proxy
ja: プロシージャ: Uyuniプロキシを使用して{opensuse} Leapをインストールする

source: Install {opensuse} Leap and apply all package updates available.
cs: Nainstalujte {opensuse} Leap a použijte všechny dostupné aktualizace balíčků.
ja: {opensuse} Leapをインストールし、利用できるすべてのパッケージ更新を適用します。

source: Configure a resolvable fully qualified domain name (FQDN) with menu:yast[System > Network Settings > Hostname/DNS].
cs: Nakonfigurujte rozřešitelný (převoditelný na IP adresu) plně kvalifikovaný doménový název (FQDN) pomocí menu:yast[System > Network Settings > Hostname/DNS] (Systém > Nastavení sítě > Název hostitele/DNS).
ja: menu:yast[システム > Network Settings（ネットワーク設定） > Hostname/DNS（ホスト名/DNS）]で、解決可能な完全修飾ドメイン名(FQDN)を設定します。

source: Add the repository with the {productname} Proxy software.
cs: Přidejte úložiště softwaru {productname} Proxy.
ja: {productname}プロキシソフトウェアでリポジトリを追加します。

source: As [systemitem]``root`` enter:
cs: Jako [systemitem] ``root`` zadejte:
ja: [systemitem]``root``として次のように入力します。

source: Refresh metadata from the repositories.
cs: Obnovte metadata z úložišť.
ja: リポジトリからメタデータを更新します。

source: Install the pattern for the {productname} Proxy:
cs: Nainstalujte vzor pro server {productname} Proxy:
ja: {productname}プロキシのパターンをインストールします。

source: Reboot the {productname} Proxy.
cs: Restartujte {productname} Proxy.
ja: {productname}プロキシを起動します。

source: For more information about the stable version of {productname}, see link:https://www.uyuni-project.org/pages/stable-version.html[].
ja: 安定したバージョンの{productname}の詳細については、link:https://www.uyuni-project.org/pages/stable-version.html[]を参照してください。

source: For more information about the development version of {productname}, see link:https://www.uyuni-project.org/pages/devel-version.html[].
ja: 開発版の{productname}の詳細については、link:https://www.uyuni-project.org/pages/devel-version.html[]を参照してください。

source: When the installation is complete, you can continue with {productname} setup. For more information, see xref:installation-and-upgrade:uyuni-proxy-registration.adoc[].
ja: インストールが完了したら、{productname}の設定に進むことができます。詳細については、xref:installation-and-upgrade:uyuni-proxy-registration.adoc[]を参照してください。

source: Install Uyuni Server with openSUSE
cs: Instalujte server Uyuni s openSUSE
ja: openSUSEを使用したUyuniサーバのインストール

source: {productname} Server can be installed on openSUSE.
cs: Server {productname} lze nainstalovat na openSUSE.
ja: {productname}サーバは、openSUSEにインストールできます。

source: For requirements, see xref:installation-and-upgrade:uyuni-install-requirements.adoc[].
ja: 要件については、xref:installation-and-upgrade:uyuni-install-requirements.adoc[]を参照してください。

source: For more information about the latest version and updates of openSUSE Leap, see https://doc.opensuse.org/release-notes/.
cs: Další informace o nejnovější verzi a aktualizacích openSUSE Leap najdete na https://doc.opensuse.org/release-notes/.
ja: openSUSE Leapの最新バージョンおよび更新の詳細については、https://doc.opensuse.org/release-notes/[]を参照してください。

source: Install Uyuni on openSUSE Leap
cs: Nainstalujte Uyuni na openSUSE Leap
ja: openSUSE LeapへのUyuniのインストール

source: Procedure: Installing openSUSE Leap with Uyuni
cs: Postup: Instalace openSUSE Leap s Uyuni
ja: プロシージャ: Uyuniを使用してopenSUSE Leapをインストールする

source: As the base system, install openSUSE Leap with all available service packs and package updates applied.
cs: Jako základní systém nainstalujte openSUSE Leap se všemi dostupnými aktualizacemi Service Pack a aktualizacemi balíčků.
ja: ベースシステムとして、使用可能なすべてのサービスパックとパッケージの更新を適用してopenSUSE Leapをインストールします。

source: Set variables to use to create repository as [systemitem]``root``:
cs: Nastavit proměnné pro použití k vytvoření úložiště jako [systemitem]``root``:
ja: リポジトリの作成に使用する変数を[systemitem]``root``として設定します。

source: Add the repository for installing the {productname} Server software as [systemitem]``root``:
cs: Přidejte úložiště pro instalaci serverového softwaru {productname} jako [systemitem]``root``:
ja: {productname}サーバのソフトウェアを[systemitem]``root``としてインストールするためにリポジトリを追加します。

source: Refresh metadata from the repositories as [systemitem]``root``:
cs: Obnovit metadata z úložišť jako [systemitem]``root``:
ja: [systemitem]``root``としてリポジトリからメタデータを更新します。

source: Install the pattern for the {productname} Server as [systemitem]``root``:
cs: Nainstalujte vzor pro server {productname} jako [systemitem]``root``:
ja: {productname}サーバのパターンを[systemitem]``root``としてインストールします。

source: For more information about the stable version of {productname}, see https://www.uyuni-project.org/pages/stable-version.html.
cs: Další informace o stabilní verzi produktu {productname} najdete na adrese https://www.uyuni-project.org/pages/stable-version.html.
ja: 安定したバージョンの{productname}の詳細については、https://www.uyuni-project.org/pages/stable-version.html[]を参照してください。

source: For more information about the development version of {productname}, see https://www.uyuni-project.org/pages/devel-version.html.
cs: Další informace o vývojové verzi {productname} najdete na adrese https://www.uyuni-project.org/pages/devel-version.html.
ja: 開発版の{productname}の詳細については、https://www.uyuni-project.org/pages/devel-version.html[]を参照してください。

source: When the installation is complete, you can continue with {productname} setup. For more information, see xref:installation-and-upgrade:uyuni-server-setup.adoc[].
ja: インストールが完了したら、{productname}の設定に進むことができます。詳細については、xref:installation-and-upgrade:uyuni-server-setup.adoc[]を参照してください。

source: Deployment and Upgrade Guide Overview
ja: 配備およびアップグレードガイドの概要

source: **Updated:** {docdate}
cs: **Aktualizováno:** {docdate}
ja: **更新:** {docdate}

source: This book provides guidance on deploying and upgrading {productname} Server and Proxy. It is split into the following sections:
ja: このドキュメントでは{productname}サーバおよびプロキシを配備およびアップグレードするガイダンスを提供します。ガイダンスは、次のセクションに分かれています。

source: Describes hardware, software, and networking requirements before you begin.
ja: インストールを開始する前に、ハードウェア、ソフトウェア、ネットワークの要件について説明します。

source: Describes tasks for deploying {productname} as a container and initial setup.
ja: コンテナとしての{productname}の配備および初期セットアップのタスクについて説明します。

source: Describes upgrade and migration of {productname}.
ja: {productname}のアップグレードと移行について説明します。

source: Basic Server Management
ja: 基本的なサーバ管理

source: Describes basic operations to start using the {productname}.
ja: {productname}の使用を開始するための基本操作について説明します。

source: IP forwarding will be enabled by containerized installation. This means {productname} Server and Proxies will behave as a router. This behavior is done by podman directly. podman containers do not run if IP forwarding is disabled.
ja: IP転送は、コンテナ化されたインストールによって有効になります。つまり、{productname}サーバとプロキシはルータとして動作します。この動作はpodmanによって直接実行されます。IP転送が無効になっている場合、podmanコンテナは実行されません。

source: If you are on an internal network and do not have access to {scclongform}, you can use an xref:installation-and-upgrade:container-deployment/suma/server-air-gapped-deployment-suma.adoc[Air-gapped Deployment].
ja: 社内ネットワーク上で操作していて、{scclongform}にアクセスできない場合、xref:installation-and-upgrade:container-deployment/suma/server-air-gapped-deployment-suma.adoc[Air-gapped配備]を使用できます。
