Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: {productname} {productnumber} introduces a rebranded set of client tools for all supported operating systems. This transition is seamless, and users performing a new product synchronization should only notice the updated channel names.
ko: {productname} {productnumber}은(는) 지원되는 모든 운영 체제를 위한 클라이언트 도구 세트를 다시 출시했습니다. 이 전환은 원활하게 이루어지며, 새 제품 동기화를 수행하는 사용자는 업데이트된 채널 이름만 확인할 수 있습니다.
zh_cn: {productname} {productnumber} 为所有受支持的操作系统推出了一套重新命名的客户端工具。此过渡过程无缝衔接，执行新产品同步的用户仅会注意到通道名称已更新。

source: This document provides the tested procedure to upgrade a {sle-micro} 5.5 host deployed with {productname} 5.0 Server to {sl-micro} 6.1 and migrate to {productname} {productnumber}.
ko: 이 문서는 {productname} 5.0 서버로 배포된 {sle-micro} 5.5 호스트를 {sl-micro} 6.1로 업그레이드하고 {productname} {productnumber}(으)로 마이그레이션하기 위한 검증된 절차를 제공합니다.
zh_cn: 本文提供了经过测试的步骤，用于将部署了 {productname} 5.0 服务器的 {sle-micro} 5.5 主机升级到 {sl-micro} 6.1 并迁移到 {productname} {productnumber}。

source: {productname} 5.0 is installed and running on {sle-micro} 5.5.
ko: {productname} 5.0은 {sle-micro} 5.5에 설치되어 실행 중입니다.
zh_cn: {productname} 5.0 已在 {sle-micro} 5.5 上安装并运行。

source: System is registered and has active subscriptions with {scc}.
ko: 시스템은 {scc}에 등록되어 있으며 활성 구독을 보유하고 있습니다.
zh_cn: 系统已注册到 {scc} 且拥有有效的订阅。

source: Distribution upgrade and server migration
ko: 배포판 업그레이드 및 서버 마이그레이션
zh_cn: 发行套件升级和服务器迁移

source: Procedure: Migration from {productname} 5.0 to {productname} {productnumber}
ko: 절차: {productname} 5.0에서 {productname} {productnumber}(으)로 마이그레이션
zh_cn: 过程：从 {productname} 5.0 迁移到 {productname} {productnumber}

source: Verify current product status.
ko: 현재 제품 상태를 확인합니다.
zh_cn: 校验当前产品状态。

source: Base OS: `SUSE Linux Enterprise Micro 5.5`
ko: 기본 OS: `SUSE Linux Enterprise Micro 5.5`
zh_cn: 基础操作系统：`SUSE Linux Enterprise Micro 5.5`

source: Extension: `SUSE Manager Server 5.0 Extension`
ko: 확장: `SUSE Manager Server 5.0 Extension`
zh_cn: 扩展：`SUSE Manager Server 5.0 Extension`

source: Ensure the system is updated.
ko: 시스템이 업데이트되었는지 확인합니다.
zh_cn: 确保系统已更新。

source: If patches were applied, stop the server and then reboot the system before proceeding to migration:
ko: 패치가 적용된 경우 마이그레이션을 진행하기 전에 서버를 중지한 다음 시스템을 재부팅합니다.
zh_cn: 如果已应用补丁，请在继续迁移前停止服务器，然后重引导系统：

source: If no updates were found, you can proceed directly to the migration step.
ko: 업데이트가 없는 경우, 마이그레이션 단계로 바로 진행할 수 있습니다.
zh_cn: 如果未发现更新，可直接进入迁移步骤。

source: Start the migration.
ko: 마이그레이션을 시작합니다.
zh_cn: 启动迁移流程。

source: Follow the prompts and select the available migration to **SUSE Linux Micro 6.1** and **{productname} Server Extension 5.1**.
ko: 안내에 따라 **SUSE Linux Micro 6.1** 및 **{productname} Server Extension 5.1**로 가능한 마이그레이션을 선택합니다.
zh_cn: 按照提示操作，选择可用的迁移目标：**SUSE Linux Micro 6.1** 和 **{productname} Server Extension 5.1**。

source: Stop the server and then reboot to apply changes.
ko: 서버를 중지한 다음 재부팅하여 변경 사항을 적용합니다.
zh_cn: 停止服务器后重引导，使更改生效。

source: Enable root SSH access (_if required_). SL Micro 6.1 disables root login via SSH by default. Edit `/etc/ssh/sshd_config.d/sshd.conf`:
ko: 루트 SSH 액세스를 활성화합니다(_필요한 경우_). SL Micro 6.1은 기본적으로 SSH를 통한 루트 로그인을 비활성화합니다. ``etc/ssh/sshd_config.d/sshd.conf``를 편집합니다.
zh_cn: 启用 root SSH 访问权限（_如果需要_）。SL Micro 6.1 默认会禁用 root 登录。请编辑 `/etc/ssh/sshd_config.d/sshd.conf`：

source: And restart the service:
ko: 그리고 서비스 다시 시작:
zh_cn: 并重启服务：

source: Verify {productname} tools
ko: {productname} 도구 확인
zh_cn: 校验 {productname} 工具

source: Version [literal]``5.1.11`` or higher
ko: 버전 [literal]``5.1.11`` 이상
zh_cn: 版本 `5.1.11` 或更高版本

source: References [literal]``5.1.0`` or higher
ko: [literal]``5.1.0`` 이상 참조
zh_cn: 引用版本 [literal]``5.1.0`` 或更高版本

source: Upgrade server containers.
ko: 서버 컨테이너를 업그레이드합니다.
zh_cn: 升级服务器容器。

source: Follow the prompts to pull and configure the new 5.1.0 containers.
ko: 프롬프트에 따라 새 5.1.0 컨테이너를 가져오고 구성합니다.
zh_cn: 按照提示拉取并配置新的 5.1.0 容器。

source: Check the running containers:
ko: 실행 중인 컨테이너 확인:
zh_cn: 检查正在运行的容器：

source: [literal]``server:5.1.0`` or higher
ko: [literal]``server:5.1.0`` 이상
zh_cn: [literal]``server:5.1.0`` 或更高版本

source: [literal]``server-postgresql:5.1.0`` or higher
ko: [literal]``server-postgresql:5.1.0`` 이상
zh_cn: [literal]``server-postgresql:5.1.0`` 或更高版本

source: Errors for missing services like [literal]``uyuni-db`` or [litarl]``saline`` during upgrade can be ignored if not installed previously.
ko: 이전에 설치하지 않은 경우 업그레이드 중 [literal]``uyuni-db`` 또는 [litarl]``saline`` 같은 서비스 누락 오류를 무시할 수 있습니다.
zh_cn: 如果之前未安装 [literal]``uyuni-db`` 或 [litarl]``saline`` 等服务，升级过程中出现的相关缺失服务错误可忽略。

source: The system is now running {productname} 5.1 on SL Micro 6.1. Validate your setup before resuming production operations. If you have a {productname} 5.0 proxy connected to this server, proceed to the xref:installation-and-upgrade:container-deployment/mlm/migrations/proxy/proxy-mlm-50-51.adoc[] guide to upgrade the proxy host.
ko: 시스템은 현재 SL Micro 6.1에서 {productname} 5.1을 실행 중입니다. 프로덕션 운영을 재개하기 전에 설정을 확인하십시오. 이 서버에 {productname} 5.0 프록시가 연결된 경우, 프록시 호스트를 업그레이드하려면 xref:installation-and-upgrade:container-deployment/mlm/migrations/proxy/proxy-mlm-50-51.adoc[] 안내서를 참조하십시오.
zh_cn: 系统现已在 SL Micro 6.1 上运行 {productname} 5.1。请在恢复生产操作前验证设置。如果您有 {productname} 5.0 代理连接至该服务器，请继续参考 xref:installation-and-upgrade:container-deployment/mlm/migrations/proxy/proxy-mlm-50-51.adoc[] 指南升级代理主机。

source: This document provides the tested procedure to upgrade a SUSE Linux Enterprise Server 15 SP6 host deployed with SUSE Multi-Linux Manager 5.0 Server to SUSE Linux Enterprise Server 15 SP7 with SUSE Multi-Linux Manager 5.1.
ko: 이 문서는 SUSE Multi-Linux Manager 5.0 Server가 배포된 SUSE Linux Enterprise Server 15 SP6 호스트를 SUSE Multi-Linux Manager 5.1이 포함된 SUSE Linux Enterprise Server 15 SP7로 업그레이드하기 위한 검증된 절차를 제공합니다.
zh_cn: 本文提供了经过测试的步骤，用于将部署了 SUSE Multi-Linux Manager 5.0 服务器的 SUSE Linux Enterprise Server 15 SP6 主机升级到部署了 SUSE Multi-Linux Manager 5.1 的 SUSE Linux Enterprise Server 15 SP7。

source: SUSE Multi-Linux Manager 5.0 is installed and running on SUSE Linux Enterprise Server 15 SP6.
ko: SUSE Multi-Linux Manager 5.0이 SUSE Linux Enterprise Server 15 SP6에 설치되어 실행 중입니다.
zh_cn: SUSE Multi-Linux Manager 5.0 已在 SUSE Linux Enterprise Server 15 SP6 上安装并运行。

source: The system is registered and has valid subscriptions in SUSE Customer Center (SCC).
ko: 해당 시스템은 SUSE 고객 센터(SCC)에 등록되어 있으며 유효한 구독을 보유하고 있습니다.
zh_cn: 系统已注册到 SUSE Customer Center (SCC) 且拥有有效的订阅。

source: Ensure backups are created before proceeding.
ko: 계속하기 전에 백업이 생성되었는지 확인하십시오.
zh_cn: 继续操作前请务必创建备份。

source: Procedure: Migration from {productname} 5.0 to {productname} {productnumber}
ko: 절차: {productname} 5.0에서 {productname} {productnumber}(으)로 마이그레이션
zh_cn: 过程：从 {productname} 5.0 迁移到 {productname} {productnumber}

source: Base OS: [literal]``SUSE Linux Enterprise Server 15 SP6``
ko: 기본 OS: [literal]``SUSE Linux Enterprise Server 15 SP6``
zh_cn: 基础操作系统：[literal]``SUSE Linux Enterprise Server 15 SP6``

source: Extension: [literal]``SUSE Manager Server 5.0 Extension``
ko: 확장: [literal]``SUSE Manager Server 5.0 Extension``
zh_cn: 扩展：[literal]``SUSE Manager Server 5.0 Extension``

source: Apply all system patches.
ko: 모든 시스템 패치를 적용합니다.
zh_cn: 应用所有系统补丁。

source: Stop the server, and then reboot if the update stack was updated.
ko: 서버를 중지한 후, 업데이트 스택이 업데이트된 경우 재부팅합니다.
zh_cn: 如果更新了更新栈，则停止服务器后重引导。

source: Launch the Zypper migration tool.
ko: Zypper 마이그레이션 도구를 실행합니다.
zh_cn: 启动 Zypper 迁移工具。

source: Zypper will show the possible migration targets with detailed summaries.
cs: Zypper ukáže možné cíle migrace s podrobnými souhrny.
ko: Zypper에 가능한 마이그레이션 대상과 함께 자세한 요약 정보가 표시됩니다.
zh_cn: Zypper 会显示可能的迁移目标以及详细摘要。

source: Select the appropriate target, and follow the prompts to complete the migration.
cs: Vyberte příslušný cíl a dokončete migraci podle pokynů.
ko: 적절한 대상을 선택하고 프롬프트를 따라 마이그레이션을 완료합니다.
zh_cn: 选择适当的目标，并按照提示完成迁移。

source: After the migration completes, stop the server and then reboot the system.
ko: 마이그레이션이 완료된 후에는 서버를 중지한 후 시스템을 재부팅합니다.
zh_cn: 完成迁移后，停止服务器，然后重引导系统。

source: Image tag [literal]``5.1.0`` or higher
ko: 이미지 태그 [literal]``5.1.0`` 이상
zh_cn: 映像标记 [literal]``5.1.0`` 或更高版本

source: Upgrade the server containers.
ko: 서버 컨테이너를 업그레이드합니다.
zh_cn: 升级服务器容器。

source: Follow prompts to pull the new container images and reconfigure the environment.
ko: 안내에 따라 새 컨테이너 이미지를 가져오고 환경을 재구성합니다.
zh_cn: 按照提示拉取新的容器映像并重新配置环境。

source: Check the running containers.
ko: 실행 중인 컨테이너를 확인합니다.
zh_cn: 检查正在运行的容器。

source: Expected containers:
ko: 필요한 컨테이너:
zh_cn: 预期容器：

source: The system is now running {productname} 5.1 on SUSE Linux Enterprise Server 15 SP7. Validate your setup before resuming production operations. If you have a {productname} 5.0 proxy connected to this server, proceed with xref:installation-and-upgrade:container-deployment/mlm/migrations/proxy/proxy-mlm-50-51.adoc[].
ko: 시스템은 현재 SUSE Linux Enterprise Server 15 SP7에서 {productname} 5.1을 실행 중입니다. 프로덕션 운영을 재개하기 전에 설정을 검증하십시오. 이 서버에 {productname} 5.0 프록시가 연결된 경우, xref:installation-and-upgrade:container-deployment/mlm/migrations/proxy/proxy-mlm-50-51.adoc[]를 진행하십시오.
zh_cn: 系统现已在 SUSE Linux Enterprise Server 15 SP7 上运行 {productname} 5.1。请在恢复生产操作前验证设置。如果您有 {productname} 5.0 代理连接至该服务器，请继续按照 xref:installation-and-upgrade:container-deployment/mlm/migrations/proxy/proxy-mlm-50-51.adoc[] 操作。

source: {productname} Proxy Air-gapped Deployment
ja: {productname}プロキシのAir-gapped配備
ko: {productname} 프록시 air-gapped 배포
zh_cn: {productname} 代理隔离的部署

source: What is air-gapped deployment?
ja: Air-gapped配備とは
ko: air-gapped 배포란?
zh_cn: 什么是隔离的部署？

source: Air-gapped deployment refers to the setup and operation of any networked system that is physically isolated from insecure networks, especially the internet. This type of deployment is commonly used in high-security environments such as military installations, financial systems, critical infrastructure, and anywhere sensitive data is handled and must be protected from external threats.
ja: Air-gapped配備とは、安全ではないネットワーク、特にインターネットから物理的に隔離されたネットワークシステムをセットアップおよび運用することです。この種の配備は、一般的に高度なセキュリティ環境で使用されます。たとえば、軍事施設、金融システム、重要インフラストラクチャ、機密データを取り扱っていて外部の脅威から保護する必要がある場所などです。
ko: air-gapped 배포란 안전하지 않은 네트워크, 특히 인터넷으로부터 물리적으로 격리된 네트워크 시스템을 설정하고 운영하는 것을 의미합니다. 이러한 유형의 배포는 일반적으로 군사 설치, 금융 시스템, 중요 인프라 및 민감한 데이터를 처리하고 외부 위협으로부터 보호해야 하는 모든 곳에서 보안 수준이 높은 환경에서 사용됩니다.
zh_cn: 隔离部署是指设置和操作与不安全网络（尤其是互联网）隔离的任何联网系统。这种部署通常用于军事设施、金融系统、关键基础架构等高安全性环境，以及处理敏感数据，因而必须防范其受到外部威胁的任何位置。

source: At the moment, air-gapped deployment is available only on {sl-micro}.
ko: 현재 air-gapped 배포는 {sle-micro}에서만 사용할 수 있습니다.
zh_cn: 目前只有 {sl-micro} 支持隔离的部署。

source: Deploy with Virtual Machine
ja: 仮想マシンでの配備
ko: 가상 머신으로 배포
zh_cn: 通过虚拟机部署

source: The recommended installation method is using the provided {productname} Virtual Machine Image option, since all the needed tools and container images are pre-loaded and will work out of the box.
ja: 推奨されるインストール方法は、提供されている{productname}の仮想マシンイメージオプションを使用する方法です。必要なツールとコンテナイメージがすべてプリロードされていて、すぐに動作するためです。
ko: 필요한 모든 도구 및 컨테이너 이미지가 미리 로드되어 있고 즉시 작동하므로, 제공되는 {productname} 가상 머신 이미지 옵션을 사용하여 설치하는 방법을 권장합니다.
zh_cn: 建议的安装方法是使用所提供的 {productname} 虚拟机映像选项，因为所需的全部工具和容器映像都已预先加载并且随时可用。

source: For more information about installing {productname} Proxy Virtual Machine, see xref:container-deployment/mlm/proxy-deployment-vm-mlm.adoc[Deploy Proxy as a Virtual Machine].
ko: {productname} 프록시 가상 머신 설치에 대한 자세한 내용은 xref:container-deployment/mlm/proxy-deployment-vm-mlm.adoc[프록시를 가상 머신으로 배포]에서 확인할 수 있습니다.
zh_cn: 有关安装 {productname} 代理虚拟机的详细信息，请参见xref:container-deployment/mlm/proxy-deployment-vm-mlm.adoc[将代理部署为虚拟机]。

source: To upgrade {productname} Proxy, users should follow the procedures defined in xref:container-management/updating-proxy-containers.adoc[Proxy Upgrade].
ja: {productname}プロキシをアップグレードするには、xref:container-management/updating-proxy-containers.adoc[プロキシのアップグレード]で定義されている手順に従う必要があります。
ko: {productname} 프록시를 업그레이드하려면 xref:container-management/updating-proxy-containers.adoc[프록시 업그레이드]에 정의된 절차를 따라야 합니다.
zh_cn: 要升级 {productname} 代理，用户应按照xref:container-management/updating-proxy-containers.adoc[代理升级]中定义的过程操作。

source: Deploy {productname} on {sl-micro}
ko: {sl-micro}에 {productname} 배포
zh_cn: 在 {sl-micro} 上部署 {productname}

source: {productname} also provides all the needed container images in RPM's that can be installed on the system.
ja: {productname}では、必要なコンテナイメージはすべてRPMでも提供されており、このイメージをシステムにインストールすることができます。
ko: 또한 {productname}은(는) 필요한 모든 컨테이너 이미지를 시스템에 설치할 수 있는 RPM으로 제공합니다.
zh_cn: {productname} 还在 RPM 中提供了可在系统上安装的所需的全部容器映像。

source: Procedure: Install {productname} on {sl-micro} in Air-gapped
ko: 절차: air-gapped 방식으로 {sl-micro}에 {productname} 프록시 설치
zh_cn: 过程：在隔离环境中的 {sl-micro} 上安装 {productname}

source: Install {sl-micro}.
ko: {sl-micro}를 설치합니다.
zh_cn: 安装 {sl-micro}。

source: Bootstrap the Proxy Host OS as a Client on {productname} Server.
ja: {productname}サーバ上のクライアントとしてプロキシホストOSをブートストラップします。
ko: {productname} 서버에서 프록시 호스트 OS를 클라이언트로 부트스트랩합니다.
zh_cn: 将代理主机操作系统作为 {productname} 服务器上的客户端进行引导。

source: Update the system.
ja: システムを更新します。
ko: 시스템을 업데이트합니다.
zh_cn: 更新系统。

source: Install tools packages and image packages (replace $ARCH$ with the correct architecture)
ja: ツールのパッケージとイメージパッケージをインストールします($ARCH$は適切なアーキテクチャと置き換えます)。
ko: 도구 패키지 및 이미지 패키지 설치($ARCH$를 올바른 아키텍처로 대체)
zh_cn: 安装工具软件包和映像包（将 $ARCH$ 替换为正确的体系结构）

source: Reboot.
cs: Rebootujte.
ja: 再起動します。
ko: 재부팅합니다.
zh_cn: 重引导。

source: Deploy {productname} with mgrpxy.
ja: mgrpxyを使用して{productname}を配備します。
ko: {productname}을(를) mgrpxy로 배포합니다.
zh_cn: 使用 mgrpxy 部署 {productname}。

source: For more detailed information about installing {productname} Proxy on {sl-micro}, see xref:container-deployment/mlm/proxy-deployment-mlm.adoc[Deploy Proxy as a Virtual Machine].
ko: {sl-micro}에 {productname} 프록시를 설치하는 방법에 대한 자세한 내용은 xref:container-deployment/mlm/proxy-deployment-mlm.adoc[가상 머신으로 프록시 배포]에서 확인할 수 있습니다.
zh_cn: 有关在 {sl-micro} 上安装 {productname} 代理的详细信息，请参见xref:container-deployment/mlm/proxy-deployment-mlm.adoc[将代理部署为虚拟机]。

source: Convert a Client to MLM Proxy
ko: 클라이언트를 MLM 프록시로 변환
zh_cn: 将客户端转换为 MLM 代理

source: Overview
ja: 概要
zh_cn: 概述

source: This chapter describes how to convert a client system into a {productname} Proxy using the {webui}.
ko: 이 장에서는 {webui}를 사용하여 클라이언트 시스템을 {productname} 프록시로 변환하는 방법에 대해 설명합니다.
zh_cn: 本章介绍如何通过 {webui} 将客户端系统转换为 {productname} 代理。

source: It assumes that the proxy host system has already been bootstrapped, is subscribed to the base operating system channel (such as {sles} 15 SP7 or {sl-micro} 6.1) and to the Proxy Extension channel.
ko: 프록시 호스트 시스템이 이미 부트스트랩되었으며, 기본 운영 체제 채널(예: {sles} 15 SP7 또는 {sl-micro} 6.1) 및 프록시 확장 채널에 가입되어 있다고 가정합니다.
zh_cn: 本文假设代理主机系统已完成引导、已订阅基础操作系统通道（如 {sles} 15 SP7 或 {sl-micro} 6.1）以及代理扩展通道。

source: For information about client onboarding, see xref:client-configuration:registration-overview.adoc[].
ko: 클라이언트 온보딩에 대한 자세한 내용은 xref:client-configuration:registration-overview.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关客户端初始配置的详细信息，请参见 xref:client-configuration:registration-overview.adoc[]。

source: Before starting the conversion, ensure the following requirements are fulfilled.
ko: 변환을 시작하기 전에 다음 요구 사항이 충족되었는지 확인하십시오.
zh_cn: 开始转换前，请确保满足以下要求。

source: Supported Systems
ko: 지원되는 시스템
zh_cn: 支持的系统

source: Only the following operating systems are currently supported for proxy conversion:
ko: 현재 프록시 변환을 위해 지원되는 운영 체제는 다음과 같습니다.
zh_cn: 目前仅支持以下操作系统进行代理转换：

source: Client Must Be
ko: 클라이언트는 다음과 같아야 함
zh_cn: 客户端需满足的条件

source: Already onboarded in {productname}
ko: {productname}에 이미 온보딩됨
zh_cn: 已在 {productname} 中完成初始配置

source: Reachable via the network
ko: 네트워크를 통해 연결 가능
zh_cn: 可通过网络访问

source: Subscribed to the appropriate proxy extension channel:
ko: 적절한 프록시 확장 채널 구독:
zh_cn: 已订阅相应的代理扩展通道：

source: {productname} Proxy Extension 5.1 (matching architecture)
ko: {productname} 프록시 확장 5.1(일치 아키텍처)
zh_cn: {productname} Proxy Extension 5.1（需匹配体系结构）

source: Preparation
zh_cn: 准备工作

source: Before proceeding with the proxy conversion, make sure the following preparations are completed to avoid interruptions during the conversion process.
ko: 프록시 변환을 계속하기 전에 변환 과정 중 중단을 방지하기 위해 다음 준비 사항이 완료되었는지 확인하십시오.
zh_cn: 进行代理转换前，请完成以下准备工作，以免转换过程中出现中断。

source: SSL Certificates
zh_cn: SSL 证书

source: Valid SSL certificates are required to secure communication between the proxy and other components.
ko: 프록시와 다른 구성 요소 간의 통신을 보호하려면 유효한 SSL 인증서가 필요합니다.
zh_cn: 为确保代理与其他组件之间的通信安全，需要具备有效的 SSL 证书。

source: You need:
ko: 필요 사항:
zh_cn: 您需要准备：

source: The public certificate of the Certificate Authority (CA) that signed the certificate on the {productname} server
ko: {productname} 서버의 인증서에 서명한 인증 기관(CA)의 공개 인증서
zh_cn: 为 {productname} 服务器证书签名的证书颁发机构 (CA) 的公共证书。

source: A certificate for the proxy.
ko: 프록시용 인증서.
zh_cn: 代理专用证书。

source: The corresponding private key for the proxy certificate.
ko: 프록시 인증서에 해당하는 개인 키입니다.
zh_cn: 代理证书对应的私用密钥。

source: If your CA uses an intermediate certificate chain, you must include all intermediate certificates as well.
ko: 인증 기관(CA)이 임시 인증서 체인을 사용하는 경우, 모든 임시 인증서도 반드시 포함해야 합니다.
zh_cn: 如果您的 CA 使用中间证书链，还必须包含所有中间证书。

source: If you are not using third party certificates, you can generate them using the `rhn-ssl-tool` inside the {productname} container.
ko: 타사 인증서를 사용하지 않는 경우, {productname} 컨테이너 내부의 ``rhn-ssl-tool``을 사용하여 생성할 수 있습니다.
zh_cn: 如果不使用第三方证书，可在 {productname} 容器内通过 `rhn-ssl-tool` 生成证书。

source: Generate a proxy certificate
ko: 프록시 인증서 생성
zh_cn: 生成代理证书

source: On the {productname} server host, run:
ko: {productname} 서버 호스트에서 다음을 실행:
zh_cn: 在 {productname} 服务器主机上运行以下命令：

source: For more information about other parameters, see xref:administration:ssl-certs-selfsigned.adoc[].
ko: 다른 파라미터에 대한 자세한 내용은 xref:administration:ssl-certs-selfsigned.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关其他参数的详细信息，请参见 xref:administration:ssl-certs-selfsigned.adoc[]。

source: Transfer the certificates to {productname} server host
ko: 인증서를 {productname} 서버 호스트 이전
zh_cn: 将证书传输至 {productname} 服务器主机

source: To confirm the exact folder where the certificates and key files were generated, you can list the directories with:
ko: 인증서 및 키 파일이 생성된 정확한 폴더를 확인하려면 다음 명령으로 디렉토리를 나열할 수 있습니다.
zh_cn: 如需确认证书和密钥文件的具体生成目录，可以执行以下命令列出相关目录：

source: Transfer the certificates from the {productname} server host to your local machine or other target system:
ko: {productname} 서버 호스트의 인증서를 로컬 컴퓨터 또는 다른 대상 시스템으로 전송합니다.
zh_cn: 将证书从 {productname} 服务器主机传输至本地计算机或其他目标系统：

source: Packages Preparation
ko: 패키지 준비
zh_cn: 软件包准备

source: It is recommended to deploy the container images as RPM packages. Please ensure the following packages are installed on the client:
ko: 컨테이너 이미지를 RPM 패키지로 배포하는 것이 권장됩니다. 클라이언트에 다음 패키지가 설치되어 있는지 확인하십시오.
zh_cn: 建议以 RPM 软件包形式部署容器映像。请确保客户端上已安装以下软件包：

source: suse-multi-linux-manager-5.1-<ARCH>-proxy-httpd-image
zh_cn: suse-multi-linux-manager-5.1-<体系结构>-proxy-httpd-image

source: suse-multi-linux-manager-5.1-<ARCH>-proxy-salt-broker-image
zh_cn: suse-multi-linux-manager-5.1-<体系结构>-proxy-salt-broker-image

source: suse-multi-linux-manager-5.1-<ARCH>-proxy-squid-image
zh_cn: suse-multi-linux-manager-5.1-<体系结构>-proxy-squid-image

source: suse-multi-linux-manager-5.1-<ARCH>-proxy-ssh-image
zh_cn: suse-multi-linux-manager-5.1-<体系结构>-proxy-ssh-image

source: suse-multi-linux-manager-5.1-<ARCH>-proxy-tftpd-image
zh_cn: suse-multi-linux-manager-5.1-<体系结构>-proxy-tftpd-image

source: You can install these packages from the {webui} by navigating to the [literal]``Software`` > [literal]``Packages`` > [literal]``Install`` tab, then searching for the packages above, and installing them.
ko: {webui}에서 [literal]``Software`` > [literal]``Packages`` > [literal]``Install`` 탭으로 이동한 후, 위의 패키지를 검색하여 설치할 수 있습니다.
zh_cn: 您可通过 {webui} 安装这些软件包：导航到[literal]``软件`` > [literal]``软件包`` > [literal]``安装``选项卡，然后搜索上述软件包并完成安装。

source: For details on air-gapped deployment, see xref:installation-and-upgrade:container-deployment/mlm/proxy-air-gapped-deployment-mlm.adoc[]
ko: air-gapped 배포에 대한 자세한 내용은 xref:installation-and-upgrade:container-deployment/mlm/proxy-air-gapped-deployment-mlm.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关隔离部署的详细信息，请参见 xref:installation-and-upgrade:container-deployment/mlm/proxy-air-gapped-deployment-mlm.adoc[]。

source: Setup Proxy Client
ko: 프록시 클라이언트 설정
zh_cn: 设置代理客户端

source: Navigate to the client's [literal]``Overview`` page.
ko: 클라이언트의 [literal]``Overview`` 페이지로 이동합니다.
zh_cn: 导航到客户端的[literal]``概览``页面。

source: Click button btn:[Convert to Proxy].
ko: btn:[프록시로 변환]을 클릭합니다.
zh_cn: 单击 btn:[转换为代理] 按钮。

source: Confirm you were redirected to the proxy configuration form.
ko: 프록시 설정 양식으로 리디렉션되었는지 확인합니다.
zh_cn: 确认您已重定向至代理配置表单。

source: This page can be accessed later from the [literal]``Details`` > [literal]``Proxy`` > [literal]``Configuration`` tab.
ko: 이 페이지는 나중에 [literal]``Details`` > [literal]``Proxy`` > [literal]``Configuration`` 탭에서 액세스할 수 있습니다.
zh_cn: 以后可通过[literal]``细节`` > [literal]``代理`` > [literal]``配置``选项卡访问该页面。

source: In the {webui}, navigate to menu:Proxy[Configuration] and fill in the required data:
ko: {webui}에서 menu:프록시[구성]으로 이동하여 필요한 데이터를 입력합니다.
zh_cn: 在 {webui} 中，导航到menu:代理[配置]，并填写所需数据：

source: Procedure: Configuring the Proxy
ko: 절차: 프록시 구성
zh_cn: 过程：配置代理

source: In the [guimenu]``Parent FQDN`` field, type the fully qualified domain name for the parent server or proxy.
ko: [guimenu]``상위 FQDN`` 필드에 상위 서버 또는 프록시의 완전히 정규화된 도메인 이름을 입력합니다.
zh_cn: 在[guimenu]``父 FQDN`` 字段中，键入父服务器或代理的完全限定域名。

source: In the [guimenu]``Proxy SSH port`` field, type the SSH port on which the SSH service is listening on the {productname} Proxy. It is recommended to keep the default: 8022.
ko: [guimenu]``프록시 SSH 포트`` 필드에 SSH 서비스가 {productname} Proxy에서 수신 대기하는 SSH 포트를 입력하십시오. 권장 사항은 기본 포트인 8022를 유지하는 것입니다.
zh_cn: 在[guimenu]``代理 SSH 端口``字段中，键入 {productname} 代理上 SSH 服务的监听端口。建议保留默认值 8022。

source: In the [guimenu]``Max Squid cache size`` field, type the maximum allowed size for the Squid cache, in Gigabytes.
ko: [guimenu]``최대 Squid 캐시 크기`` 필드에 Squid 캐시에 허용되는 최대 크기를 입력합니다.
zh_cn: 在[guimenu]``最大 Squid 缓存大小``字段中，键入允许的最大 Squid 缓存大小（以 GB 为单位）。

source: In the [guimenu]``Proxy admin email`` field, type the administrator's email address.
ko: [guimenu]``프록시 관리자 이메일`` 필드에 관리자 이메일 주소를 입력합니다.
zh_cn: 在[guimenu]``代理管理员电子邮件``字段中，键入管理员的电子邮件地址。

source: In the [literal]``Certificates`` section, provide the certificates for the {productname} Proxy, obtained in the preparation step.
ko: [literal]``Certificates`` 섹션에서, 준비 단계에서 획득한 {productname} 프록시용 인증서를 제공하십시오.
zh_cn: 在[literal]``证书``部分，提供在进行准备时获取的 {productname} 代理证书。

source: In the [literal]``Source`` section, select one of the two options: [literal]``RPM`` or [literal]``Registry``.
ko: [literal]``Source`` 섹션에서 [literal]``RPM`` 또는 [literal]``Registry`` 옵션 중 하나를 선택합니다.
zh_cn: 在[literal]``源``部分，选择以下两个选项之一：[literal]``RPM`` 或 [literal]``仓库``。

source: The [literal]``RPM`` option is recommended for air-gapped or restricted environments.
ko: [literal]``RPM`` 옵션은 air-gapped 또는 제한 환경에서 권장됩니다.
zh_cn: 对于隔离或受限环境，建议使用 [literal]``RPM`` 选项。

source: The [literal]``Registry`` option can be used if connectivity to the container image registry is available. If selected, you will be prompted to choose between two sub-options: [literal]``Simple`` or [literal]``Advanced``.
ko: 컨테이너 이미지 레지스트리에 연결할 수 있는 경우 [literal]``Registry`` 옵션을 사용하면 됩니다. 선택 시 [literal]``Simple`` 또는 [literal]``Advanced`` 두 가지 하위 옵션 중 하나를 선택하라는 메시지가 표시됩니다.
zh_cn: 如果可连接容器映像仓库，则可使用[literal]``仓库``选项。 如果选择此选项，系统会提示您从[literal]``简单``或[literal]``高级``两个子选项中选择。

source: If [literal]``Simple`` is selected, provide values in the [literal]``Registry URL`` and [literal]``Containers Tag`` fields.
ko: [literal]``Simple``을 선택한 경우, [literal]``Registry URL`` 및 [literal]``Containers Tag`` 필드에 값을 입력합니다.
zh_cn: 如果选择[literal]``简单``，需要在[literal]``仓库 URL`` 和 [literal]``容器标记``字段中输入对应值。
