Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: In the [guimenu]``Proxy SSH port`` field type SSH port on which SSH service is listening on {productname} Proxy. Recommended is to keep default 8022.
ja: ［[guimenu]``プロキシSSHポート``］フィールドに、SSHサービスが{productname}プロキシでリスンしているSSHポートを入力します。デフォルトの8022を維持することをお勧めします。
ko: [guimenu]``프록시 SSH 포트`` 필드에 SSH 서비스가 {productname} Proxy에서 수신 대기하는 SSH 포트를 입력하십시오. 권장 사항은 기본 포트인 8022를 유지하는 것입니다.
zh_cn: 在[guimenu]``代理 SSH 端口``字段中，键入 SSH 服务在 {productname} 代理上监听的 SSH 端口。建议保留默认值 8022。

source: In the [guimenu]``Max Squid cache size [MB]`` field type maximal allowed size for Squid cache. Typically this should be at most 60% of available storage for the containers.
ja: ［[guimenu]``Squidの最大キャッシュサイズ[MB]``］フィールドタイプで、Squidキャッシュの最大許容サイズ。通常、これはコンテナで使用可能なストレージの最大60%である必要があります。
ko: [guimenu]``최대 Squid 캐시 크기 [MB]`` 필드에 Squid 캐시에 허용되는 최대 크기를 입력하십시오. 일반적으로 이는 컨테이너에 사용할 수 있는 저장소의 최대 60%여야 합니다.
zh_cn: 在[guimenu]``最大 Squid 缓存大小 [MB]``字段中，键入允许的最大 Squid 缓存大小。一般该值最多应为容器可用存储空间的 60 %。

source: In the [guimenu]``SSL certificate`` selection list choose if new server certificate should be generated for {productname} Proxy or an existing one should be used. You can consider generated certificates as {productname} builtin (self signed) certificates.
ja: ［[guimenu]``SSL証明書``］選択リストで、{productname}プロキシ用に新しいサーバ証明書を生成するか、既存のサーバ証明書を使用するかを選択します。 生成された証明書は、{productname}組み込みの(自己署名)証明書とみなすことができます。
ko: [guimenu]``SSL 인증서`` 선택 목록에서 {productname} 프록시에 대해 새 서버 인증서를 생성해야 하는지 또는 기존 인증서를 사용해야 하는지 선택합니다. 생성된 인증서를 {productname} 기본 제공(자체 서명) 인증서로 간주할 수 있습니다.
zh_cn: 在 [guimenu]``SSH 证书``选择列表中，选择应为 {productname} 代理生成新服务器证书还是使用现有证书。您可以考虑作为 {productname} 内置（自我签名）证书生成的证书。

source: Depending on the choice then provide either path to signing CA certificate to generate a new certificate or path to an existing certificate and its key to be used as proxy certificate.
ja: 選択に応じて、新しい証明書を生成するための署名CA証明書へのパス、またはプロキシ証明書として使用される既存の証明書とそのキーへのパスのいずれかを指定します。
ko: 선택에 따라 새 인증서를 생성하기 위해 CA 인증서에 서명할 경로 또는 프록시 인증서로 사용할 기존 인증서 및 해당 키에 대한 경로를 입력하십시오.
zh_cn: 然后根据所做的选择提供用于生成新证书的签名 CA 证书的路径，或者要用作代理证书的现有证书及其密钥的路径。

source: For more information about existing or custom certificates and the concept of corporate and intermediate certificates, see xref:administration:ssl-certs-imported.adoc[].
ja: 既存の証明書またはカスタム証明書、および企業証明書と中間証明書の概念の詳細については、xref:administration:ssl-certs-imported.adoc[]を参照してください。
ko: 기존 또는 사용자 정의 인증서와 기업 및 중간 인증서의 개념에 대한 자세한 내용은 xref:administration:ssl-certs-imported.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关现有或自定义证书的详细信息以及企业和中间证书的概念，请参见 xref:administration:ssl-certs-imported.adoc[]。

source: Click btn:[Generate] to register new proxy FQDN in {productname} Server and generate configuration archive with details for container host.
ja: btn:[生成]をクリックして、{productname}サーバに新しいプロキシFQDNを登録し、コンテナホストの詳細を含む設定アーカイブを生成します。
ko: btn:[생성]을 클릭하여 {productname} Server에 새 프록시 FQDN을 등록하고 컨테이너 호스트에 대한 세부 정보가 포함된 구성 아카이브를 생성하십시오.
zh_cn: 单击 btn:[生成] 以在 {productname} 服务器中注册新代理 FQDN，并生成包含容器主机细节的配置归档。

source: After a few moments you are presented with file to download. Save this file locally.
ja: しばらくすると、ダウンロードするファイルが表示されます。このファイルをローカルに保存します。
ko: 잠시 후 다운로드할 파일이 표시됩니다. 이 파일을 로컬에 저장하십시오.
zh_cn: 片刻之后，系统会显示文件可供下载。请将此文件保存在本地。

source: Transfer the Proxy Configuration
ja: プロキシ設定の転送
ko: 프록시 구성 전송
zh_cn: 传输代理配置

source: The {webui} generates a configuration archive. This archive needs to be made available on the Proxy container host.
ja: {webui}で、設定アーカイブが生成されます。このアーカイブは、コンテナホストで利用できるようにする必要があります。
ko: {webui}는 구성 아카이브를 생성합니다. 이 아카이브는 프록시 컨테이너 호스트에서 사용할 수 있도록 설정해야 합니다.
zh_cn: {webui} 将生成配置归档。需要在代理容器主机上提供此归档。

source: Task: Copy the Proxy configuration
ja: タスク: プロキシ設定のコピー
ko: 작업: 프록시 구성 복사
zh_cn: 任务：复制代理配置

source: scp config.tar.gz <proxy-FQDN>:/root
zh_cn: scp config.tar.gz <代理 FQDN>:/root

source: Install the Proxy with:
ja: 次のコマンドを使用してプロキシをインストールします。
ko: 다음을 사용하여 프록시 설치:
zh_cn: 使用以下命令安装代理：

source: Start the {productname} {productnumber} Proxy
ja: {productname} {productnumber}プロキシの起動
ko: {productname} {productnumber} 프록시 시작
zh_cn: 启动 {productname} {productnumber} 代理

source: Task: Start and Check Proxy Status
ja: タスク: プロキシの起動とステータスの確認
ko: 작업: 프록시 시작 및 상태 확인
zh_cn: 任务：启动代理并检查状态

source: Start the Proxy by calling:
ja: 次のコマンドを呼び出してプロキシを起動します。
ko: 다음을 호출하여 프록시 시작:
zh_cn: 调用以下命令启动代理：

source: {productname} Proxy Deployment on K3s
ko: K3s에 {productname} 프록시 배포
zh_cn: 在 K3s 上部署 {productname} 代理

source: Install Helm by using the installer script:
ko: 설치 스크립트를 사용하여 Helm을 설치합니다.
zh_cn: 使用安装程序脚本安装 Helm：

source: For more information, see https://helm.sh/docs/intro/install/#from-script.
ko: 자세한 내용은 https://helm.sh/docs/intro/install/#from-script[]에서 확인할 수 있습니다.
zh_cn: 有关详细信息，请参见 https://helm.sh/docs/intro/install/#from-script[]。

source: The [literal]``mgrpxy`` package is available in the container utils repository. Pick the one matching the distribution in: https://download.opensuse.org/repositories/systemsmanagement:/Uyuni:/Stable:/ContainerUtils/.
zh_cn: [literal]``mgrpxy`` 软件包可从容器实用程序储存库中获取。请在 https://download.opensuse.org/repositories/systemsmanagement:/Uyuni:/Stable:/ContainerUtils/ 中选择与发行套件匹配的软件包。

source: To install package on Leap Micro run:
ko: Leap Micro에 패키지를 설치하려면 다음을 실행합니다.
zh_cn: 要在 Leap Micro 上安装软件包，请运行以下命令：

source: Create the configuration for the {productname} Proxy as documented in xref:installation-and-upgrade:container-deployment/uyuni/proxy-container-setup-uyuni.adoc[]. Copy the configuration [literal]``tar.gz`` file and then install:
ja: xref:installation-and-upgrade:container-deployment/uyuni/proxy-container-setup-uyuni.adoc[]に記載されているように、{productname}プロキシの設定を作成します。設定[literal]``tar.gz``ファイルをコピーしてインストールします。
ko: xref:installation-and-upgrade:container-deployment/uyuni/proxy-container-setup-uyuni.adoc[]에서의 설명과 같이 {productname} 프록시에 대한 구성을 생성합니다. 구성 [literal]``tar.gz`` 파일을 복사한 다음 설치합니다.
zh_cn: 按照 xref:installation-and-upgrade:container-deployment/uyuni/proxy-container-setup-uyuni.adoc[] 中所述创建 {productname} 代理的配置。复制 [literal]``tar.gz`` 配置文件，然后安装：

source: For more information see:
zh_cn: 有关详细信息，请参见：

source: link:https://rancher.com/docs/k3s/latest/en/storage/[] (K3s) documentation
ko: link:https://rancher.com/docs/k3s/latest/en/storage/[] (K3s) 설명서
zh_cn: link:https://rancher.com/docs/k3s/latest/en/storage/[] (K3s) 文档

source: Legacy Proxy Migration to Container
ko: 레거시 프록시를 컨테이너로 마이그레이션
zh_cn: 将旧版代理迁移到容器

source: The containerized proxy now is managed by a set of systemd services. For managing the containerized proxy, use the [command]``mgrpxy`` tool.
ko: 컨테이너화된 프록시는 이제 일련의 systemd 서비스로 관리됩니다. 컨테이너화된 프록시를 관리하려면 [command]``mgrpxy`` 도구를 사용하십시오.
zh_cn: 容器化代理现在通过一组 systemd 服务进行管理。要管理容器化代理，请使用 [command]``mgrpxy`` 工具。

source: This section will help you migrate from the legacy [systemitem]``systemd`` proxy using the [command]``mgrpxy`` tool.
ko: 이 섹션에서는 [command] ``mgrpxy`` 도구를 사용하여 레거시 [systemitem]``systemd`` 프록시로부터 마이그레이션하는 데 도움을 줍니다.
zh_cn: 本节内容将介绍如何使用 [command]``mgrpxy`` 工具从旧版 [systemitem]``systemd`` 代理迁移。

source: An in-place migration from previous releases of {productname} to {productnumber} will remain unsupported due to the HostOS change from {leap} to {leapmicro}.
ko: {productname}의 이전 버전에서 {productnumber}(으)로의 인플레이스 마이그레이션은 호스트 OS가 {leap}에서 {leapmicro}로 변경됨에 따라 계속해서 지원되지 않습니다.
zh_cn: 由于主机操作系统已从 {leap} 更改为 {leapmicro}，因此不支持从旧版 {productname} 就地迁移到 {productnumber}。

source: The traditional contact protocol is no longer supported in {productname} {productnumber} and later. Before migrating from previous {productname} releases to {productnumber}, any existing traditional clients including the traditional proxies must be migrated to {salt}.
ko: 기존 연락 프로토콜은 {productname} {productnumber} 이상에서 더 이상 지원되지 않습니다. 기존 프록시를 포함한 모든 기존 클라이언트를 {salt}로 마이그레이션한 후 이전 {productname} 릴리스에서 {productnumber}(으)로 마이그레이션해야 합니다.
zh_cn: {productname} {productnumber} 及更高版本不再支持传统联系协议。从旧版 {productname} 迁移到 {productnumber} 之前，必须将所有现有的传统客户端（包括传统代理）迁移到 {salt}。

source: Migrate From Legacy to Containerized Proxy With Systemd
zh_cn: 使用 Systemd 从旧版迁移到容器化代理

source: Generate Proxy Configuration
ko: 프록시 구성 생성
zh_cn: 生成代理配置

source: Procedure: Generate the Proxy Configuration
ko: 절차: 프록시 구성 생성
zh_cn: 过程：生成代理配置

source: Log in to the {productname} Server {webui}.
ja: {productname}サーバの{webui}にログインします。
ko: {productname} 서버 {webui}에 로그인합니다.
zh_cn: 登录到 {productname} 服务器 {webui}。

source: Select menu:Systems[Proxy Configuration] from the left navigation.
ja: 左側のナビゲーションから、menu:システム[プロキシの設定]を選択します。
ko: 왼쪽 탐색에서 menu:시스템[프록시 구성]을 선택합니다.
zh_cn: 在左侧导航栏中，选择menu:系统[代理配置]。

source: Enter your Proxy FQDN. Use the same FQDN as the original proxy host.
ja: プロキシのFQDNを入力します。元のプロキシホストと同じFQDNを使用します。
ko: 프록시 FQDN을 입력합니다. 원래 프록시 호스트와 동일한 FQDN을 사용합니다.
zh_cn: 输入您的代理 FQDN。使用与原始代理主机相同的 FQDN。

source: Enter your Server FQDN.
ja: サーバのFQDNを入力します。
ko: 서버 FQDN을 입력합니다.
zh_cn: 输入您的服务器 FQDN。

source: Enter the Proxy port number. __We recommend using the default port of 8022.__
zh_cn: 输入代理端口号。__建议使用默认端口 8022。__

source: Certificate and private key are located on the Server container host in `/var/lib/containers/storage/volumes/root/_data/ssl-build/`.
ja: 証明書と機密鍵は、サーバコンテナホストの`/var/lib/containers/storage/volumes/root/_data/ssl-build/`にあります。
ko: 인증서와 개인 키는 서버 컨테이너 호스트의 `/var/lib/containers/storage/volumes/root/_data/ssl-build/`에 있습니다.
zh_cn: 证书和私用密钥位于服务器容器主机上的 `/var/lib/containers/storage/volumes/root/_data/ssl-build/` 中。

source: Copy the certificate and key to your machine with:
ja: 次のコマンドを使用して証明書と鍵をマシンにコピーします。
ko: 다음을 사용하여 인증서와 키를 컴퓨터로 복사합니다.
zh_cn: 使用以下命令将证书和密钥复制到您的计算机：

source: Select btn:[Choose File] and browse your local machine for the certificate.
ja: btn:[Choose File]を選択して、ローカルマシンを参照して証明書を選択します。
ko: btn:[파일 선택]을 선택하고 로컬 컴퓨터에서 인증서를 찾습니다.
zh_cn: 选择 btn:[选择文件] 并在本地计算机上通过浏览找到证书。

source: Select btn:[Choose File] and brose your local machine for the private key.
ja: btn:[Choose File]を選択して、ローカルマシンを参照して機密鍵を選択します。
ko: btn:[파일 선택]을 선택하고 로컬 컴퓨터에서 개인 키를 찾습니다.
zh_cn: 选择 btn:[选择文件] 并在本地计算机上通过浏览找到私用密钥。

source: Enter the CA password.
ja: CAのパスワードを入力します。
ko: CA 비밀번호를 입력합니다.
zh_cn: 输入 CA 口令。

source: Click btn:[Generate].
ja: btn:[生成]をクリックします。
ko: btn:[생성]을 클릭합니다.
zh_cn: 单击 btn:[生成]。

source: Transfer Proxy Configuration to New Host
ja: 新しいホストへのプロキシ設定の転送
ko: 프록시 구성을 새 호스트로 전송
zh_cn: 将代理配置传输到新主机

source: Procedure: Transfering the Proxy Configuration
ko: 절차: 프록시 구성 이전
zh_cn: 过程：传输代理配置

source: From the Server transfer the generated tar.gz file containing the proxy configuration to the new Proxy host:
ja: サーバから、プロキシ設定が含まれる、生成されたtar.gzファイルを新しいプロキシホストに転送します。
ko: 서버에서 프록시 구성이 포함된 생성된 tar.gz 파일을 새 프록시 호스트로 전송합니다.
zh_cn: 在服务器中，将生成的包含代理配置的 tar.gz 文件传输到新代理主机：

source: scp config.tar.gz <uyuni-proxy-FQDN>:/root/
zh_cn: scp config.tar.gz <uyuni 代理 FQDN>:/root/

source: Disable the legacy proxy prior to executing the next step:
ja: 次のステップを実行する前に、レガシプロキシを無効にします。
ko: 다음 단계를 실행하기 전에 레거시 프록시를 비활성화합니다.
zh_cn: 在执行下一步之前，请先禁用旧版代理：

source: Deploy the new Proxy with:
ja: 次のコマンドを使用して新しいプロキシを配備します。
ko: 다음을 사용하여 새 프록시를 배포합니다.
zh_cn: 使用以下命令部署新代理：

source: Enable the new Proxy with:
ja: 次のコマンドを使用して新しいプロキシを有効にします。
ko: 다음을 사용하여 새 프록시를 활성화합니다.
zh_cn: 使用以下命令启用新代理：

source: Run `podman ps` to verify all the containers are present and running:
ja: `podman ps`を実行して、すべてのコンテナが存在していて実行されていることを確認します。
ko: `podman ps`를 실행하여 모든 컨테이너가 있고 실행 중인지 확인합니다.
zh_cn: 运行 ``podman ps`` 来校验所有容器是否存在并正在运行：

source: Migrate {productname} Proxy to {productname} {productnumber} Containerized Proxy
ja: {productname}プロキシを{productname} {productnumber}コンテナ化プロキシに移行する
zh_cn: 将 {productname} 代理迁移到 {productname} {productnumber} 容器化代理

source: Procedure: Migrate {productname} Containerized Proxy to {productname} {productnumber} New Containerized Proxy
ko: 절차: {productname} 컨테이너화된 프록시를 {productname} {productnumber} 새 컨테이너화된 프록시로 마이그레이션
zh_cn: 过程：将 {productname} 容器化代理迁移到 {productname} {productnumber} 新容器化代理

source: Boot your new machine and begin installation of {leapmicro} {microversion}.
ja: 新しいマシンをブートし、{leapmicro} {microversion}のインストールを開始します。
ko: 새 시스템을 부팅하고 {leapmicro} {microversion} 설치를 시작합니다.
zh_cn: 引导新计算机，然后开始安装 {leapmicro} {microversion}。

source: Complete the installation.
ja: インストールを完了します。
ko: 설치를 완료합니다.
zh_cn: 完成安装。

source: Install [command]``mgrpxy`` and optionally, [command]``mgrpxy-bash-completion``:
ja: [command]``mgrpxy``と、オプションで[command]``mgrpxy-bash-completion``をインストールします。
ko: [command]``mgrpxy``와 선택적으로 [command]``mgrpxy-bash-completion``을 설치합니다.
zh_cn: 安装 [command]``mgrpxy``，并根据需要安装 [command]``mgrpxy-bash-completion``：

source: Copy your [literal]``tar.gz`` proxy configuration to the host.
ko: [literal]``tar.gz`` 프록시 구성을 호스트에 복사합니다.
zh_cn: 将 [literal]``tar.gz`` 代理配置复制到主机。

source: Install Packages Using the {webui}
ko: {webui}를 사용하여 패키지 설치
zh_cn: 使用 {webui} 安装软件包

source: The [package]``mgrpxy`` and [package]``mgrpxy-bash-completion`` packages can also be installed via the web UI after the minion has been bootstrapped and registered with the Server.
ja: [package]``mgrpxy``パッケージと[package]``mgrpxy-bash-completion``パッケージは、Minionがブートストラップされてサーバに登録された後にWeb UIでインストールすることもできます。
ko: [package]``mgrpxy`` 및 [package]``mgrpxy-bash-completion`` 패키지는 미니언이 부트스트랩되어 서버에 등록된 후 웹 UI를 통해 설치할 수도 있습니다.
zh_cn: 在受控端已引导并已注册到服务器后，还可以通过 Web UI 安装 [package]``mgrpxy`` 和 [package]``mgrpxy-bash-completion`` 软件包。

source: Procedure: Installing Packages Using the {webui}
ko: 절차: {webui}를 사용하여 패키지 설치
zh_cn: 过程：使用 {webui} 安装软件包

source: After installation, ensure that the {sle-micro} {microversion} parent channel and Proxy child channels are added and synchronized from the menu:Admin[Setup Wizard -> Products] page.
ko: 설치가 완료되면 menu:관리자[설정 마법사 -> 제품] 페이지에서 {sle-micro} {microversion} 상위 채널과 프록시 하위 채널을 추가하고 동기화합니다.
zh_cn: 安装后，确保在menu:管理[安装向导 -> 产品]页面中添加并同步 {sle-micro} {microversion} 父通道和代理子通道。

source: In the {webui}, go to menu:Systems[Activation Keys] and create an activation key linked for the synchronized {sle-micro} {microversion} channel.
ko: {webui}에서 menu:시스템[활성화 키]로 이동하여 동기화된 {sle-micro} {microversion} 채널에 연결된 활성화 키를 만듭니다.
zh_cn: 在 {webui} 中，转到menu:系统[激活密钥]，并创建一个与已同步 {sle-micro} {microversion} 通道关联的激活密钥。

source: Bootstrap your system as a minion using the menu:Systems[Bootstrapping] page.
ja: menu:システム[ブートストラップ]ページを使用して、システムをMinionとしてブートストラップします。
ko: menu:시스템[부트스트랩] 페이지를 사용하여 시스템을 미니언으로 부트스트랩합니다.
zh_cn: 使用menu:系统[引导]页面将系统作为受控端进行引导。

source: Once the new machine is onboarded and displayed in the systems list, select the system and navigate to the menu:System Details[Install Package] page.
ja: 新しいマシンがオンボーディングされてシステムリストに表示されたら、システムを選択して、menu:システムの詳細[Install Package (パッケージのインストール)]ページに移動します。
ko: 새 머신이 온보딩되어 시스템 목록에 표시되면 시스템을 선택하고 menu:시스템 세부 정보[패키지 설치] 페이지로 이동합니다.
zh_cn: 在初始配置新计算机并且其显示在系统列表中后，选择系统并导航到menu:系统细节[安装软件包]页面。

source: Install the packages [package]``mgrpxy`` and [package]``mgrpxy-bash-completion``.
ja: パッケージ[package]``mgrpxy``および[package]``mgrpxy-bash-completion``をインストールします。
ko: [package]``mgrpxy`` 및 [package]``mgrpxy-bash-completion`` 패키지를 설치합니다.
zh_cn: 安装软件包 [package]``mgrpxy`` 和 [package]``mgrpxy-bash-completion``。

source: Reboot the system.
ja: システムを再起動します。
ko: 시스템을 재부팅합니다.
zh_cn: 重引导系统。

source: Generate Proxy Config With [literal]``spacecmd`` and Self-Signed Certificate
ko: [literal]``spacecmd`` 및 자체 서명 인증서를 사용하여 프록시 구성 생성
zh_cn: 使用 [literal]``spacecmd`` 和自我签名证书生成代理配置

source: You can generate a Proxy configuration using spacecmd.
ja: spacecmdを使用してプロキシ設定を生成できます。
ko: spacecmd를 사용하여 프록시 구성을 생성할 수 있습니다.
zh_cn: 可以使用 spacecmd 生成代理配置。

source: Procedure: Generate Proxy Config With [literal]``spacecmd`` and Self-Signed Certificate
ko: 절차: [literal]``spacecmd`` 및 자체 서명 인증서를 사용하여 프록시 구성 생성
zh_cn: 过程：使用 [literal]``spacecmd`` 和自我签名证书生成代理配置

source: SSH into your container host.
ja: SSHでコンテナホストに接続します。
ko: 컨테이너 호스트에 SSH로 연결합니다.
zh_cn: 通过 SSH 连接到您的容器主机。

source: Execute the following command replacing the Server and Proxy FQDN:
ja: 次のコマンドを実行してサーバとプロキシFQDNを置き換えます。
ko: 서버 및 프록시 FQDN을 바꾸는 다음 명령을 실행합니다.
zh_cn: 执行以下命令（替换其中的服务器和代理 FQDN）：

source: Copy the generated config to the Proxy:
ja: 生成された設定をプロキシにコピーします。
ko: 생성된 구성을 프록시에 복사합니다.
zh_cn: 将生成的配置复制到代理：

source: Deploy the Proxy with:
ja: 次のコマンドを使用してプロキシを配備します。
ko: 다음을 사용하여 프록시를 배포합니다.
zh_cn: 使用以下命令部署代理：

source: Generate Proxy Config With [literal]``spacecmd`` and Custom Certificate
ko: [literal]``spacecmd`` 및 사용자 지정 인증서를 사용하여 프록시 구성 생성
zh_cn: 使用 [literal]``spacecmd`` 和自定义证书生成代理配置

source: You can generate Proxy configuration using [literal]``spacecmd`` for a custom certificates rather than default self-signed certificates.
ko: [literal]``spacecmd``를 사용하여 기본 자체 서명 인증서가 아닌 사용자 정의 인증서에 대해 프록시 구성을 생성할 수 있습니다.
zh_cn: 可以使用 [literal]``spacecmd`` 为自定义证书（而不是默认的自我签名证书）生成代理配置。

source: 2 GB represents the default proxy squid cache size. This will need to be adjusted for your environment.
ja: 2 GBはプロキシSquidのデフォルトのキャッシュサイズを表します。これは、環境に合わせて調整する必要があります。
ko: 2GB는 기본 프록시 squid 캐시 크기입니다. 사용자의 환경에 적합하도록 조정해야 합니다.
zh_cn: 2 GB 表示默认的代理 squid 缓存大小。需要根据您的环境调整此大小。

source: Procedure: Generate Proxy Config With [literal]``spacecmd`` and Custom Certificate
ko: 절차: [literal]``spacecmd`` 및 사용자 정의 인증서를 사용하여 프록시 구성 생성
zh_cn: 过程：使用 [literal]``spacecmd`` 和自定义证书生成代理配置

source: SSH into your Server container host.
ja: サーバコンテナホストにSSHで接続します。
ko: 서버 컨테이너 호스트에 SSH로 연결합니다.
zh_cn: 通过 SSH 连接到您的服务器容器主机。

source: Load the server image
zh_cn: 加载服务器映像

source: {productname} also provides all the needed container images in RPM packages that can be installed on the system.
ko: 또한 {productname}은(는) 필요한 모든 컨테이너 이미지를 시스템에 설치할 수 있는 RPM 패키지로 제공합니다.
zh_cn: {productname} 还在 RPM 软件包中提供了可在系统上安装的全部所需容器映像。

source: User should make the needed RPM available on the internal network. That can be done by using a second {productname} Server or any kind of mirror.
ko: 사용자는 필요한 RPM을 내부 네트워크에서 사용할 수 있도록 해야 합니다. 이 작업 두 번째 {productname} 서버 또는 일종의 미러를 사용하여 수행할 수 있습니다.
zh_cn: 用户应在内部网络上提供所需的 RPM。这可以通过使用第二个 {productname} 服务器或任意类型的镜像来完成。

source: Install tools packages and image packages (replace $ARCH$ with the correct architecture):
ko: 도구 패키지 및 이미지 패키지 설치($ARCH$를 올바른 아키텍처로 대체):
zh_cn: 安装工具软件包和映像软件包（将 $ARCH$ 替换为适当的体系结构）:

source: Deploy {productname} with [command]``mgradm``. In an Air-gapped environment you may want to use the option [command]``--pullPolicy Never``.
ko: {productname}을(를) [command]``mgradm``으로 배포합니다. Air-gapped 환경에서는 [command]``--pullPolicy Never`` 옵션을 사용할 수 있습니다.
zh_cn: 使用 [command]``mgradm`` 部署 {productname}。在隔离环境中，可能需要使用 [command]``--pullPolicy Never`` 选项。

source: Deployment Preparations
zh_cn: 部署准备工作

source: In this section, you will gain expertise in setting up and deploying a {productname} Server. The process encompasses the installation of [command]``Podman``, [systemitem]``Uyuni container utilities``, deployment, and then initiating interaction with the container through [command]``mgrctl``.
ja: このセクションでは、{productname}サーバのセットアップと配備に関する専門知識を身に付けることができます。このプロセスには、[command]``Podman``と[systemitem]``Uyuniコンテナユーティリティ``のインストール、配備、および[command]``mgrctl``を使用したコンテナとの対話の開始が含まれます。
ko: 이 섹션에서는 {productname} 서버 설정 및 배포에 대한 전문 지식을 습득할 수 있습니다. 이 프로세스는 [command]``Podman``, [systemitem]``Uyuni 컨테이너 유틸리티``의 설치, 배포, [command]``mgrctl``을 통해 컨테이너와의 상호작용을 시작하는 프로세스로 구성됩니다.
zh_cn: 本节介绍有关设置和部署 {productname} 服务器的专业知识。过程包括安装 [command]``Podman`` 和 [systemitem]``Uyuni 容器实用程序``、进行部署，然后通过 [command]``mgrctl`` 开始与容器交互。

source: This procedure is described below.
ko: 이 절차는 아래에 설명되어 있습니다.
zh_cn: 下面介绍此过程。

source: Installing Uyuni Tools For Use With Containers
zh_cn: 安装用于容器的 Uyuni 工具

source: For more information, see xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[].
ja: 詳細については、xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[]を参照してください。
ko: 자세한 내용은 xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关详细信息，请参见 xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[]。

source: Deploying an Uyuni Container With Podman
zh_cn: 使用 Podman 部署 Uyuni 容器

source: [command]``mgradm`` Overview
ko: [command]``mgradm`` 개요
zh_cn: [command]``mgradm`` 概述

source: {productname} is deployed as a container using the [command]``mgradm`` tool. There are two methods of deploying a {productname} server as a container. In this section we will focus on basic container deployment.
ja: {productname}は、[command]``mgradm``ツールを使用してコンテナとして配備します。{productname}サーバをコンテナとして配備する方法は2つあります。このセクションでは、基本的なコンテナ配備に焦点を当てます。
ko: [command] ``mgradm`` 도구를 사용하여 {productname}을(를) 컨테이너로 배포합니다. {productname} 서버는 2가지 방법으로 컨테이너로 배포할 수 있습니다. 이 섹션에서는 기본 컨테이너 배포를 중심으로 설명합니다.
zh_cn: 使用 [command]``mgradm`` 工具将 {productname} 部署为容器。可使用两种方法将 {productname} 服务器部署为容器。本节重点介绍基本容器部署。

source: For information on using a custom configuration file to deploy, see xref:installation-and-upgrade:container-management/mgradm-yaml-custom-configuration.adoc[].
ja: カスタム設定ファイルを使用した配備の詳細については、xref:installation-and-upgrade:container-management/mgradm-yaml-custom-configuration.adoc[]を参照してください。
ko: 사용자 정의 구성 파일을 사용하여 배포하는 방법에 대한 자세한 내용은 xref:installation-and-upgrade:container-management/mgradm-yaml-custom-configuration.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关使用自定义配置文件进行部署的信息，请参见 xref:installation-and-upgrade:container-management/mgradm-yaml-custom-configuration.adoc[]。

source: For additional information, you can explore further by running [command]``mgradm --help`` from the command line.
ja: 他の情報が必要な場合は、コマンドラインから[command]``mgradm --help``を実行すると、詳しい情報を確認できます。
ko: 자세한 내용은 명령줄에서 [command]``mgradm --help``를 실행하여 확인할 수 있습니다.
zh_cn: 可以在命令行中运行 [command]``mgradm --help`` 来了解更多信息。

source: Procedure: Deploying an Uyuni container with Podman
ja: プロシージャ: Podmanを使用してUyuniコンテナを配備する
ko: 절차: Podman을 사용한 Uyuni 컨테이너 배포
zh_cn: 过程：使用 Podman 部署 Uyuni 容器

source: From the terminal run the following command as the sudo user or as root.
ja: 端末から、sudoユーザまたはrootとして次のコマンドを実行します。
ko: 터미널에서 sudo 사용자 또는 루트로 다음 명령을 실행합니다.
zh_cn: 在终端中以 sudo 或 root 用户身份运行以下命令。

source: You must deploy the container as sudo or root. The following error will be displayed at the terminal if you miss this step.
ja: コンテナはsudoまたはrootとして配備する必要があります。このステップを省略すると、端末に次のエラーが表示されます。
ko: 컨테이너를 sudo 또는 루트로 배포해야 합니다. 이 단계를 건너뛰면 터미널에 다음과 같은 오류가 표시됩니다.
zh_cn: 必须以 sudo 或 root 用户身份部署容器。如果您遗漏此步骤，终端中将显示以下错误。

source: Many users will want to specify locations for their persistent volumes.
ja: 多くのユーザが永続ボリュームの場所を指定したいと考えています。
ko: 많은 사용자가 영구 볼륨의 위치를 지정하기를 원할 것입니다.
zh_cn: 许多用户希望指定其永久性卷的位置。

source: If you are just testing out {productname} you do not need to specify these volumes. [command]``mgradm`` will setup the correct volumes by default.
zh_cn: 如果您只是在试用 {productname}，则无需指定这些卷。默认情况下，[command]``mgradm`` 会设置正确的卷。

source: Specifying volume locations will generally be used for larger production deployments.
ja: ボリュームの場所の指定は一般的に、大規模な運用配備で使用されます。
ko: 볼륨 위치 지정은 일반적으로 대규모 프로덕션 배포에서 사용됩니다.
zh_cn: 通常只需为较大规模的生产部署指定卷位置。

source: By default [command]``podman`` stores its volumes in [path]``/var/lib/containers/storage/volumes/``.
ja: デフォルトでは、[command]``podman``はそのボリュームを[path]``/var/lib/containers/storage/volumes/``に保存します。
ko: 기본적으로 [command] ``podman``은 볼륨을 [path]``/var/lib/containers/storage/volumes/``에 저장합니다.
zh_cn: 默认情况下，[command]``podman`` 将其卷存储在 [path]``/var/lib/containers/storage/volumes/`` 中。

source: You can provide custom storage for the volumes by mounting disks on this path or the expected volume path inside it such as: [path]``/var/lib/containers/storage/volumes/var-spacewalk``. This is especially important for the database and package mirrors.
zh_cn: 可以通过将磁盘挂载到此路径或文件系统中的预期卷路径（例如 [path]``/var/lib/containers/storage/volumes/var-spacewalk``）来为卷提供自定义存储配置。这一点对于数据库和软件包镜像尤为重要。

source: For a list of all persistent volumes in the container, see:
zh_cn: 有关容器中所有永久性卷的列表，请参见：

source: Containers used by {productname}
zh_cn: {productname} 使用的容器

source: Below is a list of containers used by {productname} {productnumber}.
zh_cn: 下面列出了 {productname} {productnumber} 使用的容器。

source: Server Containers
zh_cn: 服务器容器
