Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: The reactivation key is only needed if you do not want to lose the history of the machine. If you do not use a reactivation key, the replacement proxy will become a "new" one with a new ID.
cs: Reaktivační klíč je nutný jen v případě, že nechcete přijít o historii stroje. Pokud nepoužíváte reaktivační klíč, stane se nahrazující proxy server "novým" s novým ID.
ja: 再アクティベーションキーは、マシン履歴の喪失防止でのみ必要です。再アクティベーションキーを使用しない場合、置き換えプロキシが新しいプロキシになり、新しいIDが付きます。

source: Procedure: Replacing a Proxy and Keeping the Clients Registered
cs: Postup: Výměna proxy a udržení registrace klientů
ja: プロシージャ: プロキシの置き換えとクライアントの登録状態の保持

source: Before starting the actual migration procedure, save the data from the old proxy, if needed. Consider copying important or manually created data to a central place that can also be accessed by the new proxy.
ja: 実際の移行手順を開始する前に、必要に応じて、古いプロキシからデータを保存します。新しいプロキシからもアクセスできる一元管理場所に重要データや手動で作成したデータをコピーすることを検討してください。

source: Shut down the proxy.
cs: Vypněte proxy.
ja: プロキシをシャットダウンします。

source: Deploy a new {productname} Proxy.
ja: 新しい{productname}プロキシを配備します。

source: In the {productname} {webui}, select the newly installed {productname} Proxy, and delete it from the systems list.
cs: Na {productname} {webui} vyberte nově nainstalovaný {productname} Proxy a odstraňte jej ze seznamu systémů.
ja: {productname}の{webui}で、新しくインストールした{productname}プロキシを選択し、システム一覧から選択解除します。

source: In the {webui}, create a reactivation key for the old proxy system: On the System Details tab of the old proxy click [guimenu]``Reactivation``.
cs: V {webui} vytvořte reaktivační klíč pro starý proxy systém: Na záložce System Details starého proxy klikněte na [guimenu]``Reactivation``.
ja: {webui}で、古いプロキシシステムの再アクティベーションキーを作成します。古いプロキシの［システムの詳細］タブで［[guimenu]``再アクティベーション``］をクリックします。

source: Click [guimenu]``Generate New Key``, and make a note of the new key, as you will need it later. For more information about reactivation keys, see xref:reference:systems/system-details/sd-reactivation.adoc[Reactivation Keys].
cs: Klikněte na [guimenu]``Generovat nový klíč`` a poznamenejte si nový klíč, protože jej budete později potřebovat. Další informace o reaktivačních klíčích najdete v xref:reference:systems/system-details/sd-reactation.adoc[Reactivation Keys].
ja: ［[guimenu]``新しいキーの生成``］をクリックし、新しいキーをメモします。このキーは後で必要になります。再アクティベーションキーの詳細については、xref:reference:systems/system-details/sd-reactivation.adoc[再アクティベーションキー]を参照してください。

source: OPTIONAL: After the installation of the new proxy, you might also need to:
cs: VOLITELNÉ: Po instalaci nového serveru proxy možná budete muset:
ja: オプション: 新しいプロキシをインストールした後、次の操作を実行する必要があります。

source: Copy the centrally saved data to the new proxy system
cs: Zkopírujte centrálně uložená data do nového systému proxy
ja: 一元的に保存されているデータを新しいプロキシシステムにコピーする

source: Install any other needed software
cs: Instalujte veškerý další potřebný software
ja: その他の必要なソフトウェアをインストールする

source: Set up TFTP synchronization if the proxy is used for autoinstallation
cs: Používá-li se pro automatickou instalaci proxy, nastavte synchronizaci TFTP
ja: プロキシを自動インストールに使用する場合、TFTP同期を設定する

source: During the installation of the proxy, clients will not be able to reach the {productname} Server. After you have deleted a proxy, the systems list can be temporarily incorrect. All clients that were previously connected to the proxy will show as being directly connected to the server instead. After the first successful operation on a client, such as execution of a remote command or installation of a package or patch, this information will automatically be corrected. This may take some hours.
cs: Během instalace proxy nebudou klienti schopni se dostat na server {productname}. Po odstranění serveru proxy může být seznam systémů dočasně nesprávný. Všichni klienti, kteří byli dříve připojeni k proxy, se místo toho zobrazí jako přímo připojeni k serveru. Po první úspěšné operaci na klientovi, jako je provedení vzdáleného příkazu nebo instalace balíčku nebo opravy, budou tyto informace automaticky opraveny. Může to trvat několik hodin.
ja: プロキシのインストール中、クライアントは、{productname}サーバにアクセスできなくなります。プロキシを削除した後、システム一覧は一時的に正しくなくなります。以前プロキシに接続したすべてのクライアントは、代わりにサーバに直接接続されているとして表示されます。パッケージまたはパッチのインストールやリモートコマンドを実行するなど、クライアントでの最初の操作が成功した後、この情報は自動的に修正されます。この処理には数時間かかる場合があります。

source: {productname} Server Setup
ja: {productname}サーバのセットアップ

source: This section covers {productname} Server setup, using these procedures:
cs: Tato část popisuje nastavení serveru {productname} postupy:
ja: このセクションでは、{productname}サーバの設定について説明します。次のプロシージャを使用します。

source: Start {productname} setup with {yast}
cs: Začněte instalací {productname} službou {yast}
ja: {yast}を使用して{productname}の設定を開始する

source: Create the main administration account with the {productname} {webui}
cs: Vytvořte hlavní účet správy pomocí {productname} {webui}
ja: {productname}の{webui}を使用してメイン管理者アカウントを作成する

source: Name your base organization and add login credentials
cs: Pojmenujte svou základní organizaci a přidejte přihlašovací údaje
ja: ベース組織に名前を付け、ログイン資格情報を追加する

source: Synchronize the {sle} product channel from {scclongform}
ja: {scclongform}から{sle}製品チャンネルを同期する

source: Set up {productname} with {yast} (Legacy)
ja: {yast}を使用して{productname}を設定する(レガシ)

source: This section will guide you through {productname} setup procedures.
cs: Tato část vás provede instalačními postupy {productname}.
ja: このセクションでは、{productname}の設定プロシージャについて説明します。

source: Procedure: {productname} Setup
cs: Postup: Nastavení {productname}
ja: プロシージャ: {productname}の設定

source: Log in to the {productname} Server and start {yast}.
cs: Přihlaste se k serveru {productname} a spusťte {yast}.
ja: {productname}サーバにログインし、{yast}を開始します。

source: In {yast}, navigate to menu:Network Services[Uyuni Setup] to begin the setup.
cs: V programu {yast} přejděte do menu:Network Services[Uyuni Setup] (Síťové služby [Uyuni Setup]) a zahajte instalaci.
ja: {yast}で、menu:ネットワークサービス[Uyuni Setup]（Uyuniの設定）に移動し、設定を開始します。

source: From the introduction screen select menu:Uyuni Setup[Set up Uyuni from scratch] and click btn:[Next] to continue.
cs: Na úvodní obrazovce vyberte menu:Uyuni Setup[Set up Uyuni from scratch] (Nastavení Uyuni[Nastavit Uyuni od počátku]) a pokračujte stisknutím btn:[Next] (Další).
ja: 導入画面から、menu:Uyuni Setup（Uyuniの設定）[Set up Uyuni from scratch]（Uyuniを最初から設定する）を選択し、btn:[次へ]をクリックして続行します。

source: Enter an email address to receive status notifications and click btn:[Next] to continue.
cs: Zadejte e-mailovou adresu pro zasílání oznámení o stavu a pokračujte stisknutím btn:[Next] (Další).
ja: 状態通知を受け取るメールアドレスを入力し、btn:[次へ]をクリックして続行します。

source: {productname} can sometimes send a large volume of notification emails. You can disable email notifications in the {webui} after setup, if you need to.
cs: {productname} může někdy posílat velké množství e-mailů s oznámeními. Je-li třeba, můžete po nastavení deaktivovat e-mailová oznámení na {webui}.
ja: {productname}は、大容量の通知メールを送信する場合があります。必要に応じて、設定後に{webui}のメール通知を無効にできます。

source: Enter your certificate information and a password.
cs: Zadejte informace o svém certifikátu a heslo.
ja: 証明書情報およびパスワードを入力します。

source: Passwords must be at at least seven characters in length, and must not contain spaces, single or double quotation marks (``'`` or ``"``), exclamation marks (``!``), or dollar signs (``$``). Always store your passwords in a secure location.
cs: Hesla musí mít minimálně sedm znaků a nesmí obsahovat mezery, jednoduché nebo dvojité uvozovky (``'`` nebo ``"``), vykřičníky (``! ``) ani znaky dolaru (``$``). Hesla vždy ukládejte na bezpečné místo.
ja: パスワードは7文字以上にし、スペース、一重引用符(``'``)、二重引用符(``"``)、感嘆符(``!``)、またはドル記号(``$``)は使用しないでください。パスワードは必ず安全な場所に保管してください。

source: You must have the certificate password to set up the {productname} Proxy.
cs: Pro nastavení proxy {productname} musíte mít heslo k certifikátu.
ja: {productname}プロキシを設定するには、証明書のパスワードが必要です。

source: From the menu:Uyuni Setup[Database Settings] screen, enter a database user and password and click btn:[Next] to continue.
cs: Z obrazovky menu:Uyuni Setup[Database Settings] (Nastavení Uyuni [Nastavení databáze]) zadejte uživatele a heslo databáze a pokračujte stisknutím btn:[Next] (Další).
ja: menu:Uyuni Setup（Uyuniの設定）[データベースの設定]画面から、データベースユーザおよびパスワードを入力し、btn:[次へ]をクリックして続行します。

source: Click btn:[Yes] to run setup when prompted.
cs: Po zobrazení výzvy stisknutím btn:[Yes] (Ano) spustíte instalaci.
ja: プロンプトが表示されたらbtn:[はい]をクリックして設定を実行します。

source: When setup is complete, click btn:[Next] to continue.
cs: Po dokončení instalace pokračujte stisknutím btn:[Next] (Další).
ja: 設定が完了したら、btn:[次へ]をクリックして続行します。

source: You will see the address of the {productname} {webui}.
cs: Uvidíte adresu {productname} {webui}.
ja: {productname}の{webui}のアドレスが表示されます。

source: Click btn:[Finish] to complete {productname} setup.
cs: Stisknutím btn:[Finish] (Dokončit) dokončete nastavení {productname}.
ja: btn:[完了]をクリックし、{productname}の設定を完了します。

source: Create the Main Administration Account
cs: Vytvořte účet hlavní správy
ja: メイン管理アカウントの作成

source: This section covers how to create your organization's main administration account for {productname}.
cs: Tato část pojednává o tom, jak vytvořit hlavní účet správy vaší organizace pro {productname}.
ja: このセクションでは、{productname}用の組織のメイン管理アカウントの作成方法について説明します。

source: In container-based deployments, the administration account is established as part of the deployment process, rendering this step useful exclusively to legacy installations.
ja: コンテナベースの配備の場合、管理者アカウントは配備プロセスの一部として設定されます。そのため、このステップはレガシインストールでのみ役立ちます。

source: The main administration account has the highest authority within {productname}. Ensure you keep access information for this account secure.
cs: Účet hlavní správy má nejvyšší oprávnění v rámci {productname}. Zajistěte, aby přístupové informace k tomuto účtu byly zabezpečeny.
ja: メイン管理アカウントには{productname}内で最高の権限があります。このアカウントのアクセス情報は安全に保管してください。

source: We recommend that you create lower level administration accounts for organizations and groups. Do not share the main administration access details.
cs: Doporučujeme, abyste pro organizace a skupiny vytvořili účty správy nižší úrovně. Nesdílejte přístupové údaje pro hlavní správu.
ja: 組織およびグループ用に低レベルの管理アカウントを作成することをお勧めします。メイン管理アクセスの詳細を共有しないでください。

source: Newer browser versions can block web access to the {productname} Server FQDN because of HSTS.
ja: 新しいバージョンのブラウザでは、HSTSのため、{productname}サーバFQDNへのWebアクセスがブロックされる可能性があります。

source: Installing the CA certificate from the [path]``pub`` directory via HTTP and importing it to the browser will allow access to the server.
ja: [path]``pub``ディレクトリからHTTP経由でCA証明書をインストールし、それをブラウザにインポートすると、サーバにアクセスできるようになります。

source: On the server, go to http://<server>.example.com/pub/RHN-ORG-TRUSTED-SSL-CERT.
ja: サーバで、link:http://<server>.example.com/pub/RHN-ORG-TRUSTED-SSL-CERT[]にアクセスします。

source: Import the certificate file. In the browser settings (for Firefox), open menu:Privacy & Security[Certificates > View Certificates], and import the file.
ja: 証明書ファイルをインポートします。ブラウザ設定で(Firefoxの場合)、menu:Privacy & Security (プライバシーとセキュリティ)[証明書] > [View Certificates (証明書の表示)]を開き、ファイルをインポートします。

source: Procedure: Setting Up the Main Administration Account
cs: Postup: Nastavení hlavního účtu správy
ja: プロシージャ: メイン管理アカウントの設定

source: In your web browser, enter the address for the {productname} {webui}.
cs: Ve webovém prohlížeči zadejte adresu {productname} {webui}.
ja: 使用しているWebブラウザで、{productname}の{webui}のアドレスを入力します。

source: This address was provided after you completed setup. For more information, see xref:installation-and-upgrade:uyuni-server-setup.adoc#server-setup-yast[].
ja: このアドレスは、設定完了後に提供されます。詳細については、xref:installation-and-upgrade:uyuni-server-setup.adoc#server-setup-yast[]を参照してください。

source: Log in to the {webui}, navigate to the menu:Create Organization[Organization Name] field, and enter your organization name.
cs: Přihlaste se k {webui}, přejděte do pole menu:Create Organization[Organization Name] (Vytvořit organizaci[Název organizace]) a zadejte název vaší organizace.
ja: {webui}にログインし、menu:組織の作成[組織名]フィールドに移動し、組織名を入力します。

source: In the menu:Create Organization[Desired Login] and menu:Create Organization[Desired Password] fields, enter your username and password.
cs: V polích menu:Create Organization[Desired Login] (Vytvořit organizaci [požadované přihlášení]) a menu:Create Organization[Desired Password] (Vytvořit organizaci [požadované heslo]) zadejte své uživatelské jméno a heslo.
ja: menu:組織の作成[希望のログイン]フィールドおよびmenu:組織の作成[希望のパスワード]フィールドにユーザ名とパスワードを入力します。

source: Fill in the Account Information fields including an email for system notifications.
cs: Vyplňte pole "Informace o účtu" včetně e-mailu pro systémová upozornění.
ja: システム通知用のメールなど、アカウント情報の各フィールドに記入します。

source: Click btn:[Create Organization] to finish creating your administration account.
cs: Stisknutím btn:[Create Organization] (Vytvořit organizaci) dokončete vytváření účtu správy.
ja: btn:[組織の作成]をクリックして、管理アカウントの作成を完了します。

source: When you have completed the {productname} {webui} setup, you are taken to the menu:Home[Overview] page.
cs: Po dokončení nastavení {productname} {webui} se dostanete na stránku menu:Home[Overview] (Domovská stránka [Přehled]).
ja: {productname}の{webui}の設定を完了すると、menu:ホーム[概要]ページが表示されます。

source: Optional: Synchronizing Products from {scclongform}
ja: オプション: {scclongform}の製品の同期

source: {scclongform} ({scc}) maintains a collection of repositories which contain packages, software and updates for all supported enterprise client systems. These repositories are organized into channels each of which provide software specific to a distribution, release, and architecture. After synchronizing with {scc}, clients can receive updates, be organized into groups, and assigned to specific product software channels.
ja: {scclongform} ({scc})は、サポートされているすべてのエンタープライズクライアントシステム用のパッケージ、ソフトウェア、および更新が含まれているリポジトリのコレクションを管理します。これらのリポジトリは複数のチャンネルに編成されます。各チャンネルは、ディストリビューション、リリース、およびアーキテクチャに固有のソフトウェアを提供します。{scc}と同期すると、クライアントで更新を受け取ったり、クライアントをグループに編成したり、特定の製品ソフトウェアチャンネルに割り当てたりできるようになります。

source: For Uyuni, synchronizing products from {scclongform} is optional.
ja: Uyuniでは、{scclongform}からの製品の同期はオプションです。

source: Before you can synchronize software repositories with {scc}, you will need to enter organization credentials in {productname}. The organization credentials give you access to the {suse} product downloads. You will find your organization credentials in https://scc.suse.com/organizations.
ja: ソフトウェアリポジトリを{scc}と同期する前に、{productname}に組織の資格情報を入力する必要があります。組織の資格情報があると、{suse}製品のダウンロードにアクセスできます。組織の資格情報はhttps://scc.suse.com/organizationsにあります。

source: Enter your organization credentials in the {productname} {webui}:
cs: Zaznamenejte si přihlašovací údaje své organizace do {productname} {webui}:
ja: {productname}の{webui}に組織の資格情報を入力します。

source: In the {susemgr} {webui}, navigate to menu:Main Menu[Admin > Setup Wizard].
cs: Na webu {susemgr} {webui} přejděte do menu:Main Menu[Admin>Setup Wizard] (Hlavní menu[Správce>Průvodce nastavením]).
ja: {susemgr}の{webui}で、menu:メインメニュー[管理 > セットアップウィザード]に移動します。

source: In the [guimenu]``Setup Wizard`` page, navigate to the btn:[Organization Credentials] tab.
cs: Na stránce [guimenu]``Setup Wizard`` (Průvodce nastavením) najděte kartu btn:[Organization Credentials] (Pověření organizace).
ja: ［[guimenu]``セットアップウィザード``］ページで、btn:[組織の資格情報]タブに移動します。

source: Enter a username and password, and click btn:[Save].
cs: Zadejte uživatelské jméno a heslo a stiskněte btn:[Save] (Uložit).
ja: ユーザ名およびパスワードを入力し、btn:[保存]をクリックします。

source: A check mark icon is shown when the credentials are confirmed. When you have successfully entered the new credentials, you can synchronize with {scclongform}.
ja: 資格情報が確認されると、チェックマークアイコンが表示されます。新しい資格情報を正しく入力すると、{scclongform}と同期できます。

source: In the {productname} {webui}, navigate to menu:Admin[Setup Wizard].
cs: Na webu {productname} {webui} přejděte do menu:Admin[Setup Wizard] (Správce[Průvodce nastavením]).
ja: {productname}の{webui}で、menu:管理[セットアップウィザード]に移動します。

source: From the [guimenu]``Setup Wizard`` page select the btn:[SUSE Products] tab.
cs: Na stránce [guimenu]``Setup Wizard`` (Průvodce nastavením) vyberte kartu btn:[SUSE Products].
ja: ［[guimenu]``セットアップウィザード``］ページから、btn:[SUSE製品]タブを選択します。

source: Wait a moment for the products list to populate. If you previously registered with {scclongform} a list of products will populate the table. This table lists architecture, channels, and status information. For more information, see xref:reference:admin/setup-wizard.adoc[Wizard].
ja: 製品一覧が入力されるまで待機します。以前{scclongform}で登録したことがある場合、製品の一覧が表に入力されます。この表は、アーキテクチャ、チャンネル、状態の各情報を一覧表示します。詳細については、xref:reference:admin/setup-wizard.adoc[ウィザード]を参照してください。

source: If your {sle} client is based on [systemitem]``x86_64`` architecture scroll down the page and select the check box for this channel now.
cs: Je-li váš klient {sle} založen na architektuře [systemitem]``x86_64``, posuňte stránku dolů a zaškrtněte políčko u tohoto kanálu.
ja: {sle}クライアントが[systemitem]``x86_64``アーキテクチャに基づいている場合、ページをスクロールして下に移動し、このチャンネルのチェックボックスを付けます。

source: Add channels to {productname} by selecting the check box to the left of each channel.
cs: Přidejte kanály do {productname} zaškrtnutím políčka nalevo od každého kanálu.
ja: {productname}にチャンネルを追加します。そのためには、各チャンネルの左にあるチェックボックスにチェックを付けます。

source: Click the arrow symbol to the left of the description to unfold a product and list available modules.
cs: Kliknutím na symbol šipky vlevo od popisu rozbalíte produkt a zobrazíte seznam dostupných modulů.
ja: 説明の左にある矢印をクリックして、製品を展開し、使用できるモジュールを一覧表示します。

source: Click btn:[Add Products] to start product synchronization.
cs: Kliknutím na btn:[Add Products] (Přidat produkty) spustíte synchronizaci produktu.
ja: btn:[製品の追加]をクリックして、製品の同期を開始します。

source: After adding the channel, {productname} will schedule the channel to be synchronized. This can take a long time as {productname} will copy channel software sources from the {suse} repositories located at {scclongform} to local [path]``/var/spacewalk/`` directory of your server.
ja: チャンネルを追加した後、{productname}は、チャンネルの同期をスケジュールします。この処理には時間がかかる場合があります。その理由は、{scclongform}にある{suse}リポジトリからサーバのローカル[path]``/var/spacewalk/``ディレクトリにチャンネルソフトウェアソースを{productname}でコピーするためです。

source: In some environments, transparent huge pages provided by the kernel can slow down PostgreSQL workloads significantly.
cs: V některých prostředích mohou transparentní obrovské stránky poskytované jádrem výrazně zpomalit pracovní zatížení PostgreSQL.
ja: 環境によっては、カーネルが提供する透過的なHuge Pageによって、PostgreSQLのワークロードが大幅に低速になる場合があります。

source: To disable transparent huge pages, set the [parameter]``transparent_hugepage`` kernel parameter to ``never``. You will also need to open the [path]``/etc/default/grub`` file and add or edit the line [option]``GRUB_CMDLINE_LINUX_DEFAULT``. For example:
cs: Chcete-li zakázat transparentní obří stránky, nastavte parametr jádra [parametr]``transparent_hugepage`` na ``never`` (nikdy). Budete také muset otevřít soubor [path]``/etc/default/grub`` a přidat nebo upravit řádek [option]``GRUB_CMDLINE_LINUX_DEFAULT``. Například:
ja: 透過的なHuge Pageを無効にするには、[parameter]``transparent_hugepage``カーネルパラメータを``never``に設定します。[path]``/etc/default/grub``ファイルを開き、行[option]``GRUB_CMDLINE_LINUX_DEFAULT``を追加または編集する必要もあります。例:

source: To write the new configuration run [command]``grub2-mkconfig -o /boot/grub2/grub.cfg``.
cs: Chcete-li napsat novou konfiguraci, spusťte [command]``grub2-mkconfig -o /boot/grub2/grub.cfg``.
ja: 新しい設定を書き込むには、[command]``grub2-mkconfig -o /boot/grub2/grub.cfg``を実行します。

source: Monitor the channel synchronization process in real-time by viewing channel log files located in the directory [path]``/var/log/rhn/reposync``:
cs: Sledujte proces synchronizace kanálu v reálném čase prohlížením souborů protokolu kanálu umístěných v adresáři [path]``/var/log/rhn/reposync``:
ja: チャンネル同期プロセスをリアルタイムでモニタします。そのためには、ディレクトリ[path]``/var/log/rhn/reposync``にあるチャンネルログファイルを表示します。

source: When the channel synchronization process is complete, you can continue with client registration. For more instructions, see xref:client-configuration:registration-overview.adoc[].
cs: Po dokončení procesu synchronizace kanálu můžete pokračovat v registraci klienta. Další pokyny viz xref:client-configuration:registration-overview.adoc[].
ja: チャンネル同期プロセスが完了したら、クライアントの登録に進むことができます。詳細手順については、xref:client-configuration:registration-overview.adoc[]を参照してください。

source: [literal]``SL Micro 6.1`` + [literal]``{productname} Proxy Extension {productnumber}``
ko: {productname} {productnumber} 확장형 프록시

source: [literal]``{productname} Proxy Extension for SLE 5.1``
ko: {productname} 프록시 확장

source: [literal]``SUSE Multi-Linux Manager Proxy 5.1 Extension for SLE``
ko: {productname} 서버 확장

source: transactional-update pkg install mgrpxy* mgrctl* suse-multi-linux-manager-5.1-$ARCH$-proxy-*
ko: transactional-update pkg install mgrpxy* mgrctl* suse-manager-5.0-$ARCH$-proxy-*

source: transactional-update pkg install mgradm* mgrctl* suse-multi-linux-manager-5.1-$ARCH$-server-*
ko: transactional-update pkg install mgradm* mgrctl* suse-manager-5.0-$ARCH$-server-*

source: # allocate 8GiB for swap file fallocate -l 8G /var/swap # ensure CoW is disabled for the swap file chattr +C /var/swap # allow only root access chmod 600 /var/swap # make swap file based on allocated file mkswap /var/swap # activate swap use for the running system swapon /var/swap # activate swap during the next boots echo "/var/swap swap swap defaults 0 0" >> /etc/fstab
ko: # 스왑 파일에 8GiB 할당 fallocate -l 8G /var/swap # 스왑 파일에 대해 CoW(Copy-on-Write)가 비활성화되었는지 확인 chattr +C /var/swap # 루트 액세스만 허용 chmod 600 /var/swap # 할당된 파일을 기반으로 스왑 파일 생성 mkswap /var/swap # 실행 중인 시스템에 대한 스왑 사용 활성화 swapon /var/swap # 다음 부팅 시 스왑 활성화 echo "/var/swap swap swap defaults 0 0" >> /etc/fstab

source: xref:uyuni-install-requirements.adoc[Requirements]
cs: xref:uyuni-install-requirements.adoc[Požadavky instalace]

source: xref:ports.adoc[Required Network Ports]
cs: xref:ports.adoc[Nezbytné porty]

source: xref:client-requirements.adoc[Client Requirements]
cs: xref:client-requirements.adoc[Požadavky na klienty]

source: xref:install-intro.adoc[Installation]
cs: xref:install-intro.adoc[Instalace]

source: xref:install-server-unified.adoc[Install Server]
cs: xref:install-server-unified.adoc[Instalace Server]

source: xref:install-proxy-unified.adoc[Install Proxy]
cs: xref:install-proxy-unified.adoc[Instalace Proxy]

source: xref:install-uyuni.adoc[Install Uyuni Server with openSUSE]
cs: xref:install-uyuni.adoc[Instalace Uyuni serveru s openSUSE]

source: xref:install-proxy-uyuni.adoc[Install Uyuni Proxy with openSUSE]
cs: xref:install-proxy-uyuni.adoc[Instalace Uyuni Proxy s openSUSE]

source: xref:install-proxy.adoc[Install Proxy from Packages]
cs: xref:install-proxy.adoc[Instalace Proxy z balíčků]

source: xref:install-pubcloud.adoc[Install on Public Cloud]
cs: xref:install-pubcloud.adoc[Instalovat na Public Cloud]

source: xref:server-setup.adoc[Server Setup]
cs: xref:server-setup.adoc[Server Setup] (Nastavení serveru)

source: xref:uyuni-server-setup.adoc[Uyuni Server Setup]
cs: xref:uyuni-server-setup.adoc[Uyuni Server Setup] (Nastavení serveru Uyuni)

source: xref:proxy-registration.adoc[Proxy Registration]
cs: xref:proxy-registration.adoc[Proxy Registration] (Registrace Proxy)

source: xref:proxy-setup.adoc[Proxy Setup]
cs: xref:proxy-setup.adoc[Nastavení Proxy]

source: xref:uyuni-proxy-registration.adoc[Uyuni Proxy Registration]
cs: xref:uyuni-proxy-registration.adoc[Uyuni Proxy Registration] (Registrace Uyuni Proxy)

source: xref:uyuni-proxy-setup.adoc[Uyuni Proxy Setup]
cs: xref:uyuni-proxy-setup.adoc[Nastavení Uyuni Proxy]

source: xref:pubcloud-setup.adoc[Public Cloud Setup]
cs: xref:pubcloud-setup.adoc[Public Cloud Setup] (Nastavení veřejného cloudu)
