Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: For more information about configuring the hostname and DNS, see https://documentation.suse.com/sles/15-SP3/html/SLES-all/cha-network.html#sec-network-yast-change-host.
cs: Další informace o konfiguraci názvu hostitele a DNS najdete na adrese https://documentation.suse.com/sles/15-SP3/html/SLES-all/cha-network.html#sec-network-yast-change-host.

source: For more information about setting up a DNS server, see https://documentation.suse.com/sles/15-SP3/html/SLES-all/cha-dns.html.
cs: Další informace o nastavení serveru DNS najdete na adrese https://documentation.suse.com/sles/15-SP3/html/SLES-all/cha-dns.html.

source: Using a Proxy When Installing from {sle} Media
cs: Použití proxy při instalaci z média {sle}

source: If you are on an internal network and do not have access to {scc}, you can set up and use a proxy during installation.
cs: Je-li Váš klient v interní síti a nemá přístup k {scc}, můžete během instalace nastavit a použít proxy.

source: For more information about configuring a proxy for access to {scc} during a {sle} installation, see https://documentation.suse.com/sles/15-SP3/html/SLES-all/cha-boot-parameters.html#sec-boot-parameters-advanced-proxy.
cs: Další informace o konfiguraci proxy pro přístup k {scc} během instalace {sle} najdete na adrese https://documentation.suse.com/sles/15-SP3/html/SLES-all/cha-boot-parameters.html#sec-boot-parameters-advanced-proxy.

source: The hostname of {productname} must not contain uppercase letters as this may cause _jabberd_ to fail. Choose the hostname of your {productname} server carefully. Although changing the server name is possible and supported, it is important to plan for this change before going ahead with it. When you change the hostname of the server, all clients attached to the server must be made aware of the change.
cs: Název hostitele {productname} nesmí obsahovat velká písmena, protože by to mohlo způsobit selhání _jabberd_. Pečlivě vyberte název hostitele serveru {productname}. Ačkoli je změna názvu serveru možná a podporovaná, je důležité tuto změnu naplánovat, než s ní budete pokračovat. Když změníte název (v síti) hostitele serveru, je třeba o změně informovat všechny klienty připojené k serveru.

source: This image shows the main ports used in {productname}:
cs: Tento obrázek ukazuje hlavní porty používané v produktu {productname}:

source: | Port number | Protocol | Used By | Notes | 80 | TCP | HTTP | Required for {scc}. Port 80 is not used to serve the {webui}. | 443 | TCP | HTTPS | Required for {scc}. | 5269 | TCP | jabberd | Required to push actions to and from a proxy. | 25151 | TCP | Cobbler |
cs: | Číslo portu | Protokol | Použit | Poznámky | 80 | TCP | HTTP | Nutný pro {scc}. Port 80 není použit pro službu {webui}. | 443 | TCP | HTTPS | Nutný pro {scc}. | 5269 | TCP | jabberd | Nutný pro zasílání akcí do a z proxy. | 25151 | TCP | Cobbler |

source: | Port number | Notes | 2828 | Satellite-search API, used by the RHN application in Tomcat and Taskomatic. | 2829 | Taskomatic API, used by the RHN application in Tomcat. | 8005 | Tomcat shutdown port. | 8009 | Tomcat to Apache HTTPD (AJP). | 8080 | Tomcat to Apache HTTPD (HTTP). | 9080 | Salt-API, used by the RHN application in Tomcat and Taskomatic. | 32000 | Port for a TCP connection to the Java Virtual Machine (JVM) that runs Taskomatic and satellite-search.
cs: | Číslo portu | Poznámky | 2828 | Satellite-search (hledání satelitu) API, použito aplikací RHN v Tomcat a Taskomatic. | 2829 | Taskomatic API, použito aplikací RHN v Tomcat. | 8005 | Tomcat port pro ukončení. | 8009 | Tomcat do Apache HTTPD (AJP). | 8080 | Tomcat do Apache HTTPD (HTTP). | 9080 | Salt-API, použito aplikací RHN v Tomcat a Taskomatic. | 32000 | Port pro TCP spojení do Java Virtual Machine (JVM), kde běží Taskomatic a satellite-search (hledání satelitu).

source: | Port number | Protocol | Used By | Notes | 22 | | | Required for ssh-push and ssh-push-tunnel contact methods. Clients connected to the proxy initiate check in on the server and hop through to clients. | 67 | TCP/UDP | DHCP | Required only if clients are requesting IP addresses from the server. | 69 | TCP/UDP | TFTP | Required if the server is used as a PXE server for automated client installation. | 443 | TCP | HTTPS | {webui}, client, and server and proxy (``tftpsync``) requests. | 4505 | TCP | salt | Required to accept communication requests from clients. The client initiates the connection, and it stays open to receive commands from the Salt master. | 4506 | TCP | salt | Required to accept communication requests from clients. The client initiates the connection, and it stays open to report results back to the Salt master. | 5222 | TCP | | Required to push OSAD actions to clients. | 5269 | TCP | | Required to push actions to and from the server.
cs: | Číslo portu | Protokol | Použit | Poznámky | 22 | | | Nutný pro kontaktní metody ssh-push a ssh-push-tunnel. Klienty připojené na proxy zahajují check in na serveru a průchod ke klientům. | 67 | TCP/UDP | DHCP | Nutné, vyžadují-li klienty IP adresy ze serveru. | 69 | TCP/UDP | TFTP | Nutné, je-li server použit jako PXE server pro automatickou instalaci klienta. | 443 | TCP | HTTPS | Požadavky {webui}, klienta, serveru a proxy (``tftpsync``). | 4505 | TCP | salt | Nutné pro příjem komunikačních požadavků od klientů. Klient navazuje spojení, které zůstává otevřené pro příjem příkazů ze Salt master. | 4506 | TCP | salt | Nutné pro příjem komunikačních požadavků od klientů. Klient navazuje spojení, které zůstává otevřené pro hlášení výsledků zpět do Salt master. | 5222 | TCP | | Nutné pro zasílání akcí OSAD klientům. | 5269 | TCP | | Nutné pro zasílání akcí do a ze serveru.

source: | Port number | Protocol | Used By | Notes | 80 | | | Used to reach the server. | 443 | TCP | HTTPS | Required for {scc}. | 5269 | TCP | | Required to push actions to and from the server.
cs: | Číslo portu | Protokol | Použit | Poznámky | 80 | | | K dosažení serveru. | 443 | TCP | HTTPS | Nutné pro {scc}. | 5269 | TCP | | Nutné pro zasílání akcí do a ze serveru.

source: | Port number | Direction | Protocol | Notes | 22 | Inbound | SSH | Required for ssh-push and ssh-push-tunnel contact methods. | 80 | Outbound | | Used to reach the server or proxy. | 5222 | Outbound | TCP | Required to push OSAD actions to the server or proxy. | 9090 | Outbound | TCP | Required for Prometheus user interface. | 9093 | Outbound | TCP | Required for Prometheus alert manager. | 9100 | Outbound | TCP | Required for Prometheus node exporter. | 9117 | Outbound | TCP | Required for Prometheus Apache exporter. | 9187 | Outbound | TCP | Required for Prometheus PostgreSQL.
cs: | Číslo portu | Směr | Protokol | Poznámky | 22 | Dovnitř | SSH | Nutný pro kontaktní metody ssh-push a ssh-push-tunnel. | 80 | Ven | | Použit k dosažení serveru nebo proxy. | 5222 | Ven | TCP | Nutný pro zasílání akcí OSAD do serveru nebo proxy. | 9090 | Ven | TCP | Nutný pro uživatelské rozhraní Prometheus. | 9093 | Ven | TCP | Nutný pro správce výstrah Prometheus. | 9100 | Ven | TCP | Nutný pro exportér uzlu Prometheus. | 9117 | Ven | TCP | Nutný pro exportér Apache Prometheus. | 9187 | Ven | TCP | Nutný pro PostgreSQL Prometheus.

source: For more information about troubleshooting firewall access for non-{suse} clients, see xref:administration:tshoot-firewalls.adoc[].
cs: Další informace o řešení potíží s přístupem k bráně firewall pro klienty, kteří nejsou uživateli {suse}, najdete na stránce xref:administration:tshoot-firewalls.adoc[].

source: Proxy - Upgrade with AutoYaST
cs: Proxy - upgrade pomocí AutoYaST

source: {productname} Proxy can be upgraded from one major version to the next. The upgrade process is automated, but you will need to do some preparation steps before you can upgrade.
cs: Proxy server {productname} lze upgradovat z jedné hlavní verze na další. Proces upgradu je automatizovaný, ale před upgradem budete muset provést několik přípravných kroků.

source: You will need to complete the {productname} Server Upgrade before you start.
cs: Než začnete, musíte upgradovat {productname} Server.

source: The old system must be running {productname} Proxy with all the latest updates applied. Before you start, ensure that the system is up to date and all updates have been installed successfully.
cs: Ve starém systému musí být spuštěn {productname} Proxy se všemi nejnovějšími aktualizacemi. Než začnete, ujistěte se, že je systém aktuální a všechny aktualizace byly úspěšně nainstalovány.

source: Before you can update your proxy, you will need an autoinstallation distribution, and an autoinstallation profile. The distribution must be based on openSUSE Leap{nbsp}{opensuse-version}.
cs: Před aktualizací proxy budete potřebovat distribuci automatické instalace a profil automatické instalace. Distribuce musí být založena na openSUSE Leap{nbsp}{opensuse-version}.

source: Procedure: Preparing Installation Media
cs: Postup: Příprava instalačního média

source: On the {productname} Server, create a local directory for the openSUSE Leap{nbsp}{opensuse-version} installation media:
cs: Na {productname} Serveru vytvořte místní adresář pro instalační médium openSUSE Leap{nbsp}{opensuse-version}:

source: Download an ISO image with the installation sources, and mount the ISO image on your server:
cs: Stáhněte obraz ISO s instalačními zdroji a připojte ho ke svému serveru:

source: Copy everything from the mounted ISO to your local file system:
cs: Zkopírujte vše z připojeného ISO do místního systému souborů:

source: When the copy is complete, unmount the ISO image:
cs: Po dokončení kopie odpojte obraz ISO:

source: Procedure: Adding Software Channels at the Command Prompt
cs: Postup: Přidání softwarových kanálů z příkazového řádku

source: Procedure: Creating an Autoinstallation Distribution
cs: Postup: Vytvoření distribuce automatické instalace

source: In the {productname} {webui}, navigate to menu:Systems[Autoinstallation > Distributions] and click btn:[Create Distribution].
cs: Na {productname} {webui} přejděte do menu:Systems[Autoinstallation > Distributions] (Systémy[Automatická instalace > Distribuce]) a stiskněte btn:[Create Distribution] (Vytvořit distribuci).

source: In the [guimenu]``Create Autoinstallable Distribution`` section, use these parameters:
cs: V sekci [guimenu]``Create Autoinstallable Distribution`` (Vytvořit automaticky instalovatelnou distribuci) použijte tyto parametry:

source: In the [guimenu]``Distribution Label`` section, type a unique name for the distribution.
cs: V sekci [guimenu]``Distribution Label`` (Štítek distribuce) zadejte jedinečný název distribuce.

source: In the [guimenu]``Tree Path`` field, type an absolute path to the installation source.
cs: Do pole [guimenu]``Tree Path`` (Cesta ve stromu) zadejte absolutní cestu ke zdroji instalace.

source: In the [guimenu]``Installer Generation`` field, select [systemitem]``SUSE Linux``.
cs: V poli [guimenu]``Installer Generation`` (Generování instalátoru) vyberte [systemitem]``SUSE Linux``.

source: In the [guimenu]``Kernel Options`` field, type any options to be passed to the kernel when booting for the installation.
cs: Do pole [guimenu]``Kernel Options`` (Možnosti jádra) zadejte všechny možnosti, které mají být předány jádru při bootování instalace.

source: The [option]``install=`` parameter and the [option]``self_update=0 pt.options=self_update`` parameter are added by default.
cs: Ve výchozím nastavení jsou přidány parametry [option]``install=`` a [option]``self_update=0 pt.options=self_update``.

source: In the [guimenu]``Post Kernel Options`` section, type any options to be passed to the kernel when booting the installed system for the first time.
cs: V sekci [guimenu]``Post Kernel Options`` (zaslat volby jádra) zadejte všechny možnosti, které mají být předány jádru při prvním spuštění nainstalovaného systému.

source: Click btn:[Create Autoinstallable Distribution] to save.
cs: Uložte stisknutím tlačítka: [Create Autoinstallable Distribution] (Vytvořit automaticky instalovatelnou distribuci).

source: When you have created an autoinstallable distribution, you can edit it by navigating to menu:Systems[Autoinstallation > Distributions] and selecting the distribution you want to edit.
cs: Když jste vytvořili automaticky instalovatelnou distribuci, můžete ji upravit tak, že přejdete do menu:Systems[Autoinstallation > Distributions] (Systémy [Automatická instalace > Distribuce]) a vyberete distribuci, kterou chcete upravit.

source: Create an Autoinstallation Profile
cs: Vytvořte profil automatické instalace

source: Autoinstallation profiles contain all the installation and configuration data needed to install a system. They can also contain scripts to be executed after the installation is complete. For example scripts that you can use as a starting point, see https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST. For valid AutoYaST upgrade settings, see https://doc.opensuse.org/projects/autoyast/#CreateProfile-upgrade.
cs: Profily automatické instalace obsahují všechna instalační a konfigurační data potřebná k instalaci systému. Mohou také obsahovat skripty, které se mají spustit po dokončení instalace. Například skripty, které můžete použít jako výchozí bod viz https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST. Platné nastavení upgradu AutoYaST viz https://doc.opensuse.org/projects/autoyast/#CreateProfile-upgrade.

source: Procedure: Creating an Autoinstallation Profile
cs: Postup: Vytvoření profilu automatické instalace

source: In the {productname} {webui}, navigate to menu:Systems[Autoinstallation > Profiles] and upload your autoinstallation profile script.
cs: Na webu {productname} {webui} přejděte do menu:Systems[Autoinstallation > Profiles] (Systémy [Automatická instalace > Profily]) a nahrajte skript profilu automatické instalace.

source: For example scripts that you can use as a starting point, see https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST.
cs: Například skripty, které lze použít jako výchozí, jsou na https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST.

source: In the ``Kernel Options`` field, type ``autoupgrade=1``.
cs: Do pole ``Možnosti jádra`` napište ``autoupgrade = 1``.

source: Optionally, you can also include the ``Y2DEBUG=1`` option. The debug setting is not required but can help with investigating any future problems you might encounter.
cs: Volitelně můžete zahrnout také možnost ``Y2DEBUG=1``. Nastavení ladění není vyžadováno, ale může pomoci při vyšetřování budoucích problémů, se kterými se můžete setkat.

source: Paste the autoinstallation profile or use the file upload field.
cs: Vložte profil automatické instalace nebo použijte pole pro nahrávání souborů.

source: Click btn:[Create] to save.
cs: Uložte stisknutím na btn:[Create] (Vytvořit).

source: When the uploaded profile requires variables to be set, navigate to menu:Systems[Autoinstallation > Profiles], select the profile to edit, and navigate to the [guimenu]``Variables`` tab.
cs: Vyžaduje-li nahraný profil nastavit proměnné, přejděte do menu:Systems[Autoinstallation > Profiles] (Systémy[Automatická instalace > Profily]), vyberte profil, který chcete upravit, a přejděte na kartu [guimenu]``Variables`` (Proměnné).

source: Specify the required variables, using this format:
cs: Zadejte požadované proměnné použitím tohoto formátu:

source: For proxies that were registered using Salt, use the ``spacewalk/minion_script`` snippet to register the proxy again after upgrade has completed.
cs: Pro proxy, které byly registrovány pomocí Salt, použijte fragment ``spacewalk/minion_script``, kterým znovu zaregistrujte proxy po dokončení upgradu.

source: Upgrade
cs: Upgrade (povýšení verze)

source: Before you begin, check that all the channels referenced in the autoinstallation profile are available and fully synchronized.
cs: Než začnete, zkontrolujte, zda jsou všechny kanály odkazované v profilu automatické instalace dostupné a plně synchronizované.

source: Procedure: Upgrading
cs: Postup: Aktualizace

source: On the {productname} Server {webui}, navigate to menu:Systems[System List], select the proxy, navigate to the [guimenu]``Provisioning`` tab, and select the autoinstallation profile you uploaded.
cs: Na {productname} Server {webui} přejděte do menu:Systems[System List] (Systémy[Seznam systémů]), vyberte proxy, přejděte na kartu [guimenu]``Provisioning` (Zajišťování) a vyberte profil automatické instalace, který jste nahráli.

source: Click btn:[Schedule Autoinstallation and Finish].
cs: Stiskněte na btn:[Schedule Autoinstallation and Finish] (Naplánovat automatickou instalaci a skončit).

source: The system will download the required files, change the bootloader entries, reboot, and start the upgrade.
cs: Systém stáhne požadované soubory, změní položky bootloaderu, restartuje počítač a zahájí aktualizaci.

source: Clean Up
cs: Vyčlstění

source: When the {productname} Proxy has finished upgrading, it shows the originally assigned channels. Cleaning up after the migration ensures the correct channels are shown.
cs: Po dokončení aktualizace {productname} Proxy se zobrazí původně přiřazené kanály. Vyčistění po migraci zajistí, že se zobrazí správné kanály.

source: If the server reports that there are updates available for the proxy, do not apply them before completing the cleanup.
cs: Pokud server hlásí, že jsou k dispozici aktualizace pro proxy server, aplikujte je až po dokončení čištění.

source: Procedure: Cleaning Up
cs: Postup: Vyčistění

source: On the {productname} Server {webui}, navigate to the [guimenu]``System List``, select the proxy, and navigate to the menu:Software[Software Channels] subtab.
cs: Na {productname} Server {webui} přejděte do [guimenu]``System List`` (Seznam systémů), vyberte proxy a přejděte do podpoložky menu:Software[Software Channels] (Software [Softwarové kanály]).

source: Clear the old channels.
cs: Vymažte staré kanály.

source: In the [guimenu]``Child Channels`` field, select all the recommended channels.
cs: V poli [guimenu]``Child Channels`` (Podřízené kanály) vyberte všechny doporučené kanály.

source: {productname} Proxies are managed in the same way as clients. Maintenance updates (MU) can be installed on the {productname} Proxy in the same way as other clients. MU updates require a restart of the proxy service.
cs: {productname} Proxy jsou spravovány stejně jako klienty. Aktualizace údržby (Maintenance Updates, MU) lze na {productname} Proxy nainstalovat stejným způsobem jako ostatní klienty. Aktualizace MU vyžadují restart služby proxy.

source: {productname} uses an [literal]``X.Y.Z`` versioning schema. To determine which upgrade procedure you need, look at which part of the version number is changing.
cs: {productname} používá verzovací schéma [literal]``X.Y.Z``. Chcete-li zjistit, který postup upgradu potřebujete, podívejte se, která část čísla verze se mění.

source: Major Version Upgrade (X Upgrade)
cs: Upgrade hlavní verze (upgrade X)

source: Minor Version Upgrade (Y Upgrade)
cs: Upgrade menší verze (upgrade Y)

source: Patch Level Upgrade (Z Upgrade)
cs: Upgrade úrovně záplaty (upgrade Z)

source: The upgrade procedure to {productnumber} can either be a major or a minor upgrade. For more information, see the {productname} {productnumber} release notes.
cs: Postup aktualizace na {productnumber} může být buď hlavní, nebo vedlejší aktualizace. Další informace najdete v poznámkách k verzi {productname} {productnumber}.

source: Major Upgrade
cs: Hlavní aktualizace

source: See xref:proxy-uyuni.adoc[].
cs: Viz xref:proxy-uyuni.adoc[].

source: Minor Upgrade
cs: Vedlejší aktualizace

source: See xref:proxy-minor-uyuni.adoc[].
cs: Viz xref:proxy-minor-uyuni.adoc[].

source: SUSE Manager Proxy Registration
cs: Registrace proxy SUSE Manageru

source: After the Salt client is succesfully bootstrapped, it needs to be configured as {productname} Proxy.
cs: Po úspěšném zavedení (bootstrapu) klienta Salt je třeba jej konfigurovat jako {productname} Proxy.

source: Before you can select the correct child channels while creating the activation key, ensure you have completely downloaded the {productname} Proxy {productnumber} channel and all the recommended and mandatory {sle} {sles-version} {sp-version} channels.
cs: Než budete moci při vytváření aktivačního klíče vybrat správné podřízené kanály, ujistěte se, že jste si úplně stáhli kanál {productname} Proxy {productnumber} a všechny doporučené a povinné kanály {sle} {sles-version} {sp-version}.

source: Proxy activation key
cs: Aktivační klíč proxy

source: Base and Child Proxy Channel
cs: Základní a podřízený kanál proxy

source: Modifying bootstrap script
cs: Úpravy skriptu pro bootstrap

source: Alternatively, in the SUSE Manager Web UI, navigate to menu:System[Bootstrapping].
cs: Případně ve webovém uživatelském rozhraní SUSE Manager přejděte do menu:System[Bootstrapping].

source: Bootstrapping a proxy from GUI
cs: Zavedení proxy z grafického uživatelského rozhraní

source: Proxy Channels
cs: Proxy kanály

source: Continue with setting up the registered {productname} Proxy: xref:proxy-setup.adoc[].
cs: Pokračujte v nastavení registrovaného proxy {productname}: xref:proxy-setup.adoc[].

source: SUSE Manager Proxy Setup
cs: Nastavení SUSE Manager Proxy

source: It is possible to arrange Salt proxies in a chain. In such a case, the upstream proxy is named `parent`.
cs: Je možné uspořádat více Salt proxy do řetězce. V takovém případě se nadřazený proxy jmenuje `rodič`.

source: Create and Populate Configuration Channel rhn_proxy_config_1000010001?
cs: Vytvořit a otevřít konfigurační kanál rhn_proxy_config_1000010001?

source: Accept default ``Y``.
cs: Přijměte výchozí ``Y``.

source: SUSE Manager Username
cs: Uživatelské jméno pro SUSE Manager

source: Use same user name and password as on the {productname} server.
cs: Použijte stejné uživatelské jméno a heslo jako na serveru {productname}.

source: configure-tftpsync.sh FQDN_of_Proxy
cs: configure-tftpsync.sh FQDN_adresa_Proxy

source: It can also be done after a change within Cobbler that needs to be synchronized immediately. Otherwise Cobbler synchronization will run automatically when needed. For more information about autoinstallation powered by Cobbler, xref:client-configuration:autoinst-intro.adoc[Operating System Installation].
cs: Lze to provést také po změně v Cobbleru, kterou je třeba okamžitě synchronizovat. Jinak bude synchronizace Cobbleru spuštěna automaticky v případě potřeby. Další informace o autoinstalaci přes Cobbler najdete v xref:client-configuration:autoinst-intro.adoc[Operating System Installation].

source: Configure DHCP for PXE through {productname} Proxy
cs: Konfigurujte DHCP pro PXE prostřednictvím serveru {productname} Proxy

source: {productname} uses Cobbler for client provisioning. PXE (tftp) is installed and activated by default. Clients must be able to find the PXE boot on the {productname} Proxy using DHCP. Use this DHCP configuration for the zone that contains the clients to be provisioned:
cs: {productname} používá pro správu klientů Cobbler. Ve výchozím nastavení je nainstalován a aktivován PXE (tftp). Klienti musí být schopni najít boot PXE na {productname} Proxy použitím DHCP. Pro zónu obsahující klienty, kteří mají být zřízeni, použijte tuto konfiguraci DHCP:

source: next-server: <IP_Address_of_Proxy> filename: "pxelinux.0"
cs: next-server: <IP_adresa_Proxy> filename: "pxelinux.0"
