Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: Add the GPG key to the [systemitem]``ORG_GPG_KEY=`` parameter. For more information, see xref:client-configuration:clients-opensuseleap.adoc[]. For more information about bootstrap scripts, see xref:client-configuration:registration-bootstrap.adoc[].
cs: Přidejte klíč GPG do parametru [systemitem]``ORG_GPG_KEY=``. Další informace viz xref:client-configuration:clients-opensuseleap.adoc[]. Další informace o skriptech bootstrap viz xref:client-configuration:registration-bootstrap.adoc[].

source: Navigate to menu:Salt[Keys] and accept the key.
cs: Přejděte do menu:Salt[Keys] a přijměte klíč.

source: When the key is accepted, the new proxy will show in menu:Systems[Overview] in the [guimenu]`` Recently Registered Systems`` section.
cs: Po přijetí klíče se nový proxy server zobrazí v menu:Systems[Overview] (Systémy [Přehled]) v sekci [guimenu]``Recently Registered Systems`` (Nedávno registrované systémy).

source: The salt-broker service will be automatically started after installation is complete. This service forwards the Salt interactions to the {productname} server.
cs: Po dokončení instalace bude automaticky spuštěna služba salt-broker. Tato služba předává interakce Salt na server {productname}.

source: It can also be done after a change within Cobbler that needs to be synchronized immediately. Otherwise Cobbler synchronization will run automatically when needed. For more information about PXE booting, see xref:client-configuration:autoinst-pxeboot.adoc[Install via the Network].
cs: Lze to provést také po změně v Cobbleru, kterou je třeba okamžitě synchronizovat. Jinak bude synchronizace Cobbleru spuštěna automaticky v případě potřeby. Další informace o bootu PXE najdete v xref:client-configuration:autoinst-pxeboot.adoc[Install via the Network].

source: {productname} uses Cobbler for client provisioning. PXE (tftp) is installed and activated by default. Clients must be able to find the PXE boot on the {productname} Proxy using DHCP. Use this DHCP configuration for the zone which contains the clients to be provisioned:
cs: {productname} používá Cobbler pro správu klientů. Ve výchozím nastavení je nainstalován a aktivován PXE (tftp). Klienti musí být schopni najít bootování PXE na serveru {productname} Proxy pomocí DHCP. Pro zónu obsahující klienty, kteří mají být zřízeni, použijte tuto konfiguraci DHCP:

source: Before starting the actual migration procedure, save the data from the old proxy, if needed.
cs: Před skutečným zahájením postupu migrace uložte - v případě potřeby - data ze starého serveru proxy.

source: Consider copying important or manually created data to a central place that can also be accessed by the new proxy.
cs: Zvažte kopírování důležitých nebo ručně vytvořených dat do centrálního umístění, ke kterému může přistupovat také nový proxy server.

source: Install a new {productname} Proxy.
cs: Nainstalujte nový proxy {productname}.

source: For installation instructions, see xref:install-proxy-unified.adoc[Proxy Installation].
cs: Pokyny k instalaci viz xref:install-proxy-unified.adoc[Proxy Installation].

source: Uyuni Server Setup
cs: Nastavení serveru Uyuni

source: Set up {productname} with {yast}
cs: Nastavit {productname} pomocí {yast}

source: This address was provided after you completed setup. For more information, see xref:uyuni-server-setup.adoc#server-setup-yast[].
cs: Tato adresa byla poskytnuta po dokončení instalace. Další informace viz xref:uyuni-server-setup.adoc#server-setup-yast[].

source: Optional: Synchronizing Products from {scc}
cs: Volitelné: Synchronizace produktů z {scc}

source: {scc} (SCC) maintains a collection of repositories which contain packages, software and updates for all supported enterprise client systems. These repositories are organized into channels each of which provide software specific to a distribution, release, and architecture. After synchronizing with SCC, clients can receive updates, be organized into groups, and assigned to specific product software channels.
cs: {scc} (SCC) udržuje sbírku úložišť, která obsahují balíčky, software a aktualizace pro všechny podporované podnikové klientské systémy. Tato úložiště jsou uspořádána do kanálů, z nichž každý poskytuje software specifický pro distribuci, vydání a architekturu. Po synchronizaci se SCC mohou klienti dostávat aktualizace, být organizováni do skupin a přiřazeni ke konkrétním softwarovým kanálům produktu.

source: For Uyuni, synchronizing products from {scc} is optional.
cs: Pro Uyuni je synchronizace produktů z {scc} volitelná.

source: Before you can synchronize software repositories with SCC, you will need to enter organization credentials in {productname}. The organization credentials give you access to the {suse} product downloads. You will find your organization credentials in https://scc.suse.com/organizations.
cs: Než budete moci synchronizovat softwarová úložiště se SCC, budete muset do {productname} zadat pověření organizace. Pověření organizace vám umožňují přístup ke stažení produktu {suse}. Pověření vaší organizace najdete na https://scc.suse.com/organizations.

source: A check mark icon is shown when the credentials are confirmed. When you have successfully entered the new credentials, you can synchronize with {scc}.
cs: Po potvrzení pověření se zobrazí ikona zaškrtnutí. Po úspěšném zadání nových pověření můžete provést synchronizaci se {scc}.

source: Wait a moment for the products list to populate. If you previously registered with {scc} a list of products will populate the table. This table lists architecture, channels, and status information. For more information, see xref:reference:admin/setup-wizard.adoc[Wizard].
cs: Chvíli počkejte, až se seznam produktů naplní. Pokud jste se dříve zaregistrovali u {scc}, tabulku naplní seznam produktů. Tato tabulka uvádí architekturu, kanály a informace o stavu. Další informace viz xref:reference:admin/setup-wizard.adoc[Wizard](Průvodce).

source: Web Interface Setup
cs: Nastavení webového rozhraní

source: To use the {productname} {webui}, navigate to your {productname} URL in a browser. Sign in to the {webui} using your {productname} Administration account.
cs: Chcete-li použít {productname} {webui}, přejděte v prohlížeči na URL adresu {productname}. Přihlaste se k {webui} účtem správy {productname}.

source: While you are using the {webui}, click the icon:question-circle[role="blue"] icon to access the documentation for that section.
cs: Když jste ve {webui}, kliknutím ikony icon:question-circle[role="blue"] otevřete dokumentaci pro příslušnou sekci.

source: The first time you sign in to the {webui}, complete the setup wizard to set your user preferences. You can access the setup wizard at any time by navigating to menu:Admin[Setup Wizard].
cs: Při prvním přihlášení na {webui} dokončíte průvodce nastavením uživatelských preferencí. Průvodce nastavením můžete kdykoli otevřít v menu:Admin[Setup Wizard] (Správce[Průvodce nastavením]).

source: After the initial setup is complete, signing in will take you the menu:Home[Overview] section. This section contains summary panes that provide important information about your systems.
cs: Je-li počáteční nastavení dokončeno (a při dalším přihlášení ihned), přejdete do menu:Home[Overview] (Domů[Přehled]). Tato část obsahuje souhrnná podokna (panely), která podávají důležité informace o vašich systémech.

source: The [guimenu]``Tasks`` pane provides shortcuts to the most common {webui} tasks.
cs: Panel [guimenu]``Tasks`` (Úkoly) obsahuje zástupce nejběžnějších úkolů {webui}.

source: The [guimenu]``Inactive Systems`` pane shows any clients that have stopped checking in to the {productname} Server. You will need to check these clients.
cs: Podokno [guimenu]``Inactive Systems`` (Neaktivní systémy) zobrazuje všechny klienty, kteří se přestali přihlašovat na server {productname}. Budete muset tyto klienty zkontrolovat.

source: The [guimenu]``Most Critical Systems`` pane shows any clients that require software updates. Click the name of a client in the list to be taken to the menu:Systems[System Details] section for that client. From this page, you can apply any required updates.
cs: Panel [guimenu]``Most Critical Systems`` (Nejkritičtější systémy) zobrazuje všechny klienty, kteří vyžadují aktualizace softwaru. Kliknutím na název klienta v seznamu přejdete do menu:Systems[System Details] (Systémy[Podrobnosti]) pro daný klient. Na této stránce můžete použít všechny požadované aktualizace.

source: The [guimenu]``Recently Scheduled Actions`` pane shows all recent actions that have been run, and their status. Click the label of an action to see more detail.
cs: Podokno [guimenu]``Recently Scheduled Actions`` (Naposledy naplánované akce) zobrazuje všechny poslední spuštěné akce a jejich stav. Kliknutím na štítek akce zobrazíte další podrobnosti.

source: The [guimenu]``Relevant Security Patches`` pane shows all available security patches that need to be applied to your clients. It is critical that you apply security patches as soon as possible to keep your clients secure.
cs: Podokno [guimenu]``Relevant Security Patches`` (Související bezpečnostní opravy) zobrazuje všechny dostupné opravy zabezpečení, které je třeba na klienty použít. Je nezbytné, abyste co nejdříve použili bezpečnostní záplaty a zajistili tak bezpečnost svých klientů.

source: The [guimenu]``System Groups`` pane shows any system groups you have created, and if the clients in those groups are fully updated.
cs: Panel [guimenu]``System Groups`` (Skupiny systému) zobrazuje všechny skupiny systému, které jste pro něj vytvořili, a zda jsou klienty v těchto skupinách plně aktualizovány.

source: The [guimenu]``Recently Registered Systems`` pane shows all clients registered in the past thirty days. Click the name of a client in the list to be taken to the menu:Systems[System Details] section for that client.
cs: Panel [guimenu]``Recently Registered Systems`` (Nedávno registrované systémy) zobrazuje všechny klienty registrované za posledních třicet dní. Kliknutím na jméno klienta v seznamu přejdete do menu:Systems[System Details] (Systémy[Podrobnosti]) daného klienta.

source: Web Interface Navigation
cs: Navigace ve webovém rozhraní

source: The {productname} {webui} uses some standard elements to help you navigate. While you are using the {webui}, click the icon:question-circle[role="blue"] icon to access the documentation for that section.
cs: {productname} {webui} používá některé standardní prvky jako pomoc při navigaci. Používáte-li {webui}, kliknutím na ikonu icon:question-circle[role="blue"] otevřete dokumentaci pro příslušnou sekci.

source: Top Navigation Bar
cs: Horní navigační lišta

source: The top navigation bar gives access to system-wide functions.
cs: Horní navigační lišta umožňuje přístup k funkcím platným pro celý systém.

source: Notifications
cs: Oznámení

source: The notification bell icon displays the number of unread notification messages in a circle. Click the notification icon to go to menu:Home[Notification Messages].
cs: Ikona zvonku upozornění zobrazuje v kruhu počet nepřečtených upozornění. Klepnutím na ikonu upozornění přejděte do menu:Home[Notification Messages] (Domů [Oznámení]).

source: Overview Legend
cs: Přehled - popis

source: Click the eye icon to see commonly used icons for the currently active section of the {webui}.
cs: Kliknutím na ikonu oka zobrazíte běžně používané ikony pro právě aktivní sekci {webui}.

source: Search
cs: Vyhledávání

source: Click the search magnifying glass icon to open the search box. You can search for systems (clients), packages, patches, or documentation. Click btn:[Search] to go to the relevant [guimenu]``Advanced Search`` page, and see your search results.
cs: Kliknutím na ikonu lupy otevřete vyhledávací pole. Můžete vyhledávat systémy (klienty), balíčky, opravy nebo dokumentaci. Stisknutím btn:[Search] (Hledat) přejděte na příslušnou stránku [guimenu]``Advanced Search`` (Rozšířené vyhledávání) a zobrazte si výsledky hledání.

source: Systems Selected
cs: Vybrané systémy

source: The systems selected icon displays the number of currently selected systems in a circle. Click the systems selected icon to go to menu:Systems[System Set Manager > Overview]. Click the eraser icon to unselect all systems. For more information about the system set manager, see xref:client-configuration:system-set-manager.adoc[].
cs: Ikona vybraných systémů zobrazuje v kruhu počet aktuálně vybraných systémů. Kliknutím na ikonu vybraných systémů přejděte do menu:Systems[System Set Manager > Overview] (Systémy [Správce sady systémů> Přehled]). Kliknutím na ikonu mazací gumy zrušíte výběr všech systémů. Další informace o správci systémové sady viz xref:client-configuration:system-set-manager.adoc[].

source: User Account
cs: Uživatelský účet

source: The user account icon is displayed with the name of the currently signed-in user. Click the user account icon to go to menu:Home[User Account > My Account].
cs: Zobrazí se ikona uživatelského účtu se jménem aktuálně přihlášeného uživatele. Kliknutím na ikonu uživatelského účtu přejděte do menu:Home[User Account > My Account] (Domů[Uživatelský účet> Můj účet]).

source: The organization icon is displayed with the name of the currently active organization. Click the organization icon to go to menu:Home[My Organization > Configuration].
cs: Zobrazí se ikona organizace s názvem aktuálně aktivní organizace. Kliknutím na ikonu organizace přejděte do menu:Home[My Organization > Configuration] (Domů[Moje organizace> Konfigurace]).

source: Preferences
cs: Předvolby

source: Click the cogs icon to go to menu:Home[My Preferences].
cs: Kliknutím na ikonu ozubených kol přejdete do menu:Home[My Preferences] (Domů[Moje předvolby]).

source: Sign Out
cs: Odhlásit se

source: Click the exit icon to sign out the current user and return to the sign in screen.
cs: Kliknutím na ikonu ukončení odhlásíte aktuálního uživatele a vrátíte se na přihlašovací obrazovku.

source: If you add a distribution, newly synchronize channels, or register a system to the {productname} Server, it can take several minutes for it to be indexed and appear in search results. If you need to force a rebuild of the search index, use this command at the command prompt:
cs: Přidáte-li distribuci, nově synchronizujete kanály nebo zaregistrujete systém u {productname} Serveru, může trvat několik minut, než bude indexován a zobrazen ve výsledcích vyhledávání. Potřebujete-li vynutit nové sestavení vyhledávacího indexu, zadejte na příkazovém řádku tento příkaz:

source: Left Navigation Bar
cs: Levá navigační lišta

source: The left navigation bar is the main menu to the {productname} {webui}.
cs: Levá navigační lišta je hlavní menu {productname} {webui}.

source: Expand
cs: Rozšířit

source: If you click the icon or the down-arrow of a menu entry, it expands this part of the menu tree without actually loading a page.
cs: Když kliknete na ikonu nebo na šipku dolů u položky menu, rozšíří se tato část stromu menu, ale nenačte se stránka.

source: Collapse
cs: Sbalení

source: To collapse an open part of the menu system, click the up-arrow of a menu entry.
cs: Chcete-li sbalit otevřenou část systému nabídek, klikněte na šipku nahoru u položky nabídky.

source: Autoload
cs: Automatické zavedení

source: If you click the name of a menu entry, the first available page of that menu entry will get loaded and displayed automatically.
cs: Kliknete-li na název položky menu, automaticky se načte a zobrazí první dostupná stránka této položky menu.

source: Enter a search string in the [guimenu]``Search page`` field to find an entry of the menu tree. Available menu entries depend on the roles of the user.
cs: Zadejte vyhledávací řetězec do pole [guimenu]``Search page`` (Stránka hledání), abyste našli položku ve stromu menu. Dostupné položky menu závisí na rolích uživatele.

source: Only {productname} Administrators can access these sections:
cs: Do těchto sekcí mají přístup pouze správci {productname}:

source: [guimenu]``Images``
cs: [guimenu]``Images`` (Obrazy)

source: [guimenu]``Users``
cs: [guimenu]``Users`` (Uživatelé)

source: [guimenu]``Admin```
cs: [guimenu]``Admin`` (Správce)

source: Tables
cs: Tabulky

source: Many sections present information in tables. You can navigate through most tables by clicking the back and next arrows above and below the right side of the table. Change the default number of items shown on each page by navigating to menu:Home[My Preferences].
cs: Mnoho sekcí uvádí informace v tabulkách. Většinu tabulek můžete procházet kliknutím na šipky "zpět" a "vpřed", umístěné nad a pod pravou stranou tabulky. Výchozí počet položek zobrazených na každé stránce můžete změnit v menu:Home[My Preferences] (Domů[Moje předvolby]).

source: You can filter the content in most tables using the search bar at the top of the table. Sort table entries by clicking on the column header you want to sort by. Click the column header again to reverse the sort.
cs: Obsah ve většině tabulek můžete filtrovat pomocí vyhledávacího panelu v horní části tabulky. Položky tabulky seřadíte kliknutím na záhlaví sloupce, podle kterého chcete seřadit. Opětovným kliknutím na záhlaví sloupce řazení obrátíte.

source: Patch Alert Icons
cs: Ikony upozornění na opravu

source: Patches are represented by three main icons, depending on the type of patch. Icons are coloured either green, yellow, or red, depending on the severity.
cs: Opravy jsou reprezentovány třemi hlavními ikonami, v závislosti na typu opravy. Ikony jsou podle závažnosti opravy zbarveny buď zeleně, žlutě nebo červeně.

source: Some additional icons are used to give extra information:
cs: Některé další ikony se používají k poskytnutí dalších informací:

source: Interface Customization
cs: Přizpůsobení rozhraní

source: By default, the {productname} {webui} uses the theme appropriate to the product you have installed. You can change the theme to reflect the {uyuni} or {susemgr} colors. The {susemgr} theme also has a dark option available. To change the theme using the {webui}, navigate to menu:Home[My Preferences] and locate the [guimenu]``Style Theme`` section.
cs: {scc} (SCC) udržuje sbírku úložišť, která obsahují balíčky, software a aktualizace pro všechny podporované podnikové klientské systémy. Tato úložiště jsou uspořádána do kanálů, z nichž každý poskytuje software specifický pro distribuci, vydání a architekturu. Po synchronizaci se SCC mohou klienti dostávat aktualizace, být rozděleni do skupin a přiřazeni ke konkrétním softwarovým kanálům produktu.

source: For information about changing the default theme, see xref:administration:users.adoc[].
cs: Informace o změně výchozího motivu viz xref:administration:users.adoc[].

source: Request Timeout Value
cs: Hodnota časového limitu požadavku

source: As you are using the {webui}, you are sending requests to the {productname} Server. In some cases, these requests can take a long time, or fail completely. By default, requests will time out after 30 seconds, and a message is displayed in the {webui} with a link to try sending the request again.
cs: Používáte-li {webui}, odesíláte žádosti na {productname} Server. V některých případech mohou tyto požadavky trvat dlouho nebo zcela selhat. Ve výchozím nastavení vyprší časový limit požadavků po 30 sekundách a na {webui} se zobrazí zpráva s odkazem na opětovné odeslání požadavku.

source: You can configure the default timeout value in the ``etc/rhn/rhn.conf`` configuration file, by adjusting the ``web.spa.timeout`` parameter. Restart the tomcat service after you change this parameter. Changing this setting to a higher number could be useful if you have a slow internet connection, or regularly perform actions on many clients at once.
cs: Výchozí hodnotu časového limitu můžete změnit v konfiguračním souboru ``etc/rhn/rhn.conf`` úpravou parametru ``web.spa.timeout``. Po změně tohoto parametru restartujte službu tomcat. Změna tohoto nastavení na vyšší číslo by mohla být užitečná, máte-li pomalé připojení k internetu nebo provádíte-li pravidelné akce na mnoha klientech najednou.
