Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: xref:webui-setup.adoc[Web Interface Setup]
cs: xref:webui-setup.adoc[Web Interface Setup] (Nastavení webového rozhraní)

source: xref:setup-wizard.adoc[Setup Wizard]
cs: xref:setup-wizard.adoc[Setup Wizard] (Průvodce nastavením)

source: xref:server-intro.adoc[Upgrade the Server]
cs: xref:server-intro.adoc[Upgrade the Server] (Povýšení serveru)

source: xref:server-x.adoc[Server - Major Version Upgrade]
cs: xref:server-x.adoc[Server - Major Version Upgrade] (Povýšení hlavní verze serveru)

source: xref:server-y.adoc[Server - Minor Version Upgrade]
cs: xref:server-y.adoc[Server - Minor Version Upgrade] (Povýšení vedlejší verze serveru)

source: xref:server-y-yast.adoc[Minor Upgrade With YaST]
cs: xref:server-y-yast.adoc[Minor Upgrade With YaST] (Menší povýšení pomocí YaST)

source: xref:server-y-zypper.adoc[Minor Upgrade With Zypper]
cs: xref:server-y-zypper.adoc[Minor Upgrade With Zypper] (Menší povýšení pomocí Zypperu)

source: xref:server-z.adoc[Server - Patch Level Upgrade]
cs: xref:server-z.adoc[Server - Patch Level Upgrade] (Aktualizace záplatou)

source: xref:server-intro-uyuni.adoc[Upgrade the Server]
cs: xref:server-intro-uyuni.adoc[Upgrade the Server] (Povýšení serveru)

source: xref:server-minor-upgrade-uyuni.adoc[Server - Minor Upgrade]
cs: xref:server-minor-upgrade-uyuni.adoc[Server - Minor Upgrade] (Server - menší povýšení)

source: xref:server-major-upgrade-uyuni.adoc[Server - Major Upgrade]
cs: xref:server-major-upgrade-uyuni.adoc[Server - Major Upgrade] (Server - větší povýšení)

source: xref:proxy-intro.adoc[Upgrade the Proxy]
cs: xref:proxy-intro.adoc[Upgrade the Proxy] (Povýšení proxy)

source: xref:proxy-uyuni.adoc[Proxy - Major Upgrade]
cs: xref:proxy-uyuni.adoc[Proxy - Major Upgrade] (Hlavní aktualizace Proxy)

source: xref:proxy-minor-uyuni.adoc[Proxy - Minor Upgrade]
cs: xref:proxy-minor-uyuni.adoc[Proxy - Minor Upgrade] (Proxy - vedlejší aktualizace)

source: xref:proxy-x.adoc[Proxy - Major Version Upgrade]
cs: xref:proxy-x.adoc[Proxy - Major Version Upgrade] (Povýšení hlavní verze Proxy)

source: xref:proxy-y-z.adoc[Proxy - Minor Version or Patch Level Upgrade]
cs: xref:proxy-y-z.adoc[Proxy - Minor Version or Patch Level Upgrade] (Povýšení vedlejší verze Proxy nebo záplata Proxy)

source: xref:db-intro.adoc[Upgrade the Database]
cs: xref:db-intro.adoc[Upgrade the Database] (Povýšení databáze)

source: xref:troubleshooting.adoc[Troubleshooting]
cs: xref:troubleshooting.adoc[Troubleshooting] (Odstranění chyb)

source: Supported Client Systems
cs: Podporované klientské systémy

source: Supported operating systems for traditional and Salt clients are listed in this table.
cs: V této tabulce jsou uvedeny podporované operační systémy pro tradiční klienty a klienty Salt.

source: In this table, {check} indicates that clients running the operating system are supported by {suse}, and {cross} indicates that it is not supported. Fields marked as {question} are under consideration, and may or may not be supported at a later date.
cs: V této tabulce označuje {check}, že klienti s tímto operačním systémem jsou podporováni {suse}, a {cross} označuje, že nejsou podporováni. Označení {question} značí, že klient je posuzován a později může nebo nemusí být podporován.

source: When you are setting up your client hardware, you need to ensure you have enough for the operating system and for the workload you want to perform on the client, with these additions for {productname}:
cs: Když nastavujete klientský hardware, musíte se ujistit, že máte dostatek prostředků pro operační systém a pracovní vytížení, které chcete na klientovi provádět, plus tyto doplňky pro produkt {productname}:

source: Client Additional Hardware Requirements
cs: Další hardwarové požadavky na klienta

source: | Hardware | Additional Size Required | RAM | 512{nbsp}MB | Disk Space: | 200{nbsp}MB
cs: | Hardware | Požadovaná další velikost | RAM | 512{nbsp}MB | Prostor na disku: | 200{nbsp}MB

source: Database Migration to Latest Version
cs: Migrace databáze na nejnovější verzi

source: Prepare to Upgrade
cs: Příprava upgradu

source: Before you begin the upgrade, prepare your existing {productname} Server and create a database backup.
cs: Před zahájením upgradu připravte svůj stávající {productname} Server a vytvořte zálohu databáze.

source: PostgreSQL stores data at [path]``/var/lib/pgsql/data/``.
cs: PostgreSQL ukládá data na [path]``/var/lib/pgsql/data/``.

source: Procedure: Preparing to Upgrade
cs: Postup: Příprava na upgrade

source: Check the active PostgreSQL version:
cs: Zkontrolujte aktivní verzi PostgreSQL:

source: Check the active smdba version:
cs: Zkontrolujte aktivní verzi smdba:

source: Perform a database backup. For more information on backing up, see xref:administration:backup-restore.adoc[].
cs: Zálohujte databázi. Další informace o zálohování viz xref:administration:backup-restore.adoc[].

source: Upgrade PostgreSQL
cs: Upgradujte PostgreSQL

source: Always create a database backup before performing a migration.
cs: Před provedením migrace vždy zazálohujte databázi.

source: PostgreSQL upgrades can be performed in two ways: a regular upgrade, or a fast upgrade:
cs: PostgreSQL lze upgradovat běžným nebo rychlým způsobem:

source: A regular upgrade creates a complete copy of the database, so you need double the existing database size of space available. Regular upgrades can take a considerable amount of time, depending on the size of the database and the speed of the storage system.
cs: Běžný upgrade vytvoří úplnou kopii databáze, takže potřebujete dvojnásobek stávající velikosti dostupné databáze. Běžné upgrady mohou trvat značně dlouho, v závislosti na velikosti databáze a rychlosti paměti úložného systému.

source: A fast upgrade only takes a few minutes, and uses almost no additional disk space. However, if a fast upgrade fails, you must restore the database from the backup. A fast upgrade reduces the risk of running out of disk space, but increases the risk of data lose when a backup does not exist or cannot be replayed. A regular upgrade will copy the database files instead of creating hard links between the files.
cs: Rychlý upgrade trvá jen několik minut a nevyužívá téměř žádné přídavné místo na disku. Pokud však rychlý upgrade selže, musíte obnovit databázi ze zálohy. Rychlý upgrade snižuje riziko vyčerpání místa na disku, ale zvyšuje riziko ztráty dat, když neexistuje záloha nebo z ní nelze obnovit. Běžný upgrade zkopíruje soubory databáze namísto vytváření pevných odkazů mezi soubory.

source: Procedure: Performing a Regular Upgrade
cs: Postup: Běžný upgrade

source: Start the upgrade. Run the script:
cs: Start upgradu - spusťte skript:

source: When the upgrade has successfully completed, you can safely delete the old database directory and reclaim lost disk space. The old directory is renamed to [path]``/var/lib/pgsql/data-pg12`` or [path]``/var/lib/pgsql/data-pg10``, depending on the version you started from.
cs: Po úspěšném dokončení upgradu můžete bezpečně odstranit starý adresář databáze a získat zpět dočasně zabraný prostor disku. Starý adresář je přejmenován na [path]``/var/lib/pgsql/data-pg12`` nebo [path]``/var/lib/pgsql/data-pg10``, podle toho, z které verze jste začali.

source: The [path]``pg-migrate-x-to-y.sh`` script performs these operations:
cs: Skript [path]``pg-migrate-x-to-y.sh`` provádí tyto operace:

source: Stop spacewalk services
cs: Zastaví služby spacewalk

source: Shut down the running database
cs: Vypne spuštěnou databázi

source: Check if the latest PostgreSQL is installed and install it if necessary
cs: Zkontroluje, zda je nainstalován nejnovější PostgreSQL a v případě potřeby jej nainstaluje

source: Switch from previous version of PostgreSQL{nbsp} to the latest as the new default
cs: Přepne předchozí verzi PostgreSQL na nejnovější PostgreSQL jako novou výchozí

source: Initiate the database migration
cs: Zahájí migraci databáze

source: Create a PostgreSQL configuration file tuned for use by {productname}
cs: Vytvoří konfigurační soubor PostgreSQL vyladěný pro použití s {productname}

source: Start the database and spacewalk services
cs: Spustí služby databáze a spacewalk

source: If the upgrade fails, the migration script will attempt to restore the database to its original state.
cs: Nezdaří-li se upgrade, pokusí se migrační skript obnovit databázi do původního stavu.

source: Procedure: Performing a Fast PostgreSQL Upgrade
cs: Postup rychlého upgradu PostgreSQL

source: Perform a database backup. Without a verified database backup, you must not initiate a fast upgrade. For more information on backing up, see xref:administration:backup-restore.adoc[].
cs: Zálohujte databázi. Bez ověřené zálohy databáze nesmíte zahájit rychlou aktualizaci. Další informace o zálohování viz xref:administration:backup-restore.adoc[].

source: Start the upgrade. Run the script.
cs: Zahajte upgrade - spusťte skript.

source: Current {scc} organization credentials
cs: Aktuální pověření organizace {scc}

source: Access to installation media
cs: Přístup k instalačnímu médiu

source: Environment meets the hardware and networking requirements
cs: Prostředí splňuje hardwarové a síťové požadavky

source: Any required SSL certificates for your environment
cs: Jakékoli požadované certifikáty SSL pro vaše prostředí

source: This section contains more information on each of these requirements.
cs: Tato část obsahuje další informace o každém z těchto požadavků.

source: For a complete list of supported clients and features, see xref:client-configuration:supported-features.adoc[].
cs: Úplný seznam podporovaných klientů a funkcí viz xref:client-configuration:supported-features.adoc[].

source: {productname} {productnumber} is based on SLES {sles-version} {sp-version} as the host operating system. {productname} comes with a maintenance lifecycle of two years. For more information, see link:https://www.suse.com/lifecycle/[].
cs: {productname} {productnumber} je založen na SLES {sles-version} {sp-version} jako hostitelském operačním systému. {productname} přichází s životním cyklem údržby dva roky. Další informace najdete na https: //www.suse.com/lifecycle/ [].

source: Long Term Service Pack Support (LTSS) for {sles-version} cannot be added to {productname}. It is also not possible to use SLES for SAP as a base for {productname} to increase the lifecycle of the underlying operating system.
cs: Dlouhodobou podporu Service Pack (LTSS) pro {sles-version} nelze přidat do {productname}. Také není možné použít SLES pro SAP jako základ pro {productname} ke zvýšení životního cyklu základního operačního systému.

source: Obtain Your SUSE Customer Center Credentials
cs: Získejte pověření zákaznického centra SUSE

source: Create an account with {scc} before installation of {sles} and {productname}.
cs: Před instalací {sles} a {productname} si vytvořte účet u {scc}.

source: Procedure: Obtaining Your SCC Organization Credentials
cs: Postup: Získání pověření organizace SCC

source: Navigate to https://scc.suse.com/login in your Web browser.
cs: Ve svém webovém prohlížeči přejděte na https://scc.suse.com/login.

source: Log in to your SCC account, or follow the prompts to create a new account.
cs: Přihlaste se ke svému účtu SCC nebo podle pokynů vytvořte nový účet.

source: Click btn:[Manage my Organizations] and select your organization from the list by clicking on the organization name.
cs: Klikněte na btn:[Manage my Organizations] (Spravovat mé organizace) a vyberte svou organizaci ze seznamu kliknutím na název organizace.

source: Click the btn:[Organization] tab, and then select the btn:[Organization Credentials] tab.
cs: Klikněte na kartu btn: [Organization] (Organizace) a poté vyberte kartu btn: [Organization Credentials] (Pověření organizace).

source: Depending on your organization's setup, you might also need to activate your subscription, using the btn:[Activate Subscriptions] menu.
cs: V závislosti na nastavení vaší organizace možná budete muset aktivovat předplatné pomocí menu btn: [Activate Subscriptions] (Aktivovat předplatné).

source: For more information about using SCC, see https://scc.suse.com/docs/help.
cs: Další informace o použití SCC viz https://scc.suse.com/docs/help.

source: You only require a valid registration code for {productname}, for example from a "SUSE Manager Lifecycle Management+" subscription. For more information, see SUSE Terms and Conditions at https://www.suse.com/products/terms_and_conditions.pdf. You do not require a separate code for SLES{nbsp}{sles-version} {sp-version}.
cs: Potřebujete pouze platný registrační kód pro {productname}, například z předplatného "SUSE Manager Lifecycle Management+". Další informace viz "SUSE Terms and Conditions" v https://www.suse.com/products/terms_and_conditions.pdf.. Pro SLES {nbsp}{sles-version} {sp-version} nepotřebujete samostatný kód.

source: Direct link to {sle} {sles-version} {sp-version}, required to install SUSE Manager https://www.suse.com/download/suse-manager.
cs: Přímý odkaz na {sle} {sles-version} {sp-version} potřebný k instalaci Správce SUSE: https://www.suse.com/download/suse-manager.

source: Supported Browsers for the {susemgr} {webui}
cs: Podporované prohlížeče pro {susemgr} {webui}

source: In order to use the {webui} to manage your {susemgr} environment, you will need to ensure you are running an up to date web browser.
cs: Abyste mohli ke správě svého prostředí {susemgr} používat {webui}, musíte se ujistit, že používáte aktuální webový prohlížeč.

source: {susemgr} is supported on:
cs: {susemgr} podporuje:

source: This table outlines hardware and software requirements for the {productname} Server and Proxy, on {x86_64} and {ppc64le} architecture.
cs: Tato tabulka uvádí hardwarové a softwarové požadavky na {productname} Server a Proxy na architektuře {x86_64} a {ppc64le}.

source: This table outlines hardware and software requirements for the {productname} Server and Proxy on {x86_64} architecture.
cs: Tato tabulka uvádí hardwarové a softwarové požadavky na {productname} server a proxy na architektuře {x86_64}.

source: {productname} Server stores packages in the [path]``/var/spacewalk/`` directory. Repository synchronization fails if this directory runs out of disk space. You can estimate how much space the [path]``/var/spacewalk/`` directory requires based on the clients and repositories you plan to mirror.
cs: {productname} Server ukládá balíčky do adresáře [path]``/var/spacewalk/``. Synchronizace úložiště selže, pokud v tomto adresáři dojde místo na disku. Na základě klientů a úložišť, které/která plánujete zrcadlit, můžete odhadnout, kolik místa vyžaduje adresář [path]``/var/spacewalk/``.

source: Server Hardware Requirements for {x86_64} Architecture
cs: Hardwarové požadavky na server s architekturou {x86_64}

source: Server Hardware Requirements for IBM POWER8 or POWER9 Architecture
cs: Hardwarové požadavky na server pro architekturu IBM POWER8 nebo POWER9

source: | Hardware | Details | Recommendation | CPU | | Minimum 4 dedicated cores | RAM | Test Server | Minimum 8{nbsp}GB | | Base Installation | Minimum 16{nbsp}GB | | Production Server | Minimum 32{nbsp}GB | Disk Space | [path]``/`` (root directory) | Minimum 100{nbsp}GB | | [path]``/var/lib/pgsql`` | Minimum 50{nbsp}GB | | [path]``/var/spacewalk`` | Minimum 50{nbsp}GB per SUSE product and 360{nbsp}GB per Red Hat product | | [path]``/var/cache`` | Minimum 10{nbsp}GB. Add 100{nbsp}MB per {suse} product, 1{nbsp}GB per Red Hat or other product. Double the space if the server is an ISS Master. | | Swap space | 3{nbsp}GB
cs: | Hardware | Podrobnosti | Doporučení | CPU | | Min. 4 jádra jen pro tento účel | RAM | Testový server | Minimum 8{nbsp}GB | | Základní instalace | Minimum 16{nbsp}GB | | Provozní server | Minimum 32{nbsp}GB | Diskový prostor | [path]``/`` (kořenový adresář) | Minimum 100{nbsp}GB | | [path]``/var/lib/pgsql`` | Minimum 50{nbsp}GB | | [path]``/var/spacewalk`` | Minimum 50{nbsp}GB na produkt SUSE a 360{nbsp}GB na produkt Red Hat | | [path]``/var/cache`` | Minimum 10{nbsp}GB. Přidat 100{nbsp}MB na produkt {suse}, 1{nbsp}GB na produkt Red Hat nebo jiný. Zdvojnásobit, je-li server ISS Master. | | Odkládací prostor | 3{nbsp}GB

source: Storage Devices and Permissions
cs: Úložná zařízení a oprávnění

source: We recommend that the repositories and the database for {productname} are stored on separate storage devices. This will help to avoid data loss. You must set up the storage devices before you run the YaST {productname} setup procedure.
cs: Doporučujeme, aby úložiště a databáze produktu {productname} byly uloženy na samostatných úložných zařízeních. Tím se můžete vyhnout ztrátě dat. Úložná zařízení musíte nastavit před spuštěním procesu instalace YaST {productname}.

source: {productname} requires three different volumes:
cs: {productname} vyžaduje tři různé svazky:

source: Database volume: [path]``/var/lib/pgsql``
cs: Svazek s databází: [path]``/var/lib/pgsql``

source: Channel volume: [path]``/var/spacewalk``
cs: Svazek kanálu: [path]``/var/spacewalk``

source: Cache: [path]``/var/cache``
cs: Vyrovnávací paměť (keš): [path]``/var/cache``

source: We recommend you use XFS as the filesystem type for all volumes. Additionally, for on-premise installations, consider using logical volume management (LVM) to manage the disks. The size of the disk for repositories storage is dependent on the number of distributions and channels you intend to manage with {productname}. See the tables in this section for guides to estimate the size required.
cs: Doporučujeme použít XFS jako typ souborového systému pro všechny svazky. U místních instalací zvažte použití správy logického svazku (LVM) ke správě disků. Velikost disku pro paměť úložišť závisí na počtu distribucí a kanálů, které chcete spravovat pomocí produktu {productname}. V tabulkách v této části najdete průvodce, jak odhadnout požadovanou velikost.

source: On your {productname} Server, use this command to find all available storage devices:
cs: Pomocí tohoto příkazu na serveru {productname} vyhledejte všechna dostupná úložná zařízení:

source: Use the [command]``suma-storage`` command with the device names to set up the external disks as the locations for the database and repositories:
cs: Příkazem [command]``suma-storage`` s názvy zařízení nastavte umístění databáze a úložiště na externí disky:

source: It is possible to use the same storage device for both channel data and the database. This is not recommended, as growing channel repositories might fill up the storage, which poses a risk to database integrity. Using separate storage devices may also increase performance. If you want to use a single storage device, run [command]``suma-storage`` with a single device name parameter.
cs: Pro data kanálu i databázi lze použít stejné úložné zařízení. To se však nedoporučuje, protože rostoucí objemy úložišť kanálů mohou zaplnit paměť úložiště, což představuje riziko pro integritu databáze. Použití samostatných úložných zařízení může také zvýšit výkonnost. Chcete-li použít jediné úložné zařízení, spusťte [command]``suma-storage`` s parametrem jeho názvu.

source: If you are installing a proxy, the [command]``suma-storage`` command only takes a single device name parameter and will set up the external storage location as the Squid cache.
cs: Instalujete-li proxy, příkaz [command]``suma-storage`` použije jen jeden parametr názvu zařízení a nastaví umístění externího úložiště jako mezipaměť Squid.

source: When you create disk partitions for the {productname} Server and Proxy, ensure you set the permissions correctly.
cs: Vytváříte-li diskové oddíly pro server a proxy {productname}, ujistěte se, že jste správně nastavili oprávnění.

source: For [path]``/var/lib/pgsql``:
cs: Pro [path]``/var/lib/pgsql``:

source: Owner: Read, Write, Execute
cs: Owner: Read, Write, Execute (Vlastník: Číst, psát, spouštět)

source: Group: Read, Execute
cs: Group: Read, Execute (Skupina: Číst, spouštět)

source: User: None
cs: User: None (Uživatel: Nic)

source: For [path]``/var/spacewalk``:
cs: Pro [path]``/var/spacewalk``:

source: Owner: Read, Write, Execute
cs: Owner: Read, Write, Execute (Vlastník: Číst, psát, spouštět)

source: Group: Read, Write, Execute
cs: Group: Read, Write, Execute (Skupina: Číst, psát, spouštět)

source: User: Read, Execute
cs: User: Read, Execute (Uživatel: Číst, spouštět)

source: Check the permissions with this command:
cs: Zkontrolujte oprávnění tímto příkazem:

source: The output should look like this:
cs: Výstup by měl vypadat takto:

source: If required, change the permissions with these commands:
cs: V případě potřeby změňte oprávnění těmito příkazy:

source: And owners with:
cs: A vlastníky:

source: This section describes how to install {susemgr} Server using {sle} installation media. You must have already registered your {susemgr} product with {scc}, and have obtained a registration code.
cs: Tato část popisuje, jak nainstalovat server {susemgr} pomocí instalačního média {sle}. Svůj produkt {susemgr} jste již určitě zaregistrovali u {scc} a získali jste registrační kód.

source: For information on registering with {scc}, retrieving your organization credentials from {scc}, or obtaining installation media, see xref:general-requirements.adoc[].
cs: Informace o registraci u {scc}, načítání pověření vaší organizace z {scc} nebo získání instalačního média najdete v xref:general-requirements.adoc[].

source: | Hardware | Recommended | CPU | Minimum 4 dedicated 64-bit CPU cores | RAM: | Test Server: Minimum 3{nbsp}GB RAM and 2{nbsp}GB Swap space | | Base Installation: Minimum 16{nbsp}GB | | Production Server: Minimum 32{nbsp}GB | Disk Space: | Root Partition: Minimum 100{nbsp}GB | | [path]``/var/lib/pgsql``: Minimum 50{nbsp}GB | | [path]``/var/spacewalk``: Minimum 50{nbsp}GB per SUSE product and 360{nbsp}GB per Red Hat product
cs: | Hardware | Doporučeno | CPU | Minimum 4 64-bitová jádra CPU pracující jen pro tento software | RAM: | Testový server: Minimum 3{nbsp}GB RAM a 2{nbsp}GB odkládací prostor | | Základní instalace: Minimum 16{nbsp}GB | | Provozní server: Minimum 32{nbsp}GB | Diskový prostor: | Kořenový oddíl: Minimum 100{nbsp}GB | | [path]``/var/lib/pgsql``: Minimum 50{nbsp}GB | | [path]``/var/spacewalk``: Minimum 50{nbsp}GB pro produkt SUSE a 360{nbsp}GB pro produkt Red Hat

source: RDMA over Converged Ethernet (RoCE)
cs: RDMA přes Converged Ethernet (RoCE)

source: This section covers the installation of {productname} as a product of the {sle} family. For general information about deploying a product on {ibmz} hardware, see https://documentation.suse.com/sles/15-SP3/html/SLES-all/cha-zseries.html.
cs: Tato část popisuje instalaci produktu {productname} jako produktu rodiny {sle}. Obecné informace o nasazení produktu na hardware {ibmz} naleznete na adrese https://documentation.suse.com/sles/15-SP3/html/SLES-all/cha-zseries.html.

source: Installation
cs: Instalace

source: This section describes the process to install {productname} components.
cs: Tato část popisuje postup instalace komponent {productname}.

source: {susemgr} Proxy is a {suse} product within the {sle} product family. This section describes how to install {susemgr} Proxy from {sle} installation media. It assumes you already have obtained a registration code for your {susemgr} Proxy, for example from a "SUSE Manager Lifecycle Management+" subscription.
cs: {susemgr} Proxy je produkt {suse} v rámci rodiny produktů {sle}. Tato část popisuje, jak nainstalovat server {susemgr} Proxy z instalačního média {sle} a předpokládá, že jste již obdrželi registrační kód pro svůj {susemgr} Proxy, například z předplatného "SUSE Manager Lifecycle Management+".
