Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: If you want to install {susemgr} Proxy on a virtual machine, ensure your virtual machine has enough disk space and RAM by checking the requirements at xref:hardware-requirements.adoc[].
cs: Chcete-li nainstalovat {susemgr} Proxy na virtuální počítač, zkontrolujte, zda má váš virtuální počítač dostatek prostoru na disku a dostačující RAM, ověřením požadavků podle xref:hardware-requirements.adoc[].

source: {productname} Proxy is the {productname} component that caches software packages on an internal server. The proxy also caches patch updates from {suse} or custom RPMs generated by third-party organizations. A proxy allows you to use bandwidth more effectively because client systems connect to the proxy for updates, and the {productname} server is no longer required to handle all client requests. A {susemgrproxy} can serve both Traditional and Salt clients. The proxy also supports transparent custom package deployment.
cs: {productname} Proxy je součást {productname}, která ukládá softwarové balíčky na interní server. Proxy také ukládá aktualizace patchů z {suse} nebo vlastních RPM generovaných organizacemi třetích stran. Server proxy vám umožňuje efektivněji využívat šířku pásma, protože klientské systémy se připojují k serveru proxy kvůli aktualizacím a server {productname} již není vyžadován pro zpracování všech požadavků klientů. {susemgrproxy} může sloužit klientům Traditional i Salt. Proxy také podporuje transparentní nasazení vlastních balíčku.

source: {productname} Proxy is an open source (GPLv2) solution that provides the following features:
cs: {productname} Proxy je řešení s otevřeným zdrojovým kódem (GPLv2), které poskytuje tyto funkce:

source: Cache software packages within a Squid proxy.
cs: Zachycuje softwarové balíčky v proxy serveru Squid.

source: Client systems see the {susemgrproxy} as the {productname} server instance.
cs: Klientské systémy vidí server {susemgrproxy} jako instanci serveru {productname}.

source: The {susemgrproxy} is registered as a client system with the {productname} server.
cs: Server {susemgrproxy} je zaregistrován jako klientský systém se serverem {productname}.

source: The primary goal of a {susemgrproxy} is to improve {productname} performance by reducing bandwidth requirements and accelerating response time.
cs: Primárním cílem {susemgrproxy} je zlepšit výkon {productname} snížením požadavků na šířku pásma a zrychlením doby odezvy.

source: In the [guimenu]``Language, Keyboard and Product Selection`` screen, check the [guimenu]``SUSE Manager Proxy`` checkbox, and click btn:[Next].
cs: Na obrazovce [guimenu]``Výběr jazyka, klávesnice a produktu`` zaškrtněte možnost [guimenu]``SUSE Manager Proxy`` a stiskněte btn:[Další].

source: Read and agree to the End User Licence Agreement, and click btn:[Next].
cs: Přečtěte si a potvrďte licenční smlouvu s koncovým uživatelem, pak stiskněte btn:[Další].

source: In the [guimenu]``Registration`` screen, check the [guimenu]``Register System via scc.suse.com`` checkbox, enter your {scc} credentials, and click btn:[Next].
cs: Na obrazovce „guimenu]``Registrace`` zaškrtněte políčko [guimenu]``Registrovat systém přes scc.suse.com``, zadejte své přihlašovací údaje {scc} a stiskněte btn:[Další].

source: In the [guimenu]``Available Extensions and Modules`` screen, select any extensions or modules you require, and click btn:[Next].
cs: Na obrazovce [guimenu]``Dostupná rozšíření a moduly`` vyberte požadovaná rozšíření nebo moduly a stiskněte btn:[Další].

source: [systemitem]``Basesystem``, [systemitem]``SUSE Manager Proxy``, and [systemitem]``Server Applications`` are pre-selected and mandatory for the {productname} Proxy installation. OPTIONAL: In the following [guimenu]``Add On Product`` screen, select any additional or add-on products you require, and click btn:[Next].
cs: Předem vybrány a pro instalaci proxy serveru {productname} povinné jsou: [systemitem] ``Základní systém``, [systemitem]``SUSE Manager Proxy`` a [systemitem]``Serverové aplikace``. VOLITELNÉ: Na následující obrazovce [guimenu]``Přidat k produktu`` vyberte jakékoli další nebo doplňkové produkty, které požadujete, a stiskněte btn:[Další].

source: In the [guimenu]``System Role`` screen, check the [guimenu]``SUSE Manager Proxy`` checkbox, and click btn:[Next].
cs: Na obrazovce [guimenu]``Role systému`` zaškrtněte možnost [guimenu]``SUSE Manager Proxy`` a stiskněte btn:[Další].

source: In the [guimenu]``Clock and Time Zone`` screen, enter your region and timezone, and click btn:[Next].
cs: Na obrazovce [guimenu]``Hodiny a časové pásmo`` zadejte svůj region a časové pásmo a stiskněte btn:[Další].

source: In the [guimenu]``Local Users`` screen, create a new user, and click btn:[Next].
cs: Na obrazovce [guimenu]``Místní uživatelé`` vytvořte nového uživatele a stiskněte btn:[Další].

source: Review the settings on the [guimenu]``Installation Settings`` screen, and then click btn:[Install].
cs: Zkontrolujte nastavení na obrazovce [guimenu]``Nastavení instalace`` a poté stiskněte btn:[Instalovat].

source: When the installation procedure has finished, you can check that you have all the required modules. At the command prompt, enter:
cs: Po dokončení instalačního procesu můžete zkontrolovat, zda máte všechny požadované moduly. Na příkazovém řádku zadejte:

source: For {productname} Proxy, the expected modules are:
cs: Očekávané moduly pro {productname} Proxy jsou:

source: {sles} Basesystem Module
cs: {sles} Modul základního systému

source: Server Applications Module
cs: Modul serverových aplikací

source: SUSE Manager Proxy Module
cs: Proxy modul SUSE Manageru

source: Continue with registering the installed {productname} Proxy as a client: xref:proxy-registration.adoc[].
cs: Pokračujte v registraci instalovaného {productname} Proxy jako klienta: xref:proxy-registration.adoc[].

source: Install {productname} Proxy from packages
cs: Nainstalujte {productname} Proxy z balíčků

source: To install {productname} Proxy from packages, you will need to start by installing {sles} media. This section covers the KVM settings required to perform a {sles} installation as the base for {productname} Proxy. In this section, we use a KVM and a virtual machine manager as a sandbox for the installation.
cs: Chcete-li nainstalovat {productname} Proxy z balíčků, budete muset začít instalací média {sles}. Tato část popisuje nastavení KVM potřebná k provedení instalace {sles} jako základu pro {productname} Proxy. V této části používáme KVM a správce virtuálních strojů jako chráněné prostředí pro instalaci.

source: SLES KVM Requirements
cs: Požadavky SLES KVM

source: Use these settings to create a new virtual machine with [command]``virt-manager`` (replace [literal]``<version>`` with the actual version string):
cs: Tato nastavení použijte k vytvoření nového virtuálního počítače příkazem [command]``virt-manager`` (nahraďte [literal]``<verze>`` skutečným řetězcem verze):

source: SLES KVM Settings
cs: Nastavení SLES KVM

source: This section covers the {productname} Proxy installation, using the full installation media with KVM and [command]``virt-manager``. Before you begin, you will need to have created an account with {scc}, and downloaded the {sles} installation media.
cs: Tato část popisuje instalaci {productname} Proxy pomocí úplného instalačního média s KVM a [command]``virt-manager``. Než začnete, budete si muset vytvořit účet u {scc} a stáhnout instalační médium {sles}.

source: Procedure: Preparing for SLES Installation
cs: Postup: Příprava na instalaci SLES

source: In the Virtual Machine Manager tool ([command]``virt-manager``), click menu:File[New Virtual Machine].
cs: V nástroji Virtual Machine Manager ([command]``virt-manager``) klikněte na menu:File[New Virtual Machine].

source: Click btn:[Local install media (ISO image or CDROM)].
cs: Klikněte na btn:[Local install media (ISO image or CDROM)] (Místní instalační médium (obraz ISO nebo CDROM)).

source: In the [guimenu]``Create a new virtual machine`` dialog, click btn:[Browse] and locate the full SLES image you downloaded from your SCC account.
cs: V dialogovém okně [guimenu]``Vytvořit nový virtuální stroj``. klikněte na btn:[Browse] a vyhledejte celý obraz SLES, který jste stáhli ze svého účtu SCC.

source: Configure your machine with at least 2 GB RAM and a minimum of 2 CPUs.
cs: Nakonfigurujte svůj počítač s minimálně 2 GB RAM a minimálně 2 CPU.

source: | Disk Space Requirements | 100{nbsp}GB XFS partition (or dedicated virtual disk) for [path]``/srv/`` | 100{nbsp}GB XFS partition (or dedicated virtual disk) for [path]``/var/cache/``
cs: | Požadavky na diskový prostor | 100{nbsp}GB oddíl XFS (nebo celý virtuální disk) pro [path]``/srv/`` | 100{nbsp}GB oddíl XFS (nebo celý virtuální disk) pro [path]``/var/cache/``

source: The remaining storage space will be used by the operating system for the root partition.
cs: Zbývající úložný prostor použije operační systém pro kořenový oddíl.

source: Click btn:[Finish] to save the installation settings and begin the installation.
cs: Stisknutím btn:[Finish] uložíte nastavení instalace a zahájíte instalaci.

source: Change SLES for SUSE Manager Proxy
cs: Změňte SLES pro SUSE Manager Proxy

source: Procedure: Changing SLES for {productname} Proxy Installation
cs: Postup: Změna SLES pro instalaci serveru proxy {productname}

source: Uninstall the `sles-release` package:
cs: Odinstalujte balíček `sles-release`:

source: Register {productname} Proxy with SCC (for example, replace `<productversion>` with `{productnumber}` and `<architecture>` with `x86_64`):
cs: Zaregistrujte server {productname} Proxy pomocí SCC (například `<productversion>` nahraďte `{productnumber}` a `<architecture>` nahraďte `x86_64`):

source: Add {productname} repositories:
cs: Přidejte úložiště {productname}:

source: Install the {productname} Proxy pattern:
cs: Nainstalujte vzor proxy {productname}:

source: Public clouds provide {productname} under a Bring Your Own Subscription (BYOS) model. That means that they pre-install {productname}, so you do not need to perform any installation steps.
cs: Veřejné cloudy poskytují produkt {productname} v rámci modelu Bring Your Own Subscription (BYOS). To znamená, že mají {productname} už předem instalován, takže nemusíte provádět žádné instalační kroky.

source: {susemgr} is a {suse} product within the {sle} product family. This section describes how to install {susemgr} Server from the {sle} installation media. For this topic we assume that you already have valid organization credentials with {scc} and have obtained a registration code for your {susemgr}, for example from a "SUSE Manager Lifecycle Management+" subscription.
cs: {susemgr} je produkt {suse} v rámci rodiny produktů {sle}. Tato část popisuje, jak nainstalovat server {susemgr} z instalačního média {sle}. U tohoto tématu předpokládáme, že již máte platná pověření své organizace u {scc} a obdrželi jste registrační kód pro svůj produkt {susemgr}, například z předplatného "SUSE Manager Lifecycle Management+".

source: In case of installing {susemgr} in a public cloud where {susemgr} image is available, use that image.
cs: V případě instalace {susemgr} ve veřejném cloudu, kde je dostupný obraz {susemgr}, použijte ho.

source: Installing {susemgr}
cs: Instalace {susemgr}

source: In the [guimenu]``Language, Keyboard and Product Selection`` screen, check [guimenu]``SUSE Manager Server``, and click btn:[Next].
cs: Na obrazovce [guimenu]``Language, Keyboard and Product Selection`` (Výběr jazyka, klávesnice a produktu) označte [guimenu]``SUSE Manager Server`` a stiskněte btn:[Next] (Další).

source: In the [guimenu]``Extension and Module Selection`` screen, select additional extensions or modules you require, and click btn:[Next].
cs: Na obrazovce [guimenu]``Extension and Module Selection`` vyberte další požadované rozšíření nebo moduly a stiskněte btn:[Další].

source: Mandatory modules are pre-selected and you cannot disable them.
cs: Povinné moduly jsou předem vybrány a nelze je deaktivovat.

source: In the [guimenu]``System Role`` screen, check the [guimenu]``SUSE Manager Server`` checkbox, and click btn:[Next].
cs: Na obrazovce [guimenu]``Role systému`` zaškrtněte možnost [guimenu]``Server SUSE Manager`` a stiskněte btn:[Další].

source: In the [guimenu]``Suggested Partitioning`` screen, either accept the default values, or use the btn:[Guided Setup] or btn:[Expert Partitioner] options to customize your partitioning model, and click btn:[Next].
cs: Na obrazovce [guimenu]``Navrhované rozdělení`` buď přijměte výchozí hodnoty, nebo použijte možnosti btn:[Průvodce nastavením] nebo btn:[Expert] k úpravě modelu rozdělení svazku na oddíly a stiskněte btn:[Další].

source: In the [guimenu]``System Administrator "root"`` screen, create the "root" user, and click btn:[Next].
cs: Na obrazovce [guimenu]``System Administrator "root"`` vytvořte uživatele "root" a stiskněte btn:[Další].

source: Review the settings on the [guimenu]``Installation Settings`` screen.
cs: Zkontrolujte nastavení na obrazovce [guimenu]``Instalační nastavení``.

source: On the [guimenu]``Installation Settings`` screen click btn:[Install].
cs: Na obrazovce [guimenu]``Instalační nastavení`` klikněte na btn:[Instalovat].

source: When the installation procedure has finished, you can check that you have all the required modules by using the [command]``SUSEConnect --status-text`` command at a command prompt. For {susemgr} Server, the expected modules are:
cs: Po dokončení instalace můžete zkontrolovat, zda máte všechny požadované moduly, příkazem [command]``SUSEConnect --status-text`` příkazového řádku. Pro server {susemgr} jsou očekávané moduly:

source: Web and Scripting Module
cs: Webový a skriptovací modul

source: SUSE Manager Server Module
cs: Modul serveru SUSE Manager

source: Installing {productname} Server
cs: Instalace serveru {productname}

source: This chapter provides the required KVM settings for installation of {sles} media as the base for {productname}. A kernel virtual machine KVM combined with Virtual Machine Manager ([command]``virt-manager``) will be used as a sandbox for this installation.
cs: Tato kapitola poskytuje požadované nastavení KVM pro instalaci média {sles} jako základu pro {productname}. Jako chráněný prostor (sandbox) pro tuto instalaci bude použito jádro virtuálního stroje KVM v kombinaci s Virtual Machine Manager ([command]``virt-manager``).

source: Enter the following settings when creating a new virtual machine using [command]``virt-manager`` (replace [replaceable]``version`` with the actual version string):
cs: Při vytváření nového virtuálního stroje zadejte následující nastavení příkazem [command]``virt-manager`` (nahraďte [replaceable] ``verze`` skutečným řetězcem verze):

source: | KVM Settings for SLES | Installation Method: | Local install media (ISO image or CDROM) | OS: | Linux | Version: |``SLE-[replaceable]``version``-Server-x86_64-GM-DVD1.iso`` | Memory: | 4096{nbsp}MB | CPUs: | 2 | Storage Format: | ISO 3{nbsp}GB | Disk Space: | 234{nbsp}GB split between 4{nbsp}GB swap and 130{nbsp}GB mounted at [path]``/var/spacewalk/`` | | (Virtual Disk 1) and 50{nbsp}GB mounted at [path]``/var/lib/pgsql`` | | (Virtual Disk 2). The rest for the root partition (100{nbsp}GB+). | Name: | example-server | Network | Bridge br0
cs: | Nastavení KVM pro SLES | Instalační metoda: | Lokální instalační médium (ISO-obraz nebo CDROM) | OS: | Linux | Verze: |``SLE-[replaceable]``verze``-Server-x86_64-GM-DVD1.iso`` | Paměť: | 4096{nbsp}MB | CPU: | 2 jádra | Formát paměti: | ISO 3{nbsp}GB | Diskový prostor: | 234{nbsp}GB split between 4{nbsp}GB swap and 130{nbsp}GB mounted at [path]``/var/spacewalk/`` | | (virtuální disk 1) a 50{nbsp}GB připojeno k [path]``/var/lib/pgsql`` | | (virtuální disk 2). Zbytek pro kořenový oddíl (100{nbsp}GB+). | Název: | příklad-serveru | Síť: | Most br0

source: This section provides guidance on installation of {productname} utilizing the full installation media with KVM and [command]``virt-manager``. This section assumes you have previously setup an account with SCC and downloaded the SLES full installation media.
cs: Tato část poskytuje pokyny k instalaci produktu {productname} s využitím úplného instalačního média s KVM a [command]``virt-manager``. Tato část předpokládá, že jste si předem nastavili účet u SCC a stáhli jste si úplné instalační médium SLES.

source: In [command]``virt-manager`` select menu:File[New Virtual Machine].
cs: V přkazu [command]``virt-manager`` vyberte nabídku: Soubor[Nový virtuální stroj].

source: Select btn:[Local install media (ISO image or CDROM)].
cs: Vyberte btn:[Místní instalační médium (ISO-obraz nebo CDROM)].

source: Ensure btn:[Use ISO Image] is selected then click btn:[Browse] and locate the full SLES image you downloaded from your SCC account.
cs: Ujistěte se, že je vybráno btn:[Použít ISO obraz], poté klepněte na btn:[Procházet] a vyhledejte úplný obraz SLES, který jste stáhli ze svého účtu SCC.

source: Configure your machine with at least 4096 MB RAM and a minimum of 2 CPUs.
cs: Konfigurujte svůj počítač minimálně s 4096 MB RAM a alespoň se 2 CPU.

source: Create a storage device with a minimum of 234 GB storage space for the installation.
cs: Vytvořte úložné zařízení s minimem 234 GB úložného prostoru pro instalaci.

source: During the partitioning setup of the SLES installation this disk should be partitioned into the following disks:
cs: Během instalace oddílů při instalaci SLES by měl být tento prostor rozdělen na následující disky:

source: | Disk Space Requirements |4{nbsp}GB Swap space |130{nbsp}GB XFS partition (or dedicated virtual disk) for [path]``/var/spacewalk/`` |50{nbsp}GB XFS partition (or dedicated virtual disk) for [path]``/var/lib/pgsql/``
cs: | Požadavky na diskový prostor |4{nbsp}GB odkládací prostor |130{nbsp}GB oddíl XFS (nebo virtuální disk pouze) pro [path]``/var/spacewalk/`` |50{nbsp}GB oddíl XFS (nebo virtuální disk pouze) pro [path]``/var/lib/pgsql/``

source: Select btn:[Finish] to begin the installation.
cs: Vyberte btn:[Dokončit] pro zahájení instalace.

source: Installation of {sles} will begin. For more information on completing an installation of {sles}, see: https://documentation.suse.com/sles/15-SP3/html/SLES-all/article-installation.html.
cs: Začne instalace {sles}. Další informace o dokončení instalace aplikace {sles} najdete na adrese: https://documentation.suse.com/sles/15-SP3/html/SLES-all/article-installation.html.

source: Selecting the {productname} Extension
cs: Výběr rozšíření {productname}

source: During {sles} installation, you will be presented with the [systemitem]``Extension and Module Selection`` screen.
cs: Během instalace {sles} se vám zobrazí obrazovka [systémová položka]``Extension and Module Selection``.

source: This screen will not be shown if you have skipped the registration step at the beginning of the installation process. Ensure you have registered with {suse} and logged in.
cs: Tato obrazovka se nezobrazí, pokud jste přeskočili krok registrace na začátku procesu instalace. Ujistěte se, že jste se zaregistrovali u uživatele {suse} a přihlásili se.

source: Select the {productname} Extension and then click the btn:[Next] button.
cs: Vyberte příponu {productname} a stiskněte tlačítko btn:[Další].

source: Complete the {sles} installation.
cs: Dokončete instalaci {sles}.

source: zypper in patterns-uyuni_server
cs: zypper v patterns-uyuni_server

source: This table specifies the minimum requirements. These are suitable for a quick test installation, such as a server with one client. If you want to use a production environment, review the requirements listed in xref:hardware-requirements.adoc[].
cs: Tato tabulka uvádí minimální požadavky. Jsou vhodné pro rychlou testovací instalaci, například pro server s jedním klientem. Chcete-li použít produkční prostředí, zkontrolujte požadavky uvedené v dokumentu xref:hardware-requirements.adoc[].

source: Create three additional virtual disks required for the {productname} storage partitions.
cs: Vytvořte další tři virtuální disky požadované pro úložné oddíly {productname}.

source: Procedure: Creating the Required Partitions with KVM
cs: Postup: Vytvoření požadovaných oddílů s KVM

source: Configure RAM and number of CPUs (at least 8 GB RAM and 4 CPUs).
cs: Nakonfigurujte RAM a počet CPU (alespoň 8 GB RAM a 4 CPU).

source: Storage size values are the absolute minimum—only suitable for a small test or demo installation. Especially [path]``/var/spacewalk/`` may quickly need more space. Also consider to create a separate partition for [path]``/srv`` where Kiwi images are stored.
cs: Hodnoty velikosti úložiště jsou absolutní minimum - vhodné pouze pro malou zkušební nebo demo instalaci. Zejména [path]``/var/spacewalk/`` může rychle potřebovat více místa. Zvažte také vytvoření samostatného oddílu pro [path]``/srv``, kde jsou uloženy obrazy Kiwi.

source: | VirtIO Storage Disks | Name | Sizing | VirtIO Disk 2 | spacewalk | 101{nbsp}GB | VirtIO Disk 3 | pgsql | 50{nbsp}GB | VirtIO Disk 4 | swap | 4{nbsp}GB
cs: | Virt.IO paměťové disky | Název | Velikost | Virt.IO disk 2 | spacewalk | 101{nbsp}GB | Virt.IO disk 3 | pgsql | 50{nbsp}GB | Virt.IO disk 4 | swap | 4{nbsp}GB

source: During the basic installation prompts you are asked to enter the root password. In the next message box click btn:[Confirm root Password].
cs: Během základních výzev k instalaci budete vyzváni k zadání hesla superuživatele root. V dalším okně se zprávou stiskněte btn:[Potvrdit heslo uživatele root].

source: To:
cs: Na:

source: Partition and mount the virtual disks at the following locations using {yast} Partitioner ([command]``yast2 disk``).
cs: Rozdělte na oddíly a připojte virtuální disky na tato místa pomocí {yast} Partitioner ([command]``yast2 disk``).

source: Storage size values are the absolute minimum. They are suitable only for a small test or demonstration installation, such as a server with one client. Especially [path]``/var/spacewalk/`` may quickly need more space. Also consider to create a separate partition for [path]``/srv`` where Kiwi images are stored.
cs: Hodnoty velikosti úložiště jsou absolutní minimum. Jsou vhodné pouze pro malou testovací nebo předváděcí instalaci, například server s jedním klientem. Zejména [path] ``/var/spacewalk/`` může rychle potřebovat více místa. Zvažte také vytvoření samostatného oddílu pro [path]``/srv``, kde jsou uloženy obrazy Kiwi.

source: | VirtIO Storage Disks | Name | Storage Size | File System Type | VirtIO Disk 2 | [path]``/var/spacewalk`` | 101{nbsp}GB | XFS | VirtIO Disk 3 | [path]``/var/lib/pgsql`` | 50{nbsp}GB | XFS | VirtIO Disk 4 | [path]``swap`` | 4{nbsp}GB | swap
cs: | Paměťové disky Virt.IO | Název | Velikost paměti | Typ systému souborů | Virt.IO disk 2 | [path]``/var/spacewalk`` | 101{nbsp}GB | XFS | Virt.IO disk 3 | [path]``/var/lib/pgsql`` | 50{nbsp}GB | XFS | Virt.IO disk 4 | [path]``swap`` | 4{nbsp}GB | swap (odkládací)

source: Requirements: Describes the hardware, software, and networking requirements that you require before you begin.
cs: Požadavky: Popisuje hardwarové, softwarové a síťové požadavky, které musíte znát, než začnete.

source: Installation: Describes the process to install {productname} components.
cs: Instalace: Popisuje proces instalace komponent {productname}.

source: Setting Up: Describes the initial steps you need to take after installation to make your {productname} environment ready to use.
cs: Nastavení: Popisuje počáteční kroky, které je třeba provést po instalaci, aby bylo vaše prostředí {productname} připraveno k použití.
