Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: If zypper reports that the Uyuni package will not be upgraded, run the command manually:
ja: Uyuniパッケージがアップグレードされないとzypperが報告した場合は、次のコマンドを手動で実行します。

source: Restart the spacewalk services:
ja: spacewalkサービスを再起動します。

source: Reboot the server if a patch update recommends rebooting.
cs: Doporučuje-li provedená aktualizace restartovat server, restartujte ho.
ja: パッチ更新が再起動を推奨している場合、再起動します。

source: By default, zypper refreshes the repository every ten minutes (see ``repo.refresh.delay`` in [path]``/etc/zypp/zypp.conf``). If ``autorefresh`` is disabled, run [command]``zypper ref`` to refresh all repositories.
cs: Ve výchozím nastavení zypper aktualizuje úložiště každých deset minut (viz ``repo.refresh.delay`` v [path]``/etc/zypp/zypp.conf``). Je-li funkce ``autorefresh`` zakázána, obnovte příkazem [command]``zypper ref`` všechna úložiště.
ja: デフォルトでは、zypperは、10分ごとにリポジトリを更新します([path]``/etc/zypp/zypp.conf``の``repo.refresh.delay``を参照)。``autorefresh``が無効になっている場合、[command]``zypper ref``を実行してすべてのリポジトリを更新します。

source: Starting with {productname} 4.1, [command]``spacewalk-schema-upgrade`` is not needed anymore.
cs: Počínaje {productname} 4.1 již není [command]``spacewalk-schema-upgrade``potřebný.
ja: {productname} 4.1以降では、[command]``spacewalk-schema-upgrade``は不要になりました。

source: Starting with {productname} 2020.04 [command]``spacewalk-schema-upgrade`` is not needed anymore.
cs: Počínaje {productname} 2020.04, příkaz [command]``spacewalk-schema-upgrade`` již není potřebný.
ja: {productname} 2020.04以降では、[command]``spacewalk-schema-upgrade``は不要になりました。

source: The schema upgrade is run automatically when the spacewalk service is started with [command]``spacewalk-service start``.
cs: Upgrade schématu se spustí automaticky při spuštění služby spacewalk příkazem [command]``spacewalk-service start``.
ja: スキーマのアップグレードは、[command]``spacewalk-service start``を使用してspacewalkサービスが開始されると自動的に実行されます。

source: Services affected by a package update are not automatically restarted after an update. You need to restart these services manually to avoid potential failures. Use [command]``zypper ps`` to check for applications that are using old code and require restarting.
cs: Služby ovlivněné aktualizací balíčku se po aktualizaci automaticky nerestartují. Tyto služby musíte restartovat ručně, abyste předešli možným poruchám. Použijte příkaz [command]``zypper ps`` ke zjištění aplikací, které používají starý kód a vyžadují restartování.
ja: パッケージの更新の影響を受けるサービスは更新後に自動で再起動されません。これらのサービスは、潜在的な障害を回避するために、手動で再起動する必要があります。[command]``zypper ps``を使用して、古いコードを使用していて再起動が必要なアプリケーションを確認してください。

source: Setup
ja: セットアップ

source: This section describes the initial steps you need to take after installation to make your {productname} environment ready to use.
cs: Tato část popisuje počáteční kroky, které je třeba podniknout po instalaci, aby bylo prostředí {productname} připraveno k použití.
ja: このセクションでは、{productname}環境を使用できるようにするためにインストール後に実行する必要がある初期手順について説明します。

source: | Software and Hardware | Details | Recommendation | openSUSE Leap 15.5 | Clean installation, up-to-date | openSUSE Leap 15.5 | CPU | - | Minimum 4 dedicated 64-bit CPU cores ({x86_64}) | RAM | Test or Base Installation | Minimum 16{nbsp}GB | | Production Server | Minimum 32{nbsp}GB | Disk Space | [path]``/`` (root directory) | Minimum 40{nbsp}GB | | [path]``/var/lib/pgsql`` | Minimum 50{nbsp}GB | | [path]``/var/spacewalk`` | Minimum storage required: 100{nbsp}GB (this will be verified by the implemented check)
ja: | ソフトウェアおよびハードウェア | 詳細 | 推奨 | openSUSE Leap 15.5 | クリーンインストール、最新 | openSUSE Leap 15.5 | CPU | - | 専用64ビットCPUコア数は4つ以上({x86_64}) | RAM | テストまたはベースインストール | 16GB以上 | | 運用サーバ | 32GB以上 | ディスク容量 | [path]``/`` (ルートディレクトリ) | 40GB以上 | | [path]``/var/lib/pgsql`` | 50GB以上 | | [path]``/var/spacewalk`` | 必要な最低ストレージ: 100GB (これは、実装されたチェックによって確認されます)

source: | Software and Hardware | Details | Recommendation | openSUSE Leap 15.5 | Clean installation, up-to-date | openSUSE Leap 15.5 | CPU | | Minimum 2 dedicated 64-bit CPU cores | RAM | Test Server | Minimum 2{nbsp}GB | | Production Server | Minimum 8{nbsp}GB | Disk Space | [path]``/`` (root directory) | Minimum 40{nbsp}GB | | [path]``/srv`` | Minimum 100{nbsp}GB | | [path]``/var/cache`` (Squid) | Minimum 100{nbsp}GB
ja: | ソフトウェアおよびハードウェア | 詳細 | 推奨 | openSUSE Leap 15.5 | クリーンインストール、最新 | openSUSE Leap 15.5 | CPU | | 専用64ビットCPUコア数は2つ以上 | RAM | テストサーバ | 2GB以上 | | 運用サーバ | 8GB以上 | ディスク容量 | [path]``/`` (ルートディレクトリ) | 40GB以上 | | [path]``/srv`` | 100GB以上 | | [path]``/var/cache`` (Squid) | 100GB以上

source: Proxy systems are registered as clients using bootstrap script or {webui}.
ja: プロキシシステムは、ブートストラップスクリプトまたは{webui}を使用してクライアントとして登録します。

source: On the {productname} Server, create openSUSE Leap and the {productname} Proxy channels with the [command]``spacewalk-common-channels`` command.
cs: Na serveru {productname} vytvořte kanály openSUSE Leap a {productname} Proxy, a to příkazem [command]``spacewalk-common-channels``.
ja: {productname}サーバで、[command]``spacewalk-common-channels``コマンドを使用してopenSUSE Leapチャンネルおよび{productname}プロキシチャンネルを作成します。

source: [command]``spacewalk-common-channels`` is part of the [package]``spacewalk-utils`` package:
cs: Program [command]``spacewalk-common-channels`` je částí balíčku [package]``spacewalk-utils``:
ja: [command]``spacewalk-common-channels``は[package]``spacewalk-utils``パッケージの一部です。

source: Instead of [systemitem]``uyuni-proxy-stable-leap-155`` you can also try [systemitem]``uyuni-proxy-devel-leap`` which is the current development version.
ja: [systemitem]``uyuni-proxy-stable-leap-155``の代わりに、現在の開発バージョンである[systemitem]``uyuni-proxy-devel-leap``を試すこともできます。

source: Before you can select the correct child channels while creating the activation key, ensure you have properly synchronized the {opensuse} Leap channel with all the needed child channels and the {productname} Proxy channel.
ja: アクティベーションキーの作成中に正しい子チャンネルを選択する前に、{opensuse} Leapチャンネルをすべての必要な子チャンネルおよび{productname}プロキシチャンネルと正しく同期したことを確認してください。

source: Create an activation key with {opensuse} Leap as a base channel and the other channels as child channels. For more information about activation keys, see xref:client-configuration:activation-keys.adoc[].
ja: {opensuse} Leapをベースチャンネルに指定し、その他のチャンネルを子チャンネルに指定して、アクティベーションキーを作成します。アクティベーションキーの詳細については、xref:client-configuration:activation-keys.adoc[]を参照してください。

source: Create a bootstrap script for the proxy, and adjust it.
ja: プロキシのブートストラップスクリプトを作成し、調整します。

source: Add the GPG key to the [systemitem]``ORG_GPG_KEY=`` parameter.
ja: [systemitem]``ORG_GPG_KEY=``パラメータにGPGキーを追加します。

source: Bootstrap the client using the script.
cs: Bootstrap klienta pomocí skriptu.
ja: スクリプトを使用してクライアントをブートストラップします。

source: For more information, see xref:client-configuration:registration-bootstrap.adoc[].
cs: Další informace viz xref:client-configuration:registration-bootstrap.adoc[].
ja: 詳細については、xref:client-configuration:registration-bootstrap.adoc[]を参照してください。

source: Navigate to menu:Salt[Keys] and accept the key. When the key is accepted, the new proxy will show in menu:Systems[Overview] in the [guimenu]``Recently Registered Systems`` section.
ja: menu:Salt[キー]に移動してキーを受け入れます。キーを受け入れると、［[guimenu]``最近登録されたシステム``］セクションのmenu:システム[概要]に新しいプロキシが表示されます。

source: Navigate to menu:System Details[Software > Software Channels], and check that the proxy channel is selected.
cs: Přejděte do menu:System Details[Software > Software Channels] (Detaily systému [Software> Softwarové kanály]) a zkontrolujte, zda je vybrán kanál proxy.
ja: menu:システムの詳細[ソフトウェア > ソフトウェアチャンネル]に移動し、プロキシチャンネルが選択されていることを確認します。

source: For setting up a registered {productname} Proxy, see xref:uyuni-proxy-setup.adoc[].
cs: Nastavení registrovaného proxy {productname} viz xref:uyuni-proxy-setup.adoc[].
ja: 登録した{productname}プロキシを設定するには、xref:uyuni-proxy-setup.adoc[]を参照してください。

source: Uyuni Proxy Setup
cs: Nastavení serveru Uyuni Proxy
ja: Uyuniのプロキシの設定

source: {productname} Proxy requires additional configuration.
cs: Proxy {productname} vyžaduje další konfiguraci.
ja: {productname}プロキシは追加の設定が必要です。

source: Install the [path]``uyuni_proxy`` pattern
cs: Nainstalujte šablonu (vzor) [path]``uyuni_proxy``
ja: [path]``uyuni_proxy``パターンのインストール

source: Check that the Proxy pattern is installed correctly. This step is part of xref:installation-and-upgrade:install-proxy-uyuni.adoc[]. To verify a successful installation, on the server select the [package]``pattern_uyuni_proxy`` package for installation.
ja: プロキシパターンが正しくインストールされたことを確認します。このステップはxref:installation-and-upgrade:install-proxy-uyuni.adoc[]の一部です。正しくインストールされたことを確認するには、サーバでインストール用の[package]``pattern_uyuni_proxy``パッケージを選択します。

source: The salt-broker service will be automatically started after installation is complete. This service forwards Salt interactions to the {productname} Server.
ja: インストール完了後、salt-brokerサービスが自動的に開始されます。このサービスは、Saltのやり取りを{productname}サーバに転送します。

source: Proxy Chains
cs: Proxy řetězce
ja: プロキシチェーン

source: It is possible to arrange proxies in a chain. In such a case, the upstream proxy is named `parent`.
ja: 複数のプロキシをチェーン状に編成できます。その場合、上流プロキシの名前が``parent``になります。

source: Make sure the TCP ports `4505` and `4506` are open on the proxy. The proxy must be able to reach the {productname} Server or a parent proxy on these ports.
cs: Zkontrolujte, zda jsou na serveru proxy otevřené TCP porty `4505` a `4506`. Proxy server musí být na těchto portech schopen dosáhnout serveru {productname} nebo nadřazeného proxy serveru.
ja: TCPポート``4505``および``4506``がプロキシで開いていることを確認してください。プロキシは、これらのポートで{productname}サーバまたは親プロキシにアクセスできる必要があります。

source: Copy Server Certificate and Key
cs: Zkopírujte certifikát a klíč serveru
ja: サーバ証明書およびキーのコピー

source: The proxy will share some SSL information with the {productname} Server. Copy the certificate and its key from the {productname} Server or the parent proxy.
cs: Proxy bude sdílet některé informace SSL se serverem {productname}. Zkopírujte certifikát a jeho klíč ze serveru {productname} nebo z nadřazeného serveru proxy.
ja: プロキシは、SSL情報を{productname}サーバと共有します。証明書およびそのキーを{productname}サーバまたは親プロキシからコピーします。

source: As root, enter the following commands on the proxy using your {productname} Server or parent Proxy (named [replaceable]``PARENT``):
cs: Jako root zadejte následující příkazy na serveru proxy pomocí serveru {productname} nebo nadřazeného proxy (s názvem [replaceable]``RODIČ``):
ja: rootとして、{productname}サーバまたは親プロキシ(名前は[replaceable]``PARENT``)を使用してプロキシで次のコマンドを入力します。

source: To keep the security chain intact, the {productname} Proxy functionality requires the SSL certificate to be signed by the same CA as the {productname} Server certificate. Using certificates signed by different CAs for proxies and server is not supported.
cs: Chcete-li zachovat neporušený řetězec zabezpečení, vyžaduje funkce Proxy {productname} SSL certifikát podepsaný stejnou CA jako certifikát serveru {productname}. Používání certifikátů podepsaných různými CA pro proxy a server není podporováno.
ja: セキュリティチェーンを完全な状態で維持するために、{productname}プロキシの機能では、SSL証明書が{productname}サーバ証明書と同じCAによって署名されている必要があります。プロキシとサーバで異なるCAによって署名されている証明書を使用することはサポートされていません。

source: Run [command]``configure-proxy.sh``
cs: Spusťte příkaz [command]``configure-proxy.sh``
ja: [command]``configure-proxy.sh``の実行

source: The [command]``configure-proxy.sh`` script finalizes the setup of your {productname} Proxy.
cs: Skript [příkaz]``configure-proxy.sh`` dokončí nastavení vašeho proxy {productname}.
ja: [command]``configure-proxy.sh``スクリプトは、{productname}プロキシの設定を終了処理します。

source: Execute the interactive [command]``configure-proxy.sh`` script. Pressing kbd:[Enter] without further input will make the script use the default values provided between brackets ``[]``. Here is some information about the requested settings:
cs: Spusťte interaktivní skript [command]``configure-proxy.sh. Stisknutí tlačítka kbd:[Enter] bez zadání dalších parametrů způsobí, že skript použije výchozí hodnoty uvedené v hranatých závorkách ``[] ``. Zde je několik informací o požadovaném nastavení:
ja: インタラクティブな[command]``configure-proxy.sh``スクリプトを実行します。何も入力せずにkbd:[Enter]キーを押すと、スクリプトでは、``[]``記号で囲まれたデフォルト値を使用します。次に、リクエストされた設定に関する情報を示します。

source: {productname} Parent:: The {productname} parent can be either another proxy or the {productname} Server.
cs: Rodič {productname}:: Rodič (nadřazený) {productname} může být buď jiný proxy, nebo {productname} Server.
ja: {productname} Parent（SUSE Managerの親）::{productname}の親は、別のプロキシまたは{productname}サーバを指定できます。

source: HTTP Proxy
cs: Proxy HTTP
ja: HTTPプロキシ

source: A HTTP proxy enables your {productname} proxy to access the Web. This is needed if direct access to the Web is prohibited by a firewall.
cs: Proxy HTTP umožňuje vašemu proxy {productname} přístup na web. To je nutné, pokud je přímý přístup na web zakázán bránou firewall.
ja: HTTPプロキシでは、{productname}プロキシでWebにアクセスできます。HTTPプロキシは、Webへの直接アクセスがファイアウォールによって禁止されている場合に必要です。

source: Traceback Email
cs: E-mail zpětné stopy (traceback)
ja: Traceback Email（トレースバックメール）

source: An email address where to report problems.
cs: E-mailová adresa, kam hlásit problémy.
ja: 問題を報告するメールアドレス。

source: Use SSL
cs: Použití SSL
ja: Use SSL（SSLの使用）

source: For safety reasons, press ``Y``.
cs: Z bezpečnostních důvodů stiskněte `` Y``.
ja: 安全上の理由によって、``Y``を押します。

source: Do You Want to Import Existing Certificates?
cs: Chcete importovat existující certifikáty?
ja: Do You Want to Import Existing Certificates?（既存の証明書をインポートしますか?）

source: Answer ``N``. This ensures using the new certificates that were copied previously from the {productname} server.
cs: Odpovězte ``N``. Tím je zajištěno použití nových certifikátů, které byly dříve zkopírovány ze serveru {productname}.
ja: ``N``と応答します。そうすることで、前に{productname}サーバからコピーした新しい証明書が使用されます。

source: Organization
cs: Organizace
ja: 組織

source: The next questions are about the characteristics to use for the SSL certificate of the proxy. The organization might be the same organization that was used on the server, unless of course your proxy is not in the same organization as your main server.
cs: Další otázky se týkají charakteristik, které se mají použít pro certifikát SSL serveru proxy. Organizace může být stejná organizace, která byla použita na serveru, pokud ovšem váš proxy server není ve stejné organizaci jako váš hlavní server.
ja: 次の質問は、プロキシのSSL証明書に使用する特性に関するものです。プロキシがメインサーバと同じ組織ではない場合、サーバで使用された組織とこの組織が同じ場合があります。

source: Organization Unit
cs: Organizační jednotka
ja: 組織単位

source: The default value here is the proxy's hostname.
cs: Výchozí hodnota je zde název hostitele proxy (v síti).
ja: ここのデフォルト値はプロキシのホスト名です。

source: City
cs: Město
ja: 市区町村

source: Further information attached to the proxy's certificate.
cs: Další informace připojené k certifikátu proxy.
ja: プロキシの証明書に添付する追加情報。

source: State
cs: Stát
ja: 都道府県

source: Country Code
cs: Kód země
ja: 国コード

source: In the [guimenu]``country code`` field, enter the country code set during the {productname} installation. For example, if your proxy is in the US and your {productname} is in DE, enter `DE` for the proxy.
cs: Do pole [guimenu]``kód země`` zadejte kód země nastavený během instalace produktu {productname}. Pokud je váš proxy například v USA a váš {productname} je v DE, zadejte jako proxy `DE`.
ja: ［[guimenu]``国コード``］フィールドに{productname}のインストール中に設定した国コードを入力します。たとえば、プロキシが米国にある場合に{productname}がドイツにあるときは、プロキシに``DE``と入力します。

source: The country code must be two upper case letters. For a complete list of country codes, see https://www.iso.org/obp/ui/#search.
cs: Kód země musí obsahovat dvě velká písmena. Úplný seznam kódů zemí najdete na https://www.iso.org/obp/ui/#search.
ja: 国コードは大文字2文字にする必要があります。国コードの一覧は https://www.iso.org/obp/ui/#search[]を参照してください。

source: Cname Aliases (Separated by Space)
cs: Aliasy Cname (Common name, obecný název - oddělené mezerou)
ja: Cname Aliases (Separated by Space)（Cnameエイリアス(スペース区切り)）

source: Use this if your proxy can be accessed through various DNS CNAME aliases. Otherwise it can be left empty.
cs: Tuto možnost použijte, je-li Váš proxy dostupný různými aliasy DNS CNAME. Jinak může zůstat prázdná.
ja: プロキシにさまざまなDNS CNAMEエイリアスからアクセスできる場合、これを使用します。それ以外の場合、空白のままにでます。

source: CA Password
cs: Heslo CA (certifikační autority)
ja: CA Password（CAパスワード）

source: Enter the password that was used for the certificate of your {productname} Server.
cs: Zadejte heslo, které bylo použito pro certifikát vašeho serveru {productname}.
ja: {productname}サーバの証明書に使用したパスワードを入力します。

source: Do You Want to Use an Existing SSH Key for Proxying SSH-Push Salt Minion?
cs: Chcete použít existující klíč SSH pro proxy SSH-Push Salt Minion?
ja: Do You Want to Use an Existing SSH Key for Proxying SSH-Push Salt Minion?（SSH-Push Salt Minionのプロキシ処理に既存のSSHキーを使用しますか?）

source: Use this option if you want to reuse a SSH key that was used for SSH-Push Salt clients on the server.
cs: Tuto možnost použijte, pokud chcete znovu použít klíč SSH, který byl použit pro klienty SSH-Push Salt na serveru.
ja: サーバでSSH-Push Saltクライアントに使用したSSHキーを再使用する場合、このオプションを使用します。

source: If parts are missing, such as CA key and public certificate, the script prints commands that you must execute to integrate the needed files. When the mandatory files are copied, run [command]``configure-proxy.sh`` again. If you receive an HTTP error during script execution, run the script again.
cs: Pokud součásti chybí, například klíč CA a veřejný certifikát, skript vytiskne příkazy, které musíte provést, abyste integrovali potřebné soubory. Po zkopírování povinných souborů spusťte znovu [příkaz]``configure-proxy.sh``. Pokud se během provádění skriptu zobrazí chyba HTTP, spusťte skript znovu.
ja: CAキーやパブリック証明書などがない場合、スクリプトは、必要なファイルを統合するために実行する必要があるコマンドを出力します。必須ファイルがコピーされたら、[command]``configure-proxy.sh``を再実行します。スクリプトの実行中にHTTPエラーが発生したら、このスクリプトを再実行します。

source: [command]``configure-proxy.sh`` activates services required by {productname} Proxy, such as [systemitem]``squid``, [systemitem]``apache2``, [systemitem]``salt-broker``, and [systemitem]``jabberd``.
cs: [command]``configure-proxy.sh`` aktivuje služby vyžadované {productname} Proxy, například [systemitem]``squid``, [systemitem]``apache2``, [systemitem]``salt-broker`` a [systemitem]``jabberd``.
ja: [command]``configure-proxy.sh``は、[systemitem]``squid``、[systemitem]``apache2``、[systemitem]``salt-broker``、[systemitem]``jabberd``など、{productname}プロキシで必要なサービスをアクティブ化します。

source: To check the status of the proxy system and its clients, click the proxy system's details page on the {webui} (menu:Systems[Proxy], then the system name). [guimenu]``Connection`` and [guimenu]``Proxy`` subtabs display various status information.
cs: Chcete-li zkontrolovat stav systému proxy a jeho klientů, klikněte na stránku s podrobnostmi o systému proxy na {webui} (menu:Systems[Proxy], poté název systému). Pod-záložky [guimenu]``Připojení`` a [guimenu]``Proxy`` zobrazují různé informace o stavu.
ja: プロキシシステムおよびそのクライアントの状態をチェックするには、{webui}のプロキシシステムの詳細ページをクリックします(menu:システム[プロキシ]、<システム名>に移動)。［[guimenu]``接続``］サブタブおよび［[guimenu]``プロキシ``］サブタブにはさまざまな状態情報が表示されます。

source: Enable PXE Boot
cs: Povolte spuštění PXE
ja: PXEブートの有効化

source: Synchronize Profiles and System Information
cs: Synchronizace profilů a systémových informací
ja: プロファイルとシステム情報を同期

source: To enable PXE boot through a proxy, additional software must be installed and configured on both the {productname} Proxy and the {productname} Server.
cs: Chcete-li povolit spouštění PXE prostřednictvím serveru proxy, je nutné nainstalovat a nakonfigurovat další software na serveru {productname} Proxy i na serveru {productname}.
ja: プロキシでPXEブートを有効にするには、追加のソフトウェアをインストールし、{productname}プロキシと{productname}サーバの両方で設定する必要があります。

source: On the {productname} Proxy, install the [package]``susemanager-tftpsync-recv`` package:
cs: Na server {productname} Proxy nainstalujte balíček [package]``susemanager-tftpsync-recv``:
ja: {productname}プロキシで、[package]``susemanager-tftpsync-recv``パッケージをインストールします。

source: On the {productname} Proxy, run the [command]``configure-tftpsync.sh`` setup script and enter the requested information:
cs: Na serveru {productname} Proxy spusťte instalační skript [command]``configure-tftpsync.sh`` a zadejte požadované informace:
ja: {productname}プロキシで、[command]``configure-tftpsync.sh``設定スクリプトを実行し、要求された情報を入力します。

source: You need to provide the hostname and IP address of the {productname} Server and the proxy. You also need to enter the path to the tftpboot directory on the proxy.
cs: Musíte uvést název hostitele a IP adresu serveru a proxy {productname}. Musíte také zadat cestu k adresáři tftpboot na serveru proxy.
ja: {productname}サーバおよびプロキシのホスト名とIPアドレスを入力する必要があります。プロキシのtftpbootディレクトリへのパスも入力する必要があります。

source: On the {productname} Server, install [package]``susemanager-tftpsync``:
cs: Na server {productname} instalujte [package]``susemanager-tftpsync``:
ja: {productname}サーバで、[package]``susemanager-tftpsync``をインストールします。

source: On the {productname} Server, run [command]``configure-tftpsync.sh``.
cs: Na serveru {productname} spusťte [command]``configure-tftpsync.sh``.
ja: {productname}サーバで、[command]``configure-tftpsync.sh``を実行します。

source: This creates the configuration, and uploads it to the {productname} Proxy:
cs: Tímto se vytvoří konfigurace a nahraje se na server {productname} Proxy:
ja: 設定が作成され、{productname}プロキシにアップロードされます。

source: Start an initial synchronization on the {productname} Server:
cs: Spusťte počáteční synchronizaci na serveru {productname}:
ja: {productname}サーバで初期同期を開始します。

source: It can also be done after a change within {cobbler} that needs to be synchronized immediately. Otherwise {cobbler} synchronization will run automatically when needed.
ja: すぐに同期する必要がある変更を{cobbler}内で行った後にも実行できます。それ以外の場合、{cobbler}の同期は必要なときに自動的に実行されます。

source: Configure DHCP for PXE through Proxy
cs: Nakonfigurujte DHCP pro PXE přes server proxy
ja: プロキシを使用したDHCP for PXEの設定

source: {productname} uses {cobbler} for client provisioning. PXE (tftp) is installed and activated by default. Clients must be able to find the PXE boot on the {productname} Proxy using DHCP. Use this DHCP configuration for the zone which contains the clients to be provisioned:
ja: {productname}は、クライアントのプロビジョニングに{cobbler}を使用します。PXE (tftp)は、デフォルトでインストールされ、アクティブ化されます。クライアントは、DHCPを使用して{productname}プロキシでPXEブートを探すことができる必要があります。プロビジョニングするクライアントが含まれているゾーンでこのDHCP設定を使用します。

source: Replace the {productname} Proxy
cs: Změna proxy {productname}
ja: {productname}プロキシの置き換え

source: A proxy does not contain any information about the clients that are connected to it. Therefore, a proxy can be replaced by a new one at any time. The replacement proxy must have the same name and IP address as its predecessor.
cs: Proxy server neobsahuje žádné informace o klientech, kteří jsou k němu připojeni. Proto může být proxy kdykoli nahrazen novým. Náhradní proxy musí mít stejný název a IP adresu jako jeho předchůdce.
ja: プロキシには、接続されているクライアントの情報が含まれていません。したがって、いつでも新しいプロキシに置き換えることができます。置き換えプロキシは、その元のプロキシと同じ名前とIPアドレスにする必要があります。

source: Shut down the old proxy, and leave it installed while you prepare the replacement. Create a reactivation key for this system and then register the new proxy using the reactivation key. If you do not use the reactivation key, you will need to re-register all the clients against the new proxy.
cs: Vypněte starý proxy server a nechte jej nainstalovaný, zatímco budete připravovat náhradu. Vytvořte reaktivační klíč pro tento systém a poté zaregistrujte nový proxy pomocí reaktivačního klíče. Pokud nepoužíváte reaktivační klíč, budete muset znovu zaregistrovat všechny klienty k novému proxy.
ja: 古いプロキシをシャットダウンし、置き換えを準備している間、インストール状態を保持します。このシステムの再アクティベーションキーを作成し、その再アクティベーションキーを使用して新しいプロキシを登録します。再アクティベーションキーを使用しない場合、新しいプロキシに対してすべてのクライアントを再登録する必要があります。
