Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: In the dialog, enter [guimenu]``Username`` and [guimenu]``Password``, and confirm with btn:[Save].
cs: V dialogovém okně zadejte [guimenu]``Username`` (Uživatelské jméno) a [guimenu]``Password`` (Heslo) a potvrďte stisknutím btn:[Save] (Uložit).

source: When the credentials are confirmed with a check-mark icon, proceed with <<proc-quickstart-first-channel-sync>>.
cs: Když jsou pověření potvrzena ikonou zaškrtnutí, pokračujte <<proc-quickstart-first-channel-sync>>.

source: Procedure: Synchronizing with {scc}
cs: Postup: Synchronizace se {scc}

source: If you previously registered with {scc} a list of products will populate the table. This operation could take up to a few minutes. You can monitor the progress of the operation in section on the right ``Refresh the product catalog from SUSE Customer Center``. The table of products lists architecture, channels, and status information. For more information, see xref:reference:admin/setup-wizard.adoc[Wizard].
cs: Pokud jste se již dříve zaregistrovali u {scc}, naplní tabulku seznam produktů. Tato operace může trvat až několik minut. Můžete sledovat její postup v sekci vpravo ``Refresh the product catalog from SUSE Customer Center`` (Obnovit katalog produktu ze zákaznického centra SUSE). Tabulka produktů uvádí architekturu, kanály a informace o stavu. Další informace viz xref:reference:admin/setup-wizard.adoc[Wizard](Průvodce).

source: Use ``Filter by product description`` and ``Filter by architecture`` to filter the liste of displayed products.
cs: K filtraci seznamu zobrazených produktů použijte ``Filter by product description`` (Filtrovat podle popisu produktu) a ``Filter by architecture`` (Filtrovat podle architektury).

source: After adding the channel, {productname} will schedule the channel to be synchronized. This can take a long time as {productname} will copy channel software sources from the {suse} repositories located at {scc} to local [path]``/var/spacewalk/`` directory of your server.
cs: Po přidání kanálu naplánuje {productname} synchronizaci kanálu. To může trvat dlouho, protože {productname} zkopíruje zdroje softwaru kanálu z úložišť {suse} umístěných na {scc} do místního adresáře [cesta] ``/var/spacewalk/`` vašeho serveru.

source: PostgreSQL and Transparent Huge Pages
cs: PostgreSQL a Transparent Huge Pages

source: In some environments, _Transparent Huge Pages_ provided by the kernel may slow down PostgreSQL workloads significantly.
cs: V některých prostředích mohou _Transparent Huge Pages_ (transparentní obří stránky) poskytované jádrem významně zpomalit pracovní zatížení PostgreSQL.

source: To disable _Transparant Huge Pages_ set the [option]``transparent_hugepage`` kernel parameter to [option]``never``. This has to be changed in [path]``/etc/default/grub`` and added to the line [option]``GRUB_CMDLINE_LINUX_DEFAULT``, for example:
cs: Chcete-li deaktivovat _Transparentní obří stránky_, nastavte parametr jádra [option]``transparent_hugepage`` na [option]``never`` (nikdy). To je třeba změnit v [path]``/etc/default/grub`` a přidat do řádku [option]``GRUB_CMDLINE_LINUX_DEFAULT``, například:

source: tail -f /var/log/rhn/reposync/<CHANNEL_NAME>.log
cs: tail -f /var/log/rhn/reposync/<NÁZEV_KANÁLU>.log

source: Server - Major Version Upgrade (X Upgrade)
cs: Server - upgrade hlavní verze (upgrade X)

source: Server - Minor Version Upgrade with {yast}
cs: Server - upgrade menší verze s {yast}

source: To perform the upgrade with {yast}, use the Online Migration tool.
cs: Chcete-li upgradovat nástrojem {yast}, použijte nástroj Online Migration.

source: If {yast} does not have the Online Migration tool available, install the [package]``yast2-migration`` package and all the required packages. After installing, restart {yast} to ensure the tool is available within {yast}.
cs: Nemá-li {yast} k dispozici nástroj Online Migration, nainstalujte balíček [package]``yast2-migration`` a všechny požadované balíčky. Po instalaci restartujte aplikaci {yast}, abyste se ujistili, že už je nástroj v {yast} k dispozici.

source: Procedure: Upgrading with {yast}
cs: Postup: Upgradování nástrojem {yast}

source: From the command prompt, as root, ensure the spacewalk services are not running:
cs: Z příkazového řádku, jako root, zjistěte, zda jsou ukončeny služby spacewalk:

source: Launch the {yast} online migration tool:
cs: Spusťte nástroj {yast} pro online migraci:

source: {yast} will show the possible migration targets with detailed summaries.
cs: Program {yast} zobrazí možné cíle migrace s podrobnými souhrny.

source: Reboot the server.
cs: Restartujte server.

source: Ensure the spacewalk services are running:
cs: Zajistěte, aby byly spuštěny služby spacewalk:

source: [command]``spacewalk-schema-upgrade`` is not needed anymore. It will be run during [command]``spacewalk-service start`` automatically.
cs: [command]``spacewalk-schema-upgrade`` již není potřeba. Spustí se automaticky při [command]``spacewalk-service start``.

source: During the upgrade, {yast} will install all recommended packages. This can significantly increase the installation size of the system. To only install required packages, open the [path]``/etc/zypp/zypp.conf`` configuration file and set these variables:
cs: Během upgradu nainstaluje {yast} všechny doporučené balíčky. To může výrazně zvýšit velikost instalace systému. Chcete-li nainstalovat pouze nezbytné balíčky, otevřete konfigurační soubor [path]``/etc/zypp/zypp.conf`` a nastavte tyto proměnné:

source: This changes the behavior of all future package operations.
cs: Tím se změní chování všech budoucích operací s balíčky.

source: Server - Minor Version Upgrade with Zypper
cs: Server - Upgrade menší verze pomocí Zypper

source: To perform the upgrade with Zypper, use the Zypper migration tool.
cs: Chcete-li provést upgrade pomocí Zypperu, použijte migrační nástroj Zypper.

source: Procedure: Upgrading with Zypper
cs: Postup: Upgrade pomocí Zypperu

source: Launch the Zypper migration tool:
cs: Spusťte migrační nástroj Zypper:

source: If the process fails, check these issues first:
cs: Selže-li proces, zkontrolujte nejprve tyto problémy:

source: If Zypper does not have the migration tool available, install the [package]``zypper-migration-plugin`` package.
cs: Nemá-li Zypper nástroj pro migraci, nainstalujte balíček [package]``zypper-migration-plugin``.

source: If there are older updates available, Zypper will notify you and ask to install them first.
cs: Jsou-li k dispozici starší aktualizace, Zypper vás na to upozorní a požádá o jejich instalaci.

source: You must install all updates before performing the upgrade.
cs: Před upgradem musíte nainstalovat všechny aktualizace.

source: Server - Minor Version Upgrade (Y Upgrade)
cs: Server - Upgrade menší verze (Upgrade Y)

source: You can upgrade {productname} to the next minor version using either the {yast} online migration tool or the Zypper command line tool. This is often referred to as a product migration, service pack migration, or SP migration. This procedure does not replace the server with an updated copy. It is an in-place upgrade.
cs: {productname} můžete upgradovat na další menší verzi pomocí online migračního nástroje {yast} nebo nástroje příkazového řádku Zypper. Tento postup se často nazývá migrace produktu nebo migrace SP (Service Pack). Tento postup nenahrazuje server aktualizovanou kopií - je to upgrade na místě.

source: Upgrades should be run from a text console, rather than a graphical interface like GNOME. If you are logged into a GNOME session running on the machine you are going to migrate, you will need to switch to a text console. This does not apply if you are logged in from a remote machine (unless you are running a VNC session with GNOME).
cs: Upgrady by se měly spouštět z textové konzoly, nikoli z grafického rozhraní, jako je GNOME. Pokud jste přihlášeni k relaci GNOME spuštěné na počítači, který chcete migrovat, budete muset přepnout na textovou konzolu. To neplatí, pokud jste přihlášeni ze vzdáleného počítače (pokud nejste v relaci VNC s GNOME).

source: Server - Patch Level Upgrade (Z Upgrade)
cs: Server - upgrade záplatou (Z Upgrade)

source: This update procedure covers simple package updates or a concerted micro update, which is also known as a maintenance update (MU). During a MU the user stops services, updates packages, runs the script to update the database, and restarts services.
cs: Tento postup aktualizace se týká jednoduchých aktualizací balíčků nebo společné mikro aktualizace, která se také označuje jako aktualizace údržby (maintenance update, MU). Během MU uživatel zastaví služby, aktualizuje balíčky, spustí skript pro aktualizaci databáze a restartuje služby.

source: This means first you ensure that you have the latest version of all installed packages installed. Then you can upgrade the database schema.
cs: To znamená, že nejprve se ujistěte, že máte nainstalovanou nejnovější verzi všech nainstalovaných balíčků. Pak můžete upgradovat schéma databáze.

source: By default, several update channels are configured and enabled for the {productname} Server. New and updated packages will become available automatically.
cs: Ve výchozím nastavení je pro {productname} Server konfigurováno a povoleno několik aktualizačních kanálů. Nové a aktualizované balíčky budou k dispozici automaticky.

source: List available patches:
cs: Seznam dostupných oprav:

source: Apply all available patches:
cs: Použít všechny dostupné opravy:

source: Command [command]``spacewalk-schema-upgrade`` is not needed anymore. It will run automatically during [command]``spacewalk-service start``.
cs: Příkaz [command]``spacewalk-schema-upgrade`` již není potřebný. Spustí se automaticky během [command]``spacewalk-service start``.

source: Setup Wizard
cs: Průvodce nastavením

source: When you have completed your {productname} installation, you can use the setup wizard to complete the last few steps. The setup wizard allows you to configure the HTTP proxy, organization credentials, and {suse} products.
cs: Po dokončení instalace produktu {productname} můžete použít průvodce nastavením k dokončení posledních několika kroků. Průvodce nastavením umožňuje konfigurovat proxy HTTP, pověření organizace a produkty {suse}.

source: The setup wizard is displayed by default when you log in the {productname} {webui} for the first time. You can access the setup wizard directly by navigating to menu:Admin[Setup Wizard].
cs: Průvodce nastavením se ve výchozím nastavení zobrazí při prvním přihlášení k {productname} {webui}. K průvodci nastavením můžete přejít přímo z menu:Admin[Setup Wizard] (Správce [Průvodce nastavením]).

source: Configure the HTTP Proxy
cs: Nakonfigurujte HTTP Proxy

source: {productname} can connect to the {scc} (SCC) or other remote servers using a proxy. Navigate to the [guimenu]``HTTP Proxy`` tab to configure the proxy.
cs: {productname} se může připojit k {scc} (SCC) nebo jiným vzdáleným serverům pomocí proxy. Přejděte na kartu [guimenu]``HTTP Proxy`` a nakonfigurujte proxy.

source: You will need to provide the hostname of the proxy. Use the syntax ``<hostname>:<port>``. For example: ``<example.com>:8080``.
cs: Budete muset zadat název hostitele serveru proxy. Použijte syntaxi ``<hostname>:<port>``. Například: ``<priklad.com>:8080``.

source: You can disable use of the proxy by clearing the fields.
cs: Vymazáním polí můžete zakázat použití serveru proxy.

source: When choosing a username or password for your {productname} Proxy, ensure it does not contain an ``@`` or ``:`` character. These characters are reserved.
cs: Při výběru uživatelského jména nebo hesla pro váš server {productname} se ujistěte, že neobsahuje znak ``@`` nebo ``:``. Tyto znaky jsou vyhrazeny.

source: Configure Organization Credentials
cs: Konfigurace pověření organizace

source: Your {scc} account is associated with the administration account of your organization. You can share your {scc} access with other users within your organization. Navigate to the [guimenu]``Organization Credentials`` tab to grant users within your organization access to your {scc} account.
cs: Váš účet {scc} je přidružen k účtu správy vaší organizace. Svůj přístup {scc} můžete sdílet s ostatními uživateli ve vaší organizaci. Přejděte na kartu [guimenu]``Organization Credentials`` (Pověření organizace) a udělte uživatelům ve vaší organizaci přístup k vašemu účtu {scc}.

source: Click btn:[Add a new credential], enter the username and password of the user to grant access to, and click btn:[Save]. A new credential card is shown for the user you have granted access to. Use these buttons on the card to edit or revoke access:
cs: Stiskněte btn:[Add a new credential] (Přidat nové pověření), zadejte uživatelské jméno a heslo uživatele, kterému chcete udělit přístup, a stiskněte btn:[Save] (Uložit). U uživatele, kterému jste udělili přístup, se zobrazí nová přihlašovací karta. Pomocí těchto tlačítek na kartě můžete upravit nebo zrušit přístup:

source: Check credential validation status (green tick or red cross icon).
cs: Zkontrolujte stav ověření pověření (ikona zeleného zaškrtnutí nebo červeného křížku).

source: To re-check the credential with SCC, click the icon.
cs: Chcete-li znovu zkontrolovat pověření u SCC, klikněte na ikonu.

source: Set the primary credentials for inter-server synchronization (yellow star icon).
cs: Nastavte primární pověření pro synchronizaci mezi servery (ikona žluté hvězdičky).

source: List the subscriptions related to a certain credential (list icon).
cs: Ukázat seznam předplatných souvisejících s určitým pověřením (ikona seznamu).

source: Edit the credential (pencil icon).
cs: Upravit pověření (ikona tužky).

source: Delete the credential (trash can icon).
cs: Odstranit pověření (ikona koše).

source: Configure Products
cs: Konfigurovat produkty

source: Your {suse} subscription entitles you to access a range of products. Navigate to the [guimenu]``Products`` tab to browse the products available to you and synchronize {productname} with {scc}.
cs: Vaše předplatné {suse} vás opravňuje k přístupu k řadě produktů. Přejděte na kartu [guimenu]``Produkty`` a procházejte produkty, které máte k dispozici, a synchronizujte {productname} s {scc}.

source: Filters help you search for products by description or architecture.
cs: Filtry vám pomohou vyhledat produkty podle popisu nebo architektury.

source: The list is organized by product name showing products on top which have a subscription. Freely available products appear at the end of the list. For each product, you can see the architecture it can be used on. Click the arrow next to the product name to see associated channels and extensions. Click the btn:[Channels] icon to see the complete list of channels associated with each product.
cs: Seznam je uspořádán podle názvu produktu. Odebírané produkty jsou na začátku, zdarma dostupné na konci seznamu. U každého produktu můžete vidět architekturu, na které lze použít. Kliknutím na šipku vedle názvu produktu zobrazíte přidružené kanály a rozšíření. Kliknutím na ikonu btn:[Channels] (Kanály) zobrazíte kompletní seznam kanálů přidružených ke každému produktu.

source: For products based on {sle}{nbsp}15 and above, you can choose to only synchronize required packages, or to also include recommended products. Toggle the btn:[include recommended] switch on to synchronize all products, and toggle the switch off to synchronize only required products.
cs: U produktů založených na {sle}{nbsp}15 a vyšších můžete zvolit synchronizaci pouze požadovaných balíčků nebo zahrnutí také doporučených produktů. Přepnutím přepínače btn:[include recommended] (zahrnout doporučené) synchronizujete všechny produkty a přepnutím přepínače synchronizujete pouze požadované produkty.

source: You can further refine which products you want to synchronize by selecting or deselecting individual product.
cs: Výběrem nebo zrušením výběru jednotlivých produktů můžete dále upřesnit, které produkty chcete synchronizovat.

source: When you have completed your selection, click btn:[Add products], and click btn:[Refresh] to schedule the synchronization.
cs: Po dokončení výběru klepněte na btn:[Add products] (Přidat produkty) a klepněte na btn:[Refresh] (Obnovit), abyste naplánovali synchronizaci.

source: Synchronization progress for each product is shown in a progress bar next to the product name. Depending on the products you have chosen, synchronization can take up to several hours. New products will be available for you to use in {productname} when synchronization is complete.
cs: Průběh synchronizace pro každý produkt se zobrazuje v liště postupu vedle názvu produktu. V závislosti na produktech, které jste si vybrali, může synchronizace trvat až několik hodin. Až bude synchronizace dokončena, v {productname} budete moci používat nové produkty.

source: If your synchronization fails, it could be because of a third party GPG key or your company firewall blocking access to the download server. Please check the notification details for the error. For more information about troubleshooting product synchronization, see xref:administration:tshoot-sync.adoc[].
cs: Selže-li Vaše synchronizace, může to být kvůli GPG klíči třetí strany nebo firewallu vaší společnosti blokujícímu přístup k serveru pro stažení. Zkontrolujte chybu v podrobnostech oznámení. Další informace o řešení potíží se synchronizací produktu najdete v xref:administration:tshoot-sync.adoc[].

source: This section contains some common problems you might encounter with {productname} upgrades, and solutions to resolving them.
cs: Tato část obsahuje několik běžných problémů, se kterými se můžete při upgradu produktu {productname} setkat, a jejich řešení.

source: To get more information about an upgrade problem, check the migration log file. The log file is located at [path]``/var/log/rhn/migration.log`` on the system you are upgrading.
cs: Chcete-li získat další informace o problémech při upgradu, zkontrolujte soubor protokolu migrace. Soubor protokolu se nachází na [path]``/var/log/rhn/migration.log`` v systému, který upgradujete.

source: Not Enough Disk Space
cs: Nedostatek místa na disku

source: Check the available disk space before you begin migration. We recommend locating [path]``/var/spacewalk`` and [path]``/var/lib/pgsql`` on separate XFS file systems.
cs: Před zahájením migrace zkontrolujte dostupné místo na disku. Doporučujeme umístit [path]``/var/spacewalk`` a [path]``/var/lib/pgsql`` na různé souborové systémy XFS.

source: When you are setting up a separate file system, edit [path]``/etc/fstab`` and remove the [path]``/var/lib/pqsql`` subvolume. Reboot the server to pick up the changes.
cs: Když nastavujete samostatný systém souborů, upravte [path]``/etc/fstab`` a odstraňte podsvazek [path]``/var/lib/pqsql``. Restartujte server, aby se změny provedly.

source: Retrying to Set up the Target System
cs: Pokus o nastavení cílového systému

source: If you need to retry setting up the target system, follow these steps:
cs: Pokud potřebujete opakovat nastavení cílového systému, postupujte takto:

source: Delete [path]``/root/.MANAGER_SETUP_COMPLETE``.
cs: Smažte [path]``/root/.MANAGER_SETUP_COMPLETE``.

source: Stop PostgreSQL and remove [path]``/var/lib/pgsql/data``.
cs: Zastavte PostgreSQL a odstraňte [path]``/var/lib/pgsql/data``.

source: Set the target system hostname to match the source system hostname.
cs: Nastavte hostitelský název cílového systému tak, aby odpovídal hostitelskému názvu zdrojového systému.

source: Check the [path]``/etc/hosts`` file, and correct it if necessary.
cs: Zkontrolujte soubor [path]``/etc/hosts`` a v případě potřeby jej opravte.

source: Check [path]``/etc/setup_env.sh`` on the target system, and ensure the database name is set:
cs: Zkontrolujte [path]``/etc/setup_env.sh`` v cílovém systému a ujistěte se, že je nastaven název databáze:

source: Reboot the target system.
cs: Restartujte cílový systém.

source: Run [command]``mgr-setup`` again.
cs: Opakujte příkaz [command]``mgr-setup``.

source: Schema Upgrade Fails
cs: Upgrade schématu selže

source: If the schema upgrade fails, the database version check and all the other spacewalk services do not start. Run [command]``spacewalk-service start`` for more information and hints how to proceed.
cs: Selže-li upgrade schématu, kontrola verze databáze ani ostatní služby spacewalk se nespustí. Příkazem [command]``spacewalk-service start``(spustit služby spacewalk) získáte další informace a rady, jak postupovat.

source: You can also run the version check directly:
cs: Můžete také spustit kontrolu verze přímo:

source: These commands print debug information if you do not want to run the more general [command]``spacewalk-service`` command.
cs: Tyto příkazy tisknou informace o ladění, pokud nechcete spustit obecnější příkaz [command]``spacewalk-service``.

source: The {webui} Fails to Load
cs: {webui} se nepodařilo zavést

source: Sometimes, the {webui} will not load after migration. This is usually caused by browser caching, if the new system has the same hostname and IP address as the old system. This duplication can confuse some browsers.
cs: Někdy se {webui} nezavede. To je obvykle způsobeno ukládáním do mezipaměti prohlížeče, pokud má nový systém stejný název hostitele a IP adresu jako starý systém. Tato duplicita může některé prohlížeče zmást.

source: This issue is resolved by clearing the cache and reloading the page. In most browsers, you can do this quickly by pressing kbd:[Ctrl+F5].
cs: Tento problém je řešen smazáním mezipaměti a znovunačtením stránky. Ve většině prohlížečů to můžete udělat rychle stisknutím kbd:[Ctrl+F5].

source: {productname} has three main components, all of which need regular updates. This guide covers updating the {productname} Server, Proxy, and clients, as well as some underlying components, such as the database.
cs: {productname} má tři hlavní komponenty, které všechny vyžadují pravidelné aktualizace. Tato příručka popisuje aktualizaci {productname} Serveru, Proxy, klientů, a také některých základních komponent, jako databáze.

source: It is possible to automate some of the upgrades, but others need to be performed manually.
cs: Některé z upgradů je možné automatizovat, ale jiné je třeba provést ručně.

source: This guide is not intended to be read cover to cover. Instead, navigate to the component you want to upgrade, then identify the versions you are upgrading from and to.
cs: Tato příručka není určena ke čtení od A do Z. Místo toho přejděte na komponentu, kterou chcete upgradovat, a poté identifikujte verze, z kterých a do kterých upgradujete.

source: Upgrade Guide Overview
cs: Přehled Průvodce upgradem

source: Proxy Registration
cs: Registrace proxy

source: Proxy systems are registered as Salt clients using a bootstrap script.
cs: Proxy systémy jsou registrovány jako klienti Salt bootstrapovým skriptem.

source: Before you can select the correct child channels while creating the activation key, ensure you have properly synchronized the openSUSE Leap channel with all the needed child channels and the {productname} Proxy channel.
cs: Než budete moci při vytváření aktivačního klíče vybrat správné podřízené kanály, ujistěte se, že jste správně synchronizovali kanál openSUSE Leap se všemi potřebnými podřízenými kanály a kanálem {productname} Proxy.

source: For more information, see xref:client-configuration:clients-opensuseleap.adoc[].
cs: Další informace viz xref:client-configuration:clients-opensuseleap.adoc[].

source: Create an activation key with openSUSE Leap as a base channel and the other channels as child channels.
cs: Vytvořte aktivační klíč s openSUSE Leap jako základním kanálem a dalšími kanály jako podřízenými kanály.

source: Modify a bootstrap script for the proxy.
cs: Upravte bootstrap skript pro proxy.
