Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: Procedure: Generating a Proxy Container Configuration Using {webui}
zh_cn: 过程：使用 {webui} 生成代理容器配置

source: The CA certificates generated by the server are stored in the [path]``/var/lib/containers/storage/volumes/root/_data/ssl-build`` directory.
ja: サーバによって生成されたCA証明書は、[path]``/var/lib/containers/storage/volumes/root/_data/ssl-build``ディレクトリに保存されます。
ko: 서버에서 생성된 CA 인증서는 [path]``/var/lib/containers/storage/volumes/root/_data/ssl-build`` 디렉토리에 저장됩니다.
zh_cn: 服务器生成的 CA 证书存储在 [path]``/var/lib/containers/storage/volumes/root/_data/ssl-build`` 目录中。

source: Click btn:[Generate] to register a new proxy FQDN in the {productname} Server and generate a configuration archive ([filename]``config.tar.gz``) containing details for the container host.
ja: btn:[生成]をクリックして、{productname}サーバに新しいプロキシFQDNを登録し、コンテナホストの詳細を含む設定アーカイブ([filename]``config.tar.gz``)を生成します。
ko: btn:[생성]을 클릭하여 {productname} 서버에 새 프록시 FQDN을 등록하고 컨테이너 호스트에 대한 세부사항이 포함된 구성 아카이브([filename]``config.tar.gz``)를 생성합니다.
zh_cn: 单击 btn:[生成] 以在 {productname} 服务器中注册新代理 FQDN，并生成包含容器主机细节的配置归档 ([filename]``config.tar.gz``)。

source: After a few moments you are presented with file to download. Save this file locally.
ja: しばらくすると、ダウンロードするファイルが表示されます。このファイルをローカルに保存します。
ko: 잠시 후 다운로드할 파일이 표시됩니다. 이 파일을 로컬에 저장합니다.
zh_cn: 片刻之后，系统会显示文件可供下载。请将此文件保存在本地。

source: Generate Proxy Configuration With [literal]``spacecmd`` and Self-Signed Certificate
ko: [literal]``spacecmd`` 및 자체 서명 인증서를 사용하여 프록시 구성 생성
zh_cn: 使用 [literal]``spacecmd`` 和自我签名证书生成代理配置

source: You can generate a Proxy configuration using [literal]``spacecmd``.
ja: [literal]``spacecmd``を使用してプロキシ設定を生成できます。
zh_cn: 可以使用 [literal]``spacecmd`` 生成代理配置。

source: Procedure: Generating Proxy Configuration with spacecmd and Self-Signed Certificate
ja: プロシージャ: spacecmdと自己署名証明書を使用してプロキシ設定を生成する
ko: 절차: spacecmd 및 자체 서명 인증서를 사용하여 프록시 구성 생성
zh_cn: 过程：使用 spacecmd 和自我签名证书生成代理配置

source: Copy the generated configuration from the server container:
ja: 生成された設定をサーバコンテナからコピーします。
ko: 서버 컨테이너에서 생성된 구성을 복사합니다.
zh_cn: 从服务器容器复制生成的配置：

source: Generate Proxy Configuration With [literal]``spacecmd`` and Custom Certificate
ko: [literal]``spacecmd`` 및 사용자 정의 인증서를 사용하여 프록시 구성 생성
zh_cn: 使用 [literal]``spacecmd`` 和自定义证书生成代理配置

source: You can generate a Proxy configuration using [literal]``spacecmd`` for custom certificates rather than the default self-signed certificates.
ko: [literal]``spacecmd``를 사용하여 기본 자체 서명 인증서가 아닌 사용자 정의 인증서에 대해 프록시 구성을 생성할 수 있습니다.
zh_cn: 可以使用 [literal]``spacecmd`` 为自定义证书（而不是默认的自我签名证书）生成代理配置。

source: Procedure: Generating Proxy Configuration with spacecmd and Custom Certificate
ja: プロシージャ: spacecmdとカスタム証明書を使用してプロキシ設定を生成する
ko: 절차: spacecmd 및 사용자 정의 인증서를 사용하여 프록시 구성 생성
zh_cn: 过程：使用 spacecmd 和自定义证书生成代理配置

source: If your setup uses an intermediate CA, copy it as well and include it in the command with the `-i` option (can be provided multiple times if needed) :
ko: 설정에서 중간 CA를 사용하는 경우, 이를 복사하여 ``-i`` 옵션과 함께 명령에 포함시킵니다(필요한 경우 여러 번 제공 가능).
zh_cn: 如果您的设置使用中间 CA，请同时复制该证书，并在命令中通过 `-i` 选项（可根据需要多次提供）包含该证书：

source: {productname} server hosts that are hardened for security may restrict execution of files from the [path]``/tmp`` folder. In such cases, as a workaround, export the [literal]``TMPDIR`` environment variable to another existing path before running [command]``mgradm``.
ko: 보안을 위해 강화된 {productname} 서버 호스트는 [path]``/tmp`` 폴더의 파일 실행을 제한할 수 있습니다. 이러한 경우 해결 방법으로 [literal]``TMPDIR`` 환경 변수를 다른 기존 경로로 내보낸 다음, [command]``mgradm``을 실행합니다.
zh_cn: 经过安全加固的 {productname} 服务器主机可能会限制从 [path]``/tmp`` 文件夹执行文件。在这种情况下，可通过以下临时解决方案规避：在运行 [command]``mgradm``前，将 [literal]``TMPDIR`` 环境变量导出至其他现有路径。

source: In {productname} updates, tools will be changed to make this workaround unnecessary.
ko: {productname} 업데이트에서는 이 해결 방법이 불필요하도록 도구가 변경될 예정입니다.
zh_cn: 在 {productname} 的后续更新中，相关工具将进行优化，届时无需再使用此临时解决方案。

source: If you want to use third-party SSL certificates instead of the self-signed certificates, import them in the run of the following deployment procedure.
ko: 자체 서명 인증서 대신 타사 SSL 인증서를 사용하려면 다음 배포 절차 실행 중에 해당 인증서를 임포트하십시오.
zh_cn: 如果您希望使用第三方 SSL 证书而非自我签名证书，请在执行以下部署过程时导入相应证书。

source: For more information about the requirements of third-party SSL certificates, see xref:administration:ssl-certs-imported.adoc[].
ko: 타사 SSL 인증서의 요구 사항에 대한 자세한 내용은 xref:administration:ssl-certs-imported.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关第三方 SSL 证书要求的详细信息，请参见 xref:administration:ssl-certs-imported.adoc[]。

source: Prepare {sl-micro} {microversion} Host
ko: {sl-micro} {microversion} 호스트 준비
zh_cn: 准备 {sl-micro} {microversion} 主机

source: Download the installation media
zh_cn: 下载安装媒体

source: Procedure: Downloading the installation media
ko: 절차: 설치 미디어 다운로드
zh_cn: 过程：下载安装媒体

source: Locate the {sl-micro} {microversion} installation media at https://www.suse.com/download/sle-micro/, and download the appropriate media file.
ko: https://www.suse.com/download/sle-micro/[]에서 {sl-micro} {microversion} 설치 미디어를 찾아 적절한 미디어 파일을 다운로드합니다.
zh_cn: 访问 link:https://www.suse.com/download/sle-micro/[]，找到 {sl-micro} {microversion} 的安装媒体，并下载相应媒体文件。

source: Prepare a DVD or USB flash drive with the downloaded [filename]``.iso`` image for installation.
ja: インストール用のDVDまたはUSBフラッシュドライブ(ダウンロードした[filename]``.iso``イメージを含む)を準備します。
ko: 설치하기 위해 다운로드한 [파일명]``.iso`` 이미지가 들어 있는 DVD 또는 USB 플래시 드라이브를 준비합니다.
zh_cn: 将下载下来的 [filename]``.iso`` 映像放入一个 DVD 或 USB 闪存盘以进行安装。

source: Install {sl-micro} {microversion}
ko: {sl-micro} {microversion} 설치
zh_cn: 安装 {sl-micro} {microversion}

source: For more information about preparing your machines (virtual or physical), see the link:https://documentation.suse.com/sle-micro/6.1[{sl-micro} Deployment Guide].
ko: 머신(가상 또는 물리) 준비에 대한 자세한 내용은 link:https://documentation.suse.com/sle-micro/6.1[{sl-micro} 배포 가이드]에서 확인할 수 있습니다.
zh_cn: 有关虚拟机或物理机的准备工作详细信息，请参见 https://documentation.suse.com/sle-micro/6.1[{sl-micro} 部署指南]。

source: Procedure: Installing {sl-micro} {microversion}
ko: 절차: {sl-micro} {microversion} 설치
zh_cn: 过程：安装 {sl-micro} {microversion}

source: Insert the DVD or USB flash drive (USB disk or key) containing the installation image for {sle-micro} {microversion}.
ja: {sle-micro} {microversion}のインストールイメージを含むDVDまたはUSBフラッシュドライブ(USBディスクまたはキー)を挿入します。
zh_cn: 插入包含 {sle-micro} {microversion} 安装映像的 DVD 或 USB 闪存盘（USB 磁盘或密钥）。

source: Boot or reboot your system.
ja: システムをブートまたは再起動します。
ko: 시스템을 부팅하거나 재부팅합니다.
zh_cn: 引导或重引导您的系统。

source: Use the arrow keys to select [systemitem]``Installation``.
ja: 矢印キーを使用して[systemitem]``インストール``を選択します。
ko: 화살표 키를 사용하여 [systemitem]``설치``를 선택합니다.
zh_cn: 使用箭头键选择[systemitem]``安装``。

source: Adjust Keyboard and language.
zh_cn: 调整键盘和语言。

source: Click the [systemitem]``checkbox`` to accept the license agreement.
ja: [systemitem]``チェックボックス``をクリックしてライセンス契約に同意します。
ko: [systemitem]``확인란``을 클릭하여 라이선스 계약에 동의합니다.
zh_cn: 单击[systemitem]``复选框``接受许可协议。

source: Click [systemitem]``Next`` to continue.
ja: [systemitem]``次へ``をクリックして続行します。
ko: [systemitem]``다음``을 클릭하여 계속합니다.
zh_cn: 单击[systemitem]``下一步``继续。

source: Select the registration method. For this example, we will register the server with {scclongform}.
ja: 登録方法を選択します。この例では、{scclongform}を使用してサーバを登録します。
zh_cn: 选择注册方法。在本示例中，我们将在 {scclongform} 中注册服务器。

source: The {productname} {productnumber} containers are installed as extensions. Depending on the specific extension needed from the list below, additional {scclongform} registration codes will be required for each.
ja: {productname} {productnumber}コンテナは拡張機能としてインストールされます。以下のリストから必要な特定の拡張機能に応じて、それぞれに追加の{scclongform}登録コードが必要です。
zh_cn: {productname} {productnumber} 容器会安装为扩展。根据以下列出的所需特定扩展，您还需要有各个扩展的 {scclongform} 注册代码。

source: {productname} {productnumber} Server
ja: {productname} {productnumber}サーバ
ko: {productname} {productnumber} 서버
zh_cn: {productname} {productnumber} 服务器

source: {productname} {productnumber} Proxy
ja: {productname} {productnumber}プロキシ
ko: {productname} {productnumber} 프록시
zh_cn: {productname} {productnumber} 代理

source: {productname} {productnumber} Retail Branch Server
zh_cn: {productname} {productnumber} 零售分支服务器

source: Enter your {scclongform} email address.
ja: {scclongform}の電子メールアドレスを入力します。
zh_cn: 输入您的 {scclongform} 电子邮件地址。

source: Enter your registration code for {sl-micro} {microversion}.
ko: {sl-micro} {microversion} 등록 코드를 입력합니다.
zh_cn: 输入您的 {sl-micro} {microversion} 注册代码。

source: To install a proxy, select the {productname} {productnumber} Proxy extension; to install a server, select the {productname} {productnumber} Server extension ``Checkbox``.
zh_cn: 要安装代理，请选中 {productname} {productnumber} 代理扩展；要安装服务器，请选中 {productname} {productnumber} 服务器扩展对应的``复选框``。

source: Enter your {productname} {productnumber} extension registration code.
zh_cn: 输入您的 {productname} {productnumber} 扩展注册代码。

source: Click btn:[Next] to continue.
cs: Pokračujte stisknutím btn:[Next] (Další).
ja: btn:[次へ]をクリックして続行します。
ko: btn:[다음]을 클릭하여 계속합니다.
zh_cn: 单击 btn:[下一步] 继续。

source: On the [systemitem]``NTP Configuration`` page click btn:[Next].
ja: [systemitem]``NTP設定``ページで、btn:[次へ]をクリックします。
ko: [systemitem]``NTP 구성`` 페이지에서 btn:[다음]을 클릭합니다.
zh_cn: 在 [systemitem]``NTP 配置``页面上，单击 btn:[下一步]。

source: On the [systemitem]``Authentication for the System`` page enter a password for the root user. Click btn:[Next].
ja: [systemitem]``Authentication for the System (システムの認証)``ページで、rootユーザのパスワードを入力します。Click btn:[次へ]をクリックします。
ko: [systemitem]``시스템 인증`` 페이지에서 루트 사용자의 비밀번호를 입력합니다. btn:[다음]을 클릭합니다.
zh_cn: 在[systemitem]``系统身份验证``页面上，输入 root 用户的口令。单击 btn:[下一步]。

source: On the [systemitem]``Installation Settings`` page click btn:[Install].
ja: [systemitem]``インストール設定``ページで、btn:[インストール]をクリックします。
ko: [systemitem]``설치 설정`` 페이지에서 btn:[설치]를 클릭합니다.
zh_cn: 在[systemitem]``安装设置``页面上单击 btn:[安装]。

source: This concludes installation of {sl-micro} {microversion} and {productname} {productnumber} as an extension.
ko: 이를 통해 {sl-micro} {microversion} 및 {productname} {productnumber}의 확장으로 설치가 완료됩니다.
zh_cn: 将 {sl-micro} {microversion} 和 {productname} {productnumber} 安装为扩展的过程到此完成。

source: OPTIONAL: Registration from the command line
zh_cn: 从命令行注册（可选）

source: If you added {productname} {productnumber} as an extension during {sl-micro} {microversion} installation then you can skip this procedure. However, optionally you may skip registration during {sl-micro} {microversion} installation by selecting the btn:[Skip Registration] button. This section provides steps on registering your products after {sl-micro} {microversion} installation.
ko: {sl-micro} {microversion} 설치 중에 {productname} {productnumber}을(를) 확장자로 추가한 경우 이 절차를 건너뛸 수 있습니다. 그러나 선택적으로 btn:[등록 건너뛰기] 버튼을 선택하여 {sl-micro} {microversion} 설치 중에 등록을 건너뛸 수 있습니다. 이 섹션에서는 {sl-micro} {microversion} 설치 후 제품 등록에 대한 단계를 제공합니다.
zh_cn: 如果您在安装 {sl-micro} {microversion} 期间已将 {productname} {productnumber} 添加为扩展，则可以跳过此过程。不过，您也可以选择在安装 {sl-micro} {microversion} 期间单击 btn:[跳过注册] 按钮来跳过注册。本节提供了在安装 {sl-micro} {microversion} 后注册产品的步骤。

source: The following steps register a {productname} {productnumber} extension with the {x86_64} architecture and thus require a registration code for the {x86_64} architecture. To register {arm} or {s390x} architectures use the correct registration code.
zh_cn: 以下步骤将注册 {x86_64} 体系结构的 {productname} {productnumber} 扩展，因此需要提供适用于 {x86_64} 体系结构的注册代码。要注册 {arm} 或 {s390x} 体系结构，请使用正确的注册代码。

source: Procedure: Registering from the command line
ko: 절차: 명령줄에서 등록
zh_cn: 过程：从命令行注册

source: List available extensions with the following command:
zh_cn: 运行以下命令列出可用扩展：

source: From the list of available extensions, select the one you wish to install:
zh_cn: 从可用扩展列表中选择一个要安装的扩展：

source: If installing the Server, use your {productname} Server Extension {productnumber} x86_64 registration code with following command:
zh_cn: 如果要安装服务器，请使用您的 {productname} Server Extension {productnumber} x86_64 注册代码运行以下命令：

source: If installing the Proxy, use your {productname} Proxy Extension {productnumber} x86_64 registration code with following command:
zh_cn: 如果要安装代理，请使用您的 {productname} Proxy Extension {productnumber} x86_64 注册代码运行以下命令：

source: Update the system
ja: システムの更新
ko: 시스템 업데이트
zh_cn: 更新系统

source: Procedure: Updating the system
ko: 절차: 시스템 업데이트
zh_cn: 过程：更新系统

source: Log in as *root*.
ja: **root**としてログインします。
ko: **root**로 로그인합니다.
zh_cn: 以 *root* 身份登录。

source: Run **transactional-update**:
ja: **transactional-update**を実行します。
ko: **transactional-update** 실행:
zh_cn: 运行 **transactional-update**：

source: {sl-micro} is designed to update itself automatically by default and will reboot after applying updates. However, this behavior is not desirable for the {productname} environment. To prevent automatic updates on your server, {productname} disables the transactional-update timer during the bootstrap process.
ko: {sl-micro}는 기본적으로 자동으로 업데이트되도록 설계되어 있으며, 업데이트를 적용한 이후에는 재부팅됩니다. 그러나 {productname} 환경에서 이는 올바른 동작이 아닙니다. {productname}은(는) 서버에서 자동 업데이트를 방지하기 위해 부트스트랩 프로세스 중에 트랜잭션 업데이트 타이머를 비활성화합니다.
zh_cn: {sl-micro} 设计为默认自动更新，并会在应用更新后重引导。但是，这种行为对于 {productname} 环境而言是不利的。为了防止服务器自动更新，{productname} 会在引导过程中禁用 transactional-update 计时器。

source: If you prefer the {sl-micro} default behavior, enable the timer by running the following command:
ko: {sl-micro} 기본 동작을 사용하려면 다음 명령을 실행하여 타이머를 활성화합니다.
zh_cn: 如果您希望保留 {sl-micro} 的默认行为，请运行以下命令来启用计时器：

source: Prepare {sles} {bci-mlm} host
ko: {sles} {bci-mlm} 호스트 준비
zh_cn: 准备 {sles} {bci-mlm} 主机

source: Alternatively, you can deploy {productname} on {sles} {bci-mlm}.
ko: 또는 {productname}을(를) {sles} {bci-mlm}에 배포할 수 있습니다.
zh_cn: 或者，您也可以在 {sles} {bci-mlm} 上部署 {productname}。

source: The following procedures describe the main steps of the installation process.
ko: 다음 절차에서는 설치 과정의 주요 단계를 설명합니다.
zh_cn: 下面的过程介绍安装流程的主要步骤。

source: Install {productname} extensions on {sles}
ko: {sles}에 {productname} 확장 설치
zh_cn: 在 {sles} 上安装 {productname} 扩展

source: Procedure: Installing {productname} Extensions on {sles}
ko: 절차: {sles}에 {productname} 확장 설치
zh_cn: 过程：在 {sles} 上安装 {productname} 扩展

source: Locate and download {sles} {bci-mlm} [literal]``.iso`` at https://www.suse.com/download/sles/.
ko: https://www.suse.com/download/sles/[]에서 {sles} {bci-mlm} [literal]``.iso``를 찾아 다운로드합니다.
zh_cn: 访问 link:https://www.suse.com/download/sles/[]，找到并下载 {sles} {bci-mlm} [literal]``.iso``。

source: Make sure that you have regsistration codes both for the host operating system ({sles} {bci-mlm}) and extensions
ko: 호스트 운영 체제({sles} {bci-mlm}) 및 확장 기능 모두에 대한 등록 코드가 반드시 있어야 합니다.
zh_cn: 确保您拥有宿主操作系统 ({sles} {bci-mlm}) 和扩展的注册代码

source: Start the installation of {sles} {bci-mlm}.
ko: {sles} {bci-mlm} 설치를 시작합니다.
zh_cn: 启动 {sles} {bci-mlm} 的安装流程。

source: On the [literal]``Language, keyboard and product selection`` select the product to install.
ja: [literal]``Language, Keyboard and Product Selection``（言語、キーボードおよび製品の選択）で、インストールする製品を選択します。
zh_cn: 在[guimenu]``语言、键盘和产品选择``中选择要安装的产品。

source: On the [literal]``License agreement`` read the agreement and check [guimenu]``I Agree to the License Terms``.
ja: [literal]``ライセンス契約``で契約を読み、［[guimenu]``I Agree to the License Terms``（ ライセンス条項に同意します）にチェックを付けます。
ko: [literal]``라이선스 계약``에서 계약서를 읽고 [guimenu]``라이선스 약관에 동의합니다``에 체크 표시합니다.
zh_cn: 在[literal]``许可协议``中，阅读协议并选中[guimenu]``我同意许可条款``。

source: Select the registration method. For this example, we will register the server with SUSE Customer Center.
zh_cn: 选择注册方法。在本示例中，我们将在 SUSE Customer Center 中注册服务器。

source: Enter your registration code for {sles} {bci-mlm}.
ko: {sles} {bci-mlm} 등록 코드를 입력합니다.
zh_cn: 输入 {sles} {bci-mlm} 的注册代码。

source: Please note that for {sles} {bci-mlm}, you are required to have a valid {sles} subscription and corresponding registration code, which you must provide on this screen. You will be required to enter the {productname} Extension registration code below.
ko: {sles} {bci-mlm}의 경우 유효한 {sles} 구독과 해당 등록 코드가 필요하며, 이 화면에서 이를 입력해야 합니다. 아래에 {productname} 확장 등록 코드를 입력해야 합니다.
zh_cn: 请注意，对于 {sles} {bci-mlm}，您需要拥有有效的 {sles} 订阅及相应的注册代码，并在此界面提供。您还需要在下方输入 {productname} 扩展的注册代码。

source: In the screen [literal]``Extensions and Modules Selection`` check the following:
ja: [literal]``拡張とモジュールの選択``で、以下にチェックを付けます。
zh_cn: 在[literal]``扩展和模块选择``屏幕中，选中以下几项：

source: Select the {productname} Server Extension to install the Server, or the {productname} Proxy Extension to install the Proxy.
zh_cn: 选择 {productname} 服务器扩展以安装服务器，或选择 {productname} 代理扩展以安装代理。

source: Basesystem Module
ja: ベースシステムモジュール
zh_cn: Basesystem 模块

source: Containers Module
ja: Containersモジュール
zh_cn: Containers 模块

source: When the installation completes, log in to the newly installed server as root.
ja: インストールが完了したら、rootとして新しくインストールしたサーバにログインします。
zh_cn: 安装完成后，以 root 身份登录新安装的服务器。

source: Update the System (optional, if the system was not set to download updates during install):
zh_cn: 更新系统（可选，如果在安装期间未将系统设置为自动下载更新）：

source: If you added {productname} {productnumber} as an extension during {sles} installation then you can skip this procedure.
ko: {sles} 설치 시 {productname} {productnumber}을(를) 확장 기능으로 추가한 경우 이 절차를 건너뛸 수 있습니다.
zh_cn: 如果您在安装 {sles} 期间已将 {productname} {productnumber} 添加为扩展，则可以跳过此过程。

source: However, optionally you may skip registration during {sles} installation by selecting the btn:[Skip Registration] button. This section provides steps on registering your products after {sles} installation.
ko: 그러나 {sles} 설치 중 btn:[등록 건너뛰기] 버튼을 선택하여 등록을 건너뛸 수도 있습니다. 이 섹션에서는 {sles} 설치 후 제품을 등록하는 단계를 제공합니다.
zh_cn: 不过，您也可以选择在安装 {sles} 期间单击 btn:[跳过注册] 按钮来跳过注册。本节提供了在安装 {sles} 后注册产品的步骤。

source: The following steps register a {productname} {productnumber} extension with the {x86_64} architecture and thus require a registration code for the {x86_64} architecture.
ko: 다음 단계에서는 {x86_64} 아키텍처로 {productname} {productnumber} 확장을 등록하므로 {x86_64} 아키텍처에 대한 등록 코드가 필요합니다.
zh_cn: 以下步骤将注册 {x86_64} 体系结构的 {productname} {productnumber} 扩展，因此需要提供适用于 {x86_64} 体系结构的注册代码。

source: To register {arm} or {s390x} architectures use the correct registration code.
ko: {arm} 또는 {s390x} 아키텍처를 등록하려면 올바른 등록 코드를 사용하십시오.
zh_cn: 要注册 {arm} 或 {s390x} 体系结构，请使用正确的注册代码。

source: If installing the Proxy, use your {productname} Proxy Extension {productnumber} x86_64 registration code with the following command:
ko: 프록시를 설치하는 경우, {productname} 프록시 확장 {productnumber} x86_64 등록 코드를 다음 명령과 함께 사용합니다.
zh_cn: 如果要安装代理，请运行以下命令，并提供您的 {productname} Proxy Extension {productnumber} x86_64 注册代码：

source: Install and enable [package]``podman``
ko: [package]``podman``을 설치하고 활성화합니다.
zh_cn: 安装并启用 [package]``podman``

source: Procedure: Installing [package]``podman``
ko: 작업: [package]``podman`` 설치
zh_cn: 过程：安装 [package]``podman``

source: Log in as root and install the product package.
ko: 루트 권한으로 로그인한 후 제품 패키지를 설치합니다.
zh_cn: 以 `root` 身份登录并安装产品软件包。

source: On the server:
ko: 서버에서:
zh_cn: 在服务器上：

source: On the proxies:
ko: 프록시에서:
zh_cn: 在代理上：

source: Make sure that package [package]``podman`` is installed. Additionally, on the server [package]``mgradm`` and [package]``mgradm-bash-completion`` or on the proxies, [package]``mgrpxy`` and [package]``mgrpxy-bash-completion`` also need to be installed.
ko: [package]``podman`` 패키지가 설치되어 있는지 확인합니다. 또한 서버에는 [package]``mgradm`` 및 [package]``mgradm-bash-completion``이 설치되고, 프록시 서버에는 [package]``mgrpxy`` 및 [package]``mgrpxy-bash-completion``이 추가로 설치되어야 합니다.
zh_cn: 请确保已安装软件包 [package]``podman``。此外，服务器上需要安装 [package]``mgradm`` 和 [package]``mgradm-bash-completion``；代理上需要安装 [package]``mgrpxy`` 和 [package]``mgrpxy-bash-completion``。

source: Start the Podman service by rebooting the system, or running a command:
zh_cn: 重引导系统或运行以下命令，以启动 Podman 服务：

source: Register {sl-micro} and {productname} {productnumber} Proxy
ko: {sl-micro} 및 {productname} {productnumber} 프록시 등록
zh_cn: 注册 {sl-micro} 和 {productname} {productnumber} 代理

source: Procedure: Registering {sl-micro} and {productname} {productnumber} Proxy
ko: 절차: {sl-micro} 및 {productname} {productnumber} 프록시 등록
zh_cn: 过程：注册 {sl-micro} 和 {productname} {productnumber} 代理

source: Register {productname} {productnumber} Proxy with {scclongform}.
ja: {scclongform}で{productname} {productnumber}プロキシを登録します。
zh_cn: 在 {scclongform} 中注册 {productname} {productnumber} 代理。

source: transactional-update register -p Multi-Linux-Manager-Proxy/5.1/x86_64 -r <REGCODE>
zh_cn: transactional-update register -p Multi-Linux-Manager-Proxy/5.1/x86_64 -r <注册代码>

source: For more information, see [command]``mgr-storage-proxy --help``. This tool simplifies creating the container volumes.
ja: 詳細については、[command]``mgr-storage-proxy --help``を参照してください。このツールを使用すると、コンテナボリュームの作成が容易になります。
zh_cn: 有关详细信息，请参见 [command]``mgr-storage-proxy --help``。此工具可以简化容器卷的创建过程。

source: This command will move the persistent storage volumes at [path]``/var/lib/containers/storage/volumes`` to the specified storage device.
ja: このコマンドは、[path]``/var/lib/containers/storage/volumes``にある永続ストレージボリュームを指定されたストレージデバイスに移動します。
zh_cn: 此命令会将 [path]``/var/lib/containers/storage/volumes`` 中的永久性存储卷移动到指定的存储设备。

source: SSL certificates are needed at a later stage. If not using the self-signed generated CA and certificates, ensure you have the following before starting:
ko: SSL 인증서는 후속 단계에서 필요합니다. 자체 서명 생성 CA 및 인증서를 사용하지 않는 경우 시작 전에 다음을 준비하십시오.
zh_cn: 后续流程需要 SSL 证书。如果不使用自我签名的 CA 和证书，请在开始前准备好以下内容：

source: A certificate authority (CA) SSL public certificate. If you are using a CA chain, all intermediate CAs must also be available.
ko: 인증 기관(CA) SSL 공개 인증서. CA 체인을 사용하는 경우 모든 중간 CA도 반드시 사용 가능해야 합니다.
zh_cn: 证书颁发机构 (CA) SSL 公共证书。如果您使用 CA 链，则所有中间 CA 也必须可用。

source: An SSL database private key.
ko: SSL 데이터베이스 개인 키.
zh_cn: SSL 数据库私用密钥。

source: An SSL database certificate.
ko: SSL 데이터베이스 인증서.
zh_cn: SSL 数据库证书。

source: All files must be in PEM format.
ko: 모든 파일은 PEM 형식이어야 합니다.
zh_cn: 所有文件必须采用 PEM 格式。

source: The hostname of the SSL server certificate must match the fully qualified hostname of the machine you deploy them on. You can set the hostnames in the [literal]``X509v3 Subject Alternative Name`` section of the certificate. You can also list multiple hostnames if your environment requires it. Supported Key types are [literal]``RSA`` and [literal]``EC`` (Elliptic Curve).
ko: SSL 서버 인증서의 호스트명은 해당 인증서를 배포하는 머신의 전체 호스트 이름과 일치해야 합니다. 인증서의 [literal]``X509v3 Subject Alternative Name`` 섹션에서 호스트 이름을 설정할 수 있습니다. 환경에 따라 필요한 경우 여러 호스트 이름을 나열할 수도 있습니다. 지원되는 키 유형은 [literal]``RSA`` 및 [literal]``EC``(Elliptic Curve)입니다.
zh_cn: SSL 服务器证书的主机名必须与部署证书的计算机的完全限定主机名匹配。您可以在证书的 [literal]``X509v3 Subject Alternative Name`` 部分中设置主机名，也可以根据环境的需要列出多个主机名。支持的密钥类型为 [literal]``RSA`` 和 [literal]``EC``（椭圆曲线）。

source: Database SSL certificate requires [literal]``reportdb`` and [literal]``db`` and the FQDN used to access the report database as [literal]``Subject Alternative Name``.
ko: 데이터베이스 SSL 인증서에는 [literal]``reportdb`` 및 [literal]``db``가 필요하며, 보고서 데이터베이스에 액세스하는 데 사용되는 FQDN이 [literal]``Subject Alternative Name``으로 지정되어야 합니다.
zh_cn: 数据库 SSL 证书的 [literal]``Subject Alternative Name`` 必须是 [literal]``reportdb``、[literal]``db`` 及用于访问报告数据库的 FQDN。

source: Procedure: Start and Check Proxy Status
ja: プロシージャ: プロキシを起動してステータスを確認する
ko: 절차: 프록시 시작 및 상태 확인
zh_cn: 过程：启动代理并检查状态

source: Deploy {productname}.
ko: {productname}을(를) 배포합니다.
zh_cn: 部署 {productname}。

source: If you use VM images as a migration target, here as the last step, execute the command [command]``mgradm migrate`` instead of [command]``mgradm install``.
ko: VM 이미지를 마이그레이션 타겟으로 사용하는 경우, 마지막 단계에서 [command]``mgradm install`` 대신 [command]``mgradm migrate`` 명령을 실행합니다.
zh_cn: 如果您使用 VM 映像作为迁移目标，最后一步请执行命令 [command]``mgradm migrate``，而非 [command]``mgradm install``。

source: Execute one of the following commands, depending on the SSL certificate variant (self-signed or third-party). Replace `<FQDN>` with your fully qualified domain name of the {productname} Server:
ko: SSL 인증서 유형(자체 서명 또는 타사)에 따라 다음 명령 중 하나를 실행합니다. ``<FQDN>``을 {productname} 서버의 정규화된 도메인 이름으로 바꿉니다.
zh_cn: 根据 SSL 证书类型（自我签名证书或第三方证书），执行以下命令之一。 请将 `<FQDN>` 替换为 {productname} 服务器的完全限定域名：
