Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: When planning your migration from {productname} 4.3 to {productname} 5.0, ensure that your target instance meets or exceeds the specifications of the old setup.
ja: {productname} 4.3から{productname} 5.0への移行を計画する際は、ターゲットのインスタンスが古い設定の仕様を満たしているか、上回っていることを確認します。

source: Procedure: Performing the Migration
ja: プロシージャ: 移行を実行する

source: This step is optional. If custom persistent storage is required for your infrastructure, use the [command]``mgr-storage-server`` tool.
ja: このステップはオプションです。ご使用のインフラストラクチャにカスタム永続ストレージが必要な場合は、[command]``mgr-storage-server``ツールを使用します。

source: Execute the following command to install a new {productname} server. Replace [literal]``<oldserver.fqdn>`` with the FQDN of the 4.3 server:
ja: 次のコマンドを実行して、新しい{productname}サーバをインストールします。[literal]``<oldserver.fqdn>``は4.3サーバのFQDNに置き換えてください。

source: Trusted SSL CA certificates that were installed as part of an RPM and stored on {productname} 4.3 in the [path]``/usr/share/pki/trust/anchors/`` directory will not be migrated. Because {suse} does not install RPM packages in the container, the administrator must migrate these certificate files manually from the 4.3 installation after the migration.
ja: RPMの一部としてインストールされ、{productname} 4.3の[path]``/usr/share/pki/trust/anchors/``ディレクトリに保存されている信頼済みSSL CA証明書は移行されません。{suse}はRPMパッケージをコンテナ内にインストールしないため、管理者は移行後にこれらの証明書ファイルを4.3のインストールから手動で移行する必要があります。

source: Copy the file from the 4.3 server to the new server.
ja: 4.3サーバから新しいサーバにファイルをコピーします。

source: Migrating the {productname} server to a containerized environment
ja: コンテナ化された環境への{productname}サーバの移行

source: To migrate a regular {productname} server to a container, a new machine is required.
ja: 通常の{productname}サーバをコンテナに移行するには、新しいマシンが必要です。

source: It is not possible to perform an in-place migration.
ja: インプレース移行は実行できません。

source: The migration procedure currently does not include any hostname renaming functionality. The fully qualified domain name (FQDN) on the new server will remain identical to that on the old server. Therefore, following migration, it will be necessary to manually adjust the DNS records to point to the new server.
ja: 現在この移行手順にはホスト名の変更機能は含まれていません。新しいサーバ上の完全修飾ドメイン名(FQDN)は古いサーバのFQDNと同じままです。したがって、移行後に、新しいサーバを指すようにDNSレコードを手動で調整する必要があります。

source: Procedure: Initial preparation
ja: プロシージャ: 初期の準備

source: Stop the {productname} services on the old server:
ja: 古いサーバ上の{productname}サービスを停止します。

source: The SSH configuration and agent should be ready on the new host for a passwordless connection to the oldserver.
ja: 新しいホストでSSHの設定とエージェントが、古いサーバにパスワードなしで接続する準備ができている必要があります。

source: To establish a passwordless connection, the migration script relies on an SSH agent running on the server. If the SSH agent is not active yet, initiate it by running `eval $(ssh-agent)`. Then, add the SSH key to the running agent with `ssh-add /path/to/the/private/key`. You will be prompted to enter the password for the private key during this process.
ja: パスワードレス接続を確立するために、移行スクリプトは、サーバで実行されているSSHエージェントに依存します。SSHエージェントがまだアクティブではない場合は、`eval $(ssh-agent)`を実行して開始します。次に、`ssh-add /path/to/the/private/key`を使用して実行中のエージェントにSSHキーを追加します。このプロセス中に機密鍵のパスワードの入力を求められます。

source: The migration script only uses the old server's FQDN in the SSH command.
ja: 移行スクリプトは、SSHコマンドで古いサーバのFQDNのみを使用します。

source: This means that every other configuration required to connect needs to be defined in the [systemfile]``~/.ssh/config`` file.
ja: つまり、接続に必要な他の設定はすべて[systemfile]``~/.ssh/config``ファイルで定義する必要があります。

source: Prepare for Kubernetes
ja: Kubernetesの準備

source: Before executing the migration with [command]``mgradm migrate`` command, it is essential to predefine **Persistent Volumes**, especially considering that the migration job initiates the container from scratch. For more information, see the installation section for comprehensive guidance on preparing these volumes in xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[].
ja: [command]``mgradm migrate``コマンドを使用して移行を実行する前に、**永続ボリューム**を事前定義することが重要です。特に、移行ジョブでは何もない状態からコンテナが開始されることを考慮すると、これは不可欠です。詳細については、xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[]のインストールに関するセクションで、このようなボリュームの準備に関する包括的なガイダンスを参照してください。

source: Execute the following command to install a new {productname} server, replacing **<oldserversource.fqdn>** with the appropriate FQDN of the old server:
ja: 次のコマンドを実行して、新しい{productname}サーバをインストールします。**<oldserversource.fqdn>**は古いサーバの適切なFQDNに置き換えてください。

source: After successfully running the [command]``mgradm migrate`` command, the {salt} setup on all clients will still point to the old server. To redirect them to the new server, it is required to rename the new server at the infrastructure level (DHCP and DNS) to use the same FQDN and IP address as the old server.
ja: [command]``mgradm migrate``コマンドの実行が正常に完了した後も、すべてのクライアントの{salt}セットアップはまだ古いサーバを指したままです。これらを新しいサーバにリダイレクトするために、新しいサーバの名前をインフラストラクチャレベル(DHCPおよびDNS)で変更して、古いサーバと同じFQDNとIPアドレスを使用するようにする必要があります。

source: Install containerized {productname} Proxy
ja: コンテナ化された{productname}プロキシのインストール

source: Only {opensuse} Leap 15.3 and newer are supported to be used as container host for {productname} Proxy containers.
ja: {productname}プロキシコンテナのコンテナホストとして使用できるのは、{opensuse} Leap 15.3以降のみです。

source: Only {sles} 15 SP5 or {sle-micro} {microversion} and newer are supported to be used as container host for {productname} Proxy containers.
ja: {productname}プロキシコンテナのコンテナホストとして使用できるのは、{sles} 15 SP5または{sle-micro} {microversion}以降のみです。

source: Container host requirements
ja: コンテナホストの要件

source: Proxy Container host hardware requirements
ja: プロキシコンテナホストのハードウェア要件

source: | Hardware | Details | Recommendation | CPU | | Minimum 2 dedicated 64-bit CPU cores | RAM | Test Server | Minimum 2{nbsp}GB | | Production Server | Minimum 8{nbsp}GB | Disk Space | | Minimum 100{nbsp}GB
ja: | ハードウェア | 詳細 | 推奨 | CPU | | 専用64ビットCPUコア数は2つ以上 | RAM | テストサーバ | 2{nbsp}GB以上 | | 運用サーバ | 8{nbsp}GB以上 | ディスク容量 | | 100{nbsp}GB以上

source: Proxy Container host software requirements
ja: プロキシコンテナホストのソフトウェア要件

source: | Software | Details | Remark | Connection Method | Salt | Host must be configured as a Salt client
ja: | ソフトウェア | 詳細 | 注釈 | 接続メソッド | Salt | ホストはSaltクライアントとして設定されている必要があります

source: To ensure that domain name of the {productname} Server can be resolved by the clients:
ja: {productname}サーバのドメイン名をクライアントが解決できるようにするには:

source: Both container proxy and client machines must be connected to a DNS server
ja: コンテナプロキシとクライアントマシンの両方をDNSサーバに接続する必要があります

source: Reverse lookup must work
ja: リバース参照が機能している必要があります

source: Install container services on the host system
ja: ホストシステムにコンテナサービスをインストールする

source: Container host to be used as a base for {productname} Proxy containers needs to be first registered as a client to the {productname} Server.
ja: {productname}プロキシコンテナのベースとして使用されるコンテナホストは、最初に{productname}サーバにクライアントとして登録する必要があります。

source: For more information about registering client to the {productname} Server, see xref:client-configuration:registration-overview.adoc[].
ja: クライアントを{productname}サーバに登録する方法の詳細については、xref:client-configuration:registration-overview.adoc[]を参照してください。

source: [literal]``Containers Module`` is required to be available for container host on a {sles} machine.
ja: [literal]``Containersモジュール``は{sles}マシン上のコンテナホストで使用できる必要があります。

source: {productname} Proxy containers are using [literal]``podman`` and [literal]``systemd`` to run and manage all proxy containers.
ja: {productname}プロキシコンテナは、すべてのプロキシコンテナを実行および管理するために、[literal]``podman``と[literal]``systemd``を使用しています。

source: First step is to install the [literal]``mgrpxy`` utility provided by the package of the same name.
ja: 最初のステップは[literal]``mgrpxy``ユーティリティをインストールすることです。これは同じ名前のパッケージで提供されています。

source: The [literal]``mgrpxy`` package is available in the {productname} Proxy product repositories.
ja: [literal]``mgrpxy``パッケージは{productname}プロキシの製品リポジトリで利用可能です。

source: The [literal]``mgrpxy`` package is available in the container utils repository: pick the one matching the distribution in: https://download.opensuse.org/repositories/systemsmanagement:/Uyuni:/Stable:/ContainerUtils/.
ja: [literal]``mgrpxy``パッケージはコンテナのutilsリポジトリで利用可能です。https://download.opensuse.org/repositories/systemsmanagement:/Uyuni:/Stable:/ContainerUtils/で、ディストリビューションに一致するパッケージを選択します。

source: To install them run:
ja: インストールするには、次のコマンドを実行します。

source: Procedure: Installation of container utility tool [literal]``mgrpxy`` for {productname} Proxy
ja: プロシージャ: {productname}プロキシ用のコンテナユーティリティツール[literal]``mgrpxy``のインストール

source: Assign [literal]``Containers Module`` software channel to the container host in the {productname}. For more information about assigning software channels to the system, see xref:administration:channel-management.adoc[].
ja: [literal]``Containersモジュール`` ソフトウェアチャンネルを{productname}のコンテナホストに割り当てます。ソフトウェアチャンネルをシステムに割り当てる方法の詳細については、xref:administration:channel-management.adoc[]を参照してください。

source: Log in as `root` on the container host.
ja: コンテナホストに``root``としてログインします。

source: Manually install [literal]``mgrpxy`` package:
ja: [literal]``mgrpxy``パッケージを手動でインストールします。

source: Install {productname} Proxy containers
ja: {productname}プロキシコンテナのインストール

source: {productname} Proxy containers require some volumes to be mounted for long term storage. Those volumes are automatically created by [literal]``podman`` and can be listed using the [command]``podman volume ls`` command. By default, [literal]``podman`` stores the files of the volumes in [path]``/var/lib/containers/storage/volumes``. The volumes are named:
ja: {productname}プロキシコンテナでは、長期保存用にいくつかのボリュームをマウントする必要があります。これらのボリュームは自動的に[literal]``podman``によって作成され、[command]``podman volume ls``コマンドを使用して一覧にできます。デフォルトでは、[literal]``podman``はボリュームのファイルを[path]``/var/lib/containers/storage/volumes``に格納します。ボリュームの名前は次のとおりです。

source: To override default volume settings, create the volumes prior to the first start of the pod using the [command]``podman volume create`` command.
ja: デフォルトのボリューム設定を上書きするには、[command]``podman volume create``コマンドを使用して、ポッドの最初の起動前にボリュームを作成します。

source: By default, the [package]``uyuni-proxy-systemd-services`` package creates these three directories that can be used to mount external disks:
ja: デフォルトでは、[package]``uyuni-proxy-systemd-services``パッケージは、外部ディスクのマウントに使用できる次の3つのディレクトリを作成します。

source: If [path]``/etc/fstab`` has these entries:
ja: [path]``/etc/fstab``に次のエントリがあるかどうかを確認します。

source: Run these commands to create custom volumes:
ja: ある場合、次のコマンドを実行してカスタムボリュームを作成します。

source: To install the systemd service starting the {productname} proxy, run the [command]``mgrpxy install podman /path/to/config.tar.gz`` command.
ja: {productname}プロキシを起動するsystemdサービスをインストールするには、[command]``mgrpxy install podman /path/to/config.tar.gz``コマンドを実行します。

source: It is possible to add custom arguments passed to podman container pod with the one or more [literal]``--podman-arg`` parameters to the install command.
ja: installコマンドで[literal]``--podman-arg``パラメータを1つ以上使用して、Podmanコンテナポッドに渡されるカスタム引数を追加できます。

source: It is possible to modify the tag to use for container images with the [literal]``--tag=latest`` parameter to the install command.
ja: installコマンドで[literal]``--tag=latest``パラメータを使用して、タグをコンテナイメージ用に変更できます。

source: Changing the containers images and version parameters is dangerous and can cause a non-functional system.
ja: コンテナイメージとバージョンパラメータを変更することは危険であり、システムが機能しなくなる可能性があります。

source: Using a custom container image for a service
ja: サービスにカスタムコンテナイメージを使用する

source: Allow network access for provided services on container host firewall
ja: コンテナホストファイアウォールで提供されるサービスのネットワークアクセスを許可する

source: {productname} Proxy containers work as so called node-port service. This means proxy container pod shares container host network TCP and UDP port space. For this reason container host firewall must be configured to accept incoming traffic on ports used by {productname} Proxy containers. Those ports are:
ja: {productname}プロキシコンテナは、いわゆるノードポートサービスとして機能します。これは、プロキシコンテナポッドがコンテナホストネットワークのTCPおよびUDPポートスペースを共有することを意味します。このため、コンテナホストファイアウォールは、{productname}プロキシコンテナが使用するポートで着信トラフィックを受け入れるように設定する必要があります。これらのポートは次のとおりです。

source: Continue with setting up the installed {productname} Proxy as a containers at xref:installation-and-upgrade:container-deployment/uyuni/proxy-container-setup-uyuni.adoc[].
ja: 次に、インストールした{productname}プロキシをxref:installation-and-upgrade:container-deployment/uyuni/proxy-container-setup-uyuni.adoc[]でコンテナとしてセットアップを続行します。

source: Transfer {productname} Proxy configuration
ja: {productname}プロキシ設定の転送

source: Both [command]``spacecmd`` command and {webui} ways generate a configuration archive. This archive needs to be made available on container host.
ja: [command]``spacecmd``コマンドと{webui}の両方の方法で、設定アーカイブが生成されます。このアーカイブは、コンテナホストで利用できるようにする必要があります。

source: Transfer this generated archive to the container host.
ja: この生成されたアーカイブをコンテナホストに転送します。

source: For installation instructions to use the archive to get the proxy containers, see xref:installation-and-upgrade:container-deployment/uyuni/proxy-container-installation-uyuni.adoc[].
ja: このアーカイブを使用してプロキシコンテナを取得するためのインストール手順については、xref:installation-and-upgrade:container-deployment/uyuni/proxy-container-installation-uyuni.adoc[]を参照してください。

source: Start {productname} Proxy containers
ja: {productname}プロキシコンテナの起動

source: Procedure: Start {productname} Proxy containers
ja: プロシージャ: {productname}プロキシコンテナを起動する

source: Check if all containers started up as expected by calling
ja: 次のコマンドを呼び出して、すべてのコンテナが期待どおりに起動したかどうかを確認します

source: Five {productname} Proxy containers should be present:
ja: 次の5つの{productname}プロキシコンテナが存在する必要があります。

source: And should be part of [literal]``proxy-pod`` container pod.
ja: また、[literal]``proxy-pod``コンテナポッドの一部である必要があります。

source: Deploy a {productname} {productnumber} Proxy
ja: {productname} {productnumber}プロキシの配備

source: Synchronize the {leapmicro} {microversion} parent channel and the Proxy extension child channel on the server.
ja: {leapmicro} {microversion}の親チャンネルとサーバ上のプロキシ拡張機能の子チャンネルを同期します。

source: Install {leapmicro} {microversion} on a bare-metal machine.
ja: {leapmicro} {microversion}をベアメタルマシンにインストールします。

source: During the installation, register {leapmicro} {microversion} along with the {productname} {productnumber} Proxy extension.
ja: インストール中に、{leapmicro} {microversion}を{productname} {productnumber}プロキシ拡張機能とともに登録します。

source: The supported operating system for the container host is {leapmicro} {microversion}.
ja: コンテナホストでサポートされているオペレーティングシステムは{leapmicro} {microversion}です。

source: | Hardware | Details | Recommendation | CPU | {x86_64}, {arm} | Minimum 2 dedicated 64-bit CPU cores | RAM | Minimum | 2 GB | | Recommended | 8 GB | Disk Space | [path]``/`` (root directory) | Minimum 40 GB | | [path]``/var/lib/containers/storage/volumes/srv-www`` | Minimum 100 GB, Storage requirements should be calculated for the number of ISO distribution images, containers, and bootstrap repositories you will use. | | [path]``/var/lib/containers/storage/volumes/var-cache`` (Squid) | Minimum 100 GB
ja: | ハードウェア | 詳細 | 推奨 | CPU | {x86_64}、{arm} | 専用64ビットCPUコア数は2つ以上 | RAM | 最小 | 2 GB | | 推奨 | 8 GB | ディスク容量 | [path]``/`` (ルートディレクトリ) | 40 GB以上 | | [path]``/var/lib/containers/storage/volumes/srv-www`` | 100 GB以上。ストレージ要件は、使用するISOディストリビューションイメージ、コンテナ、およびブートストラップリポジトリの数に合わせて計算する必要があります。 | | [path]``/var/lib/containers/storage/volumes/var-cache`` (Squid) | 100 GB以上

source: Sync the Parent and Proxy Extension Child channels
ja: 親およびプロキシ拡張機能の子チャンネルの同期

source: Products are listed on the menu:Admin[Setup Wizard -> Products] page. This channel must be fully synchronized on the server, with the child channel [systemitem]Proxy as an extension option selected.
ja: 製品はmenu:管理[セットアップウィザード -> 製品]ページに一覧表示されます。子チャンネルの[systemitem]Proxy as an extension (プロキシを子チャンネルとして)オプションを選択した状態で、サーバ上でこのチャンネルを完全に同期する必要があります。

source: Task: Sync the Proxy Parent Channel and Proxy Extension
ja: タスク: プロキシの親チャンネルとプロキシ拡張機能の同期

source: Next use the dropdown to select the required architecture. For this example {x86_64}.
ja: 次に、ドロップダウンを使用してアーキテクチャを選択します。この例では、{x86_64}を選択します。

source: In the [systemitem]``Product Description`` field select the {sle-micro} {microversion} checkbox then use the dropdown to select the [systemitem]``SUSE Manager Proxy Extension 5.0 x86_64`` extension.
ja: [systemitem]``製品説明``フィールドで、{sle-micro} {microversion}チェックボックスをオンにして、ドロップダウンを使用して[systemitem]``SUSE Manager Proxy Extension 5.0 x86_64``拡張機能を選択します。

source: Click the btn:[+ Add products] button.
ja: btn:[+製品の追加]をクリックします。

source: Wait for the sync to complete.
ja: 同期が完了するまで待ちます。

source: {sle-micro} {microversion} Installation
ja: {sle-micro} {microversion}のインストール

source: Task: Download the Installation Media
ja: タスク: インストールメディアのダウンロード

source: Download the following file: [filename]``SLE-Micro-5.5-DVD-x86_64-GM-Media1.iso``
ja: 次のファイルをダウンロードします: [filename]``SLE-Micro-5.5-DVD-x86_64-GM-Media1.iso``

source: Prepare a USB fash disk or DVD for installation.
ja: インストール用のUSBフラッシュディスクまたはDVDを準備します。

source: Task: {sle-micro} {microversion} Installation
ja: タスク: {sle-micro} {microversion}のインストール

source: Adjust Keyboard and language. Click the [systemitem]``checkbox`` to accept the License Agreement.
ja: キーボードと言語を調整します。[systemitem]``チェックボックス``をクリックしてライセンス契約に同意します。

source: Select your registration method. For this example we will register the server with {scclongform}.
ja: 登録方法を選択します。この例では、{scclongform}でサーバを登録します。

source: {productname} {productnumber} Proxy as an extension
ja: 拡張機能としての{productname} {productnumber}プロキシ

source: The {productname} {productnumber} Proxy is registered as an extension. Therefore, in addition to acquiring an {scclongform} registration key for {sle-micro} {microversion}, you will also need an {scclongform} registration code for the following extension:
ja: {productname} {productnumber}プロキシは拡張機能として登録されます。したがって{sle-micro} {microversion}の{scclongform}登録キーを入手するほかに、次の拡張機能用の{scclongform}登録コードも必要です。

source: On the [systemitem]``Authentication for the System`` page enter a password for the root user. Click btn:[Next].
ja: [systemitem]``Authentication for the System``ページで、rootユーザのパスワードを入力します。Click btn:[次へ]をクリックします。

source: This concludes installation of {sle-micro} {microversion} and {productname} {productnumber} Proxy as an extension.
ja: これで、拡張機能としての{sle-micro} {microversion}および{productname} {productnumber}プロキシのインストールが完了しました。

source: Task: Update the System
ja: タスク: システムの更新

source: Login as *root*.
ja: **root**としてログインします。

source: Login as root.
ja: rootとしてログインします。

source: Task: Create an Activation Key
ja: タスク: アクティベーションキーの作成

source: Select menu:Systems[Activation Keys] then click btn:[+ Create key].
ja: menu:システム[アクティベーションキー]に移動し、btn:[+ キーの作成]をクリックします。

source: Create an activation key for the proxy host with {sle-micro} {microversion} as the parent channel. This key should include all recommended channels and the Proxy as an extension child channel.
ja: {sle-micro} {microversion}を親チャンネルとして使用して、プロキシホストのアクティベーションキーを作成します。このキーには、推奨されるすべてのチャンネルと、拡張機能としてのプロキシの子チャンネルが含まれる必要があります。

source: Proceed to boostrapping the proxy host as a minion.
ja: 続行して、プロキシホストをMinionとしてブートストラップします。

source: The CA certificates generated on the server are stored in the [path]``/var/lib/containers/storage/volumes/root/ssl-build`` directory.
ja: サーバ上で生成されたCA証明書は、[path]``/var/lib/containers/storage/volumes/root/ssl-build``ディレクトリに保存されます。

source: Copy the files from the Server container to the Server host OS:
ja: サーバコンテナからサーバのホストOSにファイルをコピーします。

source: Next copy the files from the Server host OS to the Proxy host:
ja: サーバのホストOSからプロキシホストにファイルをコピーします。

source: And should be part of the [literal]``proxy-pod`` container pod.
ja: また、[literal]``proxy-pod``コンテナポッドの一部である必要があります。

source: Install Containerized {productname} Proxy on k3s
ja: k3sへのコンテナ化された{productname}プロキシのインストール

source: Installing k3s
ja: k3sのインストール

source: On the container host machine, install [literal]``k3s`` (replace [literal]``<K3S_HOST_FQDN>`` with the FQDN of your k3s host):
ja: コンテナホストマシンに[literal]``k3s``をインストールします([literal]``<K3S_HOST_FQDN>``はk3sホストのFQDNに置き換えます)。

source: Installing tools
ja: ツールのインストール

source: The Containers Module is required to install [literal]``helm``.
ja: Containersモジュールが[literal]``helm``をインストールするために必要です。

source: Deploying the {productname} proxy helm chart
ja: {productname}プロキシhelmチャートの配備

source: To configure the storage of the volumes to be used by the {productname} Proxy pod, define persistent volumes for the following claims. If you do not customize the storage configuration, k3s will automatically create the storage volumes for you.
ja: {productname}プロキシポッドで使用するボリュームのストレージを設定するには、次のクレームに対して永続ボリュームを定義します。ストレージ設定をカスタマイズしない場合は、k3sによって自動的にストレージボリュームが作成されます。

source: For more information see link:https://kubernetes.io/docs/concepts/storage/persistent-volumes/[] (kubernetes) or link:https://rancher.com/docs/k3s/latest/en/storage/[] (k3s) documentation.
ja: 詳細については、link:https://kubernetes.io/docs/concepts/storage/persistent-volumes/[] (kubernetes)またはlink:https://rancher.com/docs/k3s/latest/en/storage/[] (k3s)のドキュメントを参照してください。

source: In {productname} {productnumber}, the containerized proxy is managed by a set of systemd services.
ja: {productname} {productnumber}で、コンテナ化されたプロキシは一連のsystemdサービスによって管理されます。

source: In {productname} {productnumber}, management of the containerized proxy was re-designed and made simpler with the [command]``mgrpxy`` tool.
ja: {productname} {productnumber}では、コンテナ化されたプロキシの管理が再設計され、[command]``mgrpxy``ツールで簡単に管理できるようになりました。

source: This section will help you migrate from the legacy [systemitem]``systemd`` proxy using the new [command]``mgrpxy`` tool.
ja: このセクションは、新しい[command]``mgrpxy``ツールを使用してレガシ[systemitem]``systemd``プロキシを移行するのに役立ちます。

source: An in-place migration from previous releases of {productname} will remain unsupported due to the HostOS change from {sles} 15 SP4 to {leapmicro} {microversion}
ja: ホストOSが{sles} 15 SP4から{leapmicro} {microversion}に変更されたため、{productname}の以前のリリースからのインプレース移行は今後もサポートされないままです

source: The traditional contact protocol is no longer supported in {productname} {productnumber} and later. Before migrating from {productname} to {productname} {productnumber}, any existing traditional clients including the traditional proxies must be migrated to {salt}.
ja: 従来の接続プロトコルは{productname} {productnumber}以降ではサポートされなくなりました。{productname}から{productname} {productnumber}に移行する前に、従来のプロキシを含む既存の従来のクライアントを{salt}に移行する必要があります。

source: For more information about migrating traditional {productname} 2024.04 clients to {salt} clients, see https://documentation.suse.com/suma/4.3/en/suse-manager/client-configuration/contact-methods-migrate-traditional.html
ja: 従来の{productname} 2024.04クライアントから{salt}クライアントへの移行の詳細については、https://documentation.suse.com/suma/4.3/en/suse-manager/client-configuration/contact-methods-migrate-traditional.htmlを参照してください

source: Migrate from Legacy to Containerized Proxy with Systemd
ja: レガシから、Systemdを使用するコンテナ化されたプロキシへの移行

source: Task: Generate the Proxy Configuration
ja: タスク: プロキシ設定の生成

source: Enter the Proxy port number. __We recommend using the default port of 8022__
ja: プロキシのポート番号を入力します。__デフォルトのポート8022を使用することをお勧めします__

source: Task: Transfer the Proxy Configuration
ja: タスク: プロキシ設定の転送

source: Disable the Legacy Proxy
ja: レガシプロキシの無効化

source: Task: Migrate {productname} Containerized Proxy to {productname} {productnumber} New Containerized Proxy
ja: タスク: {productname}コンテナ化プロキシを{productname} {productnumber}の新しいコンテナ化プロキシに移行する

source: Copy your tar.gz proxy configuration to the host.
ja: tar.gzプロキシ設定をホストにコピーします。

source: Installing packages using the {webui}
ja: {webui}を使用したパッケージのインストール

source: Task: Installing Packages using the {webui}
ja: タスク: {webui}を使用したパッケージのインストール
