Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: | Port number | Protocol | Used By | Notes | 22 | | | Required for ssh-push and ssh-push-tunnel contact methods. | 67 | TCP/UDP | DHCP | Required only if clients are requesting IP addresses from the server. | 69 | TCP/UDP | TFTP | Required if server is used as a PXE server for automated client installation. | 80 | TCP | HTTP | Required temporarily for some bootstrap repositories and automated installations. | 443 | TCP | HTTPS | Serves the {webui}, client, and server and proxy (``tftpsync``) requests. | 4505 | TCP | salt | Required to accept communication requests from clients. The client initiates the connection, and it stays open to receive commands from the Salt master. | 4506 | TCP | salt | Required to accept communication requests from clients. The client initiates the connection, and it stays open to report results back to the Salt master. | 5556 | TCP | Prometheus | Required for scraping Taskomatic JMX metrics. | 5557 | TCP | Prometheus | Required for scraping Tomcat JMX metrics. | 9100 | TCP | Prometheus | Required for scraping Node exporter metrics. | 9187 | TCP | Prometheus | Required for scraping PostgreSQL metrics. | 9800 | TCP | Prometheus | Required for scraping Taskomatic metrics. | 25151 | TCP | Cobbler |
ja: | ポート番号 | プロトコル | 使用元 | 注意 | 22 | | | ssh-pushおよびssh-push-tunnelの接続メソッドに必要です。 | 67 | TCP/UDP | DHCP | クライアントがサーバからIPアドレスをリクエストしている場合のみ必要です。 | 69 | TCP/UDP | TFTP | 自動化されたクライアントのインストールのためにサーバがPXEサーバとして使用されている場合に必要です。 | 80 | TCP | HTTP | 一部のブートストラップリポジトリおよび自動化されたインストールのために一時的に必要です。 | 443 | TCP | HTTPS | {webui}、クライアント、およびサーバとプロキシ(``tftpsync``)のリクエストを処理します。 | 4505 | TCP | salt | クライアントからの通信リクエストを受け入れるために必要です。 クライアントは、接続を開始し、開いたままになり、Saltマスタからのコマンドを受信します。 | 4506 | TCP | salt | クライアントからの通信リクエストを受け入れるために必要です。 クライアントは、接続を開始し、開いたままになり、Saltマスタに結果を返します。 | 5556 | TCP | osad | OSADのアクションをクライアントにプッシュするために必要です。 | 5557 | TCP | jabberd | プロキシとの間でアクションをプッシュするために必要です。 | 9100 | TCP | Prometheus | Node exporterのメトリックをスクレイピングするために必要です。 | 9187 | TCP | Prometheus | PostgreSQLのメトリックをスクレイピングするために必要です。 | 9800 | TCP | Prometheus | Taskomaticのメトリックをスクレイピングするために必要です。 | 25151 | TCP | Cobbler |

source: | Port number | Protocol | Used By | Notes | 22 | | | Required for ssh-push and ssh-push-tunnel contact methods. Clients connected to the proxy initiate check in on the server and hop through to clients. | 67 | TCP/UDP | DHCP | Required only if clients are requesting IP addresses from the server. | 69 | TCP/UDP | TFTP | Required if the server is used as a PXE server for automated client installation. | 443 | TCP | HTTPS | {webui}, client, and server and proxy (``tftpsync``) requests. | 4505 | TCP | salt | Required to accept communication requests from clients. The client initiates the connection, and it stays open to receive commands from the Salt master. | 4506 | TCP | salt | Required to accept communication requests from clients. The client initiates the connection, and it stays open to report results back to the Salt master.
ja: | ポート番号 | プロトコル | 使用元 | 注意 |22 | | | ssh-pushおよびssh-push-tunnelの接続メソッドに必要です。 プロキシに接続されているクライアントは、サーバへのチェックインを開始し、クライアントにホップします。 | 67 | TCP/UDP | DHCP | クライアントがサーバからIPアドレスをリクエストしている場合のみ必要です。 | 69 | TCP/UDP | TFTP | 自動化されたクライアントのインストールのためにサーバがPXEサーバとして使用されている場合に必要です。 | 443 | TCP | HTTPS | {webui}、クライアント、およびサーバとプロキシ(``tftpsync``)のリクエストを処理します。 | 4505 | TCP | salt | クライアントからの通信リクエストを受け入れるために必要です。 クライアントは、接続を開始し、開いたままになり、Saltマスタからのコマンドを受信します。 | 4506 | TCP | salt | クライアントからの通信リクエストを受け入れるために必要です。 クライアントは、接続を開始し、開いたままになり、Saltマスタに結果を返します。

source: | Port number | Protocol | Used By | Notes | 80 | | | Used to reach the server. | 443 | TCP | HTTPS | Required for {scclongform}.
ja: | ポート番号 | プロトコル | 使用元 | 注意 |80 | | | サーバにアクセスするために使用します。 | 443 | TCP | HTTPS | {scclongform}で必要です。

source: | Port number | Direction | Protocol | Notes | 22 | Inbound | SSH | Required for ssh-push and ssh-push-tunnel contact methods. | 80 | Outbound | | Used to reach the server or proxy. | 443 | Outbound | | Used to reach the server or proxy. | 9090 | Outbound | TCP | Required for Prometheus user interface. | 9093 | Outbound | TCP | Required for Prometheus alert manager. | 9100 | Outbound | TCP | Required for Prometheus node exporter. | 9117 | Outbound | TCP | Required for Prometheus Apache exporter. | 9187 | Outbound | TCP | Required for Prometheus PostgreSQL.
ja: | ポート番号 | 方向 | プロトコル | 注意 |22 | 着信 | SSH | ssh-pushおよびssh-push-tunnelの接続メソッドに必要です。 | 80 | 送信 | | サーバまたはプロキシにアクセスするために使用します。 | 443 | 送信 | | サーバまたはプロキシにアクセスするために使用します。 | 9090 | 送信 | TCP | Prometheusユーザインターフェースに必要です。 | 9093 | 送信 | TCP | Prometheus警告マネージャに必要です。 | 9100 | 送信 | TCP | Prometheusノードエクスポータに必要です。 | 9117 | 送信 | TCP | Prometheus Apacheエクスポータに必要です。 | 9187 | 送信 | TCP | Prometheus PostgreSQLに必要です。

source: Proxy - Minor Upgrade
cs: Proxy - vedlejší aktualizace
ja: プロキシ - マイナーアップグレード

source: Before you perform any proxy update, schedule a maintenance window. The clients registered to {productname} through the proxy will not be able to connect to {productname} while the update is in progress. For more information about maintenance windows, see xref:administration:maintenance-windows.adoc[].
cs: Před provedením jakékoli aktualizace proxy naplánujte okno údržby. Během aktualizace se klienty registrované na {productname} přes proxy nebudou moci připojit k {productname}. Další informace o oknech údržby viz xref:administration:maintenance-windows.adoc[].
ja: プロキシ更新を実行する前に、メンテナンスウィンドウをスケジュールします。プロキシから{productname}に登録したクライアントは、更新の実行中には{productname}に接続できません。メンテナンスウィンドウの詳細については、xref:administration:maintenance-windows.adoc[]を参照してください。

source: Minor proxy upgrades do not include a version upgrade of the operating system. For more information, see the {productname} {productnumber} release notes.
cs: Drobné aktualizace proxy serveru neobsahují aktualizaci verze operačního systému. Další informace najdete v poznámkách k verzi {productname} {productnumber}.
ja: マイナープロキシアップグレードには、オペレーティングシステムのバージョンアップグレードは含まれません。詳細については、{productname} {productnumber}リリースノートを参照してください。

source: Upgrade the Proxy
cs: Upgradujte proxy
ja: プロキシのアップグレード

source: To update a proxy you first stop the proxy service, then update the software and finally restart the proxy service.
cs: Chcete-li aktualizovat proxy, nejprve zastavte službu proxy, poté aktualizujte software a nakonec restartujte službu proxy.
ja: プロキシを更新するには、まずプロキシサービスを停止し、ソフトウェアを更新し、最後にプロキシサービスを再起動します。

source: Procedure: Updating the {productname} Proxy
cs: Postup: Aktualizace {productname} Proxy
ja: プロシージャ: {productname}プロキシを更新する

source: On the {productname} Proxy, stop the proxy service:
cs: Na {productname} Proxy zastavte službu proxy:
ja: {productname}プロキシで、プロキシサービスを停止します。

source: In the {productname} Server {webui}, navigate to menu:Systems[Proxy] and click the name of the proxy.
cs: Na {productname} Server {webui} přejděte do menu:Systems[Proxy] (Systémy[Proxy]) a klikněte na název proxy serveru.
ja: {productname}サーバの{webui}で、menu:システム[プロキシ]に移動し、プロキシの名前をクリックします。

source: Select all the packages to be updated on the proxy, and then apply the selection.
cs: Vyberte všechny balíčky, které se mají na serveru proxy aktualizovat, a pak výběr použijte.
ja: プロキシで更新するすべてのパッケージを選択し、選択を適用します。

source: On the {productname} Proxy, start the proxy service:
cs: Na {productname} Proxy spusťte službu proxy:
ja: {productname}プロキシで、プロキシサービスを開始します。

source: If you need to update many proxies, you can create an action chain of this command sequence on the {productname} Server. You can use the action chain to perform updates on multiple proxies at the same time.
cs: Potřebujete-li aktualizovat mnoho proxy serverů, můžete na {productname} Serveru vytvořit z této sekvence příkazů řetězec akcí, který můžete použít k provádění aktualizací na více proxy najednou.
ja: 多数のプロキシを更新する必要がある場合、{productname}サーバでこのコマンドシーケンスのアクションチェーンを作成できます。アクションチェーンを使用して、複数のプロキシで同時に更新を実行できます。

source: {productname} Proxy Registration
ja: {productname}プロキシの登録

source: {productname} Proxy systems are installed with the {unifiedinstaller} and registered to {productname} using bootstrap script or {webui}.
ja: {productname}プロキシシステムは、{unifiedinstaller}でインストールし、ブートストラップスクリプトまたは{webui}を使用して{productname}に登録します。

source: After the client is succesfully bootstrapped, it needs to be configured as {productname} Proxy.
ja: クライアントが正常にブートストラップされたら、{productname}プロキシとして設定する必要があります。

source: This procedure describes software channel setup and registering the installed proxy as the {productname} client, using an activation key.
cs: Tento postup popisuje nastavení softwarového kanálu a registraci instalovaného proxy jako klienta {productname} použitím aktivačního klíče.
ja: このプロシージャでは、ソフトウェアチャンネルを設定する方法、およびアクティベーションキーを使用して、インストールしたプロキシを{productname}クライアントとして登録する方法について説明します。

source: Procedure: Registering the Proxy
cs: Postup: Registrace proxy
ja: プロシージャ: プロキシの登録

source: Create an activation key based on the [systemitem]``SLE-Product-SUSE-Manager-Proxy-4.3-Pool`` base channel.
ja: [systemitem]``SLE-Product-SUSE-Manager-Proxy-4.3-Pool``ベースチャンネルに基づいて、アクティベーションキーを作成します。

source: For more information about activation keys, see xref:client-configuration:activation-keys.adoc[].
cs: Další informace o aktivačních klíčích viz xref:client-configuration:activation-keys.adoc[].
ja: アクティベーションキーの詳細については、xref:client-configuration:activation-keys.adoc[]を参照してください。

source: Before you can select the correct child channels while creating the activation key, ensure you have completely downloaded the {productname} Proxy {productnumber} channel and all the recommended and mandatory {sle} {sles-version} {sp-base} channels.
ja: アクティベーションキー作成中に正しい子チャンネルを選択するには、推奨および必須の{sle} {sles-version} {sp-base}チャンネルのすべておよび{productname}プロキシ{productnumber}チャンネルが完全にダウンロード済みであることを確認してください。

source: From the [guimenu]``Child Channels`` listing select the recommended channels by clicking the ``include recommended`` icon:
cs: V seznamu [guimenu]``Podřízené kanály`` vyberte doporučené kanály kliknutím na ikonu ``Zahrnout doporučené``:
ja: ［[guimenu]``子チャンネル``］一覧から、推奨チャンネルを選択します。そのためには、［``推奨を含める``］アイコンをクリックします。

source: The [systemitem]``SLE-Product-SUSE-Manager-Proxy-4.3-Updates`` channel is mandatory.
ja: [systemitem]``SLE-Product-SUSE-Manager-Proxy-4.3-Updates``チャンネルは必須です。

source: To bootstrap a proxy, use the bootstrap script.
cs: Ke spuštění proxy použijte bootstrap skript.
ja: プロキシをブートストラップするには、ブートストラップスクリプトを使用します。

source: For more information about bootstrap scripts, see xref:client-configuration:registration-bootstrap.adoc[].
cs: Další informaceo skriptech pro bootstrap viz xref:client-configuration:registration-bootstrap.adoc[].
ja: ブートストラップスクリプトの詳細については、xref:client-configuration:registration-bootstrap.adoc[]を参照してください。

source: Alternatively, in the {productname} {webui}, navigate to menu:System[Bootstrapping].
ja: または、{productname} {webui}で、menu:システム[ブートストラップ]に移動します。

source: Navigate to menu:System Details[Software > Software Channels], and check that the four proxy channels ([systemitem]``Pool`` and [systemitem]``Updates`` for [systemitem]``SLE-PRODUCT`` and [systemitem]``SLE-MODULE``) plus the recommended channels are selected.
cs: Přejděte do menu:System Details[Software > Softwarové kanály] a zkontrolujte, zda jsou čtyři kanály proxy ([systemitem]``Pool`` a [systemitem]``Aktualizace`` pro [systémová položka]``SLE-PRODUCT`` a [systémová položka]``SLE-MODULE``) plus doporučené kanály jsou vybrány.
ja: menu:システムの詳細[ソフトウェア > ソフトウェアチャンネル]に移動し、4つのプロキシチャンネル([systemitem]``SLE-MODULE``と[systemitem]``SLE-PRODUCT``の[systemitem]``プール``と[systemitem]``更新``)と推奨チャンネルが選択されていることを確認します。

source: [systemitem]``SLE-PRODUCT-Pool`` must be the base channel and the others are child channels.
cs: [systemitem]``SLE-PRODUCT-Pool`` musí být základní kanál a ostatní jsou podřízené kanály.
ja: [systemitem]``SLE-PRODUCT-Pool``がベースチャンネルであり、その他が子チャンネルである必要があります。

source: Proxy - Major Upgrade
cs: Proxy - hlavní upgrade
ja: プロキシ - メジャーアップグレード

source: Major proxy upgrades include a version upgrade of the operating system. For more information, see the {productname} {productnumber} release notes.
cs: Hlavní aktualizace proxy serveru zahrnují aktualizaci verze operačního systému. Další informace najdete v poznámkách k verzi {productname} {productnumber}.
ja: プロキシのメジャーアップグレードには、オペレーティングシステムのバージョンアップグレードが含まれます。詳細については、{productname} {productnumber}リリースノートを参照してください。

source: Preparation for the Upgrade
cs: Příprava aktualizace
ja: アップグレードの準備

source: Procedure: Adding openSUSE Leap {opensuse-version} Software Channels at the Command Prompt
cs: Postup: Přidání softwarových kanálů openSUSE Leap {opensuse-version} z příkazového řádku
ja: プロシージャ: コマンドプロンプトでopenSUSE Leap {opensuse-version}ソフトウェアチャンネルを追加する

source: At the command prompt on the {productname} Server, as root, use the [command]``spacewalk-common-channels`` command to add the appropriate channels:
cs: Z příkazového řádku na {productname} Serveru, jako root, použijte příkaz [command]``spacewalk-common-channels`` pro přidání příslušných kanálů:
ja: {productname} サーバのコマンドプロンプトで root になり、[command]``spacewalk-common-channels`` コマンドを特定のチャンネルに対して実行します:

source: Fully synchronize all channels with [command]``spacewalk-repo-sync``.
cs: Plně synchronizujte všechny kanály příkazem [command]``spacewalk-repo-sync``.
ja: [command]``spacewalk-repo-sync``を使用して、すべてのチャンネルを完全に同期します。

source: To upgrade a proxy you first stop the proxy service, then you replace the software repositories and update the software, and finally you restart the proxy service.
cs: Chcete-li upgradovat proxy, nejprve zastavte službu proxy, poté vyměňte úložiště softwaru a aktualizujte software a nakonec restartujte službu proxy.
ja: プロキシを更新するには、まずプロキシサービスを停止し、ソフトウェアリポジトリを置き換え、ソフトウェアを更新し、最後にプロキシサービスを再起動します。

source: Click menu:Software[Software Channels], and as the base channel select the openSUSE Leap {opensuse-version} channel that is listed in the [systemitem]``Customs Channels`` list.
cs: Klikněte na menu:Software[Software Channels] (Software [Softwarové kanály]) a jako základní kanál vyberte kanál openSUSE Leap {opensuse-version}, který je uveden v seznamu [systemitem]``Customs Channels`` (Zákaznické kanály).
ja: menu:ソフトウェア[ソフトウェアチャンネル]をクリックし、[systemitem]``カスタムチャンネル``一覧にリストされているopenSUSE Leap {opensuse-version}チャンネルをベースチャンネルとして選択します。

source: In the [guimenu]``Child Channels`` pane, select the {opensuse-version} child channels.
cs: V podokně [guimenu]``Child Channels`` (Podřízené kanály) vyberte podřízené kanály pro {opensuse-version}.
ja: ［[guimenu]``子チャンネル``］ペインで、{opensuse-version}子チャンネルを選択します。

source: Click btn:[Next], and [guimenu]``Confirm Software Channel Change`` with btn:[Confirm].
cs: Stiskněte btn:[Next] (Další) a [guimenu]``Confirm Software Channel Change`` (Potvrdit změnu softwarového kanálu) tlačítkem btn:[Confirm] (Potvrdit).
ja: btn:[次へ]、［[guimenu]``ソフトウェアチャンネルの変更確認``］、btn:[確認]をクリックします。

source: Click menu:Details[Remote Command], add `zypper --non-interactive dup --allow-vendor-change --replacefiles` to the script field, and click btn:[Schedule]
ja: menu:詳細[リモートコマンド]をクリックし、スクリプトフィールドに `zypper --non-interactive dup --allow-vendor-change --replacefiles`を追加して、btn:[スケジュール]をクリックします

source: Wait until the remote command is executed.
cs: Počkejte, dokud se vzdálený příkaz neprovede.
ja: リモートコマンドが実行されるまで待ちます。

source: Upgrade the Server
cs: Upgrade serveru
ja: サーバのアップグレード

source: {productname} uses a rolling release versioning schema. Check the release notes for information about which upgrade strategy to use to upgrade to the next version:
cs: {productname} používá postupné schéma verzování. V poznámkách k verzi najdete informace o tom, jakou strategii upgradu použít k upgradu na další verzi:
ja: {productname}は、ローリングリリースバージョン設定スキーマを使用します。次のバージョンへのアップグレードに使用するアップグレード戦略の情報についてリリースノートを確認してください。

source: Minor Upgrades
cs: Menší upgrady
ja: マイナーアップグレード

source: You can consider minor upgrades as regular upgrades. For more information, see xref:installation-and-upgrade:server-minor-upgrade-uyuni.adoc[].
ja: マイナーアップグレードは通常のアップグレードとみなすことができます。詳細については、xref:installation-and-upgrade:server-minor-upgrade-uyuni.adoc[]を参照してください。

source: Major Upgrades
cs: Hlavní upgrady
ja: メジャーアップグレード

source: You can consider major upgrades as special upgrades. In this case components such as the base operating system, Salt, or the PostgreSQL database will be upgraded. For more information, see xref:installation-and-upgrade:server-major-upgrade-uyuni.adoc[].
ja: メジャーアップグレードは特別なアップグレードとみなすことができます。この場合、ベースオペレーティングシステム、Salt、PostgreSQLデータベースなどのコンポーネントがアップグレードされます。詳細については、xref:installation-and-upgrade:server-major-upgrade-uyuni.adoc[]を参照してください。

source: Server - Major Upgrade
cs: Server - hlavní upgrade
ja: サーバ - メジャーアップグレード

source: When {productname} core components are upgraded to new major versions, you need to perform a major upgrade on the {productname} Server. This is the case if a version upgrade of PostgreSQL, Salt, or openSUSE Leap is needed. openSUSE Leap is the underlying base operating system (OS).
cs: Když jsou základní součásti produktu {productname} upgradovány na nové hlavní verze, musíte provést zásadní upgrade na {productname} Serveru. To je případ, kdy je nutná aktualizace verze PostgreSQL, Salt nebo openSUSE Leap. openSUSE Leap je základní operační systém (OS).
ja: {productname}のコアコンポーネントが新しいメジャーバージョンにアップグレードされた場合、{productname}サーバでメジャーアップグレードを実行する必要があります。これは、PostgreSQL、Salt、またはopenSUSE Leapのバージョンアップグレードが必要な場合です。openSUSE Leapは、基盤となるベースオペレーティングシステム(OS)です。

source: Some additional manual steps might be required, and this information is only available in the release notes. For important extra information about your upgrade, see the release notes at:
ja: 追加の手動手順が必要な場合があります。この情報はリリースノートでのみ確認できます。アップグレードの追加情報については、次の場所にあるリリースノートを参照してください:

source: You will not be able to fix issues that arise during the migration. Ensure you have created a backup before you start the migration. For more information about backing up {productname}, see xref:administration:backup-restore.adoc[]. If you are running {productname} Server on a virtual machine, we recommend that you create a snapshot before you start.
ja: 移行中に発生した問題は修正できません。移行を開始する前に、バックアップを作成したことを確認してください。{productname}のバックアップの詳細については、xref:administration:backup-restore.adoc[]を参照してください。仮想マシンで{productname}サーバを実行している場合、移行を開始する前にスナップショットを作成することをお勧めします。

source: Before the upgrade, ensure that storage requirements are met. For more information, see xref:uyuni-install-requirements.adoc[]. The migration procedure can fill the root partition if there is not enough space available due to the service pack migration and the download of new software packages. It is the same for the [path]``/var/lib/pgsql`` when upgrading PostgreSQL. It takes a copy of the old database, thus be sure to have at least enough space available to cope with a copy of the database.
ja: アップグレードの前に、ストレージ要件が満たされていることを確認してください。詳細については、xref:uyuni-install-requirements.adoc[]を参照してください。サービスパックの移行と新しいソフトウェアパッケージのダウンロードのための十分な空き容量がない場合、移行プロシージャによってルート パーティションがいっぱいになる可能性があります。PostgreSQLをアップグレードする場合の[path]``/var/lib/pgsql``も同様です。古いデータベースのコピーを使用するため、データベースのコピーに対応するために少なくとも十分な空き容量があることを確認してください。

source: The [command]``server-migrator.sh`` script migrates {productname} Server to the latest version. It also upgrades the underlying operating system to version {opensuse-version}. The script is part of the [package]``susemanager`` package.
cs: Skript [command]``server-migrator.sh`` migruje {productname} Server na nejnovější verzi. Skript také upgraduje základní operační systém na verzi {opensuse-version}. Skript je součástí balíčku [package]``susemanager``.
ja: [command]``server-migrator.sh``スクリプトを使用すると、{productname}サーバが最新バージョンに移行されます。基盤となるオペレーティングシステムもバージョン{opensuse-version}にアップグレードされます。このスクリプトは[package]``susemanager``パッケージの一部です。

source: Procedure: Migrating the {productname} Server
cs: Postup: Migrace {productname} Serveru
ja: プロシージャ: {productname}サーバを移行する

source: Before running the [command]``server-migrator.sh`` script, check whether the most recent version of the [package]``susemanager`` package is installed:
cs: Před spuštěním skriptu [command]``server-migrator.sh`` zkontrolujte, zda je nainstalována nejnovější verze balíčku [package]``susemanager``:
ja: [command]``server-migrator.sh``スクリプトを実行する前に、最新バージョンの[package]``susemanager``パッケージがインストールされているかどうかを確認してください。

source: Run the [command]``/usr/lib/susemanager/bin/server-migrator.sh`` script to upgrade the base OS and {productname} Server.
cs: Spuštěním skriptu [command]``/usr/lib/susemanager/bin/server-migrator.sh`` upgradujte základní operační systém a {productname} Server.
ja: [command]``/usr/lib/susemanager/bin/server-migrator.sh``スクリプトを実行してベースOSおよび{productname}サーバをアップグレードします。

source: After the migration is complete, manually reboot the {productname} Server:
ja: 移行が完了したら、{productname}サーバを手動で再起動します。

source: Server - Minor Upgrade
cs: Server - menší aktualizace
ja: サーバ - マイナーアップグレード

source: Several times a year, the {productname} team releases minor upgrades of the {productname} Server. These updates address bug fixes and feature improvements, and sometimes include new features.
cs: Několikrát ročně vydává tým {productname} drobné upgrady {productname} Serveru, které opravují chyby, vylepšují funkce a někdy obsahují nové funkce.
ja: 1年に数回、{productname}チームは、{productname}サーバのマイナーアップグレードをリリースします。この更新は、バグ修正および機能の向上に対処し、新機能を導入する場合もあります。

source: Some additional manual steps might be required, and this information is only available in the release notes. For more information about such a major upgrade, see xref:installation-and-upgrade:server-major-upgrade-uyuni.adoc[].
ja: 追加の手動手順が必要な場合があります。この情報はリリースノートでのみ確認できます。このようなメジャーアップグレードの詳細については、xref:installation-and-upgrade:server-major-upgrade-uyuni.adoc[]を参照してください。

source: For information about your upgrade, see the release notes at https://www.uyuni-project.org/pages/stable-version.html.
ja: アップグレードの詳細については、https://www.uyuni-project.org/pages/stable-version.htmlでリリースノートを参照してください。

source: Performing a minor upgrade is similar to installing operating system package updates.
cs: Menší upgrade se podobá instalaci aktualizací balíčků operačního systému.
ja: マイナーアップグレードの実行は、オペレーティングシステムパッケージの更新と似ています。

source: Procedure: Updating Packages on the {productname} Server
cs: Postup: Aktualizace balíčků na {productname} Serveru
ja: プロシージャ: {productname}サーバのパッケージを更新する

source: By default, several update repositories are configured and enabled for the {productname} Server. New and updated packages become available automatically.
cs: Ve výchozím nastavení je pro server {productname} konfigurováno a povoleno několik úložišť aktualizací. Nové a aktualizované balíčky budou k dispozici automaticky.
ja: デフォルトでは、複数の更新リポジトリが{productname}サーバ用に設定され、有効化されます。新規および更新したパッケージは自動的に使用可能になります。

source: It is recommended you make a backup of the server before upgrading. For more information about backing up {productname}, see xref:administration:backup-restore.adoc[].
ja: アップグレード前にサーバのバックアップを作成することをお勧めします。{productname}のバックアップの詳細については、xref:administration:backup-restore.adoc[]を参照してください。

source: On the {productname} Server, at the command prompt, as root, stop the spacewalk services:
cs: Na {productname} Serveru zastavte na příkazovém řádku, jako root, služby spacewalk:
ja: {productname}サーバのコマンドプロンプトで、rootとしてspacewalkサービスを停止します。

source: Refresh software repositories:
cs: Obnovení úložišť softwaru:
ja: ソフトウェアリポジトリを更新します。

source: Update new packages: (Repeat this if prompted by zypper)
ja: 新しいパッケージを更新します: (zypperによってプロンプトが表示されたらこれを繰り返します)

source: Uyuni is different from SUSE Manager in this step. SUSE Manager uses [command]``zypper patch``, but Uyuni requires [command]``zypper up``.
ja: このステップでは、UyuniはSUSE Managerとは異なります。SUSE Managerでは[command]``zypper patch``を使用しますが、Uyuniでは[command]``zypper up``が必要です。
