Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: To monitor the syncing progress of each channel, check the log files in the [path]``/var/log/rhn/reposync`` directory on the {productname} Server.
ja: 各チャンネルの同期の進行状況を監視するには、{productname}サーバの [path]``/var/log/rhn/reposync``ディレクトリにあるログファイルを確認します。
ko: 각 채널의 동기화 진행 상황을 모니터링하려면 {productname} 서버의 [path]``/var/log/rhn/reposync`` 디렉토리에서 로그 파일을 확인하십시오.
zh_cn: 要监控每个通道的同步进度，请查看 {productname} 服务器上 [path]``/var/log/rhn/reposync`` 目录中的日志文件。

source: If a product is provided by both the {payg} instance and one of the {scc} subscriptions, it will appear only once in the products list.
zh_cn: 如果 {payg} 实例和某个 {scc} 订阅都提供了某个产品，该产品在产品列表中只会显示一次。

source: When the channels belonging to that product are synced, the data might still come from the SCC subscription, and not from the Pay-As-You-Go instance.
zh_cn: 同步属于该产品的通道后，相关数据可能仍会来自 SCC 订阅，而不会来自 Pay-As-You-Go 实例。

source: Instance credential collect status
zh_cn: 实例身份凭证收集状态

source: {productname} server uses credentails collected from the instance to connect to the RMT server and to download the packages using reposync. These credentials are refreshed every 10 minutes by taskomatic using the defined SSH connection data. Connection to RMT server always uses the last known authentication credentials collected from the {payg} instance.
ja: {productname}サーバは、インスタンスから収集された資格情報を使用してRMTサーバに接続し、reposyncを使用してパッケージをダウンロードします。これらの資格情報は、taskomaticにより、定義されたSSH接続データを使用して10分ごとに更新されます。RMTサーバへの接続では、常に{payg}インスタンスから収集された最新の既知の認証資格情報が使用されます。
ko: {productname} 서버는 인스턴스에서 수집한 자격 증명을 사용하여 RMT 서버에 연결하고 reposync를 사용하여 패키지를 다운로드합니다. 이러한 자격 증명은 정의된 SSH 연결 데이터를 사용하여 taskomatic에 의해 10분마다 새로 고쳐집니다. RMT 서버에 대한 연결은 {payg} 인스턴스에서 수집된 마지막으로 알려진 인증 자격 증명을 항상 사용합니다.
zh_cn: {productname} 服务器使用从实例收集的身份凭证来连接 RMT 服务器，并通过 reposync 下载软件包。Taskomatic 会使用定义的 SSH 连接数据每 10 分钟刷新一次这些身份凭证。RMT 服务器连接始终使用从 {payg} 实例收集的最新已知身份验证身份凭证。

source: The status of the {payg} instance credentials collect is shown in the column [literal]``Status`` or on the instance details page. When the instance is not reachable, the credential update process will fail.
zh_cn: [literal]``状态``列或实例细节页面中会显示 {payg} 实例身份凭证收集的状态。如果无法访问实例，身份凭证更新进程将会失败。

source: When the instance is unreachable, the credential update process will fail and the credentials will become invalid after the second failed refresh. Synchronization of channels will fail when the credentials are invalid. To avoid this keep the connected instances running.
zh_cn: 如果无法访问实例，身份凭证更新过程将会失败，并且在刷新操作第二次失败后，身份凭证将变成无效状态。当身份凭证无效后，通道的同步将会失败。为了避免出现此问题，请让连接的实例保持运行状态。

source: {payg} instance remains connected to {productname} server unless SSH connection data is explicitly deleted. To delete the SSH connection data to the instance, use <<proc-deleting-connection-data-to-instance>>.
ja: {payg}インスタンスは、SSH接続データが明示的に削除されない限り、{productname}サーバに接続されたままになります。インスタンスへのSSH接続データを削除するには、<<proc-deleting-connection-data-to-instance>>を使用します。
ko: SSH 연결 데이터가 명시적으로 삭제된 경우를 제외하고, {payg} 인스턴스는 {productname} 서버에 연결된 상태를 유지합니다. 인스턴스에 대한 SSH 연결 데이터를 삭제하려면 <<proc-deleting-connection-data-to-instance>> 명령을 사용하십시오.
zh_cn: 除非明确删除了 SSH 连接数据，否则 {payg} 实例将始终连接到 {productname} 服务器。要删除实例的 SSH 连接数据，请执行 <<proc-deleting-connection-data-to-instance>>。

source: {payg} instance may not be accessible from the {productname} server at all times.
ja: {payg}インスタンスは、{productname}サーバから常にアクセスできるとは限りません。
ko: 항상 {productname} 서버에서 {payg} 인스턴스에 액세스할 수 있는 것은 아닙니다.
zh_cn: 并非在任何时间都可从 {productname} 服务器访问 {payg} 实例。

source: If the instance exists, but is stopped, the last known credentials will be used to try to connect to the instance.
ja: インスタンスが存在するが停止している場合は、最新の既知の資格情報を使用してインスタンスへの接続が試行されます。
ko: 인스턴스가 존재하지만 중지된 경우에는 마지막으로 알려진 자격 증명을 사용하여 인스턴스에 연결을 시도합니다.
zh_cn: 如果实例存在但已停止，系统将使用最新的已知身份凭证尝试连接实例。

source: How long the credentials remain valid depends on the cloud provider.
ja: 資格情報が有効である期間は、クラウドプロバイダによって異なります。
ko: 자격 증명 유효 기간은 클라우드 공급자에 따라 다릅니다.
zh_cn: 身份凭证的有效时长取决于云提供商。

source: If the instance no longer exists, but is still registered with SUMA, its credentials are no longer valid and the authentication will fail.
ja: インスタンスが存在しなくなったが、SUMAに登録されている場合、その資格情報は無効になり、認証は失敗します。
zh_cn: 如果实例不再存在，但在 SUMA 中仍保持注册状态，其身份凭证将不再有效，身份验证将会失败。

source: The error message is shown in the column Status.
ja: エラーメッセージは［ステータス］列に表示されます。
ko: 오류 메시지는 상태 열에 표시됩니다.
zh_cn: “状态”列中会显示错误消息。

source: The error message only indicates that the instance is not available. Further diagnostics about the status of the instance needs to be done on the cloud provider.
ja: エラーメッセージは、インスタンスが使用できないことを示すだけです。インスタンスのステータスに関する詳細な診断は、クラウドプロバイダで実行する必要があります。
ko: 오류 메시지는 인스턴스를 사용할 수 없다는 것만을 나타냅니다. 인스턴스 상태에 대한 자세한 진단은 클라우드 공급자에서 수행해야 합니다.
zh_cn: 错误消息只会指出实例不再可用。云提供商需要对实例的状态进行进一步诊断。

source: Any of the following actions or changes in the {payg} instance will lead to credentials failing:
ja: {payg}インスタンスで次のアクションまたは変更を行うと、資格情報が機能しなくなります。
ko: {payg} 인스턴스에서 다음 작업 또는 변경 사항이 발생하면 자격 증명이 작동하지 않게 됩니다.
zh_cn: 在 {payg} 实例中进行以下任意操作或更改都将导致身份凭证失效：

source: removing zypper credentials files
ja: zypper資格情報ファイルの削除
ko: zypper 자격 증명 파일 제거
zh_cn: 去除 zypper 身份凭证文件

source: removing the imported certificates
ja: インポートした証明書の削除
ko: 가져온 인증서 제거
zh_cn: 去除导入的证书

source: removing cloud-specific entries from [path]``/etc/hosts``
ja: [path]``/etc/hosts``からのクラウド固有エントリの削除
ko: [path]``/etc/hosts``에서 클라우드 관련 항목 제거
zh_cn: 从 [path]``/etc/hosts`` 中去除特定于云的条目

source: Registering {payg} system as a client
zh_cn: 将 {payg} 系统注册为客户端

source: You can register a {payg} instance from where you harvest the credentials as a {salt} client. The instance needs to have a valid cloud connection registered, otherwise it will not have access to channels. If the user removes the cloud packages, the credentials harvesting may stop working.
ja: 資格情報を{salt}クライアントとして収集する場所から{payg}インスタンスを登録できます。 インスタンスには有効なクラウド接続が登録されている必要があります。登録されていないとチャンネルにアクセスできません。 ユーザがクラウドパッケージを削除すると、資格情報の収集が機能しなくなる場合があります。
ko: 자격 증명을 수집하는 {payg} 인스턴스를 {salt} 클라이언트로 등록할 수 있습니다. 인스턴스에는 유효한 클라우드 연결이 등록되어 있어야 하며, 그렇지 않으면 채널에 액세스할 수 없습니다. 사용자가 클라우드 패키지를 제거하면 자격 증명 수집이 작동하지 않을 수 있습니다.
zh_cn: 您可以将从中收集身份凭证的 {payg} 实例注册为 {salt} 客户端。需要为实例注册有效的云连接，否则它将无法访问通道。如果用户去除相关云软件包，身份凭证收集可能会停止工作。

source: First set up the {payg} instance to collect authentication data, so it can synchronize the channels.
ja: 最初に{payg}インスタンスを設定して、認証データを収集し、チャンネルを同期できるようにします。
ko: 우선 {payg} 인스턴스를 설정하여 인증 데이터를 수집합니다. 그러면 채널을 동기화할 수 있습니다.
zh_cn: 首先，将 {payg} 实例设置为收集身份验证数据，以使其可以同步通道。

source: The rest of the process is the same as for any non-public-cloud client and consists of synchronizing channels, automatic bootstrap script creation, activation key creation and starting the registration.
ja: 残りのプロセスは、パブリッククラウド以外のクライアントの場合と同じで、チャンネルの同期、ブートストラップスクリプトの自動作成、アクティベーションキーの作成、および登録の開始で構成されます。
ko: 나머지 프로세스는 비퍼블릭 클라우드 클라이언트에서와 동일하며 채널 동기화, 자동 부트스트랩 스크립트 생성, 활성화 키 생성 및 등록 시작으로 구성됩니다.
zh_cn: 该过程的其余步骤与非公有云客户端的步骤相同，包括同步通道、自动创建引导脚本、创建激活密钥，以及启动注册。

source: For more about registering clients, see xref:client-configuration:registration-overview.adoc[].
ja: クライアントの登録の詳細については、xref:client-configuration:registration-overview.adoc[]を参照してください。
ko: 클라이언트 등록에 대한 자세한 내용은 xref:client-configuration:registration-overview.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关注册客户端的详细信息，请参见 xref:client-configuration:registration-overview.adoc[]。

source: Troubleshooting
ja: トラブルシューティング
ko: 문제 해결
zh_cn: 查错

source: Checking the credentials
ja: 資格情報の確認
ko: 자격 증명 확인
zh_cn: 检查身份凭证

source: If the script fails to collect the credentials, it should provide a proper error message in the logs and in the {webui}.
ja: スクリプトが資格情報の収集に失敗した場合、ログと{webui}に適切なエラーメッセージが表示されます。
ko: 스크립트가 자격 증명 수집에 실패하면 로그 및 {webui}에 적절한 오류 메시지가 표시되어야 합니다.
zh_cn: 如果脚本无法收集身份凭证，将会在日志和 {webui} 中提供正确的错误消息。

source: If the credentials are not working, [literal]``reposync`` should show the proper error.
ja: 資格情報が機能しない場合は、[literal]``reposync``に適切なエラーが表示されます。
ko: 자격 증명이 작동하지 않으면 [literal]``reposync``에 적절한 오류가 표시되어야 합니다.
zh_cn: 如果身份凭证无法工作，[literal]``reposync`` 应该会显示正确的错误消息。

source: Using [literal]``registercloudguest``
ja: [literal]``registercloudguest``を使用する
ko: [literal]``registercloudguest`` 설치
zh_cn: 使用 [literal]``registercloudguest``

source: Refreshing or changing the [literal]``registercloudguest`` connection to the public cloud update infrastructure should not interfere with the credentials usage.
ja: パブリッククラウド更新インフラストラクチャへの[literal]``registercloudguest``接続を更新または変更しても、資格情報の使用に支障はありません。
ko: 공용 클라우드 업데이트 인프라에 대한 [literal]``registercloudguest`` 연결을 새로 고치거나 변경해도 자격 증명을 사용하는 데 방해가 되지 않아야 합니다.
zh_cn: 刷新或更改 [literal]``registercloudguest`` 与公有云更新基础架构的连接不应影响身份凭证的使用。

source: Running [literal]```registercloudguest --clean`` will cause problems if no new cloud connection is registered with the cloud guest command.
ja: cloudguestコマンドを使用して新しいクラウド接続が登録されていない場合、[literal]``registercloudguest --clean``を実行すると問題が発生します。
ko: 클라우드 게스트 명령에 새 클라우드 연결이 등록되어 있지 않은 경우 [literal]``registercloudguest --clean``을 실행하면 문제가 발생할 수 있습니다.
zh_cn: 如果未使用 cloud guest 命令注册新的云连接，运行 [literal]``registercloudguest --clean`` 将会导致发生问题。

source: Proxy Migration from 4.3 to 5.1
ko: 4.3에서 5.1로 프록시 마이그레이션
zh_cn: 将代理从 4.3 迁移到 5.1

source: Requirements and considerations
ko: 요구 사항 및 고려 사항
zh_cn: 要求和注意事项

source: To migrate a SUSE Manager 4.3 Proxy to {productname} {productnumber}, you require a new machine with {sl-micro} {microversion} or {sles} {bci-mlm} and [literal]``mgrpxy`` installed.
ko: SUSE Manager 4.3 프록시를 {productname} {productnumber}(으)로 마이그레이션하려면, {sl-micro} {microversion} 또는 {sles} {bci-mlm}이(가) 설치된 새 시스템과 [literal]``mgrpxy``가 필요합니다.
zh_cn: 要将 SUSE Manager 4.3 代理迁移到 {productname} {productnumber}，需要一台安装了 {sl-micro} {microversion} 或 {sles} {bci-mlm} 和 [literal]``mgrpxy`` 的新计算机。

source: Before migrating from SUSE Manager 4.3 to {productnumber}, any existing traditional clients including the traditional proxies must be migrated to {salt}. For more information about migrating traditional {productname} 4.3 clients to {salt} clients, see https://documentation.suse.com/suma/4.3/en/suse-manager/client-configuration/contact-methods-migrate-traditional.html.
ko: SUSE Manager 4.3에서 {productnumber}(으)로 마이그레이션하기 전에, 기존 클라이언트(기존 프록시 포함)를 모두 {salt}로 마이그레이션해야 합니다. 기존 {productname} 4.3 클라이언트를 {salt} 클라이언트로 마이그레이션하는 방법에 대한 자세한 내용은 https://documentation.suse.com/suma/4.3/en/suse-manager/client-configuration/contact-methods-migrate-traditional.html[]에서 확인할 수 있습니다.
zh_cn: 在从 SUSE Manager 4.3 迁移到 {productnumber} 之前，必须将所有现有的传统客户端（包括传统代理）迁移到 {salt}。有关将传统 {productname} 4.3 客户端迁移到 {salt} 客户端的详细信息，请参见 link:https://documentation.suse.com/suma/4.3/en/suse-manager/client-configuration/contact-methods-migrate-traditional.html[]。

source: Traditional contact protocol is no longer supported in {productname} 5.0 and later.
ja: 従来の接続プロトコルは、{productname} 5.0以降ではサポートされなくなりました。
zh_cn: {productname} 5.0 及更高版本不再支持传统联系协议。

source: Before migrating a SUSE Manager 4.3 Proxy to {productname} {productnumber}, the SUSE Manager 4.3 Server needs to be migrated first, see xref:installation-and-upgrade:container-deployment/mlm/migrations/server/server-mlm-43-51.adoc[].
ko: SUSE Manager 4.3 프록시를 {productname} {productnumber}(으)로 마이그레이션하기 전에, 먼저 SUSE Manager 4.3 서버를 마이그레이션해야 합니다. 자세한 내용은 xref:installation-and-upgrade:container-deployment/mlm/migrations/server/server-mlm-43-51.adoc[]에서 확인할 수 있습니다.
zh_cn: 在将 SUSE Manager 4.3 代理迁移至 {productname} {productnumber} 之前，需要先迁移 SUSE Manager 4.3 服务器，详情请参见 xref:installation-and-upgrade:container-deployment/mlm/migrations/server/server-mlm-43-51.adoc[]。

source: Introduction
ko: 소개
zh_cn: 简介

source: containerized running on Podman
ko: Podman에서 실행 중인 컨테이너화
zh_cn: 基于 Podman 运行的容器化部署

source: containerized running on k3s
ko: k3s에서 컨테이너화된 실행
zh_cn: 基于 k3s 运行的容器化部署

source: TFTP files synchronization
ko: TFTP 파일 동기화
zh_cn: TFTP 文件同步

source: Containerized proxies do not use tftpsync mechanism to transfer tftproot files. Instead these files are transparently downloaded and cached on demand.
ko: 컨테이너화된 프록시는 tftpsync 메커니즘을 사용하여 tftproot 파일을 전송하지 않습니다. 대신 이러한 파일들은 필요에 따라 투명하게 다운로드되고 캐시됩니다.
zh_cn: 容器化代理不使用 tftpsync 机制传输 tftproot 文件。相反，这些文件会按需自动下载并缓存。

source: To prevent false positive errors during [command]``cobbler sync`` run, migrated 4.3 proxies need to be removed from tftpsync mechanism.
ko: [command]``cobbler sync`` 실행 중 오감지 오류를 방지하려면, 마이그레이션된 4.3 프록시를 tftpsync 메커니즘에서 제거해야 합니다.
zh_cn: 为避免在 [command]``cobbler sync`` 运行期间出现误报错误，需要将迁移后的 4.3 代理从 tftpsync 机制中去除。

source: If you previously configured a 4.3 proxy to receive TFTP files, one of the following configuration option is required:
ko: 이전 설정에서 TFTP 파일을 수신하도록 4.3 프록시를 구성한 경우, 다음 구성 옵션 중 하나가 필요합니다.
zh_cn: 如果您之前已将 4.3 代理配置为接收 TFTP 文件，则需要选择以下配置选项之一：

source: To get to a shell inside the container, run on the container host:
ja: コンテナ内のシェルに移動するには、コンテナホストで次のコマンドを実行します。
ko: 컨테이너 내부의 셸로 이동하려면 컨테이너 호스트에서 실행합니다.
zh_cn: 要在容器内访问外壳，请在容器主机上运行以下命令：

source: In the {productname} {productnumber} server container, run [command]``configure-tftpsync.sh`` with the list of remaining 4.3 proxies as arguments. If no 4.3 proxies remain, run [command]``configure-tftpsync.sh`` with no arguments.
ko: {productname} {productnumber} 서버 컨테이너에서, 남은 4.3 프록시 목록을 인수로 지정하여 [command]``configure-tftpsync.sh``를 실행합니다. 남은 4.3 프록시가 없는 경우, 인수를 지정하지 않고 [command]``configure-tftpsync.sh``를 실행합니다.
zh_cn: 在 {productname} {productnumber} 服务器容器中，运行 [command]``configure-tftpsync.sh``，并将剩余的 4.3 代理列表作为参数传入。如果不存在剩余的 4.3 代理，则直接运行 [command]``configure-tftpsync.sh``（无需传入参数）。

source: In the {productname} {productnumber} server container, manually remove the relevant proxy from the [option]``proxies`` setting in the [path]``/etc/cobbler/settings.yaml`` file. If there are no 4.3 proxies remaining, then manually remove the [option]``proxies`` list completely.
ko: {productname} {productnumber} 서버 컨테이너에서, [path]``/etc/cobbler/settings.yaml`` 파일의 [option]``proxies`` 설정에서 관련 프록시를 수작업으로 제거합니다. 4.3 프록시가 남아 있지 않은 경우, [option]``proxies`` 목록을 수작업으로 완전히 제거합니다.
zh_cn: 在 {productname} {productnumber} 服务器容器中，手动从文件 [path]``/etc/cobbler/settings.yaml`` 的 [option]``proxies`` 设置中去除相关代理。如果不存在剩余的 4.3 代理，则手动将 [option]``proxies`` 列表完全去除。

source: Proxy Migration from 5.0 to 5.1
ko: 5.0에서 5.1로 프록시 마이그레이션
zh_cn: 将代理从 5.0 迁移到 5.1

source: This document provides the tested and validated procedures for migrating both the **host operating system** and the **proxy extension** in environments managed by **{productname}**, specifically targeting systems deployed with **{productname} Proxy 5.0**.
ko: 이 문서는 {productname}(으)로 관리되는 환경에서 **호스트 운영 체제** 및 **프록시 확장**을 마이그레이션하기 위한 검증된 절차를 제공하며, 특히 {productname} Proxy 5.0이 배포된 시스템을 대상으로 합니다.
zh_cn: 本文提供了经过测试和验证的步骤，专门针对部署了 **{productname} 代理 5.0** 的系统，在 **{productname}** 管理的环境中迁移**主机操作系统**和**代理扩展**。

source: The upgrade scenarios covered include:
ko: 업그레이드 시나리오에는 다음이 포함됩니다.
zh_cn: 涵盖的升级场景包括：

source: Migrating from **SUSE Linux Enterprise Micro (SLE Micro) 5.5** to **SLE Micro 6.1**
ko: **SUSE Linux Enterprise Micro (SLE Micro) 5.5**에서 **SLE Micro 6.1**로 마이그레이션
zh_cn: 从 **SUSE Linux Enterprise Micro (SLE Micro) 5.5** 迁移到 **SLE Micro 6.1**

source: Migrating from **SUSE Linux Enterprise Server (SLES) 15 SP6** to **SLES 15 SP7**
ko: **SUSE Linux Enterprise Server (SLES) 15 SP6**에서 **SLES 15 SP7**으로 마이그레이션
zh_cn: 从 **SUSE Linux Enterprise Server (SLES) 15 SP6** 迁移到 **SLES 15 SP7**

source: Upgrading the **{productname} Proxy Extension** from **version 5.0** to **version {productnumber}**
ko: **{productname} 프록시 확장**을 **버전 5.0**에서 **버전 {productnumber}**(으)로 업그레이드
zh_cn: 将 **{productname} 代理扩展**从 **5.0 版本**升级到 **{productnumber} 版本**

source: Before migrating the proxy, it is required to first migrate the SUSE Manager 5.0 Server to {productname} {productnumber}.
ko: 프록시를 마이그레이션하기 전에 먼저 SUSE Manager 5.0 서버를 {productname} {productnumber}(으)로 마이그레이션해야 합니다.
zh_cn: 在迁移代理前，需要先将 SUSE Manager 5.0 服务器迁移至 {productname} {productnumber}。

source: {sle-micro} 5.5 to {sl-micro} 6.1
ko: {sle-micro} 5.5에서 {sl-micro} 6.1로
zh_cn: 从 {sle-micro} 5.5 迁移到 {sl-micro} 6.1

source: This section provides the tested procedure to upgrade a {sle-micro} 5.5 host deployed with {productname} 5.0 Proxy to {sl-micro} 6.1 with {productname} {productnumber} Proxy.
ko: 이 섹션에서는 {productname} 5.0 프록시가 배포된 {sle-micro} 5.5 호스트를 {productname} {productnumber} 프록시가 포함된 {sle-micro} 6.1로 업그레이드하는 검증된 절차를 제공합니다.
zh_cn: 本节提供了经过测试的步骤，用于将部署了 {productname} 5.0 代理的 {sle-micro} 5.5 主机升级到部署了 {productname} {productnumber} 代理的 {sl-micro} 6.1。

source: Prerequisites
zh_cn: 先决条件

source: {productname} 5.0 Proxy is installed and running on {sle-micro} 5.5.
ko: {sle-micro} 5.5.에서 {productname} 5.0 프록시 설치 및 실행
zh_cn: {productname} 5.0 代理已在 {sle-micro} 5.5 上安装并运行。

source: Proxy system is registered with the {productname} Server.
ko: 프록시 시스템은 {productname} 서버에 등록되어 있습니다.
zh_cn: 已在 {productname} 服务器中注册代理系统。

source: Distribution upgrade and proxy migration
ko: 배포판 업그레이드 및 프록시 마이그레이션
zh_cn: 发行套件升级和代理迁移

source: Procedure: Migrate {productname} 5.0 Proxy to {productname} {productnumber} Proxy
ko: 절차: {productname} 5.0 프록시를 {productname} {productnumber} 프록시로 마이그레이션
zh_cn: 过程：将 {productname} 5.0 代理迁移到 {productname} {productnumber} 代理

source: Verify System and {productname} Tools version.
ko: 시스템 및 {productname} 도구 버전을 확인합니다.
zh_cn: 校验系统和 {productname} 工具版本。

source: Confirm:
ko: 확인:
zh_cn: 确认以下信息：

source: Operating System: [literal]``SLE Micro 5.5``
ko: 운영 체제: [literal]``SLE Micro 5.5``
zh_cn: 操作系统：[literal]``SLE Micro 5.5``

source: Tools version: [literal]``mgrpxy version 0.1.29`` or higher
ko: 도구 버전: [literal]``mgrpxy version 0.1.29`` 이상
zh_cn: 工具版本：[literal]``mgrpxy version 0.1.29`` 或更高版本

source: Check running containers.
ko: 실행 중인 컨테이너를 확인합니다.
zh_cn: 检查正在运行的容器。

source: Ensure the following containers are running:
ko: 다음 컨테이너가 실행 중인지 확인합니다.
zh_cn: 确保以下容器正在运行：

source: Synchronize the new Proxy Products in {productname} Server. For more information, see xref:client-configuration:products.adoc[].
ko: {productname} 서버에서 새로운 프록시 제품을 동기화합니다. 자세한 내용은 xref:client-configuration:products.adoc[]에서 확인할 수 있습니다.
zh_cn: 在 {productname} 服务器中同步新代理产品。有关详细信息，请参见 xref:client-configuration:products.adoc[]。

source: Use the Web UI to synchronize:
ko: 웹 UI를 사용하여 동기화:
zh_cn: 使用 Web UI 进行同步：

source: Perform proxy product migration. For more information, see xref:client-configuration:client-upgrades-product-migration.adoc[].
ko: 자세한 내용은 xref:client-configuration:clients-opensuseleap.adoc[]에서 참조하십시오.
zh_cn: 执行代理产品迁移。有关详细信息，请参见 xref:client-configuration:client-upgrades-product-migration.adoc[]。

source: Navigate to the proxy system and select menu:Systems[Overview] > menu:Software[Product Migration].
ko: 프록시 시스템으로 이동하여 menu:시스템[개요] > menu:소프트웨어[제품 마이그레이션]을 선택합니다.
zh_cn: 导航至代理系统，选择menu:系统[概览] > menu:软件[产品迁移]。

source: Migrate from
ko: 마이그레이션 출처
zh_cn: 将

source: to
ko: 대상
zh_cn: 迁移到

source: **Do not select** optional channels when prompted, unless you have confirmed they are required.
ko: 필수 채널인지 확인하지 않은 경우, 메시지가 표시될 때 선택 채널을 **선택하지 마십시오**.
zh_cn: 出现提示时，**请勿选择**可选通道，除非您已确认必须使用这些通道。

source: It is recommended to do a dry-run first before performing the actual migration.
ko: 실제 마이그레이션을 수행하기 전에 먼저 테스트를 실행해 보는 것이 좋습니다.
zh_cn: 建议在执行实际迁移前先进行试运行。

source: Monitor the migration action.
ko: 마이그레이션 작업을 모니터링합니다.
zh_cn: 监控迁移操作。

source: You can follow the process under menu:Systems[Details > Events] tab in the {webui}.
ko: {webui}의 menu:시스템[세부 정보 > 이벤트] 탭에서 해당 절차를 확인할 수 있습니다.
zh_cn: 您可在 {webui} 的menu:系统[细节 > 事件]选项卡中查看流程进度。

source: After the upgrade completes, stop the proxy container and then reboot the system.
ko: 마이그레이션이 완료된 후에는, 프록시 컨테이너를 중지한 후 시스템을 재부팅합니다.
zh_cn: 完成升级后，停止代理容器，然后重引导系统。

source: Perform post-reboot checks.
ko: 재부팅 후 점검을 수행합니다.
zh_cn: 执行重引导后的检查。

source: Verify upgraded OS and {productname} extension:
ko: 업그레이드된 OS 및 {productname} 확장 확인:
zh_cn: 校验升级后的操作系统和 {productname} 扩展：

source: You should see:
ko: 다음을 참조해야 합니다.
zh_cn: 您应看到以下内容：

source: Verify {productname} tools version.
ko: {productname} 도구 버전을 확인합니다.
zh_cn: 校验 {productname} 工具版本。

source: Expected output:
ko: 예상 출력:
zh_cn: 预期输出：

source: `mgrpxy version 5.1.11` or higher
ko: ``mgrpxy version 5.1.11`` 이상
zh_cn: `mgrpxy version 5.1.11` 或更高版本

source: Enable Root SSH Access (_if required_). SL Micro 6.1 disables root login via SSH by default. Edit `/etc/ssh/sshd_config.d/sshd.conf`:
ko: 루트 SSH 액세스를 활성화합니다(_필요한 경우_). SL Micro 6.1은 기본적으로 SSH를 통한 루트 로그인을 비활성화합니다. ``/etc/ssh/sshd_config.d/sshd.conf``를 편집합니다.
zh_cn: 启用 root SSH 访问权限（_如果需要_）。SL Micro 6.1 默认会禁用 root 登录。请编辑 `/etc/ssh/sshd_config.d/sshd.conf`：

source: Restart the service:
ko: 서비스를 다시 시작합니다.
zh_cn: 重启该服务：

source: For more information, see xref:administration:troubleshooting/tshoot-remote-root-on-micro.adoc[].
ko: 자세한 내용은 xref:administration:troubleshooting/tshoot-remote-root-on-micro.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关详细信息，请参见 xref:administration:troubleshooting/tshoot-remote-root-on-micro.adoc[]。

source: Install the new proxy container images as RPM packages.
ko: 새 프록시 컨테이너 이미지를 RPM 패키지로 설치합니다.
zh_cn: 以 RPM 软件包形式安装新的代理容器映像。

source: Reboot the P-roxy.
zh_cn: 重引导代理。

source: Upgrade proxy containers and restart them.
ko: 프록시 컨테이너를 업그레이드하고 다시 시작합니다.
zh_cn: 升级代理容器并重启。

source: Confirm proxy containers are operational.
ko: 프록시 컨테이너가 정상 작동하는지 확인합니다.
zh_cn: 确认代理容器可正常运行。

source: All expected proxy containers should be up and running:
ko: 예상되는 모든 프록시 컨테이너가 작동 중이어야 합니다.
zh_cn: 所有预期的代理容器均应正常启动并运行：

source: Migration complete
ko: 마이그레이션 완료
zh_cn: 迁移完成

source: The proxy host system is now running {sl-micro} {microversion} with updated {productname} {productnumber} Proxy packages and synchronized product channels.
ko: 프록시 호스트 시스템에서는 현재 업데이트된 {productname} {productnumber} 프록시 패키지 및 동기화된 제품 채널이 있는 {sl-micro} {microversion}을(를) 실행 중입니다.
zh_cn: 代理主机系统现已运行 {sl-micro} {microversion}，并配备了更新后的 {productname} {productnumber} 代理软件包及已同步的产品通道。

source: {sles} 15 SP6 to 15 SP7
ko: {sles} 15 SP6에서 15 SP7으로
zh_cn: 从 {sles} 15 SP6 升级到 15 SP7

source: This section provides the procedure to upgrade a {sles} SP6 host deployed with {productname} 5.0 Proxy to {sles} {sp-version} with {productname} {productnumber} Proxy.
ko: 이 섹션에서는 {productname} 5.0 프록시가 배포된 {sles} SP6 호스트를 {productname} {productnumber} 프록시가 포함된 {sles} {sp-version}(으)로 업그레이드하는 절차를 설명합니다.
zh_cn: 本节提供了经过测试的步骤，用于将部署了 {productname} 5.0 代理的 {sles} SP6 主机升级到部署了 {productname} {productnumber} 代理的 {sles} {sp-version}。

source: {productname} Proxy 5.0 is installed and running on {sles} 15 SP6.
ko: {productname} 프록시 5.0이 {sles} 15 SP6에 설치되어 실행 중입니다.
zh_cn: {productname} 5.0 代理已在 {sles} 15 SP6 上安装并运行。

source: Procedure: Update {productname} Proxy components on {sles} 15 SP6
ko: 절차: {sles} 15 SP6에서 {productname} 프록시 구성 요소 업데이트
zh_cn: 过程：在 {sles} 15 SP6 上更新 {productname} 代理组件

source: Verify operating system and {productname} tools version.
ko: 운영 체제 및 {productname} 도구 버전을 확인합니다.
zh_cn: 校验操作系统和 {productname} 工具版本。

source: Operating System: [literal]``SUSE Linux Enterprise Server 15 SP6``
ko: 운영 체제: [literal]``SUSE Linux Enterprise Server 15 SP6``
zh_cn: 操作系统：[literal]``SUSE Linux Enterprise Server 15 SP6``

source: List running proxy containers.
ko: 실행 중인 프록시 컨테이너를 나열합니다.
zh_cn: 列出正在运行的代理容器。

source: Verify the following containers are running:
ko: 다음 컨테이너가 실행 중인지 확인합니다.
zh_cn: 校验以下容器是否正在运行：

source: Supporting infrastructure container(s)
ko: 지원되는 인프라 컨테이너
zh_cn: 支撑性基础架构容器

source: Synchronize the new proxy products in {productname} Server. For more information see xref:client-configuration:products.adoc[].
ko: {productname} 서버에서 새로운 프록시 제품을 동기화합니다. 자세한 내용은 xref:client-configuration:products.adoc[]에서 확인할 수 있습니다.
zh_cn: 在 {productname} 服务器中同步新代理产品。有关详细信息，请参见 xref:client-configuration:products.adoc[]。

source: Using the {webui}, synchronize the following:
ko: {webui}를 사용하여 다음을 동기화합니다.
zh_cn: 通过 {webui} 同步以下产品：
