Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: Using self-signed certificates provided by {productname}:
ko: {productname}에서 제공하는 자체 서명 인증서 사용:
zh_cn: 使用 {productname} 提供的自我签名证书：

source: With importing SSL certificates using third-party SSL certificate flags (the example can adjusted if not all these certificates are needed):
ko: 타사 SSL 인증서 플래그를 사용하여 SSL 인증서 임포트(필요한 인증서가 모두 포함되지 않은 경우 예제 조정 가능):
zh_cn: 使用第三方 SSL 证书标志导入相应 SSL 证书（如果无需全部证书，可调整示例）：

source: For more information, see [command]``mgradm install podman --help``.
ko: 자세한 내용은 [command]``mgradm install podman --help``에서 확인할 수 있습니다.
zh_cn: 有关详细信息，请执行命令 [command]``mgradm install podman --help`` 查看帮助文档。

source: The {webui} generates a configuration archive. This archive needs to be made available on the proxy container host.
ja: {webui}によって設定アーカイブが生成されます。このアーカイブをプロキシコンテナホストで利用できるようにする必要があります。
ko: {webui}는 구성 아카이브를 생성합니다. 이 아카이브는 프록시 컨테이너 호스트에서 사용할 수 있도록 설정해야 합니다.
zh_cn: {webui} 将生成配置归档。需要在代理容器主机上提供此归档。

source: Procedure: Copying the Proxy Configuration
ja: プロシージャ: プロキシ設定をコピーする
ko: 절차: 프록시 구성 복사
zh_cn: 过程：复制代理配置

source: If not already done, copy the configuration archive ([literal]``config.tar.gz``) generated in the previous step from the server container to the server host:
ja: まだ実行していない場合は、前のステップで生成された設定アーカイブ ([literal]``config.tar.gz``)をサーバコンテナからサーバホストにコピーします。
ko: 아직 완료하지 않은 경우 이전 단계에서 생성한 구성 아카이브([literal]``config.tar.gz``)를 서버 컨테이너에서 서버 호스트로 복사합니다.
zh_cn: 从服务器容器将上一步生成的配置归档 ([literal]``config.tar.gz``) 复制到服务器主机（如果还未执行此操作）：

source: If not already done, copy the files from the server host to the proxy host:
ja: まだ実行していない場合は、サーバホストからプロキシホストにファイルをコピーします。
zh_cn: 将服务器主机中的文件复制到代理主机（如果还未执行此操作）：

source: On the proxy host, install the Proxy with:
ja: プロキシホストで、次のコマンドを使用してプロキシをインストールします。
zh_cn: 在代理主机上使用以下命令安装代理：

source: Customized {productname} {productnumber} VM images are provided only for {sl-micro} {microversion}. To run the product on {sles} {bci-mlm}, use the standard {sles} {bci-mlm} installation media available at https://www.suse.com/download/sles/ and enable the {productname} {productnumber} extensions on top of it.
ko: 사용자 정의 {productname} {productnumber} VM 이미지는 {sl-micro} {microversion} 전용으로 제공됩니다. {sles} {bci-mlm}에서 제품을 실행하려면 https://www.suse.com/download/sles/[]에서 제공되는 표준 {sles} {bci-mlm} 설치 미디어를 사용하고, 여기에 {productname} {productnumber} 확장을 활성화하십시오.
zh_cn: 自定义的 {productname} {productnumber} VM 映像仅适用于 {sl-micro} {microversion}。要在 {sles} {bci-mlm} 上运行该产品，请使用从 https://www.suse.com/download/sles/ 获取的标准 {sles} {bci-mlm} 安装媒体，并在其上启用 {productname} {productnumber} 扩展。

source: xref:container-deployment/uyuni/server-deployment-uyuni.adoc[Server Deployment on {leapmicro}]
ja: xref:container-deployment/uyuni/server-deployment-uyuni.adoc[{leapmicro}へのサーバの配備]

source: xref:container-deployment/uyuni/proxy-deployment-uyuni.adoc[Proxy Deployment on {leapmicro}]
ja: xref:container-deployment/uyuni/proxy-deployment-uyuni.adoc[{leapmicro}へのプロキシの配備]

source: xref:container-deployment/suma/server-deployment-suma.adoc[{productname} Deployment]
ja: xref:container-deployment/suma/server-deployment-suma.adoc[{productname}の配備]

source: xref:container-deployment/suma/server-deployment-vm-suma.adoc[Server Deployment as Virtual Machine - KVM]
ja: xref:container-deployment/suma/server-deployment-vm-suma.adoc[仮想マシンとしてのサーバの配備 - KVM]

source: xref:container-deployment/suma/server-deployment-vmdk-suma.adoc[Server Deployment as Virtual Machine - VMware]
ja: xref:container-deployment/suma/server-deployment-vmdk-suma.adoc[仮想マシンとしてのサーバの配備 - VMware]

source: xref:container-deployment/suma/server-air-gapped-deployment-suma.adoc[Air-gapped Deployment]
ja: xref:container-deployment/suma/server-air-gapped-deployment-suma.adoc[Air-gapped配備]

source: xref:container-deployment/suma/proxy-deployment-suma.adoc[{productname} Proxy Deployment]
ja: xref:container-deployment/suma/proxy-deployment-suma.adoc[{productname}プロキシの配備]

source: xref:container-deployment/suma/proxy-deployment-vm-suma.adoc[Proxy Deployment as Virtual Machine - KVM]
ja: xref:container-deployment/suma/proxy-deployment-vm-suma.adoc[仮想マシンとしてのプロキシの配備 - KVM]

source: xref:container-deployment/suma/proxy-deployment-vmdk-suma.adoc[Proxy Deployment Virtual Machine - VMware]
ja: xref:container-deployment/suma/proxy-deployment-vmdk-suma.adoc[仮想マシンとしてのプロキシの配備 - VMware]

source: xref:container-deployment/suma/proxy-k3s-deployment-suma.adoc[Proxy Deployment on K3s]
ja: xref:container-deployment/suma/proxy-k3s-deployment-suma.adoc[K3sへのプロキシの配備]

source: xref:container-deployment/suma/proxy-air-gapped-deployment-suma.adoc[Air-gapped Deployment]
ja: xref:container-deployment/suma/proxy-air-gapped-deployment-suma.adoc[エアギャップ配備]

source: xref:container-deployment/suma/server-migration-suma.adoc[Server Migration]
ja: xref:container-deployment/suma/server-migration-suma.adoc[サーバの移行]

source: xref:container-deployment/suma/proxy-migration-suma.adoc[Proxy Migration]
ja: xref:container-deployment/suma/proxy-migration-suma.adoc[プロキシの移行]

source: Installing on {ibmz}
cs: Instalace na {ibmz}
ja: {ibmz}へのインストール

source: This section is intended for z/VM systems programmers responsible for operating the {ibmz} mainframes. It assumes that you are a z/VM systems programmer trained on {ibmz} operating protocols, and steps you through installing {productname} onto an existing mainframe system. This section does not cover the variety of hardware configuration profiles available on {ibmz}, but provides a foundational overview of the procedure and requirements necessary for a successful {productname} Server deployment on {ibmz}.
cs: Tato část je určena pro programátory systémů z/VM odpovědných za provozování sálových počítačů {ibmz}. Předpokládá, že jste programátorem systémů z/VM vyškoleným v operačních protokolech {ibmz}, a provede vás instalací produktu {productname} do existujícího systému sálového počítače. Tato část nepokrývá různé profily konfigurace hardwaru dostupné na serveru {ibmz}, ale poskytuje základní přehled postupu a požadavků nezbytných pro úspěšné nasazení serveru {productname} na serveru {ibmz}.
ja: このセクションの対象読者は、{ibmz}メインフレームを運用するz/VMシステムプログラマです。{ibmz}オペレーティングプロトコルのトレーニングを受けたz/VMシステムプログラマを想定して、既存のメインフレームシステムに{productname}をインストールする手順を説明します。このセクションは、{ibmz}で利用可能な多種類のハードウェア設定プロファイルを網羅していませんが、{ibmz}に{productname}サーバを正しく配備するために必要な手順および要件の基本的な概要を説明します。

source: This section describes how to install {susemgr} Server using {sle} installation media. You must have already registered your {susemgr} product with {scclongform}, and have obtained a registration code.
ja: このセクションでは、{sle}インストールメディアを使用して{susemgr}サーバをインストールする方法について説明します。 {scclongform}で{susemgr}製品を登録済みで、登録コードを取得している必要があります。

source: For information on registering with {scclongform}, retrieving your organization credentials from {scclongform}, or obtaining installation media, see xref:installation-and-upgrade:general-requirements.adoc[].
ja: {scclongform}を使用して登録し、{scclongform}から組織の資格情報を取得し、インストールメディアを取得する方法については、xref:installation-and-upgrade:general-requirements.adoc[]を参照してください。

source: System Requirements
cs: Požadavky na systém
ja: システム要件

source: Before you begin, check that your environment meets the base system requirements.
cs: Než začnete, zkontrolujte, zda vaše prostředí splňuje základní systémové požadavky.
ja: 開始する前に、お使いの環境がベースシステム要件を満たしていることを確認してください。

source: Compatible {ibmz} Systems:
cs: Systémy kompatibilní s {ibmz}:
ja: 互換性のある{ibmz}システム:

source: | Hardware | Recommended | CPU | Minimum 4 dedicated 64-bit CPU cores | RAM: | Test Server: Minimum 16{nbsp}GB RAM and 2{nbsp}GB Swap space | | Base Installation: Minimum 16{nbsp}GB | | Production Server: Minimum 32{nbsp}GB | Disk Space: | Root Partition: Minimum 100{nbsp}GB | | [path]``/var/lib/pgsql``: Minimum 50{nbsp}GB | | [path]``/var/spacewalk``: Minimum 50{nbsp}GB per SUSE product and 360{nbsp}GB per Red Hat product
ja: | ハードウェア | 推奨 | CPU | 専用64ビットCPUコア数は4つ以上 | RAM: | テストサーバ:RAMは16{nbsp}GB以上で、スワップ容量は2{nbsp}GB | | ベースインストール:16{nbsp}GB以上 | | 運用サーバ32{nbsp}GB以上 | ディスク容量: | ルートパーティション: 100{nbsp}GB以上 | | [path]``/var/lib/pgsql``: 50{nbsp}GB以上 | | [path]``/var/spacewalk``: 各SUSE製品では50{nbsp}GB以上、各Red Hat製品では360{nbsp}GB

source: Memory should be split across available RAM, VDISK, and swap to suit your environment. On a production system the ratio of physical memory to VDISK will need to be evaluated based on the number of clients you will be installing.
cs: Paměť by měla být rozdělena mezi dostupnou RAM, VDISK a swap, aby vyhovovaly vašemu prostředí. V produkčním systému bude třeba vyhodnotit poměr fyzické paměti k VDISK na základě počtu klientů, které budete instalovat.
ja: メモリは、お使いの環境に合わせて、使用可能なRAM、VDISK、およびスワップ間で分割する必要があります。 運用システムでは、インストールするクライアントの数に基づいてVDISK用の物理メモリの割合を評価する必要があります。

source: You will require an additional disk for database storage. This should be an [systemitem]``zFCP`` or [systemitem]``DASD`` device as these are preferred for use with [systemitem]``HYPERPAV``. The database storage disk should have:
cs: Pro úložiště databáze budete potřebovat další disk. Mělo by to být zařízení [systemitem]``zFCP`` nebo [systemitem]``DASD``, protože jsou preferovány pro použití se [systemitem]``HYPERPAV``. Disk úložiště databáze by měl mít:
ja: データベースストレージ用の追加ディスクが必要です。 [systemitem]``HYPERPAV``での使用が優先されるため、[systemitem]``zFCP``または[systemitem]``DASD``デバイスにすることをお勧めします。 データベースストレージディスクの要件を以下に示します。

source: At least 50{nbsp}GB for [path]``/var/lib/pgsql``
cs: Alespoň 50{nbsp}GB pro [path]``/var/lib/pgsql``
ja: [path]``/var/lib/pgsql``では50{nbsp}GB以上

source: At least 50{nbsp}GB for each SUSE product in [path]``/var/spacewalk``
cs: Alespoň 50{nbsp}GB pro každý produkt SUSE ve [path]``/var/spacewalk``
ja: 各SUSE製品で[path]``/var/spacewalk``に50{nbsp}GB以上

source: At least 360{nbsp}GB for each Red Hat product in [path]``/var/spacewalk``
cs: Alespoň 360{nbsp}GB pro každý produkt Red Hat ve [path]``/var/spacewalk``
ja: 各Red Hat製品で[path]``/var/spacewalk``に360{nbsp}GB以上

source: You will need to ensure you have sufficient disk storage for {productname} before running [command]``yast2 susemanager_setup``. By default, the {productname} file system, including the embedded database and patch directories, reside within the root directory. While adjustments are possible when installation is complete, it is important that you specify and monitor these adjustments closely. For information on storage management and reclaiming disk space, see the troubleshooting section in the {productname} Administration Guide.
cs: Před spuštěním [command]``yast2 susemanager_setup`` se musíte ujistit, že máte dostatek místa na disku pro {productname}. Ve výchozím nastavení je souborový systém {productname}, včetně vložené databáze a adresářů oprav, umístěn v kořenovém adresáři. I když je možno úpravit nastaverní po dokončení instalace, je důležité tato nastavení pečlivě specifikovat a sledovat. Informace o správě úložiště a uvolnění místa na disku najdete v části "řešení potíží" Příručky pro správu produktu {productname}.
ja: [command]``yast2 susemanager_setup``を実行する前に、{productname}のディスクストレージが十分であることを確認する必要があります。 デフォルトでは、組み込みデータベース、パッチディレクトリなどの{productname}ファイルシステムはルートディレクトリに配置します。 インストール完了時に調整することもできますが、その調整は綿密に指定して監視することが重要です。 ストレージ管理およびディスク容量の調整については、{productname}管理ガイドのトラブルシューティングセクションを参照してください。

source: If your {productname} runs out of disk space, this can have a severe impact on its database and file structure. A full recovery is only possible with a previous backup or a new {productname} installation. {suse} technical services will not be able to provide support for systems suffering from low disk space conditions.
cs: Dojde-li v produktu {productname} místo na disku, může to mít vážný dopad na strukturu jeho databáze a souborů. Úplné obnovení je možné pouze s předchozí zálohou nebo novou instalací produktu {productname}. Technické služby {suse} nebudou schopny poskytnout podporu systémům s nedostatkem místa na disku.
ja: {productname}のディスク容量が不足すると、データベースおよびファイル構造に深刻な影響が及ぶ可能性があります。 完全に復元するには、以前のバックアップを使用するか、新しい{productname}をインストールするしか方法がありません。 {suse}テクニカルサービスは、ディスク容量が少ないシステムにはサポートを提供できません。

source: Network Requirements:
cs: Požadavky sítě:
ja: ネットワーク要件:

source: OSA Express Ethernet (including Fast and Gigabit Ethernet)
cs: OSA Express Ethernet (včetně Fast a Gigabit Ethernet)
ja: OSA Express Ethernet (Fast EthernetおよびGigabit Ethernetを含む)

source: HiperSockets or Guest LAN
cs: HiperSockets nebo Guest LAN
ja: HiperSocketsまたはGuest LAN

source: These interfaces are still included but no longer supported:
cs: Tato rozhraní jsou stále obsažena, ale již nejsou podporována:
ja: 次のインタフェースはまだパッケージに含まれていますが、サポートは終了しています。

source: CTC or virtual CTC
cs: CTC nebo virtuální CTC
ja: CTCまたは仮想CTC

source: IP network interface for IUCV
cs: Síťové rozhraní IP pro IUCV
ja: IUCV用IPネットワークインタフェース

source: The z/VM guest you want to run {productname} from will require a static IP address and hostname before you begin, as these cannot easily be changed after initial installation. The hostname should contain less than eight characters and must not contain any upper case letters.
cs: Host z/VM, ze kterého chcete spustit {productname}, bude před zahájením vyžadovat statickou adresu IP a název hostitele, protože ty nelze po počáteční instalaci snadno změnit. Název hostitele by měl obsahovat méně než osm znaků a nesmí obsahovat žádná velká písmena.
ja: {productname}の実行元にするz/VMゲストは、初期インストール後に簡単には変更できないため、インストール開始前に静的IPアドレスおよびホスト名が必要です。 ホスト名は8文字未満にし、大文字を含めないでください。

source: Install {productname} on {ibmz}
cs: Nainstalujte si {productname} na {ibmz}
ja: {ibmz}への{productname}のインストール

source: This section covers the installation of {productname} as a product of the {sle} family. For general information about deploying a product on {ibmz} hardware, see {sles-base-os-documentation}/cha-zseries.html.
ja: このセクションでは、{sle}ファミリの製品として{productname}をインストールする方法について説明します。{ibmz}ハードウェアの製品配備の一般的な情報については、{sles-base-os-documentation}/cha-zseries.htmlを参照してください。

source: Procedure: Installing {susemgr} Server from a DVD Image
cs: Postup: Instalace serveru {susemgr} z obrazu DVD
ja: プロシージャ: DVDイメージから{susemgr}サーバにインストールする

source: Boot your system with the {unifiedinstaller}.
ja: {unifiedinstaller}を使用してシステムを起動します。

source: If booting fails you might need to adjust the boot order in the BIOS.
cs: Pokud se bootování nezdaří, budete možná muset upravit pořadí zavádění v systému BIOS.
ja: 起動に失敗した場合、BIOSで起動順序を調整する必要がある場合があります。

source: When prompted, select [guimenu]``Installation``.
cs: Po zobrazení výzvy vyberte [guimenu] ``Instalace``.
ja: プロンプトが表示されたら、［[guimenu]``インストール``］を選択します。

source: Then continue as described in xref:installation-and-upgrade:install-server-unified.adoc[].
ja: xref:installation-and-upgrade:install-server-unified.adoc[]の説明に従って続行します。

source: To finalize the {productname} installation see xref:installation-and-upgrade:server-setup.adoc[].
ja: {productname}のインストールを終了するには、xref:installation-and-upgrade:server-setup.adoc[]を参照してください。

source: Upgrade the Clients
cs: Povýšení klientů
ja: クライアントのアップグレード

source: Connect {payg} Instance
ja: {payg}インスタンスの接続

source: This document describes how to connect existing {payg} instance to {productname} server, and gives basic information about credentials collection from the instance. The goal of this connection is to extract authentication data so the {productname} Server can connect to a cloud RMT host. Then the {productname} Server has access to products on the RMT host that are not already available with the {scclongform} organization credentials.
ja: このドキュメントでは、既存の{payg}インスタンスを{productname}サーバに接続する方法について説明し、インスタンスからの資格情報の収集に関する基本的な情報を提供します。 この接続の目的は、認証データを抽出して、{productname}サーバがクラウドRMTホストに接続できるようにすることです。 これにより、{productname}サーバは{scclongform}組織資格情報ではまだ利用できないRMTホスト上の製品にアクセスできるようになります。

source: Before using the {payg} feature ensure:
ja: {payg}機能を使用する前に、以下のことを確認してください。

source: A basic {scclongform} account is required. Enter your valid {scclongform} credentials in menu:Admin[Setup Wizard > Organization Credentials]. This account is required for accessing the {productname} client tools for boostrapping regardless of {payg} instances.
ja: 基本的な{scclongform}アカウントが必要です。有効な{scclongform}資格情報をmenu:管理[セットアップウィザード > 組織の資格情報]に入力します。 このアカウントは、{payg}インスタンスに関係なく、ブーストラッピング用の{productname}クライアントツールにアクセスするために必要です。

source: If you bootstrap the {payg} instance to {productname}, {productname} will disable its {payg} repositories then add repositories from where it mirrored the data from the RMT server. The final result will be {payg} instances acquiring the same repositories from the RMT servers but through the {productname} server itself. Of course repositories can still be setup primarily from {scc}.
ja: {payg}インスタンスを{productname}にブートストラップする場合、{productname}はその{payg}リポジトリを無効にしてから、RMTサーバからのデータをミラーリングした場所からリポジトリを追加します。 最終的な結果は、{payg}インスタンスがRMTサーバから{productname}サーバ自体を介して同じリポジトリを取得することになります。 もちろん、リポジトリは主に{scc}から引き続きセットアップできます。

source: Connecting {payg} Instance
ja: {payg}インスタンスを接続する

source: Procedure: Connecting new {payg} Instance
ja: プロシージャ: 新しい{payg}インスタンスを接続する

source: Procedure: Adding SSH Bastion Connection Data
ja: プロシージャ: SSH要塞接続データを追加する

source: Procedure: Finishing {payg} Connecting
ja: プロシージャ: {payg}の接続を完了する

source: Available products are all versions of the same product family and architecture as the one installed in the {payg} instance. For example, if the instance has the {slsa}{nbsp}15 SP1 product installed, {slsa}{nbsp}15 SP2, {slsa}{nbsp}15 SP3, {slsa}{nbsp}15 SP4 and {slsa}{nbsp}15 SP5 are automatically shown in [guimenu]``Admin > Setup Wizard > Products``.
ja: 利用可能な製品は、{payg}インスタンスにインストールされているものと同じ製品ファミリおよびアーキテクチャのすべてのバージョンです。たとえば、インスタンスに{slsa}{nbsp}15 SP1製品がインストールされている場合、{slsa}{nbsp}15 SP2、{slsa}{nbsp}15 SP3、{slsa}{nbsp}15 SP4、および{slsa}{nbsp}15 SP5が［[guimenu]``管理 > セットアップウィザード > 製品``］に自動的に表示されます。

source: If a product is provided by both the {payg} instance and one of the {scclongform} subscriptions, it will appear only once in the products list.
ja: {payg}インスタンスと{scclongform}サブスクリプションの1つによって製品が提供されている場合、その製品は製品リストに1回のみ表示されます。

source: When the channels belonging to that product are synced, the data might still come from the {scc} subscription, and not from the Pay-As-You-Go instance.
ja: その製品に属するチャンネルが同期されている場合でも、データは{scc}サブスクリプションからのものであり、従量課金制インスタンスからのものではない可能性があります。

source: Deleting the Instance Connection Data
ja: インスタンス接続データを削除する

source: The following procedure describes how to delete SSH connection data of the instance.
ja: 以下の手順では、インスタンスのSSH接続データを削除する方法について説明します。

source: Procedure: Deleting Connection Data to Instance
ja: プロシージャ: インスタンスへの接続データを削除する

source: Open [guimenu]``Admin > Setup Wizard > {payg}``.
ja: ［[guimenu]``管理 > セットアップウィザード > {payg}``］を開きます。

source: Find the instance on the list of existing instances.
ja: 既存のインスタンスのリストでインスタンスを見つけます。

source: Click on the instance details.
ja: インスタンスの詳細をクリックします。

source: Select btn:[Delete] and confirm your selection.
ja: btn:[削除]を選択し、選択を確認します。

source: You are returned to the list of instances.
ja: インスタンスのリストに戻ります。

source: The one that was just deleted is no longer shown.
ja: 削除したインスタンスは表示されなくなります。

source: Instance Credential Collect Status
ja: インスタンス資格情報収集ステータス

source: The status of the {payg} instance credentials collect is shown in the column [literal]``Status`` or on the instance details page. When the instance is unreachable, the credential update process will fail and the credentials will become invalid after the second failed refresh. Synchronization of channels will fail when the credentials are invalid. To avoid this keep the connected instances running.
ja: {payg}インスタンスの資格情報収集のステータスは、［[literal]``ステータス``］列またはインスタンスの詳細ページに表示されます。インスタンスに到達できない場合、資格情報の更新プロセスは失敗し、2回目に更新が失敗すると資格情報は無効になります。資格情報が無効な場合、チャンネルの同期は失敗します。これを避けるには、接続されているインスタンスの実行状態を維持します。

source: Registering {payg} System as a Client
ja: {payg}システムをクライアントとして登録する

source: Navigate to menu:Systems[Activation Keys], and click btn:[Create key].
ja: menu:システム[アクティベーションキー]に移動し、btn:[キーの作成]をクリックします。

source: Create an activation key for the proxy host with {sle-micro} {microversion} as the parent channel. This key should include all recommended channels and the proxy as an extension child channel.
ja: {sle-micro} {microversion}を親チャンネルとして使用して、プロキシホストのアクティベーションキーを作成します。このキーには、推奨されるすべてのチャンネルと、拡張機能としてのプロキシの子チャンネルが含まれる必要があります。

source: Reboot the proxy host.
ja: プロキシホストを再起動します。

source: 2 GB represents the default proxy squid cache size. This will need to be adjusted for your environment.
ja: 2 GBはプロキシSquidのデフォルトのキャッシュサイズを表します。これは環境に合わせて調整する必要があります。

source: Procedure: Generating a Proxy Container Configuration using {webui}
ja: プロシージャ: {webui}を使用してプロキシコンテナ設定を生成する

source: In the [guimenu]``Max Squid cache size [MB]`` field type maximal allowed size for Squid cache. Recommended is to use at most 60% of available storage for the containers.
ja: ［[guimenu]``Squidの最大キャッシュサイズ[MB]``］フィールドタイプで、Squidキャッシュの最大許容サイズ。コンテナで使用可能なストレージの最大60%で使用することを推奨します。

source: Generate the Proxy Configuration with spacecmd and Self-Signed Certificate
ja: spacecmdと自己署名証明書を使用したプロキシ設定ファイルの生成

source: Generate the Proxy Configuration with spacecmd and Custom Certificate
ja: spacecmdとカスタム証明書を使用したプロキシ設定の生成

source: You can generate a Proxy configuration using [literal]``spacecmd`` for a custom certificates rather than the default self-signed certificates.
ja: デフォルトの自己署名証明書ではなくカスタム証明書に対して[literal]``spacecmd``を使用して、プロキシ設定を生成できます。

source: Register {sle-micro} and {productname} {productnumber} Proxy
ja: {sle-micro}および{productname} {productnumber}プロキシの登録

source: Procedure: Registering {sle-micro} and {productname} {productnumber} Proxy
ja: プロシージャ: {sle-micro}および{productname} {productnumber}プロキシを登録する

source: Register {sle-micro} with SCC.
ja: SCCで{sle-micro}を登録します。

source: At the moment, air-gapped deployment is available only on {sle-micro}.
ja: 現時点では、Air-gappd配備は{sle-micro}でのみ利用可能です。

source: For more information about installing {productname} Proxy Virtual Machine, see xref:container-deployment/suma/proxy-deployment-vm-suma.adoc[Deploy Proxy as a Virtual Machine].
ja: {productname}プロキシ仮想マシンのインストールの詳細については、xref:container-deployment/suma/proxy-deployment-vm-suma.adoc[仮想マシンとしてのプロキシの配備]を参照してください。

source: Deploy {productname} on SLE Micro
ja: SLE Microに{productname}を配備する

source: Procedure: Install {productname} on SLE Micro in Air-gapped
ja: プロシージャ: Air-gappedでSLE Microに{productname}をインストールする

source: Install SLE Micro.
ja: SLE Microをインストールします。

source: For more detailed information about installing {productname} Proxy on SLE Micro, see xref:container-deployment/suma/proxy-deployment-suma.adoc[Deploy Proxy as a Virtual Machine].
ja: SLE Microに{productname}プロキシをインストールする方法の詳細については、xref:container-deployment/suma/proxy-deployment-suma.adoc[仮想マシンとしてのプロキシの配備]を参照してください。

source: This guide outlines the deployment process for the {productname} {productnumber} Proxy. This guide presumes you have already successfully deployed a {productname} {productnumber} Server.
ja: このガイドでは、{productname} {productnumber}プロキシの配備プロセスの概要を説明します。このガイドでは、{productname} {productnumber}サーバが既に正常に配備済みであることを想定しています。

source: {sle-micro} is only supported as regular minion ([systemitem]``default`` contact method) for the time being. We are working on managing it as Salt SSH client ([systemitem]``salt-ssh`` contact method), too.
ja: 現時点では、{sle-micro}は正規のminionとして([systemitem]``デフォルト``接続メソッド)のみサポートされています。Salt SSHクライアント([systemitem]``salt-ssh``接続メソッド)としても管理できるように目指しています。

source: Synchronize the {sle-micro} {microversion} parent channel and the proxy extension child channel on the server.
ja: {sle-micro} {microversion}の親チャンネルとサーバ上のプロキシ拡張機能の子チャンネルを同期します。

source: Install {sle-micro} {microversion} on a bare-metal machine.
ja: ベアメタルマシンに{sle-micro} {microversion}をインストールします。

source: During the installation, register {sle-micro} {microversion} along with the {productname} Proxy extension.
ja: インストール時に、{sle-micro} {microversion}を{productname}プロキシ拡張機能とともに登録します。
