Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: Update installed software with [command]``zypper``:
ko: [command]``zypper``로 설치된 소프트웨어 업데이트:
zh_cn: 使用 [command]``zypper`` 更新安装的软件：

source: The {productname} Proxy containers running on [literal]``podman`` can be updated using the following command:
ko: 다음 명령을 사용하여 [literal]``podman``에서 실행 중인 {productnumber} 프록시 컨테이너를 업데이트할 수 있습니다.
zh_cn: 可使用以下命令来更新 [literal]``podman`` 上运行的 {productname} 代理容器：

source: Or, those running on a Kubernetes cluster can update using:
ja: または、Kubernetesクラスタ上で実行されるプロキシコンテナは、次のコマンドを使用して更新できます。
zh_cn: 或者，可使用以下命令更新 Kubernetes 群集上运行的容器：

source: On podman, clean up the unused container images to free disk space:
ko: podman에서, 사용하지 않는 컨테이너 이미지를 정리하여 디스크 공간을 확보합니다.
zh_cn: 在 Podman 上，清理未使用的容器映像以释放磁盘空间：

source: On Kubernetes the image cleanup is handled automatically, or it depends on the Kubernetes distribution.
ko: Kubernetes에서는 이미지 정리가 자동으로 처리되거나 Kubernetes 배포판에 따라 다릅니다.
zh_cn: 在 Kubernetes 中，映像清理工作要么自动完成，要么由所用的 Kubernetes 发行版决定具体执行方式。

source: If you do not specify the tag parameter when upgrading to specific version, it will default to upgrading to the most recent version. To upgrade to a specific version, provide the tag parameter with the desired image tag.
ja: 特定のバージョンにアップグレードする際にタグパラメータを指定しない場合、デフォルトで最新バージョンにアップグレードされます。特定のバージョンにアップグレードするには、タグパラメータと目的のイメージタグを指定します。
zh_cn: 如果升级到特定版本时未指定标记参数，则默认会升级到最新版本。要升级到特定版本，请为标记参数提供所需的映像标记。

source: While there is an option to upgrade a specific container using its specific tag, this feature is intended for applying PTFs only.
ko: 특정 태그를 사용하여 특정 컨테이너를 업그레이드하는 옵션이 있지만, 이 기능은 PTF를 적용하는 경우에만 사용할 수 있습니다.
zh_cn: 虽然可以使用特定标记升级特定容器，但此功能仅用于应用 PTF。

source: We highly recommend using the same tag for all proxy containers to ensure consistency under normal circumstances.
ko: 일반적인 상황에서는 일관성을 유지하기 위해 모든 프록시 컨테이너에 동일한 태그를 사용하는 것이 좋습니다.
zh_cn: 在正常情况下，我们强烈建议为所有代理容器使用相同的标记，以确保配置一致性。

source: For air-gapped installations, first upgrade the container RPM packages, then run the [command]``mgrpxy upgrade podman`` command.
ja: Air-gappedインストールでは、まずコンテナのRPMパッケージをアップグレードし、その後[command]``mgrpxy upgrade podman``コマンドを実行します。
zh_cn: 对于隔离的安装，请先升级容器 RPM 软件包，然后运行 [command]``mgrpxy upgrade podman`` 命令。

source: {productname} Server Upgrade
ko: {productname} 서버 업그레이드
zh_cn: {productname} 服务器升级

source: Before running the upgrade command, it is required to update the host operating system. Updating the host operating system will also result in the update of the {productname} tooling such as the [literal]``mgradm`` tool.
ko: 업그레이드 명령을 실행하기 전에 호스트 운영 체제를 업데이트해야 합니다. 호스트 운영 체제를 업데이트하면 [literal]``mgradm`` 도구와 같은 {productname} 도구도 함께 업데이트됩니다.
zh_cn: 运行升级命令前，需要更新主机操作系统。更新主机操作系统时，{productname} 相关工具（如 [literal]``mgradm``）也会同步更新。

source: Procedure: Upgrading Server
ja: プロシージャ: サーバのアップグレード
ko: 절차: 서버 업그레이드
zh_cn: 过程：升级服务器

source: The {productname} Server container can be updated using the following command:
ja: {productname}サーバコンテナは、次のコマンドを使用して更新できます。
zh_cn: 可使用以下命令更新 {productname} 服务器容器：

source: This command will bring the status of the container up-to-date and restart the server.
ja: このコマンドは、コンテナのステータスを最新に更新してサーバを再起動します。
ko: 이 명령은 컨테이너의 상태를 최신 상태로 가져오고 서버를 다시 시작합니다.
zh_cn: 此命令可使容器保持最新状态并重启服务器。

source: Clean up the unused container images to free disk space:
ko: 사용하지 않는 컨테이너 이미지를 정리하여 디스크 공간을 확보합니다.
zh_cn: 清理未使用的容器映像以释放磁盘空间：

source: Upgrading with third-party SSL certificate
ko: 타사 SSL 인증서로 업그레이드
zh_cn: 使用第三方 SSL 证书升级

source: If you are using third-party certificates, the database container needs to have an SSL certificate with the following Subject Alternate Names (SANs):
ko: 타사 인증서를 사용하는 경우, 데이터베이스 컨테이너에는 다음의 SAN(Subject Alternate Names)이 포함된 SSL 인증서가 필요합니다.
zh_cn: 如果您使用第三方证书，数据库容器需配备包含以下主体备用名称 (SAN) 的 SSL 证书：

source: the externally facing fully qualified domain name
ko: 외부에 노출되는 정규화된 도메인 이름
zh_cn: 对外提供服务的完全限定域名

source: The same certificate can be used for both the main container and the database one, but it needs to have those SANs too.
ko: 기본 컨테이너와 데이터베이스 컨테이너 모두에 동일한 인증서를 사용할 수 있지만 해당 SAN도 있어야 합니다.
zh_cn: 同一证书可同时用于主容器与数据库容器，但需包含上述 SAN。

source: Upgrading to specific version
ja: 特定のバージョンへのアップグレード
ko: 특정 버전으로 업그레이드
zh_cn: 升级到特定版本

source: If you do not specify the tag parameter, it will default to upgrading to the most recent version. To upgrade to a specific version, provide the tag parameter with the desired image tag.
zh_cn: 如果未指定标记参数，则默认会升级到最新版本。要升级到特定版本，请为标记参数提供所需的映像标记。

source: For more information on the upgrade command and its parameters, use the following command:
ja: upgradeコマンドとそのパラメータの詳細については、次のコマンドを使用します。
ko: 업그레이드 명령과 해당 파라미터에 대한 자세한 내용은 다음 명령을 참조하십시오.
zh_cn: 要查看 upgrade 命令及其参数的详细信息，请使用以下命令：

source: For air-gapped installations, first upgrade the container RPM packages, then run the [literal]``mgradm`` command.
ja: Air-gappedインストールでは、まずコンテナのRPMパッケージをアップグレードし、その後[literal]``mgradm``コマンドを実行します。
ko: air-gapped 설치의 경우, 먼저 컨테이너 RPM 패키지를 업그레이드한 후 [literal]``mgradm`` 명령을 실행합니다.
zh_cn: 对于隔离的安装，请先升级容器 RPM 软件包，然后运行 [literal]``mgradm`` 命令。

source: General Requirements
cs: Obecné požadavky
ja: 一般的な要件
ko: 일반 요구사항
zh_cn: 一般要求

source: Before you begin installation, ensure that you have:
cs: Před zahájením instalace se ujistěte, že máte:
ja: インストールを始める前に、次の項目を確認してください。
ko: 설치를 시작하기 전, 다음이 준비되었는지 확인해야 합니다.
zh_cn: 在开始安装之前，请确保：

source: A {scclongform} account. This account gives you access to organization credentials and registration keys for {productname} Server, Proxy and Retail Branch Server.
ja: {scclongform}アカウント。このアカウントにより、組織の資格情報と、{productname}サーバ、プロキシ、およびRetail Branch Serverの登録キーにアクセスできます。
ko: {scclongform} 계정. 이 계정을 통해 {productname} 서버, 프록시, 소매 지점 서버에 대한 조직 자격 증명 및 등록 키에 액세스할 수 있습니다.
zh_cn: {scclongform} 帐户。您可以使用此帐户访问 {productname} 服务器、代理和零售分支服务器的组织身份凭证和注册密钥。

source: Supported Browsers for {productname} {webui}.
ja: {productname} {webui}でサポートされるブラウザ。
ko: {susemgr} {webui}에서 지원되는 브라우저입니다.
zh_cn: {productname} {webui} 支持的浏览器。

source: SSL certificates for your environment. By default {productname} {productnumber} uses a self-signed certificate.
ja: 環境のSSL証明書。デフォルトでは、{productname} {productnumber}は自己署名証明書を使用します。
ko: 사용자 환경의 SSL 인증서. 기본적으로 {productname} {productnumber}은(는) 자체 서명된 인증서를 사용합니다.
zh_cn: 环境的 SSL 证书。默认情况下，{productname} {productnumber} 使用自我签名证书。

source: The {sl-micro} {microversion} entitlement is included within the {productname} entitlement, so it does not require a separate registration key.
ko: {sl-micro} {microversion} 권한은 {productname} 권한 내에 포함되어 있으므로 별도의 등록 키가 필요하지 않습니다.
zh_cn: {sl-micro} {microversion} 权利包含在 {productname} 权利中，因此不需要单独的注册密钥。

source: The following section contains more information on these requirements.
ja: 次のセクションでは、これらの要件について詳しく説明します。
ko: 다음 섹션은 이러한 요구사항에 대한 자세한 정보를 제공합니다.
zh_cn: 以下小节包含有关这些要求的详细信息。

source: {scclongform} Account and Credentials
ja: {scclongform}アカウントと資格情報
zh_cn: {scclongform} 帐户和身份凭证

source: Create an account with {scclongform} prior to deployment of {productname} {productnumber}.
ja: {productname} {productnumber}を配備する前に、{scclongform}でアカウントを作成します。
ko: {productname} {productnumber}을(를) 배포하기 전에 {scclongform}를 사용하여 계정을 생성합니다.
zh_cn: 在部署 {productname} {productnumber} 之前，在 {scclongform} 中创建一个帐户。

source: Procedure: Obtain Your Organization Credentials
ja: プロシージャ: 組織の資格情報を取得する
ko: 절차: 조직 자격 증명 가져오기
zh_cn: 过程：获取组织身份凭证

source: Navigate to https://scc.suse.com/login in your web browser.
ja: Webブラウザで https://scc.suse.com/login[]にアクセスします。
ko: 웹 브라우저에서 link:https://scc.suse.com/login[]으로 이동합니다.
zh_cn: 在网页浏览器中导航到 link:https://scc.suse.com/login[]。

source: Log in to your {scc} account, or follow the prompts to create a new account.
ja: {scc}アカウントにログインするか、またはプロンプトに従い新しいアカウントを作成します。
zh_cn: 登录到您的 {scc} 帐户，或按照提示创建一个新帐户。

source: If you have not yet done so, click btn:[Connect to an Organization] and type or search for your organization.
cs: Pokud jste tak dosud neučinili, klikněte na btn:[Connect to an Organization] (Připojit k organizaci) a zadejte nebo vyhledejte svou organizaci.
ja: まだ組織に接続していない場合、btn:[組織に接続する]をクリックし、組織を入力または検索します。
ko: 아직 수행하지 않은 경우, btn:[조직에 연결]을 클릭한 후 조직을 입력하거나 검색합니다.
zh_cn: 如果您尚未这样做，请单击 btn:[连接到组织] 并键入或搜索您的组织。

source: Click btn:[Manage my Organizations] and select your organization from the list by clicking the organization name.
ja: btn:[組織を管理する]をクリックし、組織名をクリックして一覧から組織を選択します。
ko: btn:[내 조직 관리]를 클릭하고 목록에서 조직 이름을 클릭하여 조직을 선택합니다.
zh_cn: 单击 btn:[管理我的组织]，然后在列表中单击您的组织名称以将其选中。

source: Click the btn:[Users] tab, and then select the btn:[Organization Credentials] sub-tab.
ja: btn:[ユーザ]タブをクリックし、btn:[組織の資格情報]サブタブを選択します。
ko: btn:[사용자] 탭을 클릭한 후 btn:[조직 자격 증명] 하위 탭을 선택합니다.
zh_cn: 单击 btn:[用户] 选项卡，然后选择 btn:[组织身份凭证] 子选项卡。

source: Record your login information for use during {productname} setup.
cs: Zaznamenejte si své přihlašovací údaje pro použití během instalace produktu {productname}.
ja: {productname}の設定中に使用するログイン情報をメモします。
ko: {productname} 설정 중에 사용할 로그인 정보를 기록합니다.
zh_cn: 记下您的登录信息，以便在设置 {productname} 期间使用。

source: Depending on your organization's setup, you might also need to activate your subscription, using the btn:[Activate Subscriptions] menu from the left navigation bar.
ja: 組織の設定によっては、左側のナビゲーションバーからbtn:[サブスクリプションをアクティブ化する]メニューを使用してサブスクリプションをアクティブ化する必要が生じる場合もあります。
ko: 조직의 설정에 따라 왼쪽 탐색 모음에서 btn:[구독 활성화] 메뉴를 사용하여 구독을 활성화해야 할 수도 있습니다.
zh_cn: 根据组织的设置，还可能需要使用左侧导航栏中的 btn:[激活订阅] 菜单激活您的订阅。

source: For more information about using {scc}, see https://scc.suse.com/docs/help.
ja: {scc}の使用の詳細については、link:https://scc.suse.com/docs/help[]を参照してください。
zh_cn: 有关使用 {scc} 的详细信息，请参见 https://scc.suse.com/docs/help[]。

source: Supported Browsers for {productname} {webui}
ja: {productname} {webui}でサポートされているブラウザ
ko: {productname} {webui}에서 지원되는 브라우저
zh_cn: {productname} {webui} 支持的浏览器

source: To use the {webui} to manage your {productname} environment, you must run an up to date web browser.
ja: {webui}を使用して{productname}環境を管理するには、最新のWebブラウザを実行する必要があります。
ko: {webui}를 사용하여 {productname} 환경을 관리하려면 최신 웹 브라우저를 실행해야 합니다.
zh_cn: 要使用 {webui} 管理您的 {productname} 环境，必须运行最新的 Web 浏览器。

source: {productname} is supported on:
ja: {productname}は以下のブラウザでサポートされています。
ko: {productname} 지원 제품:
zh_cn: 以下浏览器支持 {productname}：

source: Latest Firefox browser shipped with {sles}
cs: Nejnovější prohlížeč Firefox dodávaný se {sles}
ja: {sles}に付属する最新のFirefoxブラウザ
ko: {sles}와 함께 제공되는 최신 Firefox 브라우저
zh_cn: {sles} 随附的最新 Firefox 浏览器

source: Latest Chrome browser on all operating systems
cs: Nejnovější prohlížeč Chrome ve všech operačních systémech
ja: あらゆるオペレーティングシステム上の最新のChromeブラウザ
ko: 모든 운영 체제의 최신 Chrome 브라우저
zh_cn: 所有操作系统上的最新 Chrome 浏览器

source: Latest Edge browser shipped with Windows
cs: Nejnovější prohlížeč Edge dodávaný s Windows
ja: Windowsに付属する最新のEdgeブラウザ
ko: Windows와 함께 제공되는 최신 Edge 브라우저
zh_cn: Windows 随附的最新 Edge 浏览器

source: Windows Internet Explorer is not supported. The {productname} {webui} will not render correctly under Windows Internet Explorer.
cs: Windows Internet Explorer není podporován. {productname} {webui} se nebude v prohlížeči Windows Internet Explorer správně vykreslovat.
ja: Windows Internet Explorerはサポートされていません。{productname}の{webui}はWindows Internet Explorerでは正しくレンダリングされません。
ko: Windows Internet Explorer는 지원되지 않습니다. {productname} {webui}는 Windows Internet Explorer에서 올바르게 렌더링되지 않습니다.
zh_cn: 不支持 Windows Internet Explorer。在 Windows Internet Explorer 中无法正常呈现 {productname} {webui}。

source: SSL Certificates
cs: SSL certifikáty
ja: SSL証明書
ko: SSL 인증서
zh_cn: SSL 证书

source: {productname} uses SSL certificates to ensure that clients are registered to the correct server. By default, {productname} uses a self-signed certificate. If you have certificates signed by a third-party CA, you can import them to your {productname} installation.
cs: {productname} používá certifikáty SSL, aby byli klienti registrováni na správném serveru. Ve výchozím nastavení používá {productname} certifikát podepsaný sám sebou. Pokud máte certifikáty podepsané certifikační autoritou třetí strany, můžete je importovat do své instalace produktu {productname}.
ja: {productname}は、SSL証明書を使用して、クライアントが正しいサーバに登録されていることを確認します。デフォルトでは、{productname}は自己署名証明書を使用します。サードパーティCAによって署名された証明書がある場合、それを{productname}インストール環境にインポートできます。
ko: {productname}에서는 SSL 인증서를 사용하여 클라이언트가 올바른 서버에 등록되었는지 확인합니다. 기본적으로 {productname}에서는 자체 서명 인증서가 사용됩니다. 타사 CA가 서명한 인증서인 경우 {productname} 설치로 인증서를 임포트할 수 있습니다.
zh_cn: {productname} 使用 SSL 证书来确保客户端注册到正确的服务器。{productname} 默认使用自我签名证书。如果您的证书已由第三方 CA 签名，可将其导入 {productname} 安装。

source: For more on self-signed certificates, see xref:administration:ssl-certs-selfsigned.adoc[].
cs: Další informace o certifikátech podepsaných samy sebou najdete v dokumentu xref:administration:ssl-certs-selfsigned.adoc[].
ja: 自己署名証明書の詳細については、xref:administration:ssl-certs-selfsigned.adoc[]を参照してください。
ko: 자체 서명 인증서에 대한 자세한 내용은 xref:administration:ssl-certs-selfsigned.adoc[]를 참조하십시오.
zh_cn: 有关自我签名证书的详细信息，请参见 xref:administration:ssl-certs-selfsigned.adoc[]。

source: For more on imported certificates, see xref:administration:ssl-certs-imported.adoc[].
cs: Další informace o importovaných certifikátech najdete na stránce xref:administration:ssl-certs-imported.adoc[].
ja: インポートした証明書の詳細については、xref:administration:ssl-certs-imported.adoc[]を参照してください。
ko: 임포트한 인증서에 대한 자세한 내용은 xref:administration:ssl-certs-imported.adoc[]에서 참조하십시오.
zh_cn: 有关导入的证书的详细信息，请参见 xref:administration:ssl-certs-imported.adoc[]。

source: Hardware Requirements
cs: Požadavky na hardware
ja: ハードウェア要件
ko: 하드웨어 요구사항
zh_cn: 硬件要求

source: This table outlines hardware and software requirements for the {productname} Server and Proxy, on {x86_64}, {arm}, {ppc64le} and {s390x} architecture.
ja: 以下の表は、{x86_64}、{arm}、 {ppc64le}、および{s390x}アーキテクチャの{productname}サーバおよびプロキシのハードウェアとソフトウェアの要件を説明しています。
zh_cn: 下表概述了 {x86_64}、{arm}、{ppc64le} 和 {s390x} 体系结构上的 {productname} 服务器与代理的硬件和软件要求。

source: {productname} installations based on {ppc64le} or {s390x} architecture cannot use secure boot for network booting clients. This limitation exists because the shim bootloader is not available for both these architectures.
ja: {ppc64le}または{s390x}アーキテクチャに基づく{productname}のインストールでは、ネットワークブートクライアントにセキュアブートを使用できません。この制限は、これらのアーキテクチャの両方でshimブートローダが利用できないために存在します。
zh_cn: 基于 {ppc64le} 或 {s390x} 体系结构的 {productname} 安装无法使用安全引导来引导网络客户端。存在此限制是因为 shim 引导加载程序不适用于这两种体系结构。

source: For {productname} {smr} hardware requirements, see xref:retail:retail-requirements.adoc[].
cs: Hardwarové požadavky pro {productname} {smr} viz xref:retail:retail-requirements.adoc[].
ja: {productname} {smr}ハードウェアの要件については、xref:retail:retail-requirements.adoc[]を参照してください。
ko: {productname} {smr} 하드웨어 요구사항은 xref:retail:retail-requirements.adoc[]을 참조하십시오.
zh_cn: 有关 {productname} {smr} 硬件要求，请参见 xref:retail:retail-requirements.adoc[]。

source: Server Requirements
ja: サーバ要件
ko: 서버 요구사항
zh_cn: 服务器要求

source: One of {sl-micro} {microversion} or {sles} {bci-mlm} is the operating system of the container host.
ko: {sl-micro} {microversion} 또는 {sles} {bci-mlm} 중 하나는 컨테이너 호스트의 운영 체제입니다.
zh_cn: 容器主机的操作系统为 {sl-micro} {microversion} 或 {sles} {bci-mlm}。

source: In the following, {sles} as the installed host operating system is explicitly mentioned only if it matters. Otherwise we either write {sl-micro} or just host operating system.
ko: 다음에서 설치된 호스트 운영 체제인 {sles}는 관련이 있을 경우에만 명시적으로 언급합니다. 그렇지 않은 경우 {sl-micro} 또는 단순히 호스트 운영 체제로 표기합니다.
zh_cn: 在下文中，仅当 {sles} 作为已安装的主机操作系统会产生影响时，才会明确提及该系统；否则，我们将使用 {sl-micro} 或直接统称“主机操作系统”。

source: The container host with {sl-micro} as operating system requires as free disk space:
ko: 운영 체제로 {sl-micro}를 사용하는 컨테이너 호스트에는 디스크 여유 공간이 필요합니다.
zh_cn: 操作系统为 {sl-micro} 的容器主机的可用磁盘空间要求如下：

source: Minimum for base installation 100 GB
ja: ベースインストール用に100GB以上
ko: 기본 설치 시 최소 100GB
zh_cn: 至少 100 GB 用于基础安装

source: Plus a minimum of 130 GB for repository data
ja: およびリポジトリデータ用に130GB以上
ko: 리포지토리 데이터용 공간 최소 130GB
zh_cn: 再加上至少 130 GB 用于储存库数据

source: Depending on the amount of selected software, {sles} as operating system can require considerably more disk space.
ja: 選択したソフトウェアの量によって、オペレーティングシステムとして{sles}には、かなり多くのディスク容量が必要な場合があります。
zh_cn: 使用 {sles} 操作系统时，所需的磁盘空间可能要多很多，具体取决于所选软件的数量。

source: By default the {productname} Server container stores mirrored repository (packages or products), database, and other data in subdirectories of the [path]``/var/lib/containers/storage/volumes/`` directory. Repository synchronization fails if this directory runs out of disk space. Estimate how much space the [path]``/var/lib/containers/storage/volumes/`` directory requires based on the number and kind of clients and repositories you plan to mirror.
ja: デフォルトでは、{productname}サーバコンテナは、ミラーリングされたリポジトリ(パッケージまたは製品)、データベース、およびその他のデータを [path]``/var/lib/containers/storage/volumes/``ディレクトリのサブディレクトリに保存します。このディレクトリのディスク容量がなくなるとリポジトリの同期に失敗します。ミラーリングする予定のクライアントおよびリポジトリの数と種類に基づいて、[path]``/var/lib/containers/storage/volumes/``ディレクトリが必要とする容量を推測します。
zh_cn: 默认情况下，{productname} 服务器容器会将镜像储存库（软件包或产品）、数据库和其他数据存储在 [path]``/var/lib/containers/storage/volumes/`` 目录的子目录中。如果此目录耗尽了磁盘空间，储存库同步将会失败。请根据您要镜像的客户端和储存库的数量和类型来估算 [path]``/var/lib/containers/storage/volumes/`` 目录所需的空间。

source: For more information about filesystem and partitioning details, see xref:installation-and-upgrade:hardware-requirements.adoc#install-hardware-requirements-storage[] and the detailed installation instructions in the Installation and Deployment sections of this guide.
ja: ファイルシステムとパーティションの詳細については、xref:installation-and-upgrade:hardware-requirements.adoc#install-hardware-requirements-storage[]およびこのガイドのインストールと配備のセクションにある詳細なインストール手順を参照してください。
ko: 파일 시스템 및 파티셔닝 세부 정보에 대한 자세한 내용은 xref:installation-and-upgrade:hardware-requirements.adoc#install-hardware-requirements-storage[] 및 이 가이드의 설치 및 배포 섹션에 있는 세부 설치 지침을 참조하십시오.
zh_cn: 有关文件系统和分区细节的详细信息，请参见 xref:installation-and-upgrade:hardware-requirements.adoc#install-hardware-requirements-storage[] 和本指南的安装和部署相关章节中的详细安装说明。

source: Server Hardware Requirements
cs: Požadavky na hardware serveru
ja: サーバハードウェアの要件
ko: 서버 하드웨어 요구사항
zh_cn: 服务器硬件要求

source: | Hardware | Details | Recommendation | CPU | {x86_64}, {arm}, {ppc64le} or {s390x} | Minimum 4 dedicated 64-bit CPU cores | RAM | Minimum | 16 GB | | Recommended | 32 GB | Disk Space | [path]``/`` (root directory) | 40 GB | | [path]``/var/lib/containers/storage/volumes`` | Minimum 150 GB (depending on the number of products) | | [path]``/var/lib/containers/storage/volumes/var-pgsql`` | Minimum 50 GB | Swap space | Systems can benefit from additional swap space. {suse} recommends using a swap file instead of a swap partition. For more information about swap space, see xref:installation-and-upgrade:hardware-requirements.adoc#installation-swap-space[]. | 8 to 12 GB
ko: | 하드웨어 | 세부 정보 | 권장 | CPU | {x86_64}, {arm}, {ppc64le} 또는 {s390x} | 최소 4개의 전용 64비트 CPU 코어 | RAM | 최소 | 16GB | | 권장 | 32GB | 디스크 공간 | [path]``/`` (루트 디렉토리) | 40GB | | [path]``/var/lib/containers/storage/volumes`` | 최소 150GB(제품 수에 따라 다름) | | [path]``/var/lib/containers/storage/volumes/var-pgsql`` | 최소 50GB | 스왑 공간 | 시스템은 추가 스왑 공간의 이점을 누릴 수 있습니다. {suse}는 스왑 파티션 대신 스왑 파일을 사용할 것을 권장합니다. 스왑 공간에 대한 자세한 내용은 see xref:installation-and-upgrade:hardware-requirements.adoc#installation-swap-space[]에서 확인할 수 있습니다. | 8~12GB
zh_cn: | 硬件 | 详细信息 | 建议 | CPU | {x86_64}、{arm}、{ppc64le} 或 {s390x} | 至少 4 个专用 64 位 CPU 核心 | RAM | 至少 | 16 GB | | 建议 | 32 GB | 磁盘空间 | [path]``/``（根目录） | 40 GB | | [path]``/var/lib/containers/storage/volumes`` | 至少 150 GB（取决于产品数量） | | [path]``/var/lib/containers/storage/volumes/var-pgsql`` | 至少 50 GB | 交换空间 | 额外配置交换空间有助于提升系统性能。{suse} 建议使用交换文件而非交换分区。有关交换空间的详细信息，请参见 xref:installation-and-upgrade:hardware-requirements.adoc#installation-swap-space[]。 | 8 到 12 GB

source: The images by default have a 40 GB [literal]``/`` partition. The cloud image of {sl-micro} {microversion} has just a 5 GB [literal]``/`` partition. Both work flawlessly with {productname}. As long as external storage is mounted to [path]``/var/lib/containers/storage/volumes``, {productname} does not need or use storage on the [literal]``/`` partition, but leaves that to the management of the container host itself.
ko: 기본적으로 이미지에는 40GB [literal]``/`` 파티션이 있습니다. {sl-micro} {microversion}의 클라우드 이미지에는 5GB [literal]``/`` 파티션만 있습니다. 두 파티션 모두 {productname}에서 완벽하게 작동합니다. 외부 스토리지가 [path]``/var/lib/containers/storage/volumes``에 마운트된 경우 {productname}은(는) [literal]``/`` 파티션에서 스토리지를 필요로 하거나 사용하지 않으며, 컨테이너 호스트가 직접 관리하도록 합니다.
zh_cn: 默认情况下，映像有一个 40 GB 的 [literal]``/`` 分区。{sl-micro} {microversion} 的云映像只有一个 5 GB 的 [literal]``/`` 分区。两者均与 {productname} 完美兼容。只要将外部存储设备挂载到 [path]``/var/lib/containers/storage/volumes``，{productname} 便无需或不会使用 [literal]``/`` 分区的存储资源，而是交由容器主机自行管理该部分存储空间。

source: {productname} performance depends on hardware resources, network bandwidth, latency between clients and server, etc.
ja: {productname}のパフォーマンスは、ハードウェアリソース、ネットワーク帯域幅、クライアントとサーバ間の遅延などによって異なります。
ko: {productname} 성능은 하드웨어 리소스, 네트워크 대역폭, 클라이언트와 서버 간 대기 시간 등에 따라 달라집니다.
zh_cn: {productname} 性能取决于硬件资源、网络带宽、客户端与服务器之间的延迟，等等。

source: Based on the experience and different deployments that are in use, the advice for optimal performance of {productname} Server with an adequate number of proxies is to not exceed 10,000 clients per single server. It is highly recommended to move to the Hub setup and involve consultancy when you have more than 10,000 clients. Even with fine-tuning and an adequate number of proxies, such a large number of clients can lead to performance issues.
ja: 経験および使用されているさまざまな配備に基づいて、適切な数のプロキシを備えた{productname}サーバの最適なパフォーマンスを得るためには、単一サーバあたり10,000クライアントを超えないようにすることをお勧めします。 クライアント数が10,000を超える場合は、ハブのセットアップに移行し、コンサルティングを利用することを強くお勧めします。 微調整と適切な数のプロキシを使用しても、このような多数のクライアントによって、パフォーマンスの問題が生じる可能性があります。
ko: 사용 중인 환경과 다양한 배포에 따라 적절한 수의 프록시가 배치된 {productname} 서버의 최적 성능을 달성하려면 단일 서버당 10,000개의 클라이언트를 초과하지 않는 것이 좋습니다. 클라이언트가 10,000개를 초과하는 경우 허브 설정으로 이동하여 컨설팅을 포함하는 것이 매우 권장됩니다. 미세 조정 및 적절한 수의 프록시가 포함된 경우에도 클라이언트의 수가 그렇게 많으면 성능 문제가 발생할 수 있습니다.
zh_cn: 根据所用体验和部署方式的不同，{productname} 服务器与足够数量的代理配套使用时，建议每个服务器处理的客户端不要超过 10,000 个，以便获得最佳性能。当客户端数量超过 10,000 个时，强烈建议改为使用集线器设置并咨询相关专业人员。即使优化了设置并配备了充足的代理，数量如此庞大的客户端也可能导致发生性能问题。

source: For more information about managing a large number of clients, see xref:specialized-guides:large-deployments/hub-multi-server.adoc[].
ja: 多数のクライアント管理の詳細については、xref:specialized-guides:large-deployments/hub-multi-server.adoc[]を参照してください。
ko: 대규모 클라이언트 관리에 대한 자세한 내용은 xref:specialized-guides:large-deployments/hub-multi-server.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关如何管理大量客户端的详细信息，请参见 xref:specialized-guides:large-deployments/hub-multi-server.adoc[]。

source: Proxy Requirements
ja: プロキシ要件
ko: 프록시 요구사항
zh_cn: 代理要求

source: Minimum requirements are suitable for a quick test installation, such as a Proxy with one client. If you want to use a production environment start with recommended values.
zh_cn: 最低要求适用于快速测试安装，例如包含一个客户端的代理。如果您想要使用生产环境，请使用建议的值开始操作。
