Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: To establish a connection without prompting for a password, the migration script relies on an SSH agent running on the new server. If the agent is not active yet, initiate it by running [command]``eval $(ssh-agent)``. Then add the SSH key to the running agent with [command]``ssh-add`` followed by the path to the private key. You will be prompted to enter the password for the private key during this process.
ko: 비밀번호를 묻지 않고 연결을 설정하기 위해 마이그레이션 스크립트는 새 서버에서 실행 중인 SSH 에이전트를 활용합니다. 에이전트가 아직 활성화되어 있지 않은 경우, [command]``eval $(ssh-agent)``를 실행하여 에이전트를 시작합니다. 그런 다음 [command]``ssh-add``를 실행한 후 개인 키의 경로를 입력하여 실행 중인 에이전트에 SSH 키를 추가합니다. 이 프로세스 중에는 개인 키의 비밀번호를 입력하라는 메시지가 표시됩니다.
zh_cn: 迁移脚本依赖新服务器上运行的 SSH 代理来建立不提示输入口令的连接。如果该代理尚未激活，请运行 [command]``eval $(ssh-agent)`` 将其启动。然后，使用 [command]``ssh-add``（后跟私用密钥的路径）将 SSH 密钥添加到正在运行的代理。在此过程中，系统将提示您输入私用密钥的口令。

source: Copy the public SSH key to the legacy {productname} Server ([literal]``<oldserver.fqdn>``) with [command]``ssh-copy-id``. Replace [literal]``<oldserver.fqdn>`` with the FQDN of the legacy server:
ko: [command]``ssh-copy-id``를 사용하여 레거시 {productname} 서버([literal]``<oldserver.fqdn>``)에 공개 SSH 키를 복사합니다. [literal]``<oldserver.fqdn>``을 레거시 서버의 FQDN으로 바꿉니다.
zh_cn: 使用 [command]``ssh-copy-id`` 将公共 SSH 密钥复制到旧版 {productname} 服务器 ([literal]``<oldserver.fqdn>``)。请将 [literal]``<oldserver.fqdn>`` 替换为旧版服务器的 FQDN：

source: The SSH key will be copied into the legacy server's [path]``~/.ssh/authorized_keys`` file. For more information, see the [literal]``ssh-copy-id`` manpage.
ko: SSH 키가 레거시 서버의 [path]``~/.ssh/authorized_keys`` 파일에 복사됩니다. 자세한 내용은 [literal]``ssh-copy-id`` 사용자 지정 페이지에서 확인할 수 있습니다.
zh_cn: SSH 密钥会被复制到旧版服务器的 [path]``~/.ssh/authorized_keys`` 文件中。有关详细信息，请参见 [literal]``ssh-copy-id`` 手册页。

source: Establish an SSH connection from the new server to the legacy {productname} Server to check that no password is needed. Also there must not by any problem with the host fingerprint. In case of trouble, remove old fingerprints from the [path]``~/.ssh/known_hosts`` file. Then try again. The fingerprint will be stored in the local [path]``~/.ssh/known_hosts`` file.
ko: 새 서버에서 레거시 {productname} 서버로 SSH 연결을 설정하여 비밀번호가 필요하지 않은지 확인합니다. 호스트 지문에도 문제가 없어야 합니다. 문제가 있는 경우 [path]``~/.ssh/known_hosts`` 파일에서 기존 지문을 제거합니다. 그런 다음 다시 시도합니다. 지문은 로컬 [path]``~/.ssh/known_hosts`` 파일에 저장됩니다.
zh_cn: 在新服务器上与旧版 {productname} 服务器建立 SSH 连接，检查是否不需要口令。此外，主机指纹不得有任何问题。如果遇到问题，请从 [path]``~/.ssh/known_hosts`` 文件中去除旧指纹。然后重试。指纹将存储在本地 [path]``~/.ssh/known_hosts`` 文件中。

source: Perform the Migration
ja: 移行の実行
ko: 마이그레이션 수행
zh_cn: 执行迁移

source: When planning your migration from a legacy {productname} to a containerized {productname}, ensure that your target instance meets or exceeds the specifications of the legacy setup. This includes, but is not limited to, memory (RAM), CPU Cores, Storage, and Network Bandwidth.
ko: 레거시 {productname}에서 컨테이너화된 {productname}(으)로 마이그레이션을 계획할 때는 대상 인스턴스가 레거시 설정의 사양을 충족하거나 초과하는지 확인하십시오. 여기에는 메모리(RAM), CPU 코어, 스토리지 및 네트워크 대역폭이 포함되지만, 이에 국한되지 않습니다.
zh_cn: 在规划从旧版 {productname} 到容器化 {productname} 的迁移时，请确保您的目标实例达到或超过旧版设置的规格。这包括但不限于内存 (RAM)、CPU 核心、存储空间和网络带宽。

source: Devices must not have any filesystem. The command aborts if a filesystem exists on the storage device.
ko: 장치에는 파일 시스템이 없어야 합니다. 저장 장치에 파일 시스템이 있으면 명령이 중단됩니다.
zh_cn: 设备上不得存在任何文件系统。如果存储设备上存在文件系统，命令会中止。

source: Execute the following command to install a new {productname} server. Replace [literal]``<oldserver.fqdn>`` with the FQDN of the legacy server:
ko: 새 {productname} 서버를 설치하려면 다음 명령을 실행합니다. **<oldserver.fqdn>**은 레거시 서버의 FQDN으로 바꿉니다.
zh_cn: 执行以下命令来安装新的 {productname} 服务器。请将 [literal]``<oldserver.fqdn>`` 替换为旧版服务器的 FQDN：

source: Migration of the Certificates
ja: 証明書の移行
zh_cn: 证书的迁移

source: Trusted SSL CA certificates that were installed as part of an RPM and stored on a legacy {productname} in the [path]``/usr/share/pki/trust/anchors/`` directory will not be migrated. Because {suse} does not install RPM packages in the container, the administrator must migrate these certificate files manually from the legacy installation after migration:
ko: RPM의 일부로 설치되고 레거시 {productname}의 [path]``/usr/share/pki/trust/anchors/`` 디렉토리에 저장된 신뢰할 수 있는 SSL CA 인증서는 마이그레이션되지 않습니다. {suse}는 컨테이너에 RPM 패키지를 설치하지 않으므로 관리자는 마이그레이션 후 레거시 설치에서 이러한 인증서 파일을 수동으로 마이그레이션해야 합니다.
zh_cn: 作为 RPM 的一部分安装并存储在旧版 {productname} 上 [path]``/usr/share/pki/trust/anchors/`` 目录中的可信 SSL CA 证书将不会迁移。由于 {suse} 不会在容器中安装 RPM 软件包，因此迁移完成后，管理员必须手动从以前安装的旧版系统中迁移这些证书文件：

source: Procedure: Migrating the Certificates
ja: プロシージャ: 証明書の移行
zh_cn: 过程：迁移证书

source: Copy the file from the legacy server to the new server.
ko: 레거시 서버에서 새 서버로 파일을 복사합니다.
zh_cn: 将旧版服务器中的该文件复制到新服务器。

source: Copy the file into the container with the command:
ko: 다음 명령을 사용하여 파일을 컨테이너에 복사합니다.
zh_cn: 使用以下命令将文件复制到容器中：

source: Finalize migration
ko: 마이그레이션 마무리
zh_cn: 完成迁移

source: After successfully running the [command]``mgradm migrate`` command, the {salt} setup on all clients will still point to the legacy server.
ko: [command]``mgradm migrate`` 명령을 성공적으로 실행한 후에도 모든 클라이언트의 {salt} 설정은 계속해서 기존 레거시 서버를 가리킵니다.
zh_cn: 成功运行 [command]``mgradm migrate`` 命令后，所有客户端上的 {salt} 设置仍会指向旧版服务器。

source: To redirect them to the new {productnumber} server, it is required to rename the new server at the infrastructure level (DHCP and DNS) to use the same FQDN and IP address as the legacy server.
ko: 새 {productnumber} 서버로 리디렉션하려면, 기존 서버와 동일한 FQDN 및 IP 주소를 사용하도록 새 서버의 인프라 수준(DHCP 및 DNS)에서 이름을 변경해야 합니다.
zh_cn: 要将其重定向到新的 {productnumber} 服务器，需要在基础架构级别（DHCP 和 DNS）重命名新服务器，以使用与旧版服务器相同的 FQDN 和 IP 地址。

source: If something goes wrong with the migration it is possible to restart the old system. As root, restart {postgresql} and the spacewalk services with the following commands:
ko: 마이그레이션에 문제가 발생할 경우 기존 시스템을 재시작할 수 있습니다. 루트 권한으로 다음 명령을 사용하여 {postgresql} 및 spacewalk 서비스를 다시 시작합니다.
zh_cn: 如果迁移过程中出现问题，可重启旧系统。请以 root 身份执行以下命令，重启 {postgresql} 和 spacewalk 服务：

source: Kubernetes Preparations
ko: Kubernetes 준비
zh_cn: Kubernetes 准备工作

source: Before executing the migration with [command]``mgradm migrate`` command, it is essential to predefine **Persistent Volumes**, especially considering that the migration job initiates the container from scratch.
ko: [command]``mgradm migrate`` 명령으로 마이그레이션을 실행하기 전에, 특히 마이그레이션 작업이 컨테이너를 처음부터 시작한다는 점을 고려하여 **영구 볼륨**을 필수로 미리 정의해야 합니다.
zh_cn: 在使用 [command]``mgradm migrate`` 命令执行迁移之前，必须预先定义**永久性卷**，尤其要注意的是，迁移作业会从头开始初始化容器。

source: For more information, see the installation section on preparing these volumes in xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[].
ko: 자세한 내용은 xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[]의 설치 섹션에서 이러한 볼륨 준비 방법을 참조하십시오.
zh_cn: 有关详细信息，请参见安装章节中关于准备这些卷的内容，具体可查看 xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[]。

source: Migrating
ja: 移行
ko: 마이그레이션
zh_cn: 迁移

source: Execute the following command to install a new {productname} server, replacing **<oldserver.fqdn>** with the appropriate FQDN of the legacy server:
ko: 다음 명령을 실행하여 **<oldserver.fqdn>**을 레거시 서버의 적절한 FQDN으로 바꿔 새 {productname} 서버를 설치합니다.
zh_cn: 执行以下命令安装新的 {productname} 服务器（请将 **<oldserver.fqdn>** 替换为旧版服务器的相应 FQDN）：

source: After successfully running the [command]``mgradm migrate`` command, the {salt} setup on all clients will still point to the legacy server. To redirect them to the new server, it is required to rename the new server at the infrastructure level (DHCP and DNS) to use the same FQDN and IP address as the legacy server.
ko: [command]``mgradm migrate`` 명령이 성공적으로 실행된 후에도 모든 클라이언트의 {salt} 설정이 계속해서 레거시 서버를 가리킵니다. 이러한 설정을 새 서버로 리디렉션하려면 인프라 수준(DHCP 및 DNS)에서 새 서버에서 레거시 서버와 동일한 FQDN 및 IP 주소를 사용하도록 이름을 변경해야 합니다.
zh_cn: 成功运行 [command]``mgradm migration`` 命令后，所有客户端上的 {salt} 设置仍会指向旧版服务器。要将其重定向到新服务器，需要在基础架构级别（DHCP 和 DNS）重命名新服务器，以使用与旧版服务器相同的 FQDN 和 IP 地址。

source: Containerized {productname} Proxy Setup
ja: コンテナ化された{productname}プロキシの設定
ko: 컨테이너화된 {productname} 프록시 설정
zh_cn: 容器化 {productname} Proxy 设置

source: Once container host for {productname} Proxy containers is prepared, setup of containers require few additional steps to finish configuration.
ja: {productname}プロキシコンテナのコンテナホストが準備された後に、コンテナの設定では、設定を完了するための追加の手順がいくつか必要になります。
ko: {productname} 프록시 컨테이너에 대한 컨테이너 호스트가 준비되면 컨테이너 설정에서 구성을 완료하기 위해 몇 가지 추가 단계가 필요합니다.
zh_cn: 为 {productname} Proxy 容器准备好容器主机后，需要额外执行几步容器设置才能完成配置。

source: Procedure
ja: プロシージャ
zh_cn: 过程

source: Generate {productname} Proxy configuration archive file
ja: {productname}プロキシ設定アーカイブファイルを生成します
ko: {productname} 프록시 구성 아카이브 파일 생성
zh_cn: 生成 {productname} Proxy 配置归档文件

source: Transfer configuration archive to the container host prepared in installation step and extract it
ja: インストールステップで準備したコンテナホストに設定アーカイブを転送し、抽出します
ko: 설치 단계에서 준비한 컨테이너 호스트로 구성 아카이브를 전송하고 압축을 풉니다.
zh_cn: 将配置归档传输到在安装步骤中准备的容器主机并解压缩

source: Start the proxy sevices with [literal]``mgrpxy``
ja: [literal]``mgrpxy``でプロキシサービスを開始します
ko: [literal]``mgrpxy``를 실행하여 프록시 서비스를 시작합니다.
zh_cn: 使用 [literal]``mgrpxy`` 启动代理服务

source: Transfer {productname} Proxy Configuration
zh_cn: 传输 {productname} 代理配置

source: Both [command]``spacecmd`` command and generating via {webui} ways create a configuration archive. This archive needs to be made available on container host. Transfer this generated archive to the container host.
ko: [command]``spacecmd`` 명령과 {webui} 방식을 통한 생성 모두 구성 아카이브를 생성합니다. 이 아카이브는 컨테이너 호스트에서 사용할 수 있도록 해야 합니다. 생성된 아카이브를 컨테이너 호스트로 전송합니다.
zh_cn: 执行 [command]``spacecmd`` 命令和使用 {webui} 这两种方式均会创建配置归档。该归档需在容器主机上可用，请将生成的此归档传输至容器主机。

source: Start {productname} Proxy Containers
zh_cn: 启动 {productname} 代理容器

source: Container can be started with the [literal]``mgrpxy`` command.
ko: 컨테이너는 [literal]``mgrpxy`` 명령으로 시작할 수 있습니다.
zh_cn: 可以执行 [literal]`mgrpxy` 命令来启动容器。

source: Procedure: Start {productname} Proxy Containers
zh_cn: 过程：启动 {productname} 代理容器

source: Run command:
zh_cn: 运行以下命令：

source: Check if all containers started up as expected by calling:
zh_cn: 调用以下命令检查所有容器是否都已按预期启动：

source: Five {productname} Proxy containers should be present and should be part of [literal]``proxy-pod`` container pod.
ko: 5개의 {productname} 프록시 컨테이너가 존재해야 하며, [literal]``proxy-pod`` 컨테이너 포드의 일부여야 합니다.
zh_cn: 应该会显示以下五个 {productname} 代理容器，并且它们应该是 [literal]``proxy-pod`` 容器 Pod 的一部分。

source: Proxy conversion from client
ko: 클라이언트에서의 프록시 변환
zh_cn: 从客户端转换为代理

source: It assumes that the proxy host system has already been bootstrapped and subscribed to the base operating system channel.
ko: 프록시 호스트 시스템이 이미 부트스트랩되어 기본 운영 체제 채널을 구독하고 있다고 가정합니다.
zh_cn: 本文假定代理主机系统已完成引导，且已订阅基础操作系统通道。

source: Transfer the certificates from {productname} server host
ko: {productname} 서버 호스트에서 인증서 이전
zh_cn: 从 {productname} 服务器主机传输证书

source: Install `mgrpxy`
zh_cn: 安装 `mgrpxy` 工具

source: The `mgrpxy` tool must be installed from a repository matching your system. Choose the appropriate repository from:
ko: ``mgrpxy`` 도구는 시스템에 맞는 리포지토리에서 설치해야 합니다. 다음 중 적절한 리포지토리를 선택합니다.
zh_cn: 必须从与您的系统匹配的储存库安装 `mgrpxy` 工具。请从以下地址选择适当的储存库：

source: Install Container Images
ko: 컨테이너 이미지 설치
zh_cn: 安装容器映像

source: For [literal]``Registry URL`` use: [literal]``registry.opensuse.org/uyuni``.
ko: [literal]``Registry URL``의 경우 [literal]``registry.opensuse.org/uyuni``를 사용합니다.
zh_cn: 在[literal]``仓库 URL`` 中填写 [literal]``registry.opensuse.org/uyuni``。

source: For each individual container URL field, use the registry: [literal]``registry.opensuse.org/uyuni`` followed by the corresponding suffix, for example, `_proxy-httpd_` or `_salt-broker_`.
ko: 각 개별 컨테이너 URL 필드에 레지스트리 [literal] ``registry.opensuse.org/uyuni`` 뒤에 해당 접미사(예: `_proxy-httpd_` 또는 `_salt-broker_`)를 사용합니다.
zh_cn: 对于每个独立容器的 URL 字段，均需填写仓库地址 [literal]``registry.opensuse.org/uyuni``，并添加对应的后缀（例如 `_proxy-httpd_` 或 `_salt-broker_`）。

source: This guide outlines the deployment process for the {productname} {productnumber} Proxy. This guide presumes you have already successfully deployed a {productname} {productnumber} Server. To successfully deploy, you will perform the following actions:
ja: このガイドでは、{productname} {productnumber}プロキシの配備プロセスの概要について説明します。このガイドでは、{productname} {productnumber}サーバが正常に配備済みであることを想定しています。正常に配備するには、次のアクションを実行します。
ko: 이 가이드에서는 {productname} {productnumber} 프록시에 대한 배포 프로세스를 간략하게 설명합니다. 이 가이드에서는 {productname} {productnumber} 서버가 이미 배초된 상태를 가정합니다. 배포하려면 다음 작업을 수행합니다.
zh_cn: 本指南概述了 {productname} {productnumber} 代理的部署过程。本指南假定您已成功部署 {productname} {productnumber} 服务器。要成功完成部署，请执行以下操作：

source: Checklist: Proxy Deployment
ja: チェックリスト: プロキシの配備
ko: 검사 목록: 프록시 배포
zh_cn: 核对清单：代理部署

source: Bootstrap the Proxy as a {salt} minion.
ja: プロキシを{salt} Minionとしてブートストラップします。
ko: 프록시를 {salt} 미니언으로 부트스트랩합니다.
zh_cn: 将代理作为 {salt} 受控端进行引导。

source: Generate a Proxy configuration.
ja: プロキシ設定を生成します。
ko: 프록시 구성을 생성합니다.
zh_cn: 生成代理配置。

source: Transfer the Proxy configuration from Server to Proxy
ja: サーバからプロキシへのプロキシ設定の転送
ko: 프록시 구성을 서버에서 프록시로 전송
zh_cn: 将服务器中的代理配置传输到代理

source: Use the Proxy configuration to register the {salt} minion as a Proxy with {productname}.
ja: プロキシ設定を使用して、{salt} Minionをプロキシとして{productname}に登録します。
ko: 프록시 구성을 사용하여 {salt} 미니언을 {productname}의 프록시로 등록합니다.
zh_cn: 使用代理配置将 {salt} 受控端作为代理注册到 {productname}。

source: A container host is a server equipped with a container engine like Podman, which lets it manage and deploy containers. These containers hold applications and their essential parts, such as libraries, but not a full operating system, making them lightweight. This setup ensures applications run the same way in different environments. The container host supplies the necessary resources such as CPU, memory, and storage for these containers.
ja: コンテナホストは、コンテナを管理および配備できるPodmanなどのコンテナエンジンを搭載したサーバです。これらのコンテナは、アプリケーションと、ライブラリなどの重要な部品を保持しますが、完全なオペレーティングシステムは保持しないため軽量です。このセットアップにより、アプリケーションは異なる環境でも同じように動作します。CPU、メモリ、ストレージなど、これらのコンテナに必要なリソースはコンテナホストが提供します。
ko: 컨테이너 호스트는 컨테이너를 관리하고 배포할 수 있는 Podman과 같은 컨테이너 엔진이 탑재된 서버입니다. 이러한 컨테이너는 애플리케이션과 라이브러리와 같은 필수적인 부분을 보관하지만, 전체 운영 체제는 보관하지 않으므로 경량화됩니다. 이 설정을 통해 애플리케이션이 다양한 환경에서 동일한 방식으로 실행될 수 있습니다. 컨테이너 호스트는 이러한 컨테이너에 CPU, 메모리, 스토리지 등 필요한 리소스를 제공합니다.
zh_cn: 容器主机是配备了容器引擎（例如 Podman）的服务器，可用于管理和部署容器。这些容器包含应用程序及其必备组件（例如库），但不包含完整的操作系统，因此体量很小。此设置可确保应用程序能够在不同环境中以一致的方式运行。容器主机为这些容器提供必要的资源，例如 CPU、内存和存储。

source: This table shows the hardware requirements for deploying {productname} Proxy.
ja: 次の表に、{productname}プロキシを配備するためのハードウェア要件を示します。
ko: 이 테이블은 {productname} 프록시를 배포하기 위한 하드웨어 요구사항을 보여줍니다.
zh_cn: 下表列出了部署 {productname} 代理所要满足的硬件要求。

source: Proxy Hardware Requirements
cs: Hardwarové požadavky na proxy server
ja: プロキシのハードウェア要件
ko: 프록시 하드웨어 요구사항
zh_cn: 代理硬件要求

source: | Hardware | Details | Recommendation | CPU | {x86_64}, {arm} | Minimum 2 dedicated 64-bit CPU cores | RAM | Minimum | 2 GB | | Recommended | 8 GB | Disk Space | [path]``/`` (root directory) | Minimum 40 GB | | [path]``/var/lib/containers/storage/volumes`` | Minimum 100 GB, Storage requirements should be calculated for the number of ISO distribution images, containers, and bootstrap repositories you will use.
ko: | 하드웨어 | 세부 정보 | 권장 | CPU | {x86_64}, {arm} | 최소 2개의 전용 64비트 CPU 코어 | RAM | 최소 | 2GB | | 권장 | 8GB | 디스크 공간 | [path]``/`` (루트 디렉토리) | 최소 40GB | | [path]``/var/lib/containers/storage/volumes/srv-www`` | 최소 100GB, 스토리지 요구사항은 사용할 ISO 배포 이미지, 컨테이너 및 부트스트랩 리포지토리 수에 따라 계산해야 합니다. | |[path]``/var/lib/containers/storage/volumes`` | 최소 100GB, 사용 예정인 ISO 배포 이미지, 컨테이너 및 부트스트랩 리포지토리의 수에 따라 저장 공간 요구 사항을 계산해야 합니다.
zh_cn: | 硬件 | 详细信息 | 建议 | CPU | {x86_64}、{arm} | 至少 2 个专用的 64 位 CPU 核心 | RAM | 至少 | 2 GB | | 建议 | 8 GB | 磁盘空间 | [path]``/``（根目录） | 至少 40 GB | | [path]``/var/lib/containers/storage/volumes`` | 至少 100 GB，应根据您要使用的 ISO 发行套件映像、容器和引导储存库的数量来计算存储要求。

source: Container Host General Requirements
ko: 컨테이너 호스트 일반 요구사항
zh_cn: 容器主机一般要求

source: For general requirements, see xref:installation-and-upgrade:general-requirements.adoc[General requirements].
ja: 一般的な要件については、xref:installation-and-upgrade:general-requirements.adoc[一般的な要件]を参照してください。
ko: 일반 요구사항은 xref:installation-and-upgrade:general-requirements.adoc[일반 요구사항]에서 확인할 수 있습니다.
zh_cn: 有关一般要求，请参见xref:installation-and-upgrade:general-requirements.adoc[一般要求]。

source: Container Host Requirements
ja: コンテナホストの要件
ko: 컨테이너 호스트 요구사항
zh_cn: 容器主机要求

source: For CPU, RAM, and storage requirements, see xref:installation-and-upgrade:hardware-requirements.adoc[Hardware requirements].
ja: CPU、RAM、およびストレージの要件については、xref:installation-and-upgrade:hardware-requirements.adoc[ハードウェア要件]を参照してください。
ko: CPU, RAM, 스토리지 요구사항은 xref:installation-and-upgrade:hardware-requirements.adoc[하드웨어 요구사항]에서 확인할 수 있습니다.
zh_cn: 有关 CPU、RAM 和存储要求，请参见xref:installation-and-upgrade:hardware-requirements.adoc[硬件要求]。

source: To guarantee that clients can resolve the FQDN domain name, both the containerized server and the host machines must be linked to a functional DNS server. Additionally, it is essential to ensure correct configuration of reverse lookups.
ja: クライアントがFQDNドメイン名を解決できることを保証するには、コンテナ化されたプロキシとホストマシンの両方が、機能しているDNSサーバにリンクされている必要があります。さらに、リバース参照が正しく設定されていることを確認することも重要です。
ko: 클라이언트가 FQDN 도메인 이름을 확인할 수 있도록 하려면 컨테이너화된 서버와 호스트 컴퓨터가 모두 올바르게 작동하는 DNS 서버에 연결되어 있어야 합니다. 또한 역방향 확인도 올바르게 구성해야 합니다.
zh_cn: 为了保证客户端能够解析 FQDN 域名，容器化服务器和主机都必须连接到正常运行的 DNS 服务器。此外，必须确保反向查找的配置正确。

source: Installing Uyuni Tools for Use With Containers
zh_cn: 安装用于容器的 Uyuni 工具

source: Log in.
ko: 로그인합니다.
zh_cn: 登录系统。

source: Refresh the repository list and accept the key:
ja: リポジトリのリストを更新してキーを受け入れます。
ko: 리포지토리 목록을 새로 고치고 키를 수락합니다.
zh_cn: 刷新储存库列表并接受密钥：

source: Install the container tools:
ja: コンテナツールをインストールします。
ko: 컨테이너 도구를 설치합니다.
zh_cn: 安装容器工具：

source: Alternatively you may install [systemitem]``mgrpxy-zsh-completion`` or [systemitem]``mgrpxy-fish-completion``.
ja: または、[systemitem]``mgrpxy-zsh-completion``または[systemitem]``mgrpxy-fish-completion``をインストールできます。
ko: 또는 [systemitem]``mgrpxy-zsh-completion`` 또는 [systemitem]``mgrpxy-fish-completion``을 설치할 수 있습니다.
zh_cn: 或者，可以安装 [systemitem]``mgrpxy-zsh-completion`` 或 [systemitem]``mgrpxy-fish-completion``。

source: For more information on the Uyuni Container Utilities, see link:https://build.opensuse.org/repositories/systemsmanagement:Uyuni:Stable:ContainerUtils[Uyuni Container Utilities].
ja: Uyuniコンテナユーティリティの詳細については、link:https://build.opensuse.org/repositories/systemsmanagement:Uyuni:Stable:ContainerUtils[Uyuniコンテナユーティリティ]を参照してください。
ko: Uyuni 컨테이너 유틸리티에 대한 자세한 내용은 link:https://build.opensuse.org/repositories/systemsmanagement:Uyuni:Stable:ContainerUtils[Uyuni 컨테이너 유틸리티]를 참조하십시오.
zh_cn: 有关 Uyuni 容器实用程序的详细信息，请参见 link:https://build.opensuse.org/repositories/systemsmanagement:Uyuni:Stable:ContainerUtils[Uyuni 容器实用程序]。

source: This step is optional. However, if custom persistent storage is required for your infrastructure, use the [command]``mgr-storage-proxy`` tool.
ja: このステップはオプションです。ただし、ご使用のインフラストラクチャにカスタム永続ストレージが必要な場合は、[command]``mgr-storage-proxy``ツールを使用します。
ko: 이 단계는 선택 사항입니다. 그러나 인프라에 사용자 정의 영구 스토리지가 필요한 경우 [command]``mgr-storage-proxy`` 도구를 사용하십시오.
zh_cn: 此步骤是可选的。但是，如果您的基础架构需要自定义的永久性存储，请使用 [command]``mgr-storage-proxy`` 工具。

source: Bootstrap the Proxy Host as a Minion
ja: Minionとしてのプロキシホストのブートストラップ
ko: 프록시 호스트를 미니언으로 부트스트랩
zh_cn: 将代理主机作为受控端进行引导

source: Task: Bootstrap the Proxy Host
ja: タスク: プロキシホストのブートストラップ
ko: 작업: 프록시 호스트 부트스트랩
zh_cn: 任务：引导代理主机

source: Select menu:Systems[Bootstrapping].
ja: menu:システム[ブートストラップ]を選択します。
ko: menu:시스템[부트스트랩]을 선택합니다.
zh_cn: 选择menu:系统[引导]。

source: Fill in the fields for your Proxy host.
ja: プロキシホストのフィールドに入力します。
ko: 프록시 호스트의 필드를 입력합니다.
zh_cn: 填写代理主机的相关字段。

source: Select the Activation key created in the previous step from the dropdown.
ja: ドロップダウンから、前のステップで作成したアクティベーションキーを選択します。
ko: 드롭다운에서 이전 단계에서 생성한 활성화 키를 선택합니다.
zh_cn: 从下拉列表中选择上一步骤中创建的激活密钥。

source: Click btn:[+ Bootstrap].
ja: btn:[+ ブートストラップ]をクリックします。
ko: btn:[+ 부트스트랩]을 클릭합니다.
zh_cn: 单击 btn:[+ 引导]。

source: Wait for the Bootstrap process to complete successfully. Check the menu:Salt[] menu and confirm the {salt} minion key is listed and accepted.
ja: ブートストラッププロセスが正常に完了するまで待ちます。menu:Salt[]メニューをチェックし、{salt} Minionキーが一覧表示されていて受け入れられていることを確認します。
ko: 부트스트랩 프로세스가 완료될 때까지 기다립니다. menu:Salt[] 메뉴를 선택한 후 {salt} 미니언 키가 나열되고 수락되었는지 확인합니다.
zh_cn: 等待引导过程成功完成。检查 menu:Salt[] 菜单，确认 {salt} 受控端密钥已列出并已接受。

source: Reboot the Proxy host.
ja: プロキシホストを再起動します。
ko: 프록시 호스트를 재부팅합니다.
zh_cn: 重引导代理主机。

source: Select the host from the menu:System[] list and trigger a second reboot after all events are finished to conclude the onboarding.
ja: すべてのイベントが終了したら、menu:システム[]の一覧からホストを選択して2回目の再起動をトリガし、オンボーディングを完了します。
ko: menu:시스템[] 목록에서 호스트를 선택하고 모든 이벤트가 완료된 후 두 번째 재부팅을 트리거하여 온보딩을 완료합니다.
zh_cn: 从menu:系统[]列表中选择主机，并在所有事件完成后再次触发重引导以完成初始配置。

source: Task: Update the Proxy Host
ja: タスク: プロキシホストの更新
ko: 작업: 프록시 호스트 업데이트
zh_cn: 任务：更新代理主机

source: Select the host from the menu:Systems[] list and apply all patches to update it.
ja: menu:システム[]の一覧からホストを選択し、すべてのパッチを適用してホストを更新します。
ko: menu:시스템[] 목록에서 호스트를 선택하고 모든 패치를 적용하여 업데이트합니다.
zh_cn: 从menu:系统[]列表中选择主机，并应用所有补丁以将其更新。

source: Generate the Proxy Configuration
ja: プロキシ設定の生成
ko: 프록시 구성 생성
zh_cn: 生成代理配置

source: The configuration archive of the {productname} Proxy is generated by the {productname} Server. Each additional Proxy requires its own configuration archive.
ja: {productname}プロキシの設定アーカイブは{productname}サーバによって生成されます。追加のプロキシごとに専用の設定アーカイブが必要です。
ko: {productname} 프록시의 구성 아카이브는 {productname} 서버에서 생성됩니다. 각 추가 프록시에는 자체 구성 아카이브가 필요합니다.
zh_cn: {productname} 代理的配置归档由 {productname} 服务器生成。每个附加代理都需要自身的配置归档。

source: The container host for the {productname} Proxy must be registered as a salt minion to the {productname} Server prior to generating this Proxy configuration.
ja: このプロキシ設定を生成する前に、{productname}プロキシのコンテナホストをSalt Minionとして{productname}サーバに登録する必要があります。
ko: {productname} 프록시의 컨테이너 호스트는 이 프록시 구성을 생성하기 전에 {productname} 서버에 salt 미니언으로 등록해야 합니다.
zh_cn: 在生成此代理配置之前，必须将 {productname} 代理的容器主机作为 Salt 受控端注册到 {productname} 服务器。

source: You will perform the following tasks:
ja: 次のタスクを実行します。
ko: 다음 작업을 수행합니다.
zh_cn: 您将执行以下任务：

source: Procedure:
ko: 절차
zh_cn: 过程：

source: Generate a Proxy configuration file.
ja: プロキシ設定ファイルを生成します。
ko: 프록시 구성 파일을 생성합니다.
zh_cn: 生成代理配置文件。

source: Transfer the configuration to the Proxy.
ja: 設定をプロキシに転送します。
ko: 구성을 프록시로 전송합니다.
zh_cn: 将配置传输到代理。

source: Start the Proxy with the [literal]``mgrpxy`` command.
ja: [literal]``mgrpxy``コマンドでプロキシを起動します。
ko: [literal] ``mgrpxy`` 명령어로 프록시를 시작합니다.
zh_cn: 使用 [literal]``mgrpxy`` 命令启动代理。

source: Task: Generating a Proxy Container Configuration using Web UI
ja: タスク: Web UIを使用したプロキシコンテナ設定の生成
ko: 작업: 웹 UI를 사용하여 프록시 컨테이너 구성 생성
zh_cn: 任务：使用 Web UI 生成代理容器配置

source: In the {webui}, navigate to menu:Systems[Proxy Configuration] and fill the required data:
ja: {webui}で、menu:システム[プロキシの設定]に移動し、必要なデータを入力します。
ko: {webui}에서 menu:Systems[프록시 구성]으로 이동하여 필요한 데이터를 입력합니다.
zh_cn: 在 {webui} 中，导航到menu:系统[代理配置]，然后填写所需数据：

source: In the [guimenu]``Proxy FQDN`` field type fully qualified domain name for the proxy.
ja: ［[guimenu]``プロキシFQDN``］フィールドに、プロキシの完全修飾ドメイン名を入力します。
ko: [guimenu]``Proxy FQDN`` 필드에 프록시의 정규화된 도메인 이름을 입력합니다.
zh_cn: 在[guimenu]``代理 FQDN``字段中，键入代理的完全限定域名。

source: In the [guimenu]``Parent FQDN`` field type fully qualified domain name for the {productname} Server or another {productname} Proxy.
ja: ［[guimenu]``親FQDN``］フィールドに、{productname}サーバまたは別の{productname}プロキシの完全修飾ドメイン名を入力します。
ko: [guimenu]``상위 FQDN`` 필드에 {productname} Server 또는 다른 {productname} Proxy에 대한 정규화된 도메인 이름을 입력하십시오.
zh_cn: 在[guimenu]``父 FQDN``字段中，键入 {productname} 服务器或另一个 {productname} 代理的完全限定域名。
