Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: This section provides the requirements for installing {productname} on public cloud infrastructure. We have tested these instructions on Amazon EC2, Google Compute Engine, and Microsoft Azure, but they should work on other providers as well, with some variation.
cs: Tato sekce obsahuje požadavky na instalaci {productname} do infrastruktury veřejného cloudu. Tento návod jsme testovali na Amazon EC2, Google Compute Engine a Microsoft Azure, ale měl by s nějakými variacemi fungovat i pro jiné poskytovatele.
ja: このセクションは、パブリッククラウドインフラストラクチャに{productname}をインストールする要件について説明します。Amazon EC2、Google Compute Engine、およびMicrosoft Azureではテストを実施済みですが、若干の差異はあってもその他のプロバイダにも当てはまるはずです。
ko: 이 섹션에서는 공용 클라우드 인프라에 {productname}를 설치하기 위한 요구사항을 제공합니다. Amazon EC2, Google Compute Engine, Microsoft Azure에서 이러한 지침을 테스트했지만 약간의 차이는 있지만 다른 공급자에서도 작동해야 합니다.
zh_cn: 本节介绍在公有云基础结构上安装 {productname} 所要满足的要求。我们已在 Amazon EC2、Google Compute Engine 和 Microsoft Azure 上对这些指令进行过测试，不过它们进行一定修改后在其他提供商的云服务上也应能正常工作。

source: Before you begin, here are some considerations:
cs: Několik úvah, než začnete:
ja: 始める前に、考慮事項を次に示します。
ko: 시작하기 전 고려해야 할 사항은 다음과 같습니다.
zh_cn: 在开始之前，请注意以下一些事项：

source: The {productname} setup procedure performs a forward-confirmed reverse DNS lookup. This must succeed in order for the setup procedure to complete and for {productname} to operate as expected. It is important to perform hostname and IP configuration before you set up {productname}.
cs: Procedura nastavení {productname} si předem zjišťuje, zda uspěje reverzní vyhledávání DNS. To musí proběhnout úspěšně, aby bylo dokončeno nastavení a aby produkt {productname} fungoval podle očekávání. Před nastavením produktu {productname} je důležité provést konfiguraci názvu hostitele a adresy IP.
ja: {productname}設定プロシージャは、正引きで確認された逆引きDNS参照を実行します。設定プロシージャが完了して{productname}が期待どおりに動作するためには、この参照が成功する必要があります。{productname}を設定する前に、ホスト名とIPの設定を実行することが重要です。
ko: {productname} 설정 절차는 정방향 확인 된 역방향 DNS 조회를 수행합니다. 설정 절차를 완료하고 {productname}이 예상대로 작동하려면 이 작업이 성공해야 합니다. {productname}를 설정하기 전에 호스트 이름 및 IP 구성을 수행하는 것이 중요합니다.
zh_cn: {productname} 设置过程执行正向确认的反向 DNS 查找。此操作必须成功，设置过程才能完成，并且 {productname} 才能按预期方式运行。请务必在设置 {productname} 之前执行主机名和 IP 配置。

source: {productname} Server and Proxy instances need to run in a network configuration that provides you control over DNS entries, but cannot be accessed from the internet at large.
cs: Instance serveru a proxy {productname} musí běžet v síťové konfiguraci, v níž můžete ovládat položky DNS, ale nelze k nim přistupovat z obecného internetu.
ja: {productname}サーバとプロキシのインスタンスは、DNSエントリを介した制御を提供するネットワーク設定で実行する必要がありますが、大規模インターネットからはアクセスできません。
ko: {productname} 서버 및 프록시 인스턴스는 DNS 항목을 관리할 수 있는 네트워크 구성에서 실행해야 하지만 인터넷에서 전체적으로 액세스할 수 없습니다.
zh_cn: {productname} Server 和 Proxy 实例需在适当的网络配置中运行，该网络配置可让您控制 DNS 项，但无法通过因特网自由访问。

source: Within this network configuration DNS resolution must be provided: `hostname -f` must return the fully qualified domain name (FQDN).
cs: V rámci této konfigurace sítě musí být poskytnuto rozlišení DNS: `hostname -f` musí vrátit plně kvalifikovaný doménový název (FQDN).
ja: このネットワーク設定内では、DNSの解決を提供する必要があります。``hostname -f``は、完全修飾ドメイン名(FQDN)を返す必要があります。
ko: 이 네트워크 구성에서는 DNS 확인이 제공되어야 합니다. ``hostname -f``에서 FQDN(정규화된 도메인 이름)을 반환해야 합니다.
zh_cn: 在此网络配置中必须提供 DNS 解析：`hostname -f` 必须返回完全限定的域名 (FQDN)。

source: DNS resolution is also important for connecting clients.
cs: Rozřešení DNS je také důležité pro připojení klientů.
ja: DNSの解決は、クライアントを接続するためにも重要です。
ko: DNS 확인은 클라이언트 연결에도 중요합니다.
zh_cn: DNS 解析对于连接客户端也很重要。

source: DNS is dependent on the cloud framework you choose. Refer to the cloud provider documentation for detailed instructions.
cs: DNS závisí na Vámi zvoleném cloudovém rámci. Podrobné pokyny najdete v dokumentaci poskytovatele cloudu.
ja: DNSは、選択したクラウドフレームワークに依存しています。詳細な手順については、クラウドプロバイダのドキュメントを参照してください。
ko: DNS는 선택한 클라우드 프레임워크와 독립적입니다. 자세한 지침은 클라우드 공급자의 설명서를 참조하십시오.
zh_cn: DNS 取决于所选的云框架。有关详细说明，请参见云提供商文档。

source: We recommend that you locate software repositories, the server database, and the proxy squid cache on an external virtual disk. This prevents data loss if the instance is unexpectedly terminated. This section includes instructions for setting up an external virtual disk.
cs: Doporučujeme vyhledat úložiště softwaru, databázi serveru a mezipaměť proxy squid na externím virtuálním disku. To zabrání ztrátě dat, pokud je instance neočekávaně ukončena. Tato část obsahuje pokyny pro nastavení externího virtuálního disku.
ja: ソフトウェアリポジトリ、サーバデータベース、およびプロキシsquidキャッシュは外部仮想ディスクに配置することをお勧めします。こうすることによって、インスタンスが予期せずに終了した場合のデータ損失が防止されます。このセクションでは、外部仮想ディスクの設定方法の手順について説明します。
ko: 외부 가상 디스크에서 소프트웨어 리포지토리, 서버 데이터베이스 및 프록시 squid 캐시를 찾는 것이 좋습니다. 이를 수행하면 인스턴스가 예기치 않게 종료되는 경우 데이터 손실을 방지할 수 있습니다. 이 섹션에는 외부 가상 디스크를 설정하기 위한 지침이 포함되어 있습니다.
zh_cn: 我们建议将软件储存库、服务器数据库和代理 squid 缓存存储在外部虚拟磁盘上。这可以防止在实例意外终止时丢失数据。本节包含有关设置外部虚拟磁盘的说明。

source: When you use {productname} on a public cloud, you must use a restricted network. We recommend using a VPC private subnet with an appropriate firewall setting. Only machines in your specified IP ranges must be able to access the instance.
cs: Když používáte {productname} na veřejném cloudu, musíte použít neveřejnou síť. Doporučujeme použít soukromou podsíť VPC s příslušným nastavením brány firewall. K instanci musí mít přístup pouze stroje ve vašich zadaných rozsazích IP adres.
ja: パブリッククラウドで{productname}を使用する場合は、制限付きのネットワークを使用する必要があります。適切なファイアウォール設定でVPCプライベートサブネットを使用することをお勧めします。指定したIP範囲にあるマシンのみがインスタンスにアクセスできる必要があります。
ko: 공용 클라우드에서 {productname}를 사용하는 경우 제한 네트워크를 사용해야 합니다. 방화벽이 올바르게 설정된 VPC 개인 서브넷을 사용하는 것이 좋습니다. 지정된 IP 범위의 시스템만 인스턴스에 액세스할 수 있습니다.
zh_cn: 在公有云上使用 {productname} 时，必须使用受限制的网络。我们建议使用带有适当防火墙设置的 VPN 专用子网。只能允许指定 IP 范围内的计算机访问该实例。

source: Running {productname} on the public cloud means implementing robust security measures. It is essential to limit, filter, monitor, and audit access to the instance. {SUSE} strongly advises against a globally accessible {productname} instance that lacks adequate perimeter security.
ja: パブリッククラウド上で{productname}を実行するということは、堅牢なセキュリティ対策を実装することを意味します。インスタンスへのアクセスを制限、フィルタ、監視、監査することが不可欠です。{SUSE} は、適切な境界セキュリティが欠如しているグローバルにアクセス可能な{productname}インスタンスを使用しないことを強くお勧めします。
ko: 퍼블릭 클라우드에서 {productname}을 실행하면 강력한 보안 조치를 구현할 수 있습니다. 인스턴스에 대한 액세스 제한, 필터링, 모니터링 및 감사 기능은 필수 기능입니다. {SUSE}는 적절한 경계 보안이 부족한 전역 액세스 {productname} 인스턴스를 사용하지 않을 것을 강력하게 권장됩니다.
zh_cn: 在公有云上运行 {productname} 意味着需要实施强大的安全措施。限制、过滤、监控并审计对实例的访问至关重要。{SUSE} 强烈建议不要配置全球均可访问但缺少充足边界安全保护的 {productname} 实例。

source: To access the {productname} {webui}, allow HTTPS when configuring the network access controls. This allows you to access the {productname} {webui}.
cs: Chcete-li získat přístup k {productname} {webui}, povolte HTTPS při konfiguraci řízení přístupu k síti. To Vám umožní dostat se k {productname} {webui}.
ja: {productname}の{webui}にアクセスするには、ネットワークアクセス制御を設定するときにHTTPSを許可します。そうすると、{productname}の{webui}にアクセスできます。
ko: {productname} {webui}에 액세스하려면, 네트워크 액세스 제어를 구성할 때 HTTPS를 허용하십시오. 이렇게 하면 {productname} {webui}에 액세스할 수 있습니다.
zh_cn: 要访问 {productname} {webui}，请在配置网络访问控制时允许 HTTPS。这将允许您访问 {productname} {webui}。

source: In EC2 and Azure, create a new security group, and add inbound and outbound rules for HTTPS. In GCE, check the ``Allow HTTPS traffic`` box under the ``Firewall`` section.
cs: V EC2 a Azure vytvořte novou skupinu zabezpečení a přidejte příchozí a odchozí pravidla pro HTTPS. V GCE zkontrolujte možnost ``Allow HTTPS traffic`` v sekci ``Firewall``.
ja: EC2およびAzureでは、新しいセキュリティグループを作成し、HTTPSの着信および受信のルールを追加します。GCEでは、［``ファイアウォール``］セクションで［``HTTPSトラフィックを許可する``］ボックスにチェックを付けます。
ko: EC2 및 Azure에서 새 보안 그룹을 만들고 HTTPS에 대한 인바운드 및 아웃바운드 규칙을 추가합니다. GCE에서 ``방화벽`` 섹션 아래의 ``HTTPS 트래픽 허용`` 상자를 선택합니다.
zh_cn: 在 EC2 和 Azure 中，创建一个新安全组，并添加 HTTPS 入站和出站规则。在 GCE 中，选中``防火墙``部分下的``允许 HTTPS 流量``复选框。

source: Prepare Storage Volumes
ja: ストレージボリュームの準備
ko: 스토리지 볼륨 준비
zh_cn: 准备存储卷

source: We recommend that the repositories and the database for {productname} are stored on separate storage devices from the root volume. This will help to avoid data loss and possibly increase performance.
ja: リポジトリと{productname}のデータベースは、ルートボリュームとは別のストレージデバイスに保存することをお勧めします。こうするとデータの損失が防止され、パフォーマンスが向上する可能性があります。
ko: {productname}용 리포지토리와 데이터베이스를 루트 볼륨과 별도의 스토리지 장치에 저장하는 것이 좋습니다. 이렇게 하면 데이터 손실을 방지하고 성능을 향상하는 데 도움이 됩니다.
zh_cn: 我们建议将 {productname} 的储存库和数据库存储在不同于根卷的存储设备上。这有助于避免丢失数据，有时还可以提高性能。

source: The {productname} container utilizes default storage locations. These locations should be configured prior to deployment for custom storage. For more information see xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[Persistent container volumes]
ja: {productname}コンテナはデフォルトのストレージの場所を利用します。これらの場所は、カスタムストレージ用の配備前に設定する必要があります。詳細については、xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[永続コンテナのボリューム]を参照してください
ko: {productname} 컨테이너는 기본 스토리지 위치를 사용합니다. 이러한 위치는 사용자 정의 스토리지를 배포하기 전에 구성해야 합니다. 자세한 내용은 xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[영구 컨테이너 볼륨]에서 확인할 수 있습니다.
zh_cn: {productname} 容器利用默认存储位置。应在部署之前为自定义存储配置这些位置。有关详细信息，请参见xref:installation-and-upgrade:container-management/persistent-container-volumes.adoc[永久性容器卷]

source: Do not use logical volume management (LVM) for public cloud installations.
ja: パブリッククラウドへのインストールでは論理ボリューム管理(LVM)を使用しないでください。
ko: 공용 클라우드 설치에는 논리적 볼륨 관리(LVM)를 사용하지 않아야 합니다.
zh_cn: 不要使用逻辑卷管理 (LVM) 进行公有云安装。

source: The size of the disk for repositories storage is dependent on the number of distributions and channels you intend to manage with {productname}. When you attach the virtual disks, they will appear in your instance as Unix device nodes. The names of the device nodes will vary depending on your provider, and the instance type selected.
cs: Velikost disku pro paměti úložišť závisí na počtu distribucí a kanálů, které chcete spravovat v {productname}. Když připojíte virtuální disky, zobrazí se ve vaší instanci jako uzly zařízení Unix. Názvy uzlů zařízení se budou lišit v závislosti na poskytovateli a vybraném typu instance.
ja: リポジトリストレージのディスクのサイズは、{productname}で管理するディストリビューションおよびチャンネルの数によって決まります。仮想ディスクを接続すると、Unixデバイスノードとしてインスタンスに表示されます。デバイスノードの名前は、選択インスタンスの種類とプロバイダによって異なります。
ko: 리포지토리 저장소를 위한 디스크 크기는 {productname}로 관리할 배포 및 채널 수에 따라 다릅니다. 가상 디스크를 연결하면 인스턴스에 Unix 장치 노드로 표시됩니다. 장치 노드의 이름은 공급자 및 선택한 인스턴스 유형에 따라 다릅니다.
zh_cn: 用于存储储存库的磁盘大小取决于您要使用 {productname} 管理的发行套件和通道数目。挂接虚拟磁盘时，它们将作为 Unix 设备节点显示在实例中。设备节点的名称因提供商及所选实例类型而异。

source: Ensure the root volume of the {productname} Server is 100{nbsp}GB or larger. Add an additional storage disk of 500{nbsp}GB or more, and choose SSD storage if you can. The cloud images for {productname} Server use a script to assign this separate volume when your instance is launched.
cs: Ujistěte se, že kořenový svazek serveru {productname} je aspoň 100{nbsp}GB. Přidejte další úložný disk aspoň 500{nbsp}GB a zvolte pokud možno SSD. Cloudové obrazy {productname} Serveru používají skript pro přiřazení tohoto samostatného svazku při spouštění Vaší instance.
ja: {productname}サーバのルートボリュームが100{nbsp}GB以上であることを確認してください。500{nbsp}GB以上のストレージディスクを追加し、可能な場合にはSSDストレージを選択します。{productname}サーバのクラウドイメージは、スクリプトを使用して、インスタンス起動時にこの個別ボリュームを割り当てます。
ko: {productname} 서버의 루트 볼륨이 100GB 이상인지 확인합니다. 500GB 이상의 추가 저장소 디스크를 추가하고 가능하면 SSD 저장소를 선택하십시오. {productname} 서버의 클라우드 이미지는 인스턴스가 시작될 때 스크립트를 사용하여 별도의 볼륨을 할당합니다.
zh_cn: 确保 {productname} 服务器的根卷大小不少于 100{nbsp}GB。如果可能，请另外添加一个 500{nbsp}GB 或以上大小的存储磁盘，并选择 SSD 存储类型。当您的实例启动时，{productname} 服务器的云映像会使用脚本来指派这个单独的卷。

source: When you launch your instance, you can log in to the {productname} Server and use this command to find all available storage devices:
cs: Po spuštění své instance se můžete přihlásit k {productname} Serveru a vyhledat všechna dostupná úložná zařízení příkazem:
ja: インスタンスを起動すると、{productname}サーバにログインし、次のコマンドを使用して、利用可能なすべてのストレージデバイスを検索できます。
ko: 인스턴스를 시작할 때 {productname} 서버에 로그인하고 이 명령을 사용하여 사용 가능한 모든 저장소 장치를 찾을 수 있습니다.
zh_cn: 启动实例后，您便可登录 {productname} 服务器，并使用以下命令查找所有可用的存储设备：

source: If you are not sure which device to choose, use the [command]``lsblk`` command to see the name and size of each device. Choose the name that matches with the size of the virtual disk you are looking for.
cs: Pokud si nejste jisti, které zařízení zvolíte, použijte příkaz [command]``lsblk`` pro zobrazení názvu a velikosti každého zařízení. Vyberte název, který odpovídá velikosti virtuálního disku, který hledáte.
ja: 選択したデバイスがわからない場合、[command]``lsblk``コマンドを使用して、各デバイスの名前およびサイズを確認します。 探している仮想ディスクのサイズと一致している名前を選択します。
ko: 선택해야 할 장치가 확실하지 않은 경우 [command]``lsblk`` 명령을 사용하여 각 장치의 이름과 크기를 확인하십시오. 찾고 있는 가상 디스크의 크기와 일치하는 이름을 선택하십시오.
zh_cn: 如果您不确定应选择哪个设备，可使用 [command]``lsblk`` 命令查看每个设备的名称和大小。请选择与要寻找的虚拟磁盘大小匹配的名称。

source: You can set up the external disk with the [command]``mgr-storage-server`` command. This creates an XFS partition mounted at ``/manager_storage`` and uses it as the location for the database and repositories:
ja: [command]``mgr-storage-server``コマンドを使用して外部ディスクを設定できます。設定すると、XFSパーティションが``/manager_storage``にマウントされ、データベースおよびリポジトリの場所として使用されます。
ko: [command]``mgr-storage-server`` 명령어로 외부 디스크를 설정할 수 있습니다. 그러면 ``/manager_storage``에 마운트된 XFS 파티션이 생성되고 이를 데이터베이스 및 리포지토리의 위치로 사용합니다.
zh_cn: 可以使用 [command]``mgr-storage-server`` 命令设置外部磁盘。这会创建一个挂载到 ``/manager_storage`` 的 XFS 分区，并使用它作为存储数据库和储存库的位置：

source: For more information about setting up storage volumes and partitions, including recommended minimum sizes, see xref:installation-and-upgrade:hardware-requirements.adoc[].
ja: ストレージボリュームおよびパーティションの設定(推奨最小サイズを含む)の詳細については、xref:installation-and-upgrade:hardware-requirements.adoc[]を参照してください。
ko: 권장 최소 크기 등 저장소 볼륨 및 파티션에 대한 자세한 내용은 xref:installation-and-upgrade:hardware-requirements.adoc[]에서 참조하십시오.
zh_cn: 有关设置存储卷和分区的详细信息（包括建议的最小大小），请参见 xref:installation-and-upgrade:hardware-requirements.adoc[]。

source: The following tables specify the minimum server and proxy requirements.
ja: 次の表では、サーバとプロキシの最低要件を指定しています。
ko: 다음 테이블은 최소 서버 및 프록시 요구사항을 지정합니다.
zh_cn: 下表指定了服务器和代理的最低要求。

source: Do not use NFS for storage because it does not support SELinux file labeling.
ja: NFSはSELinuxのファイルラベル付けをサポートしていないため、NFSをストレージに使用しないでください。
zh_cn: 请勿使用 NFS 存储数据，因为它不支持 SELinux 文件标记。

source: Server Requirements for {x86_64} Architecture
ja: {x86_64}アーキテクチャのサーバ要件
ko: {x86_64} 아키텍처에 대한 서버 요구사항
zh_cn: {x86_64} 体系结构的服务器要求

source: 50{nbsp}GB for each {suse} product and Package Hub
ja: 各{suse}製品およびPackage Hubでは50GB
ko: 각 {suse} 제품 및 Package Hub당 50{nbsp}GB
zh_cn: 每个 {suse} 产品和软件包中心 50{nbsp}GB

source: 360{nbsp}GB for each {redhat} product | | [path]``/var/cache`` | Minimum 10{nbsp}GB. Add 100{nbsp}MB per {suse} product, 1{nbsp}GB per {redhat} or other product. Double the space if the server is an ISS Master. | | Swap space | 3{nbsp}GB
ja: 各{redhat}製品では360{nbsp}GB | | [path]``/var/cache`` | 10{nbsp}GB以上。 {suse}製品あたり100{nbsp}MB、{redhat}または他の製品あたり1{nbsp}GBを追加します。 サーバがISSマスタである場合は容量を倍増します。 | | スワップ容量 | 3{nbsp}GB
ko: 각 {redhat} 제품당{nbsp}360GB | | [path]``/var/cache`` | 최소 10{nbsp}GB. {suse} 제품당{nbsp}100MB, {redhat} 또는 기타 제품당{nbsp}1GB를 추가합니다. 서버가 ISS 마스터인 경우 공간을 두 배로 늘립니다. | | 공간 스왑 | 3GB{nbsp}
zh_cn: 为每个 {redhat} 产品提供 360{nbsp}GB 空间 | | [path]``/var/cache`` | 至少 10{nbsp}GB 空间。 为每个 {suse} 产品增加 100{nbsp}MB 空间，为每个 {redhat} 或其他产品增加 1{nbsp}GB 空间。 如果服务器为 ISS 主服务器，则空间需要翻倍。 | | 交换空间 | 3{nbsp}GB

source: {productname} Proxy caches packages in the [path]``/var/cache/`` directory. If there is not enough space available in [path]``/var/cache/``, the proxy will remove old, unused packages and replace them with newer packages.
cs: {productname} Proxy ukládá balíčky do adresáře [path]``/var/cache/``. Není-li v [path]``/var/cache/`` k dispozici dostatek místa, proxy server odebere staré a nepoužívané balíčky a nahradí je novějšími.
ja: {productname}プロキシは、[path]``/var/cache/``ディレクトリにパッケージをキャッシュします。 [path]``/var/cache/``の容量が不足している場合、プロキシは、使用されていない古いパッケージを削除し、新しいパッケージに置き換えます。
ko: {productname} 프록시는 [path]``/var/cache/`` 디렉토리에 패키지를 캐시합니다. [path]``/var/cache/``의 공간이 부족한 경우 프록시는 사용되지 않는 오래된 패키지를 제거한 후 새 패키지로 교체합니다.
zh_cn: {productname} Proxy 将软件包缓存在 [path]``/var/cache/`` 目录中。如果 [path]``/var/cache/`` 中的可用空间不足，代理将去除旧的未使用软件包，并将其替换为较新的软件包。

source: The larger [path]``/var/cache/`` directory is on the proxy, the less traffic there will be between it and the {productname} Server.
cs: Čím větší adresář [path]``/var/cache/`` je na proxy serveru, tím menší provoz bude mezi ním a provozním serverem {productname}.
ja: プロキシ上の[path]``/var/cache/``ディレクトリの容量を大きくすると、このディレクトリと{productname}サーバ間のトラフィックが少なくなります。
ko: 프록시에서 [path]``/var/cache/``디렉토리에 더 많은 공간이 확보되고 프록시와 {productname} 서버 간의 트래픽이 감소합니다.
zh_cn: 代理上的 [path]``/var/cache/`` 目录越大，代理与 {productname} 服务器之间的流量就越少。

source: By making the [path]``/var/cache/`` directory on the proxy the same size as [path]``/var/spacewalk/`` on the {productname} Server, you avoid a large amount of traffic after the first synchronization.
cs: Vytvořením adresáře [cesta] ``/var/cache/`` na serveru proxy o stejné velikosti jako [cesta]``/var/spacewalk/`` na serveru {productname} se vyhnete velkému provozu po první synchronizaci.
ja: プロキシ上の[path]``/var/cache/``ディレクトリを{productname}サーバ上の[path]``/var/spacewalk/``と同じサイズにすることで、最初に同期した後のトラフィック量の増大が防止されます。
ko: 프록시에서 [path]``/var/cache/``디렉토리의 크기와 {productname} 서버에서 [path]``/var/spacewalk/``의 크기를 동일하게 설정하면, 최초 동기화 후 대규모 트래픽이 발생하는 것을 방지할 수 있습니다.
zh_cn: 使代理上的 [path]``/var/cache/`` 目录与 {productname} 服务器上的 [path]``/var/spacewalk/`` 保持相同的大小，可以避免在首次同步后出现大量的流量。

source: The [path]``/var/cache/`` directory can be small on the {productname} Server compared to the proxy.
cs: Adresář [path]``/var/cache/`` může být na serveru {productname} menší než na proxy.
ja: [path]``/var/cache/``ディレクトリは、{productname}サーバ上ではプロキシと比べて小さくできます。
ko: {productname} 서버의 [path]``/var/cache/`` 디렉토리는 프록시에 비해 작을 수 있습니다.
zh_cn: {productname} 服务器上的 [path]``/var/cache/`` 目录相比代理上的目录可能较小。

source: For a guide to size estimation, see the <<server-hardware-requirements>> section.
cs: Průvodce odhadem velikosti najdete v části <<server-hardware-requirements>> (hardwarové požadavky na server).
ja: サイズの推測のガイドについては、<<server-hardware-requirements>> セクションを参照してください。
ko: 크기 예상에 대한 설명은 <<server-hardware-requirements>> 섹션을 참조하십시오.
zh_cn: 有关大小估算的指导，请参见 <<server-hardware-requirements>> 一节。

source: Installation, Deployment and Upgrade {productname} {productnumber}
zh_cn: 安装、部署和升级 {productname} {productnumber}

source: Create an Activation Key for the Proxy
ja: プロキシのアクティベーションキーの作成
ko: 프록시용 활성화 키 생성
zh_cn: 为代理创建激活密钥

source: Procedure: Creating an Activation Key
ja: プロシージャ: アクティベーションキーの作成
ko: 절차: 활성화 키 만들기
zh_cn: 过程：创建激活密钥

source: Navigate to menu:Systems[Activation Keys] , and click btn:[Create key].
zh_cn: 导航到menu:系统[激活密钥]，然后单击 btn:[创建密钥]。

source: Create an activation key for the proxy host with {sl-micro} {microversion} or {sles} {bci-mlm} as the parent channel. This key should include all recommended channels and the proxy as an extension child channel.
zh_cn: 为代理主机创建激活密钥，并使用 {sl-micro} {microversion} 或 {sles} {bci-mlm} 作为父通道。该密钥应包含所有建议的通道，并包含代理作为扩展子通道。

source: Proceed to boostrapping the proxy host as a [systemitem]``default`` client.
ja: 続行して、プロキシホストを[systemitem]``デフォルト``クライアントとしてブートストラップします。
ko: 프록시 호스트를 [systemitem]``기본`` 클라이언트로 부스트래핑을 진행합니다.
zh_cn: 继续将代理主机作为 [systemitem]``default`` 客户端进行引导。

source: Bootstrap the Proxy Host as a Client
ja: クライアントとしてのプロキシホストのブートストラップ
ko: 프록시 호스트를 클라이언트로 부트스트랩
zh_cn: 将代理主机作为客户端进行引导

source: Procedure: Bootstrapping the Proxy Host
ja: プロシージャ: プロキシホストのブートストラップ
zh_cn: 过程：引导代理主机

source: Fill in the fields for your proxy host.
ja: プロキシホストのフィールドに入力します。
ko: 프록시 호스트의 필드를 입력합니다.
zh_cn: 填写代理主机的相关字段。

source: Select the activation key created in the previous step from the drop-down.
ja: ドロップダウンから、前のステップで作成したアクティベーションキーを選択します。
ko: 드롭다운에서 이전 단계에서 생성한 활성화 키를 선택합니다.
zh_cn: 从下拉列表中选择上一步骤中创建的激活密钥。

source: Click btn:[Bootstrap].
ja: Click btn:[ブートストラップ]をクリックします。
ko: btn:[부트스트랩]을 클릭합니다.
zh_cn: 单击 btn:[引导]。

source: Wait for the bootstrap process to complete successfully. Check the menu:Salt[] menu and confirm the {salt} key is listed and accepted.
ja: ブートストラッププロセスが完了するまで待ちます。menu:Salt[]メニューをチェックし、{salt}キーが一覧表示されていて受け入れられていることを確認します。
ko: 부트스트랩 프로세스가 완료될 때까지 기다립니다. menu:Salt[] 메뉴를 선택한 후 {salt} 키가 나열되고 수락되었는지 확인합니다.
zh_cn: 等待引导过程成功完成。检查 menu:Salt[] 菜单，确认 {salt} 密钥已列出并已接受。

source: Reboot the proxy host if the operating system is {sl-micro}.
ko: 운영 체제가 {sl-micro}인 경우 프록시 호스트를 재부팅합니다.
zh_cn: 如果操作系统是 {sl-micro}，则重引导代理主机。

source: Select the host from the menu:System[] list and trigger a second reboot in case of {sl-micro} after all events are finished to conclude the onboarding.
ko: menu:시스템[] 목록에서 호스트를 선택하고 모든 이벤트가 완료된 후 {sl-micro}의 경우 두 번째 재부팅을 트리거하여 온보딩을 완료합니다.
zh_cn: 从menu:系统[]列表中选择主机，并在所有事件完成后再次触发重引导（如果是 {sl-micro} 系统）以完成初始配置。

source: Procedure: Updating the Proxy Host
ja: プロシージャ: プロキシホストの更新
zh_cn: 过程：更新代理主机

source: Database Backup Volume
ko: 데이터베이스 백업 볼륨
zh_cn: 数据库备份卷

source: Server migration or upgrade with [command]``mgradm migration`` or [command]``mgradm upgrade`` can create a volume with the database backup.
ko: [command]``mgradm migration`` 또는 [command]``mgradm upgrade``를 사용한 서버 마이그레이션 또는 업그레이드는 데이터베이스 백업과 함께 볼륨을 생성할 수 있습니다.
zh_cn: 通过 [command]``mgradm migration`` 或 [command]``mgradm upgrade`` 执行服务器迁移或升级时，会创建一个包含数据库备份的卷。

source: When the {postgresql} database version is increased, the old database must be stored in a separate location before running the upgrade. For this purpose [command]``mgradm`` dynamically creates the volume [path]``var-pgsql-backup``. When the migration or upgrade is done and the user has validated that the new system is working as expected, this volume can be removed safely.
ko: {postgresql} 데이터베이스 버전을 업그레이드할 때는 기존 데이터베이스를 별도의 위치에 백업해 두어야 합니다. 이를 위해 [command]``mgradm``이 [path]``var-pgsql-backup`` 볼륨을 동적으로 생성합니다. 마이그레이션 또는 업그레이드가 완료되고 새 시스템의 정상 작동을 사용자가 확인한 후에는 이 볼륨을 안전하게 제거할 수 있습니다.
zh_cn: 当 {postgresql} 数据库有更新的版本时，必须在执行升级流程前将旧数据库存储到单独的位置。为此，[command]``mgradm`` 会动态创建卷 [path]``var-pgsql-backup``。当迁移或升级完成且用户已验证新系统可按预期正常运行后，可安全去除该卷。

source: For the containerized {productname} Proxy, you must build a new proxy configuration file and then redeploy the container for the changes to take effect. This is the process for updating settings, including the SSL certificate.
ko: 컨테이너화된 {productname} 프록시의 경우 변경 사항을 적용하려면 새 프록시 구성 파일을 빌드한 다음 컨테이너를 다시 배포해야 합니다. 이는 SSL 인증서를 포함한 설정을 업데이트하는 프로세스입니다.
zh_cn: 对于容器化 {productname} 代理，您必须构建新的代理配置文件，然后重新部署容器以使更改生效。此流程适用于更新设置（包括 SSL 证书）。

source: For Podman deployment, the container host for the {productname} Proxy must be registered as a client to the {productname} Server prior to generating this proxy configuration.
ja: Podmanの配備では、このプロキシ設定を生成する前に、{productname}プロキシのコンテナホストを{productname}サーバにクライアントとして登録する必要があります。
ko: Podman 배포의 경우, 이 프록시 구성을 생성하기 전에 {productname} 프록시의 컨테이너 호스트가 {productname} 서버에 클라이언트로 등록되어 있어야 합니다.
zh_cn: 对于 Podman 部署，在生成此代理配置之前，必须将 {productname} 代理的容器主机作为客户端注册到 {productname} 服务器。

source: If a proxy FQDN is used to generate a proxy container configuration that is not a registered client (as in the Kubernetes use case), a new system entry will appear in system list. This new entry will be shown under previously entered Proxy FQDN value and will be of [literal]``Foreign`` system type.
ja: プロキシFQDNを使用して、登録済みのクライアントではないプロキシコンテナ設定を生成すると(Kubernetesのユースケースと同様)、新しいシステムエントリがシステム一覧に表示されます。この新しいエントリは、以前に入力されたプロキシFQDN値の下に表示され、[literal]``外部``システムタイプになります。
ko: 프록시 FQDN을 사용하여 등록된 클라이언트가 아닌 프록시 컨테이너 구성을 생성하는 경우(Kubernetes 사용 사례와 같이), 시스템 목록에 새 시스템 항목이 표시됩니다. 이 새 항목은 이전에 입력한 프록시 FQDN 값 아래에 표시되며 시스템 유형은 [literal]``외부``입니다.
zh_cn: 如果使用代理 FQDN 生成非注册客户端的代理容器配置（如 Kubernetes 用例中那样），系统列表中将出现一个新的系统项。此新项将显示在之前输入的“代理 FQDN”值下方并属于[literal]``外部``系统类型。

source: Generate the Proxy Configuration with {webui}
ja: {webui}を使用したプロキシ設定の生成
ko: {webui}를 사용하여 프록시 구성 생성
zh_cn: 使用 {webui} 生成代理配置
