Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/installation-and-upgrade/*.po
Languages: cs, ja, ko, zh_cn

source: The supported operating system for the container host are {sle-micro} {microversion} and {sles} {bci-suma}.
ja: コンテナホストでサポートされているオペレーティングシステムは{sle-micro} {microversion}と{sles} {bci-suma}です。

source: This section presumes that you have already entered your organization credentials under the menu:Admin[Setup Wizard -> Organization Credentials] in the server's {webui}. Products are listed on the menu:Admin[Setup Wizard -> Products] page. This channel must be fully synchronized on the server, with the child channel [systemitem]``Proxy`` as an extension option selected.
ja: このセクションは、サーバの{webui}のmenu:管理[セットアップウィザード -> 組織の資格情報]で組織の資格情報を入力済みであることを想定しています。製品は、menu:管理[セットアップウィザード -> 製品]ページに一覧表示されます。このチャンネルは、子チャンネルの［[systemitem]``Proxy`` as an extension (プロキシを子チャンネルとして)］オプションを選択した状態で、サーバ上で完全に同期する必要があります。

source: Procedure: Synchronizing the Proxy Parent Channel and Proxy Extension
ja: プロシージャ: プロキシの親チャンネルとプロキシ拡張機能の同期

source: From the products page enter {sle-micro} in the filter field.
ja: ［製品］ページから、フィルタフィールドに「{sle-micro}」入力します。

source: In the [systemitem]``Product Description`` field select the {sle-micro} {microversion} checkbox then use the drop-down to select the [systemitem]``SUSE Manager Proxy Extension 5.0 x86_64`` extension.
ja: [systemitem]``製品説明``フィールドで［{sle-micro} {microversion} ］チェックボックスをオンにし、ドロップダウンを使用して[systemitem]``SUSE Manager Proxy Extension 5.0 x86_64``拡張機能を選択します。

source: Deploy {productname} Proxy on {sle-micro} {microversion}
ja: {sle-micro} {microversion}に{productname}プロキシを配備する

source: Procedure: Downloading the Installation Media
ja: プロシージャ: インストールメディアのダウンロード

source: Locate the {sle-micro} {microversion} installation media at https://www.suse.com/download/sle-micro/.
ja: link:https://www.suse.com/download/sle-micro/[]で{sle-micro} {microversion}のインストールメディアを見つけます。

source: You will need an account with {scclongform} and must be logged in to download the ISO.
ja: ISOをダウンロードするには、{scclongform}のアカウントが必要で、ログインしている必要があります。

source: Download [filename]``SLE-Micro-5.5-DVD-x86_64-GM-Media1.iso``.
ja: [filename]``SLE-Micro-5.5-DVD-x86_64-GM-Media1.iso``をダウンロードします。

source: Prepare a USB flash disk or DVD for installation.
ja: インストール用のUSBフラッシュディスクまたはDVDを準備します。

source: Insert a DVD or a bootable USB stick containing the installation image for {sle-micro} {microversion}.
ja: {sle-micro} {microversion}のインストールイメージを含むDVDまたは起動可能なUSBスティックを挿入します。

source: For detailed documentation on preparing your machines OS (virtual or physical), see link:https://documentation.suse.com/sle-micro/5.5/html/SLE-Micro-all/book-deployment-slemicro.html[{sle-micro} {microversion} Deployment Guide].
ja: マシンのOS (仮想または物理)の準備に関する詳しいドキュメントについては、link:https://documentation.suse.com/sle-micro/5.5/html/SLE-Micro-all/book-deployment-slemicro.html[{sle-micro} {microversion} Deployment Guide]を参照してください。

source: Procedure: Installing {sle-micro} {microversion}
ja: プロシージャ: {sle-micro} {microversion}のインストール

source: Adjust Keyboard and language. Click the [systemitem]``checkbox`` to accept the license agreement.
ja: キーボードと言語を調整します。[systemitem]``チェックボックス``をクリックしてライセンス契約に同意します。

source: Select your registration method. For this example, we will register the proxy with {scclongform}.
ja: 登録方法を選択します。この例では、{scclongform}でプロキシを登録します。

source: Enter your {scclongform} Email address.
ja: {scclongform}の電子メールアドレスを入力します。

source: Enter your registration code for {sle-micro} {microversion}.
ja: {sle-micro} {microversion}の登録コードを入力します。

source: On the [systemitem]``Extension and Module Selection`` page uncheck the **Hide Development Versions** checkbox.
ja: [systemitem]``拡張とモジュールの選択``ページで、**開発版を隠す**チェックボックスをオフにします。

source: Select the {productname} {productnumber} Proxy extension [systemitem]``Checkbox``.
ja: {productname} {productnumber}プロキシ拡張機能の[systemitem]``チェックボックス``をオンにします。

source: Enter your {productname} {productnumber} Proxy extension registration code.
ja: {productname} {productnumber}プロキシ拡張機能の登録コードを入力します。

source: This finalizes installation of {sle-micro} {microversion} and {productname} {productnumber} Proxy as an extension.
ja: これにより、拡張機能としての{sle-micro} {microversion}および{productname} {productnumber}プロキシのインストールが終了します。

source: Update the System
ja: システムの更新

source: Procedure: Updating the System
ja: プロシージャ: システムの更新

source: Install the container utilities:
ja: コンテナユーティリティをインストールします。

source: Deploy {productname} Proxy on {sles} {bci-suma}
ja: {sles} {bci-suma}に{productname}プロキシを配備する

source: Alternatively, you can install {productname} Proxy on {sles} {bci-suma}. The following procedure describes the main steps of the installation process.
ja: または、{sles} {bci-suma}に{productname}プロキシをインストールすることもできます。以下の手順では、インストールプロセスの主な手順について説明します。

source: Procedure: Installing {productname} Proxy on {sles} {bci-suma}
ja: プロシージャ: {sles} {bci-suma}への{productname}プロキシのインストール

source: Locate and download {sles} {bci-suma} [literal]``.iso`` at https://www.suse.com/download/sles/.
ja: link:https://www.suse.com/download/sles/[]で{sles} {bci-suma} [literal]``.iso``を見つけてダウンロードします。

source: Make sure that the {scc} code you plan to use has the Extensions enabled.
ja: 使用する予定の{scc}コードで拡張機能が有効になっていることを確認します。

source: Start the installation of {sles} {bci-suma}.
ja: {sles} {bci-suma}のインストールを開始します。

source: Select the registration method.
ja: 登録方法を選択します。

source: {productname} Proxy Extension
ja: {productname}プロキシ拡張機能

source: As root, run
ja: rootとして、次のコマンドを実行します。

source: This step is optional. However, if custom persistent storage is required for your infrastructure, use the [command]``mgr-storage-proxy`` tool. This tool simplifies creating the container storage and Squid cache volumes.
ja: このステップはオプションです。ただし、ご使用のインフラストラクチャにカスタム永続ストレージが必要な場合は、[command]``mgr-storage-proxy``ツールを使用します。このツールを使用すると、コンテナ ストレージとSquidキャッシュボリュームの作成が容易になります。

source: For more information, type:
ja: 詳細については、次のコマンドを入力します。

source: The preferred method for deploying {productnumber} Proxy is to use one of the following available images. All tools are included in these images simplifying deployment.
ja: {productnumber}プロキシを配備する際に推奨される方法は、利用可能な次のイメージの1つを使用することです。これらのイメージにはすべてのツールが含まれており、配備が容易になります。

source: For more information on preparing raw images, see:
ja: 生イメージの準備の詳細については、以下を参照してください。

source: For additional information on the self install images, see:
ja: セルフインストールイメージの詳細については、以下を参照してください。

source: 2+<| KVM Settings | Installation Method | Import Existing Disk Image | OS: | Linux | Version: | {productname}-Proxy.x86_64-5.0.0-*.qcow2 | Memory: | 2 GB (minimum) | CPU's: | 2 | Storage Format: | _.qcow2_ 40 GB (Default) Root Partition | Name: | test-setup | Network | Bridge _br0_
ja: 2+<| KVMの設定 | インストール方法 | 既存のディスクイメージのインポート | OS: | Linux | バージョン: | {productname}-Proxy.x86_64-5.0.0-*.qcow2 | メモリ: | 2GB (最小) | CPU: | 2 | ストレージフォーマット: | _.qcow2_ 40GB (デフォルト)ルートパーティション | 名前: | test-setup | ネットワーク | Bridge _br0_

source: Configure RAM and number of CPUs (at least 16 GB RAM and 4 CPUs).
ja: RAMおよびCPU数を設定します(少なくとも16GBのRAMおよび4つのCPU)。

source: The preferred method for deploying {productname} Proxy is to use one of the following available images. All tools are included in these images greatly simplifying deployment.
ja: {productname}プロキシを配備する際に推奨される方法は、利用可能な次のイメージの1つを使用することです。これらのイメージにはすべてのツールが含まれており、配備が大幅に容易になります。

source: This sections describes VMware configurations, focusing on the creation of an extra virtual disk essential for the {productname} Proxy storage partition within VMware environments.
ja: このセクションでは、VMware環境内の{productname}プロキシストレージパーティションに不可欠な追加の仮想ディスクの作成に重点を置いて、 VMware設定について説明します。

source: {productname} Proxy is supported on K3s running on top of {sle-micro} in a single node cluster. If you need to deploy it in any other Kubernetes environment, please contact support for evaluation.
ja: {productname}プロキシは、シングルノードクラスタの{sle-micro}上で実行されるK3sでサポートされます。他のKubernetes環境に配備する必要がある場合は、サポートに連絡して評価を依頼してください。

source: To install it run:
ja: インストールするには、次のコマンドを実行します。

source: Create the configuration for the {productname} Proxy as documented in xref:installation-and-upgrade:container-deployment/suma/proxy-deployment-suma.adoc[]. Copy the configuration [literal]``tar.gz`` file and then install:
ja: xref:installation-and-upgrade:container-deployment/suma/proxy-deployment-suma.adoc[]に記載されているように、{productname}プロキシの設定を作成します。設定[literal]``tar.gz``ファイルをコピーしてインストールします。

source: Proxy Migration
ja: プロキシの移行

source: In {productname} 4.3, the proxy can be deployed using three different methods: RPM based, containerized running on podman or k3s.
ja: {productname} 4.3では、RPMベース、Podman上でのコンテナ化、またはk3s上でのコンテナ化の3つの方法を使用してプロキシを配備できます。

source: In {productname} {productnumber}, management of the containerized proxy running with podman was re-designed and made simpler with the [command]``mgrpxy`` tool. At the same time, RPM based support was removed, and only the containerized version running with podman or k3s is supported.
ja: {productname} {productnumber}では、Podmanで実行されるコンテナ化されたプロキシの管理が再設計され、[command]``mgrpxy``ツールで簡単に管理できるようになりました。同時に、RPMベースのサポートは削除され、Podmanまたはk3sで実行されるコンテナ化されたバージョンのみがサポートされるようになりました。

source: This section describes migrating from Proxy 4.3 using the [command]``mgrpxy`` tool.
ja: このセクションでは、[command]``mgrpxy``ツールを使用したプロキシ4.3からの移行について説明します。

source: An in-place migration from {productname} 4.3 to 5.0 is unsupported because the host operating system has changed from {sles} 15 SP4 to {sle-micro} {microversion}.
ja: ホストオペレーティングシステムが{sles} 15 SP4から{sle-micro} {microversion}に変更されたため、{productname} 4.3から5.0へのインプレース移行はサポートされていません。

source: The traditional contact protocol is no longer supported in {productname} 5.0 and later. Before migrating from {productname} 4.3 to {productnumber}, any existing traditional clients including the traditional proxies must be migrated to {salt}.
ja: 従来の接続プロトコルは、{productname} 5.0移行ではサポートされなくなりました。Before migrating from {productname} 4.3から{productnumber}に移行する前に、従来のプロキシを含む既存の従来のクライアントを{salt}に移行する必要があります。

source: For more information about migrating to {salt} clients, see https://documentation.suse.com/suma/4.3/en/suse-manager/client-configuration/contact-methods-migrate-traditional.html
ja: {salt}クライアントへの移行の詳細については、link:https://documentation.suse.com/suma/4.3/en/suse-manager/client-configuration/contact-methods-migrate-traditional.html[]を参照してください。

source: Deploy a New {productname} Proxy
ja: 新しい{productname}プロキシの配備

source: Because in-place migration is not supported, the users must deploy a new {productname} proxy with a new FQDN.
ja: インプレース移行はサポートされていないため、新しいFQDNを使用して新しい{productname}プロキシを配備する必要があります。

source: For more information about installing {productname} Proxy, see xref:installation-and-upgrade:install-proxy.adoc[].
ja: {productname}プロキシのインストールの詳細については、xref:installation-and-upgrade:install-proxy.adoc[]を参照してください。

source: Migrate Clients to the New Proxy
ja: 新しいプロキシへのクライアントの移行

source: Before migrating the clients, ensure that the new proxy is already deployed and fully functional.
ja: クライアントを移行する前に、新しいプロキシが配備済みで完全に機能することを確認します。

source: Procedure: Migrating Client Between Proxies
ja: プロシージャ: プロキシ間でクライアントを移行する

source: From the left navigation, select menu:Systems[Systems List].
ja: 左側のナビゲーションから、:システム[システム一覧]を選択します。

source: Navigate to the old 4.3 proxy page, and click the [guimenu]``Proxy`` tab.
ja: 古い4.3プロキシのページに移動し、［[guimenu]``プロキシ``］タブを選択します。

source: Select all systems to "SSM".
ja: 「SSM」に対するすべてのシステムを選択します。

source: From the left navigation, select menu:Systems[System Set Manager].
ja: 左側のナビゲーションから、menu:システム[システムセットマネージャ]を選択します。

source: Select the sub-menu menu:Misc[Proxy].
ja: サブメニューのmenu:その他[プロキシ]を選択します。

source: From the drop-down select the new proxy to migrate to.
ja: ドロップダウンから、移行先の新しいプロキシを選択します。

source: Click btn:[Change Proxy].
ja: btn:[プロキシの変更]をクリックします。

source: All selected clients will now be migrated to the new proxy. You can check the schedule progress to verify if all clients were successfully migrated.
ja: 選択したすべてのクライアントが新しいプロキシに移行されます。スケジュールの進行状況をチェックして、すべてのクライアントが正常に移行されたかどうかを確認できます。

source: After a few minutes, the clients will start to show up the new connection path. When all clients have the connection path under the new proxy, the old 4.3 proxy system is not needed anymore and can be removed.
ja: 数分後、クライアントに新しい接続パスが表示され始めます。すべてのクライアントに新しいプロキシ下の接続パスが設定されたら、古い4.3 のプロキシシステムは不要なので削除できます。

source: What is Air-gapped Deployment?
ja: Air-gapped配備とは何ですか?

source: For more information about installing {productname} Server Virtual Machine, see xref:container-deployment/suma/server-deployment-vm-suma.adoc[Deploy Server as a Virtual Machine].
ja: {productname}サーバ仮想マシンのインストールの詳細については、xref:container-deployment/suma/server-deployment-vm-suma.adoc[仮想マシンとしてのサーバの配備]を参照してください。

source: Deploy {productname} on {sle-micro}
ja: {sle-micro}に{productname}を配備する

source: User should make the needed RPM available on the internal network. That can be done by using a second {productname} Server or an RMT server.
ja: ユーザは必要なRPMを内部ネットワーク上で利用できるようにする必要があります。そのためには、2つ目の{productname}サーバまたはRMTサーバを使用します。

source: Install SLE Micro
ja: SLE Microのインストール

source: Deploy {productname} with mgradm.
ja: mgradmを使用した{productname}の配備

source: For more detailed information about installing {productname} Server on {sle-micro}, see xref:container-deployment/suma/server-deployment-suma.adoc[Deploy Server as a Virtual Machine].
ja: {sle-micro}に{productname}サーバをインストールする方法の詳細については、xref:container-deployment/suma/server-deployment-suma.adoc[仮想マシンとしてのサーバの配備]を参照してください。

source: This guide shows you how to install and configure a {productname} {productnumber} container on {sle-micro} {microversion} or {sles} {bci-suma}.
ja: このガイドでは、{sle-micro} {microversion}または{sles} {bci-suma}に{productname} {productnumber}コンテナをインストールして設定する方法について説明します。

source: | Software and Hardware | Recommended | Operating System | {sle-micro} {microversion} or {sles} {bci-suma} | Architecture | {x86_64}, {arm}, {s390x}, {ppc64le} | Processor (CPU) | Minimum of four (4) 64-bit CPU cores | RAM | 16 GB | Disk Space | 200 GB | Channel Requirements | 50 GB per SUSE or openSUSE product 360 GB per Red Hat product | Swap space: | 3 GB
ja: | ソフトウェアおよびハードウェア | 推奨 | オペレーティングシステム: | {sle-micro} {microversion}または {sles} {bci-suma} | アーキテクチャ | {x86_64}、{arm}、{s390x}、{ppc64le} | プロセッサ(CPU) | 最低4つの64ビットCPUコア | RAM | 16GB | ディスク容量 | 200GB | チャンネル要件 | SUSEまたはopenSUSE製品では50GB Red Hat製品では360GB | スワップ容量: | 3GB

source: The supported operating system for the container host is {sle-micro} {microversion} or {sles} {bci-suma}.
ja: コンテナホストでサポートされているオペレーティングシステムは{sle-micro} {microversion}または{sles} {bci-suma}です。

source: XFS (though any supported filesystem for {sle-micro} {microversion} could work).
ja: XFS (ただし、{sle-micro} {microversion}でサポートされているファイルシステムであればどれでも動作可能)。

source: For more information about preparing your machines (virtual or physical), see link:https://documentation.suse.com/sle-micro/5.5/html/SLE-Micro-all/book-deployment-slemicro.html[{sle-micro} {microversion} Deployment Guide].
ja: マシン(仮想または物理)の準備の詳細については、link:https://documentation.suse.com/sle-micro/5.5/html/SLE-Micro-all/book-deployment-slemicro.html[{sle-micro} {microversion} Deployment Guide]を参照してください。

source: Adjust keyboard and language.
ja: キーボードと言語を調整します。

source: Registering {productname} as an Extension during Installation
ja: インストール中に{productname}を拡張機能として登録する

source: The {sle-micro} {microversion} entitlement is included within the {productname} entitlement, so it does not require a separate registration code.
ja: {sle-micro} {microversion}エンタイトルメントは{productname}エンタイトルメントに含まれているため、別途登録コードは必要ありません。

source: Select the {productname} {productnumber} Server extension [systemitem]``Checkbox``.
ja: {productname} {productnumber}サーバ拡張機能の[systemitem]``チェックボックス``をオンにします。

source: Enter your {productname} {productnumber} Server extension registration code.
ja: {productname} {productnumber}サーバ拡張機能の登録コードを入力します。

source: This concludes installation of {sle-micro} {microversion} and {productname} {productnumber} as an extension.
ja: これで、拡張機能としての{sle-micro} {microversion}と{productname} {productnumber}のインストールが完了しました。

source: Registration from the Command Line (Optional)
ja: コマンドラインからの登録(オプション)

source: If you added {productname} {productnumber} as an extension during {sle-micro} {microversion} installation then you can skip this step. However, optionally you may skip registration during {sle-micro} {microversion} installation by selecting the btn:[Skip Registration] button. This section provides steps on registering your products after {sle-micro} {microversion} installation.
ja: {sle-micro} {microversion}のインストール中に{productname} {productnumber}を拡張機能として追加した場合は、このステップはスキップして構いません。ただし、オプションで、btn:[登録を行なわずに次へ進む]ボタンを選択することにより{sle-micro} {microversion}のインストール中に登録をスキップできます。このセクションでは、{sle-micro} {microversion}のインストール後に製品を登録するステップについて説明します。

source: Procedure: Post Installation Product Registration
ja: プロシージャ: インストール後の製品の登録

source: Register {sle-micro} {microversion} to {scclongform} from the command line run the following commands on the container host:
ja: コマンドラインから{sle-micro} {microversion}を{scclongform}に登録するには、コンテナホストで次のコマンドを実行します。

source: Use the registration code you obtained from your {scclongform} account for {sle-micro} {microversion}.
ja: {scclongform}アカウントから取得した登録コードを{sle-micro} {microversion}に使用します。

source: The following steps register a server with the {x86_64} architecture and thus require a registration code for the {x86_64} architecture. To register {arm} or {s390x} architectures use the correct registration code.
ja: 次の手順では、サーバを{x86_64}アーキテクチャに登録します。そのため、{x86_64}アーキテクチャの登録コードが必要になります。{arm}または{s390x}アーキテクチャを登録する場合は、正しい登録コードを使用してください。

source: Next add the **SUSE Manager Server Extension 5.0 x86_64** Extension. List available extensions with the following command:
ja: 次に、**SUSE Manager Server Extension 5.0 x86_64**拡張機能を追加します。次のコマンドを使用して、利用可能な拡張機能を一覧表示します。

source: Use your **SUSE Manager Server Extension 5.0 x86_64** registration code with the following command:
ja: 次のコマンドで**SUSE Manager Server Extension 5.0 x86_64**の登録コードを使用します。

source: {sle-micro} is designed to update itself automatically by default and will reboot after applying updates. However, this behavior is not desirable for the {productname} environment. To prevent automatic updates on your server, {productname} disables the transactional-update timer during the bootstrap process.
ja: {sle-micro}はデフォルトで自動的に自己更新するように設定されており、更新が適用されると再起動します。ただし、この動作は{productname}環境では望ましくありません。サーバの自動更新を防ぐために、{productname}では、ブートストラッププロセス中にトランザクション更新タイマーが無効化されます。

source: If you prefer the {sle-micro} default behavior, enable the timer by running the following command:
ja: {sle-micro}のデフォルトの動作を使用したい場合は、次のコマンドを実行してタイマーを有効にします。

source: Procedure: Installing {productname} on {sles} {bci-suma}
ja: プロシージャ: {sles} {bci-suma}に{productname}をインストールする

source: {productname} Server Extension
ja: {productname}サーバの拡張機能

source: Execute the following command, replacing `<suma.example.com>` with your fully qualified domain name:
ja: 次のコマンドを、``<suma.example.com>``を完全修飾ドメイン名に置き換えて入力します。

source: If the above command fails ensure that you have registered {productname} {productnumber}. If you skipped registration during installation and now need to register from the command line, follow the steps below to log in to the registry:
ja: 上記のコマンドが失敗する場合は、{productname} {productnumber}が登録済みであることを確認してください。インストール時に登録をスキップし、ここでコマンドラインから登録する必要がある場合は、次のステップに従ってレジストリにログインします。

source: Enter a certificate and administrator account password when prompted.
ja: 入力を求められたら、証明書と管理者アカウントのパスワードを入力します。

source: 2+<| KVM Settings | Installation Method | Import Existing Disk Image | OS: | Linux | Version: | {productname}-Server.x86_64-5.0.0-Build16.10.qcow2 | Memory: | 16 GB | CPU's: | 4 | Storage Format: | _.qcow2_ 100 GB (Default) Root Partition | Name: | test-setup | Network | Bridge _br0_
ja: 2+<| KVMの設定 | インストール方法 | 既存のディスクイメージのインポート | OS: | Linux | バージョン: | {productname}-Server.x86_64-5.0.0-Build16.10.qcow2 | メモリ: | 16 GB | CPU数: | 4 | ストレージフォーマット: | _.qcow2_ 100GB (デフォルト)ルートパーティション | 名前: | test-setup | ネットワーク | Bridge _br0_

source: Register {sle-micro} and {productname} {productnumber} Server
ja: {sle-micro}および{productname} {productnumber}サーバの登録

source: Procedure: Registering {sle-micro} and {productname} {productnumber}
ja: プロシージャ: {sle-micro}および{productname} {productnumber}を登録する

source: Run the following command to deploy {productname}:
ja: 次のコマンドを実行して{productname}を配備します。

source: Register {sle-micro} with {scc}.
ja: {scc}で{sle-micro}を登録します。

source: General
ja: 全般

source: To migrate a {productname} 4.3 Server to a container, you require a new machine with {sle-micro} 5.5 and [literal]``mgradm`` installed.
ja: {productname} 4.3サーバをコンテナに移行するには、{sle-micro} 5.5と[literal]``mgradm``がインストールされた新しいマシンが必要です。

source: An in-place migration from {productname} 4.3 to 5.0 is unsupported because of the change of the underlying operating system from {sles} 15 SP4 to {sle-micro} {microversion}.
ja: 基盤となるオペレーティングシステムが{sles} 15 SP4から{sle-micro} {microversion}に変更されたため、{productname} 4.3から5.0へのインプレース移行はサポートされていません。

source: Before migrating from {productname} 4.3 to {productnumber}, any existing traditional clients including the traditional proxies must be migrated to {salt}.
ja: {productname} 4.3から{productnumber}に移行する前に、従来のプロキシを含む既存の従来のクライアントを{salt}に移行する必要があります。

source: For more information about migrating traditional {productname} 4.3 clients to {salt} clients, see https://documentation.suse.com/suma/4.3/en/suse-manager/client-configuration/contact-methods-migrate-traditional.html.
ja: 従来の{productname} 4.3クライアントから{salt}クライアントへの移行については、link:https://documentation.suse.com/suma/4.3/en/suse-manager/client-configuration/contact-methods-migrate-traditional.html[]を参照してください。

source: The current migration procedure does not include functionality for renaming hostnames. As a result, the fully qualified domain name (FQDN) of the new server will remain the same as that of the old server.
ja: 現在、この移行手順にはホスト名の名前変更機能が含まれていません。そのため、新しいサーバの完全修飾ドメイン名(FQDN)は古いサーバのFQDNと同じままです。

source: After the migration, it will be necessary to manually update the DHCP and DNS records to point to the new server.
ja: 移行後、新しいサーバを指すようにDHCPおよびDNSレコードを手動で更新する必要があります。

source: GPG Keys
ja: GPGキー

source: Procedure: Manual Migration of the 4.3 GPG Keys to New Server
ja: プロシージャ: 4.3 GPGキーの新しいサーバへの手動移行

source: The migration can take a very long time depending on the amount of data that needs to be replicated. To reduce downtime it is possible to run the migration multiple times in a process of _initial replication_, _re-replication_, or _final replication and switch over_ while all the services on the old server can stay up and running.
ja: 移行には、複製が必要なデータの量によって、非常に長い時間がかかることがあります。ダウンタイムを短縮するには、古いサーバ上のすべてのサービスを稼働させたまま、初期複製、再複製、最終複製および切り替えのプロセスで移行を複数回実行することができます。

source: Only during the final migration the processes on the old server need to be stopped.
ja: 最終移行時のみ、古いサーバ上のプロセスを停止する必要があります。

source: For all non-final replications add the parameter [command]``--prepare`` to prevent the automatic stopping the services on the old server. For example:
ja: 最終複製以外のすべての複製については、古いサーバ上のサービスを自動的に停止しないように、パラメータ[command]``--prepare``を追加します。例:

source: Initial Preparation on the Old 4.3 Server
ja: 古い4.3サーバでの初期準備

source: Procedure: Initial preparation on the 4.3 server
ja: プロシージャ: 4.3サーバでの初期準備

source: Pre-installing {productname} on the prepared {sle-micro} 5.5 with [litaral]``mgradm`` is not necessary. The migration process will take care of the server installation.
ja: [litaral]``mgradm``を使用して準備された{sle-micro} 5.5に{productname}を事前にインストールする必要はありません。移行プロセスで、サーバのインストールが行われます。

source: Procedure: Preparing the SSH Connection
ja: プロシージャ: SSH接続を準備する
