Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/quickstart-public-cloud/*.po
Languages: cs

source: xref:qs-publiccloud-overview.adoc[Quick Start: Public Cloud]
cs: xref:qs-publiccloud-overview.adoc[Quick Start: Public Cloud (Rychlý start: Veřejný cloud)]

source: xref:setup.adoc[Setting Up]
cs: xref:setup.adoc[Setting Up (Nastavení)]

source: xref:clients.adoc[Clients]
cs: xref:clients.adoc[Clients (Klienty)]

source: Register clients
cs: Registrovat klienty

source: When you have your {productname} Server set up, you are ready to start registering clients.
cs: Když máte nastavený server {productname}, jste připraveni začít registrovat klienty.

source: For instructions on registering clients on a public cloud, see xref:client-configuration:clients-pubcloud.adoc[]
cs: Instrukce k registraci klientů ve veřejném cloudu viz xref:client-configuration:clients-pubcloud.adoc[]

source: More information
cs: Více informací

source: For more {productname} product documentation, see https://documentation.suse.com/suma.
cs: Další dokumentaci o produktu {productname} viz https://documentation.suse.com/suma.

source: To raise an issue or propose a change to the documentation, use the links under the ``Resources`` menu on the documentation site.
cs: Chcete-li upozornit na problém nebo navrhnout změnu dokumentace, použijte odkazy v menu `` Zdroje`` na webu dokumentace.

source: Quick Start: Public Cloud overview
cs: Rychlý start: Přehled veřejného cloudu

source: **Updated:** {docdate}
cs: **Aktualizováno:** {docdate}

source: This guide shows you the fastest way to get {productname} up and running in a public cloud using on-demand or BYOS services. Additionally, it assumes that you are installing the {productname} Server on a single cloud instance. It has been tested on Amazon Web Services, Microsoft Azure, and Google Cloud Engine.
cs: Tato příručka vám ukáže nejrychlejší způsob, jak uvést {productname} do provozu ve veřejném cloudu pomocí služeb na vyžádání nebo BYOS. Dále předpokládá, že instalujete server {productname} na jednu instanci cloudu. Bylo testováno na Amazon Web Services, Microsoft Azure a Google Cloud Engine.

source: For more information on using {productname}, see the official {productname} documentation at https://documentation.suse.com/suma.
cs: Další informace o používání {productname} najdete v oficiální dokumentaci {productname} na adrese https://documentation.suse.com/suma.

source: Setting up
cs: Nastavení

source: This guide shows you the fastest way to get {productname} up and running in a public cloud using on-demand or BYOS services. We have tested using {productname} on Amazon EC2, Google Compute Engine, and Microsoft Azure, but these procedures should work with other public cloud providers as well, with some variation.
cs: Tato příručka vám ukáže nejrychlejší způsob, jak uvést {productname} do provozu ve veřejném cloudu pomocí služeb na vyžádání nebo BYOS. Testovali jsme {productname} na Amazonu EC2, Google Compute Engine a Microsoft Azure, ale tyto postupy by s určitými obměnami měly fungovat i u jiných poskytovatelů veřejného cloudu.

source: There are three main methods of using {productname} on a public cloud service.
cs: Existují tři hlavní způsoby použití produktu {productname} ve veřejné cloudové službě.

source: Bring your own subscription (BYOS)
cs: Přineste si vlastní předplatné (Bring your own subscription, BYOS)

source: Most public cloud providers make a BYOS image of {productname} available. This means you do not need to install {productname}, just set up the server. You will need to have {suse} product entitlements before you begin, and there are some additional setup steps required. The public cloud documentation in the {productname} documentation suite assumes you are using this method.
cs: Většina poskytovatelů veřejného cloudu zpřístupňuje BYOS obraz {productname}. To znamená, že nemusíte instalovat {productname}, stačí nastavit server. Než začnete, budete potřebovat oprávnění k produktu {suse} a je třeba provést několik dalších kroků nastavení. Dokumentace veřejného cloudu v sadě dokumentace {productname} předpokládá, že používáte tuto metodu.

source: Virtual machine on public cloud
cs: Virtuální stroj ve veřejném cloudu

source: In this method, you subscribe to a public cloud service, and install {productname} in a virtual machine, using the unified installer. You will need to have {suse} product entitlements before you begin. You can do this by following all the same instructions as you would for any local {productname} installation.
cs: V této metodě se přihlásíte k odběru veřejné cloudové služby a nainstalujete produkt {productname} do virtuálního počítače pomocí jednotného instalačního programu. Než začnete, budete potřebovat oprávnění k produktu {suse}. Můžete to provést podle stejných pokynů, jako při jakékoli místní instalaci {productname}.

source: On-demand {sles} pay as you go (PAYG) image
cs: Platba na vyžádání {sles} za obraz (PAYG)

source: Most public cloud providers make {sles} available as a BYOS image. This means that {sles} is pre-installed, and you can install {productname} on top, using the unified installer. You can do this by following all the same instructions as you would for any local {productname} installation. You will need to have {suse} product entitlements before you begin. Be careful with this method, because you might end up requiring additional product entitlements that could drive up your costs.
cs: Většina poskytovatelů veřejného cloudu zpřístupňuje {sles} jako obraz BYOS. To znamená, že aplikace {sles} je předinstalována a produkt {productname} můžete nainstalovat na ni pomocí jednotného instalátoru. Můžete to provést podle stejných pokynů jako pro jakoukoli místní instalaci {productname}. Než začnete, budete potřebovat oprávnění k produktu {suse}. U této metody buďte opatrní, protože byste mohli nakonec potřebovat další oprávnění k produktu, která by mohla zvýšit vaše náklady.

source: If you are using the BYOS method, start by logging in to your chosen public cloud provider, and launching a {productname} instance. Depending on the public cloud you are using, you can usually locate the {productname} Server BYOS images by searching for ``suse manager``. In EC2, you need to search within the Community AMIs. In GCE and Azure, search the marketplace.
cs: Používáte-li metodu BYOS, začněte přihlášením k vybranému poskytovateli veřejného cloudu a spuštěním instance {productname}. V závislosti na veřejném cloudu, který používáte, můžete obvykle vyhledat obrazy BYOS {productname} Serveru vyhledáním ``suse manager`` (správce suse). V EC2 musíte hledat v komunitě AMI. V GCE a Azure prohledejte "tržiště" (marketplace).

source: Select a public cloud instance type that meets the hardware and networking requirements in xref:installation:pubcloud-requirements.adoc[].
cs: Vyberte typ instance veřejného cloudu, který splňuje hardwarové a síťové požadavky, v xref:installation:pubcloud-requirements.adoc[].

source: When you have your virtual machine ready, and the BYOS image installed, you need to set up {productname}. This is done in the same way as a local installation, using {yast}. When you have completed {productname} setup, you need to activate the public cloud module. You can then complete setup in the {productname} {webui}. For more information about setting up, see xref:installation:pubcloud-setup.adoc[].
cs: Když máte připravený virtuální stroj a nainstalovaný obraz BYOS, musíte nastavit {productname}. To se děje stejným způsobem jako lokální instalace, pomocí {yast}. Po dokončení instalace {productname} musíte aktivovat modul veřejného cloudu. Poté můžete dokončit nastavení v {productname} {webui}. Další informace o nastavení najdete v dokumentu xref:installation:pubcloud-setup.adoc[].
