Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/ROOT/*.po
Languages: cs, ja, ko, lt, pt_br, ru, sk, zh_cn

source: {productname} offers seamless management of {sle}, {opensuse}, {rhel}, {centos}, {oracle}, {ubuntu}, {debian}, {amazon}, and {almalinux} client systems. They can be on-premise, or on public cloud, private cloud, hybrid cloud or even multi-cloud environments.
lt: {productname} užtikrina sklandų {sle}, {opensuse}, {rhel}, {centos}, {oracle}, {ubuntu}, {debian}, {amazon} ir {almalinux} klientų sistemų valdymą. Jos gali būti diegiamos vietoje, viešajame debesyje, privačiame debesyje, hibridiniame debesyje ar net kelių debesų (multi-cloud) aplinkose.
ru: {productname} обеспечивает бесшовное управление клиентскими системами {sle}, {opensuse}, {rhel}, {centos}, {oracle}, {ubuntu}, {debian}, {amazon} и {almalinux}. Они могут располагаться локально, а также в общедоступном облаке, частном облаке, гибридном облаке или даже в мультиоблачных средах.

source: If you cannot use the {productname} {webui}, almost all functionality (with the exception of virtualization tasks) is available from the command prompt. All command line tools can be used with assistive technology tools. Text readers ``orca`` and ``espeak`` can be enabled in the Desktop Applications Module. Additionally, you can interact with {productname} using the XML-RPC API.
lt: Jei negalite naudotis {productname} {webui}, beveik visa funkcija (išskyrus virtualizacijos užduotis) yra prieinama iš komandų eilutės. Visi komandų eilutės įrankiai gali būti naudojami su pagalbinių technologijų įrankiais. Ekrano skaitytuvus orca ir espeak galima įjungti Desktop Applications modulyje. Be to, su {productname} galite sąveikauti naudodami XML-RPC API.
ru: Если вы не можете использовать {productname} {webui}, почти вся функциональность (за исключением задач виртуализации) доступна из командной строки. Все инструменты командной строки можно использовать со средствами вспомогательных технологий. Экранные дикторы orca и espeak можно включить в модуле Desktop Applications. Кроме того, вы можете взаимодействовать с {productname}, используя API XML-RPC.

source: For more information about the API, see link:https://documentation.suse.com/suma/4.3/api/pdf/suse_manager_api_guide.pdf[https://documentation.suse.com/suma/4.3/api/pdf/suse_manager_api_guide.pdf].
lt: Daugiau informacijos apie API žr. link:https://documentation.suse.com/suma/4.3/api/pdf/suse_manager_api_guide.pdf[https://documentation.suse.com/suma/4.3/api/pdf/suse_manager_api_guide.pdf].
ru: Для получения дополнительной информации об API см. link:https://documentation.suse.com/suma/4.3/api/pdf/suse_manager_api_guide.pdf[https://documentation.suse.com/suma/4.3/api/pdf/suse_manager_api_guide.pdf].

source: Speech recognition ``mycroft-core`` and ``sphinx`` are available in Package Hub.
lt: Kalbos atpažinimas mycroft-core ir sphinx yra prieinami Package Hub.
ru: Распознавание речи mycroft-core и sphinx доступно в Package Hub.

source: General updates and fixes to the packages in SUSE Package Hub are provided by the openSUSE community based on their discretion.
lt: Bendruosius SUSE Package Hub paketų atnaujinimus ir pataisymus openSUSE bendruomenė teikia savo nuožiūra.
ru: Общие обновления и исправления для пакетов в SUSE Package Hub предоставляются сообществом openSUSE на их усмотрение.

source: Packages from the Package Hub are delivered without L3 support from SUSE, though SUSE will monitor and ensure that any known critical security issues will be addressed. Packages in the Package Hub are approved by SUSE for use with SUSE Linux Enterprise Server and to not interfere with the supportability of SUSE Linux Enterprise Server, its modules and extensions.
lt: Package Hub paketai pateikiami be SUSE L3 palaikymo, tačiau SUSE stebės ir užtikrins, kad bet kokios žinomos kritinės saugumo problemos būtų pašalintos. Package Hub paketai yra SUSE patvirtinti naudoti su SUSE Linux Enterprise Server ir neturi trukdyti SUSE Linux Enterprise Server, jo modulių ir plėtinių palaikomumui.
ru: Пакеты из Package Hub поставляются без поддержки уровня L3 со стороны SUSE, хотя SUSE будет осуществлять мониторинг и обеспечивать устранение любых известных критических проблем безопасности. Пакеты в Package Hub одобрены SUSE для использования с SUSE Linux Enterprise Server и не должны влиять на возможность получения поддержки для SUSE Linux Enterprise Server, его модулей и расширений.

source: For more information about Package Hub, see https://packagehub.suse.com/support/.
lt: Daugiau informacijos apie Package Hub žr. https://packagehub.suse.com/support/.
ru: Для получения дополнительной информации о Package Hub см. https://packagehub.suse.com/support/.

source: {productname} documentation is available in several locations and formats. For the most up-to-date version of this documentation, see https://documentation.suse.com/suma/.
cs: Dokumentace k produktu {productname} je k dispozici v několika umístěních a formátech. Zcela aktuální verzi této dokumentace najdete na https://documentation.suse.com/suma/.
lt: {productname} dokumentacija yra prieinama keliose vietose ir formatuose. Norėdami peržiūrėti naujausią šios dokumentacijos versiją, žr. https://documentation.suse.com/suma/.
ru: {productname} документация доступна в нескольких местах и форматах. Чтобы получить самую актуальную версию этой документации, см. https://documentation.suse.com/suma/.

source: Download All PDFs icon:caret-right[] icon:file-archive[link="../susemanager-docs_en-pdf.zip"]
lt: Atsisiųsti visus PDF icon:caret-right[] icon:file-archive[link="../susemanager-docs_en-pdf.zip"]
ru: Скачать все PDF icon:caret-right[] icon:file-archive[link="../susemanager-docs_en-pdf.zip"]

source: | View HTML | View PDF | View HTML | View PDF | xref:quickstart:quickstart-overview.adoc[Quick Start] | icon:file-pdf[link="../pdf/suse_manager_quickstart_guide.pdf", window="_blank" role="green"] | xref:retail:retail-overview.adoc[Retail Guide] | icon:file-pdf[link="../pdf/suse_manager_retail_guide.pdf", window="_blank" role="green"] | xref:installation-and-upgrade:installation-and-upgrade-overview.adoc[Installation/Upgrade Guide] | icon:file-pdf[link="../pdf/suse_manager_installation-and-upgrade_guide.pdf", window="_blank" role="green"] | xref:reference:reference-overview.adoc[Reference Guide] | icon:file-pdf[link="../pdf/suse_manager_reference_guide.pdf", window="_blank" role="green"] | xref:client-configuration:client-config-overview.adoc[Client Configuration Guide] | icon:file-pdf[link="../pdf/suse_manager_client-configuration_guide.pdf", window="_blank" role="green"] | xref:common-workflows:common-workflows-overview.adoc[Common Workflows] | icon:file-pdf[link="../pdf/suse_manager_common-workflows_guide.pdf", window="_blank" role="green"] | xref:administration:admin-overview.adoc[Administration Guide] | icon:file-pdf[link="../pdf/suse_manager_administration_guide.pdf", window="_blank" role="green"] | xref:specialized-guides:specialized-guides-overview.adoc[Specialized Guides] | icon:file-pdf[link="../pdf/suse_manager_specialized-guides_guide.pdf", window="_blank" role="green"]
lt: | Peržiūrėti HTML | Peržiūrėti PDF | Peržiūrėti HTML | Peržiūrėti PDF | xref:quickstart:quickstart-overview.adoc[Greita pradžia] | icon:file-pdf[link="../pdf/suse_manager_quickstart_guide.pdf", window="_blank" role="green"] | xref:retail:retail-overview.adoc[Retail vadovas] | icon:file-pdf[link="../pdf/suse_manager_retail_guide.pdf", window="_blank" role="green"] | xref:installation-and-upgrade:installation-and-upgrade-overview.adoc[Diegimo / atnaujinimo vadovas] | icon:file-pdf[link="../pdf/suse_manager_installation-and-upgrade_guide.pdf", window="_blank" role="green"] | xref:reference:reference-overview.adoc[Nuorodų vadovas] | icon:file-pdf[link="../pdf/suse_manager_reference_guide.pdf", window="_blank" role="green"] | xref:client-configuration:client-config-overview.adoc[Klientų konfigūravimo vadovas] | icon:file-pdf[link="../pdf/suse_manager_client-configuration_guide.pdf", window="_blank" role="green"] | xref:common-workflows:common-workflows-overview.adoc[Dažniausi darbo srautai] | icon:file-pdf[link="../pdf/suse_manager_common-workflows_guide.pdf", window="_blank" role="green"] | xref:administration:admin-overview.adoc[Administravimo vadovas] | icon:file-pdf[link="../pdf/suse_manager_administration_guide.pdf", window="_blank" role="green"] | xref:specialized-guides:specialized-guides-overview.adoc[Specializuoti vadovai] | icon:file-pdf[link="../pdf/suse_manager_specialized-guides_guide.pdf", window="_blank" role="green"]
ru: | Просмотреть HTML | Просмотреть PDF | Просмотреть HTML | Просмотреть PDF | xref:quickstart:quickstart-overview.adoc[Быстрый старт] | icon:file-pdf[link="../pdf/suse_manager_quickstart_guide.pdf", window="_blank" role="green"] | xref:retail:retail-overview.adoc[Руководство по Retail] | icon:file-pdf[link="../pdf/suse_manager_retail_guide.pdf", window="_blank" role="green"] | xref:installation-and-upgrade:installation-and-upgrade-overview.adoc[Руководство по установке и обновлению] | icon:file-pdf[link="../pdf/suse_manager_installation-and-upgrade_guide.pdf", window="_blank" role="green"] | xref:reference:reference-overview.adoc[Справочное руководство] | icon:file-pdf[link="../pdf/suse_manager_reference_guide.pdf", window="_blank" role="green"] | xref:client-configuration:client-config-overview.adoc[Руководство по настройке клиентов] | icon:file-pdf[link="../pdf/suse_manager_client-configuration_guide.pdf", window="_blank" role="green"] | xref:common-workflows:common-workflows-overview.adoc[Типовые рабочие процессы] | icon:file-pdf[link="../pdf/suse_manager_common-workflows_guide.pdf", window="_blank" role="green"] | xref:administration:admin-overview.adoc[Руководство по администрированию] | icon:file-pdf[link="../pdf/suse_manager_administration_guide.pdf", window="_blank" role="green"] | xref:specialized-guides:specialized-guides-overview.adoc[Специализированные руководства] | icon:file-pdf[link="../pdf/suse_manager_specialized-guides_guide.pdf", window="_blank" role="green"]

source: {productname} is a solution for organizations that require absolute control over maintenance and package deployment on their servers. {productname} enables you to manage large sets of Linux systems and keep them up to date, with automated software management, asset management, and system provisioning. {productname} allows you to maintain a high level of security while effectively managing system life-cycle requirements.
cs: {productname} je řešení pro organizace, které vyžadují absolutní dohled nad údržbou a nasazením balíků na svých serverech. {productname} vám umožňuje spravovat velké sady systémů Linux a udržovat je aktuální, s automatizovanou správou softwaru, správou aktiv a zajišťováním systému. {productname} vám umožňuje udržovat vysokou úroveň zabezpečení a současně efektivně spravovat požadavky na životní cyklus systému.

source: {productname} offers seamless management of {sle}, {opensuse}, {rhel}, {centos}, {oracle} and {ubuntu} client systems, no matter if on-premise, on public cloud, private cloud, hybrid cloud or even multi-cloud environments.
cs: {productname} nabízí bezproblémovou správu klientských systémů {sle}, {opensuse}, {rhel}, {centos}, {oracle} a {ubuntu}, bez ohledu na to, zda jsou lokální, ve veřejném cloudu, soukromém cloudu, hybridním cloudu nebo i v prostředí s více cloudy.

source: Accessibility
cs: Dostupnost

source: For more information about the API, see https://documentation.suse.com/external-tree/en-us/suma/4.1/pdf/susemanager_api_doc_color_en.pdf.
cs: Další informace o rozhraní API viz https://documentation.suse.com/external-tree/en-us/suma/4.1/pdf/susemanager_api_doc_color_en.pdf.

source: Download All PDFs icon:caret-right[] icon:file-archive[link="../susemanager-docs_en-pdf.tar.gz"]
cs: Stáhněte všechny soubory PDF icon:caret-right[] icon:file-archive[link="../susemanager-docs_en-pdf.tar.gz"]

source: | View HTML | View PDF | View HTML | View PDF | xref:installation:install-overview.adoc[Installation Guide] | icon:file-pdf[link="../pdf/suse_manager_installation_guide.pdf", window="_blank" role="green"] | xref:client-configuration:client-config-overview.adoc[Client Configuration Guide] | icon:file-pdf[link="../pdf/suse_manager_client-configuration_guide.pdf", window="_blank" role="green"] | xref:upgrade:upgrade-overview.adoc[Upgrade Guide] | icon:file-pdf[link="../pdf/suse_manager_upgrade_guide.pdf", window="_blank" role="green"] | xref:reference:reference-overview.adoc[Reference Guide] | icon:file-pdf[link="../pdf/suse_manager_reference_guide.pdf", window="_blank" role="green"] | xref:administration:admin-overview.adoc[Administration Guide] | icon:file-pdf[link="../pdf/suse_manager_administration_guide.pdf", window="_blank" role="green"] | xref:salt:salt-overview.adoc[Salt Guide] | icon:file-pdf[link="../pdf/suse_manager_salt_guide.pdf", window="_blank" role="green"] | xref:retail:retail-overview.adoc[Retail Guide] | icon:file-pdf[link="../pdf/suse_manager_retail_guide.pdf", window="_blank" role="green"] | xref:large-deployments:large-deployments-overview.adoc[Large Deployments Guide] | icon:file-pdf[link="../pdf/suse_manager_large-deployments_guide.pdf", window="_blank" role="green"] | xref:quickstart-public-cloud:qs-publiccloud-overview.adoc[Quick Start - Public Cloud] | icon:file-pdf[link="../pdf/suse_manager_quickstart-public-cloud_guide.pdf", window="_blank" role="green"] | xref:quickstart-sap:qs-sap-overview.adoc[Quick Start - SAP] | icon:file-pdf[link="../pdf/suse_manager_quickstart-sap_guide.pdf", window="_blank" role="green"]
cs: | Zobrazit HTML | Zobrazit PDF | Zobrazit HTML | Zobrazit PDF | xref:installation:install-overview.adoc[Installation Guide] (Průvodce instalací) | icon:file-pdf[link="../pdf/suse_manager_installation_guide.pdf", window="_blank" role="green"] | xref:client-configuration:client-config-overview.adoc[Client Configuration Guide] (Průvodce konfigurací klienta) | icon:file-pdf[link="../pdf/suse_manager_client-configuration_guide.pdf", window="_blank" role="green"] | xref:upgrade:upgrade-overview.adoc[Upgrade Guide] (Průvodce povýšením verze) | icon:file-pdf[link="../pdf/suse_manager_upgrade_guide.pdf", window="_blank" role="green"] | xref:reference:reference-overview.adoc[Reference Guide] (Referenční příručka) | icon:file-pdf[link="../pdf/suse_manager_reference_guide.pdf", window="_blank" role="green"] | xref:administration:admin-overview.adoc[Administration Guide] (Průvodce správou) | icon:file-pdf[link="../pdf/suse_manager_administration_guide.pdf", window="_blank" role="green"] | xref:salt:salt-overview.adoc[Salt Guide] (Příručka Salt) | icon:file-pdf[link="../pdf/suse_manager_salt_guide.pdf", window="_blank" role="green"] | xref:retail:retail-overview.adoc[Retail Guide] (Příručka práce v drobném) | icon:file-pdf[link="../pdf/suse_manager_retail_guide.pdf", window="_blank" role="green"] | xref:quickstart-public-cloud:qs-publiccloud-overview.adoc[Quick Start - Public Cloud] (Rychlý start - veřejný cloud) | icon:file-pdf[link="../pdf/suse_manager_quickstart-public-cloud_guide.pdf", window="_blank" role="green"] | xref:quickstart-sap:qs-sap-overview.adoc[Quick Start - SAP] (Příručka hromadného nasazení) | icon:file-pdf[link="../pdf/suse_manager_quickstart-sap_guide.pdf", window="_blank" role="green"] | |

source: Download All PDFs icon:caret-right[] icon:file-archive[link="../uyuni-docs_en-pdf.tar.gz"]
cs: Stáhněte všechny soubory PDF icon:caret-right[] icon:file-archive[link="../uyuni-docs_en-pdf.tar.gz"]

source: | View HTML | View PDF | View HTML | View PDF | xref:installation:install-overview.adoc[Installation Guide] | icon:file-pdf[link="../pdf/uyuni_installation_guide.pdf", window="_blank" role="green"] | xref:client-configuration:client-config-overview.adoc[Client Configuration Guide] | icon:file-pdf[link="../pdf/uyuni_client-configuration_guide.pdf", window="_blank" role="green"] | xref:upgrade:upgrade-overview.adoc[Upgrade Guide] | icon:file-pdf[link="../pdf/uyuni_upgrade_guide.pdf", window="_blank" role="green"] | xref:reference:reference-overview.adoc[Reference Guide] | icon:file-pdf[link="../pdf/uyuni_reference_guide.pdf", window="_blank" role="green"] | xref:administration:admin-overview.adoc[Administration Guide] | icon:file-pdf[link="../pdf/uyuni_administration_guide.pdf", window="_blank" role="green"] | xref:salt:salt-overview.adoc[Salt Guide] | icon:file-pdf[link="../pdf/uyuni_salt_guide.pdf", window="_blank" role="green"] | xref:retail:retail-overview.adoc[Retail Guide] | icon:file-pdf[link="../pdf/uyuni_retail_guide.pdf", window="_blank" role="green"] | xref:large-deployments:large-deployments-overview.adoc[Large Deployments Guide] | icon:file-pdf[link="../pdf/uyuni_large-deployments_guide.pdf", window="_blank" role="green"] | xref:quickstart-public-cloud:qs-publiccloud-overview.adoc[Quick Start Guide - Public Cloud] | icon:file-pdf[link="../pdf/uyuni_quickstart-public-cloud_guide.pdf", window="_blank" role="green"] | xref:quickstart-sap:qs-sap-overview.adoc[Quick Start - SAP] | icon:file-pdf[link="../pdf/suse_manager_quickstart-sap_guide.pdf", window="_blank" role="green"]
cs: | Zobrazit HTML | Zobrazit PDF | Zobrazit HTML | Zobrazit PDF | xref:installation:install-overview.adoc[Installation Guide] (Průvodce instalací) | icon:file-pdf[link="../pdf/uyuni_installation_guide.pdf", window="_blank" role="green"] | xref:client-configuration:client-config-overview.adoc[Client Configuration Guide] (Průvodce konfigurací klienta) | icon:file-pdf[link="../pdf/uyuni_client-configuration_guide.pdf", window="_blank" role="green"] | xref:upgrade:upgrade-overview.adoc[Upgrade Guide] (Průvodce povýšením verze) | icon:file-pdf[link="../pdf/uyuni_upgrade_guide.pdf", window="_blank" role="green"] | xref:reference:reference-overview.adoc[Reference Guide] (Referenční příručka) | icon:file-pdf[link="../pdf/uyuni_reference_guide.pdf", window="_blank" role="green"] | xref:administration:admin-overview.adoc[Administration Guide] (Průvodce správou) | icon:file-pdf[link="../pdf/uyuni_administration_guide.pdf", window="_blank" role="green"] | xref:salt:salt-overview.adoc[Salt Guide] (Příručka Salt) | icon:file-pdf[link="../pdf/uyuni_salt_guide.pdf", window="_blank" role="green"] | xref:retail:retail-overview.adoc[Retail Guide](Příručka práce v drobném) | icon:file-pdf[link="../pdf/uyuni_retail_guide.pdf", window="_blank" role="green"] | xref:large-deployments:large-deployments-overview.adoc[Large Deployments Guide] | icon:file-pdf[link="../pdf/uyuni_large-deployments_guide.pdf", window="_blank" role="green"] | xref:quickstart-public-cloud:qs-publiccloud-overview.adoc[Quick Start Guide - Public Cloud] (Rychlý úvodní průvodce - veřejný cloud) | icon:file-pdf[link="../pdf/uyuni_quickstart-public-cloud_guide.pdf", window="_blank" role="green"] | xref:quickstart-sap:qs-sap-overview.adoc[Quick Start - SAP] | icon:file-pdf[link="../pdf/suse_manager_quickstart-sap_guide.pdf", window="_blank" role="green"]

source: We are currently in the process of enhancing the [.currentrel]**{productnumber}** documentation. As we transition from a traditional framework to a modern, containerized approach, please be aware of the following:
ja: SUSEでは目下、[.currentrel]**{productnumber}**のドキュメンテーションの向上に取り組んでいます。従来のフレームワークからコンテナ化された最新のアプローチへの移行を進めるにあたり、次の点にご留意ください。
zh_cn: 我们目前正在完善 [.currentrel]**{productnumber}** 文档。在我们从传统框架过渡到新式容器化方法的过程中，请注意以下几点：

source: We are currently in the process of enhancing the [.currentrel]**{releaseversion}** documentation.
pt_br: No momento, estamos no processo de aprimoramento da documentação [.currentrel]**{releaseversion}**.

source: **We Value Your Input:** Your feedback is crucial to us! If you find any aspects of the documentation unclear or notice missing information, please do not hesitate to reach out. We appreciate your questions and suggestions, which are vital in helping us improve.
pt_br: **Valorizamos sua opinião:** Seu feedback é crucial para nós! Se você achar algum aspecto da documentação pouco claro ou notar informações faltantes, não hesite em entrar em contato. Agradecemos suas dúvidas e sugestões que são vitais para nos ajudar a melhorar.

source: The following documentation for {productname} version {productnumber} is available in PDF format for easy download and reference.
pt_br: A seguinte documentação está disponível para a versão {productnumber} do {productname} em formato PDF para referência e fácil download.

source: Download the complete set of PDFs icon:caret-right[] icon:file-archive[link="../suse-multi-linux-manager-docs_en-pdf.zip"]
pt_br: Baixe o pacote completo de PDFs icon:caret-right[] icon:file-archive[link="../suse-multi-linux-manager-docs_en-pdf.zip"]

source: {productname} documentation is available in several locations and formats. For the most up-to-date version of this documentation, see link:https://documentation.suse.com/[SUSE Multi-Linux Manager].
pt_br: A documentação do {productname} está disponível em vários locais e formatos. Para obter a versão mais atualizada desta documentação, consulte link:https://documentation.suse.com/[SUSE Multi-Linux].

source: Download the complete set of PDFs icon:caret-right[] icon:file-archive[link="../uyuni-docs_en-pdf.zip"]
pt_br: Baixar o pacote completo de PDFs icon:caret-right[] icon:file-archive[link="../uyuni-docs_en-pdf.zip"]

source: [.currentrel]**Version: {productnumber}**
ko: [.currentrel]**버전: {productnumber}**
