Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/ROOT/*.po
Languages: cs, ja, ko, lt, pt_br, ru, sk, zh_cn

source: {productname} Documentation
cs: Dokumentace k {productname}
ja: {productname} ドキュメンテーション
ko: {productname} 설명서
lt: {productname} dokumentacija
pt_br: Documentação de {productname}
ru: {productname} Документация
sk: Dokumentácia {productname}
zh_cn: {productname} 文档

source: [.currentrel]**Version: {productnumber} {releaseversion}**
sk: [.currentrel]**Verzia: {productnumber} {releaseversion}**

source: **Version**: {productnumber}
ja: **バージョン**: {productnumber}
ko: **버전**: {productnumber}
pt_br: **Versão**: {productnumber}
sk: **Verzia**: {productnumber}
zh_cn: **版本**：{productnumber}

source: We are currently in the process of enhancing the [.currentrel]**{productnumber} {releaseversion}** documentation. As we transition from a traditional framework to a modern, containerized approach, please be aware of the following:
sk: V súčasnosti prebieha proces vylepšovania dokumentácie [.currentrel]**{productnumber} {releaseversion}**. Vzhľadom na to, že prechádzame z tradičného konceptu na moderný kontajnerový prístup, upozorňujeme na nasledujúce:

source: **Developmental Stage:** This documentation is actively being updated. You will encounter areas that are still under construction or evolving.
ja: **開発段階:** このドキュメンテーションは活発に更新されています。まだ作成中の領域や発展段階の領域が存在します。
sk: **Vývojové štádium:** Táto dokumentácia je aktívne aktualizovaná. Narazíte na oblasti, ktoré sú ešte vo fáze tvorby alebo sa vyvíjajú.
zh_cn: **开发阶段**：我们正在积极更新本文档。有些方面的内容仍在制作或改进中。

source: **Information Gaps:** During this transition, there may be gaps in the information provided. We are working diligently to update and complete all sections as quickly and efficiently as possible.
ja: **情報のギャップ:** この移行中は、提供される情報にギャップが存在する可能性があります。SUSEでは、すべてのセクションを可能な限り迅速かつ効率的に更新、完成できるよう、着実に取り組んでいます。
sk: **Informačné nedostatky:** Počas tohto prechodu sa môžu vyskytnúť nedostatky v poskytovaných informáciách.Usilovne pracujeme na čo najrýchlejšej a najefektívnejšej aktualizácii a dokončení všetkých sekcií.
zh_cn: **信息差距**：在此过渡期间，提供的信息可能存在差距。我们正在努力，以求尽快、高效地更新和完成所有章节。

source: **We Value Your Input:** Your feedback is crucial to us! If you find any aspects of the documentation unclear or notice missing information, please do not hesitate to reach out. We appreciate your questions and suggestions, which are vital in helping us improve.
ja: **ご意見をお聞かせください:** ユーザからのフィードバックはSUSEにとって非常に重要です。ドキュメンテーションに不明確な部分を見つけたり、情報に漏れがあることに気付いたりした場合は、お気軽にお知らせください。ユーザからのご質問、ご意見は改善において非常に重要です。皆様からのご質問、ご意見をお待ちしています。
sk: **Vážime si vaše pripomienky:** Vaša spätná väzba je pre nás veľmi dôležitá! Ak sa vám zdajú niektoré časti dokumentácie nejasné alebo ste si všimli chýbajúce informácie, neváhajte sa na nás obrátiť. Vážime si vaše otázky a návrhy, ktoré nám pomáhajú zlepšovať sa.
zh_cn: **我们重视您的意见：**您的反馈对我们非常重要！如果您发现本文档的任何方面不明确或缺少信息，请随时联系我们。非常感谢您提出的问题和建议，这对于帮助我们做出改进极其重要。

source: Submit feedback: https://github.com/uyuni-project/uyuni-docs/issues
ja: フィードバックのお送り先: https://github.com/uyuni-project/uyuni-docs/issues
ko: 피드백 제출: https://github.com/uyuni-project/uyuni-docs/issues
pt_br: Envie comentários: https://github.com/uyuni-project/uyuni-docs/issues
sk: Odoslanie spätnej väzby: https://github.com/uyuni-project/uyuni-docs/issues
zh_cn: 提交反馈：https://github.com/uyuni-project/uyuni-docs/issues

source: We are currently in the process of enhancing the [.currentrel]**{releaseversion}** documentation. As we transition from a traditional framework to a modern, containerized approach, please be aware of the following:
ja: SUSEでは目下、[.currentrel]**{releaseversion}**のドキュメンテーションの向上に取り組んでいます。従来のフレームワークからコンテナ化された最新のアプローチへの移行を進めるにあたり、次の点にご留意ください。
sk: V súčasnosti prebieha proces vylepšovania dokumentácie [.currentrel]**{releaseversion}**. Vzhľadom na to, že prechádzame z tradičného konceptu na moderný kontajnerový prístup, upozorňujeme na nasledujúce:
zh_cn: 我们目前正在完善 [.currentrel]**{releaseversion}** 文档。在我们从传统框架过渡到新式容器化方法的过程中，请注意以下几点：

source: We are currently in the process of enhancing the [.currentrel]**{productname} {productnumber}** documentation. As we transition from a traditional framework to a modern, containerized approach, please be aware of the following:
sk: V súčasnosti prebieha proces vylepšovania dokumentácie [.currentrel]**{productname} {productnumber}**. Vzhľadom na to, že prechádzame z tradičného konceptu na moderný kontajnerový prístup, upozorňujeme na nasledujúce:

source: What is {productname}?
cs: Co je to {productname}?
ja: {productname} とは？
ko: {productname}이(가) 무엇입니까?
lt: Kas yra {productname}?
pt_br: O que é {productname}?
ru: Что такое {productname}?
sk: Čo je {productname}?
zh_cn: 什么是 {productname}？

source: {productname} is a solution for organizations that require robust control over maintenance and package deployment on their servers. It enables you to manage large sets of Linux systems and keep them up-to-date, with automated software management, asset management, and system provisioning. It also allows you to maintain a high level of security while effectively managing system life-cycle requirements.
ja: {productname} はサーバに対するメンテナンスやパッケージ配備を制御したい組織向けのソリューションです。自動化されたソフトウェア管理やアセット管理、そしてシステムのプロビジョニング機能を利用することで、多数の Linux システムを管理して最新の状態に維持することができます。また、システムのライフサイクル要件を効率的に管理しながら、高いレベルのセキュリティを実現することができます。
ko: {productname}은(는) 서버의 유지 관리 및 패키지 배포에 대한 강력한 제어가 필요한 조직을 위한 솔루션입니다. 이 제품을 사용하면 자동화된 소프트웨어 관리, 자산 관리 및 시스템 프로비저닝을 통해 대규모 Linux 시스템 세트를 관리하고 최신 상태로 유지할 수 있습니다. 또한, 시스템 라이프싸이클 요구사항을 효과적으로 관리하면서 높은 수준의 보안을 유지할 수 있습니다.
pt_br: {productname} é uma solução para organizações que exigem controle robusto sobre manutenção e implantação de pacotes em seus servidores. Ele permite gerenciar grandes conjuntos de sistemas Linux e mantê-los atualizados, com gerenciamento automatizado de software, gerenciamento de ativos e provisionamento de sistema. Ele também permite manter um alto nível de segurança enquanto gerencia com eficácia os requisitos do ciclo de vida do sistema.
sk: {productname} je riešenie pre organizácie, ktoré vyžadujú spoľahlivú kontrolu nad údržbou a nasadzovaním balíkov na svojich serveroch. Umožňuje spravovať veľké sady linuxových systémov a udržiavať ich v aktuálnom stave pomocou automatizovanej správy softvéru, správy prostriedkov a poskytovania systémov. Tiež umožňuje zachovať vysokú úroveň bezpečnosti a zároveň efektívne riadiť požiadavky na životný cyklus systému.
zh_cn: {productname} 解决方案面向需要加强控制其服务器上的维护工作和软件包部署的组织。它可让您通过自动化软件管理、资产管理和系统置备来管理大型 Linux 系统集并使它们保持最新。它还可让您保持较高级别的安全性，同时有效管理系统生命周期方面的要求。

source: {productname} uses {salt} to provide event-driven configuration and management control. The Salt-master orchestrates tens of thousands of {salt} clients ({productname} clients) using remote execution.
ja: {productname} では {salt} と呼ばれる仕組みで、イベント駆動型の設定や管理制御を提供しています。{salt} マスターは数万もの {salt} クライアント ({productname} クライアント) をリモート実行の仕組みで制御します。
ko: {productname}은 {salt}를 사용하여 이벤트 기반 구성 및 관리 제어를 제공합니다. Salt-master는 원격 실행을 사용하여 수만 개의 {salt} 클라이언트({productname} 클라이언트)를 오케스트레이션합니다.
pt_br: {productname} usa {salt} para fornecer configuração orientada a eventos e controle de gerenciamento. O Salt-master orquestra dezenas de milhares de clientes {salt} (clientes {productname}) usando execução remota.
sk: {productname} používa {salt} na poskytovanie udalosťami riadenej konfigurácie a riadenia správy. Salt-master riadi desiatky tisíc klientov {salt} (klienti {productname}) pomocou vzdialeného spúšťania.
zh_cn: {productname} 使用 {salt} 提供事件驱动的配置和管理控制。Salt 主服务器使用远程执行方法来协调数万个 {salt} 客户端（{productname} 客户端）。

source: {productname} offers seamless management of {sle}, {opensuse}, {rhel}, {centos}, {oracle}, {ubuntu}, {debian}, {amazon}, {almalinux}, and {raspberrypios} client systems. They can be on-premise, or on public cloud, private cloud, hybrid cloud or even multi-cloud environments.
ja: {productname} は {sle}、{opensuse}、{rhel}、{centos}、{oracle}、{ubuntu}、{debian}、{amazon}、{almalinux}、および {raspberrypios} の各クライアントシステムを区別無く管理する機能を提供します。もちろんオンプレミスだけでなく、パブリッククラウドやプライベートクラウド、ハイブリッドクラウドからマルチクラウド環境まで、どの環境にも対応します。
ko: {productname}은(는) {sle}, {opensuse}, {rhel}, {centos}, {oracle}, {ubuntu}, {debian}, {amazon}, {almalinux} 및 {raspberrypios} 클라이언트 시스템의 원활한 관리를 제공합니다. 온프레미스 또는 공용 클라우드, 개인 클라우드, 하이브리드 클라우드 또는 다중 클라우드 환경일 수 있습니다.
pt_br: {productname} oferece gerenciamento contínuo de sistemas clientes {sle}, {opensuse}, {rhel}, {centos}, {oracle}, {ubuntu}, {debian}, {amazon}, {almalinux} e {raspberrypios}. Eles podem estar no local ou em nuvem pública, nuvem privada, nuvem híbrida ou até mesmo em ambientes multinuvem.
sk: {productname} ponúka bezproblémovú správu klientskych systémov {sle}, {opensuse}, {rhel}, {centos}, {oracle}, {ubuntu}, {debian}, {amazon}, {almalinux} a {raspberrypios}. Môžu byť on-premise alebo vo verejnom cloude, súkromnom cloude, hybridnom cloude alebo dokonca vo viaccloudových prostrediach.
zh_cn: {productname} 提供 {sle}、{opensuse}、{rhel}、{centos}、{oracle}、{ubuntu}、{debian}、{amazon}、{almalinux} 和 {raspberrypios} 客户端系统的无缝管理。这些系统可能位于本地、公有云、私有云、混合云，甚至是多云环境中。

source: If you cannot use the {productname} {webui}, almost all functionality (with the exception of virtualization tasks) is available from the command prompt. All command line tools can be used with assistive technology tools. Text readers ``orca`` and ``espeak`` can be enabled in the Desktop Applications Module. Speech recognition ``mycroft-core`` and ``sphinx`` are available in PackageHub. Additionally, you can interact with {productname} using the XML-RPC API.
cs: Nemůžete-li použít {productname} {webui}, jsou téměř všechny funkce (s výjimkou virtualizačních úkolů) dostupné z příkazového řádku. Všechny nástroje příkazového řádku lze použít s nástroji pomocných technologií. Čtečky textů ``orca`` a ``espeak`` lze povolit v modulu desktopových aplikací. Rozpoznávání řeči ``mycroft-core`` a ``sphinx`` jsou k dispozici v PackageHub. S produktem {productname} můžete navíc komunikovat na rozhraní API XML-RPC.
sk: Ak nemôžete použiť {productname} {webui}, takmer všetky funkcie (s výnimkou virtualizačných úloh) sú dostupné z príkazového riadku. Všetky nástroje príkazového riadka možno používať s nástrojmi asistenčných technológií. Čítačky textu ``orca`` a ``espeak`` je možné povoliť v module desktopových aplikácií. Rozpoznávanie reči ``mycroft-core`` a ``sphinx`` sú dostupné v PackageHub. Okrem toho môžete komunikovať s {productname} pomocou XML-RPC API.

source: For more information about [command]``spacecmd``, see xref:reference:spacecmd-intro.adoc[].
cs: Další informace o příkazu [command]``spacecmd`` viz xref:reference:spacecmd-intro.adoc[].
lt: Daugiau informacijos apie [command]spacecmd žr. xref:reference:spacecmd-intro.adoc[].
ru: Для получения дополнительной информации о [command]spacecmd см. xref:reference:spacecmd-intro.adoc[].
sk: Ďalšie informácie o [command]``spacecmd``nájdete v xref:reference:spacecmd-intro.adoc[].

source: For more information about other command line tools, see xref:reference:command-line-tools.adoc[].
cs: Informace o dalších nástrojích příkazového řádku viz xref:reference:command-line-toolss.adoc[].
lt: Daugiau informacijos apie kitus komandų eilutės įrankius žr. xref:reference:command-line-tools.adoc[].
ru: Для получения дополнительной информации о других инструментах командной строки см. xref:reference:command-line-tools.adoc[].
sk: Ďalšie informácie o ďalších nástrojoch príkazového riadka nájdete v xref:reference:command-line-tools.adoc[].

source: For more information about the API, see link:https://documentation.suse.com/suma/4.3/pdf/4.3_pdf_susemanager_api_doc_color_en.pdf[].
sk: Ďalšie informácie o API nájdete pod odkazom:https://documentation.suse.com/suma/4.3/pdf/4.3_pdf_susemanager_api_doc_color_en.pdf[].

source: For more information about the API, see https://www.uyuni-project.org/uyuni-docs-api/uyuni/index.html.
lt: Daugiau informacijos apie API žr. https://www.uyuni-project.org/uyuni-docs-api/uyuni/index.html.
ru: Для получения дополнительной информации об API см. https://www.uyuni-project.org/uyuni-docs-api/uyuni/index.html.
sk: Ďalšie informácie o API nájdete na https://www.uyuni-project.org/uyuni-docs-api/uyuni/index.html.

source: For the latest information about all command line tools, see the release notes available from https://www.suse.com/releasenotes/.
cs: Nejnovější informace o všech nástrojích příkazového řádku najdete v poznámkách k verzi, které jsou k dispozici na adrese https://www.suse.com/releasenotes/.
lt: Naujausios informacijos apie visus komandų eilutės įrankius ieškokite leidimo pastabose, pateikiamose adresu https://www.suse.com/releasenotes/.
ru: Для получения самой актуальной информации обо всех инструментах командной строки см. примечания к выпуску, доступные по адресу https://www.suse.com/releasenotes/.
sk: Najnovšie informácie o všetkých nástrojoch príkazového riadka nájdete v poznámkach k vydaniu, ktoré sú dostupné na https://www.suse.com/releasenotes/.

source: Available Documentation
cs: Dostupná dokumentace
ja: 利用可能なドキュメンテーション
ko: 사용 가능한 설명서
lt: Prieinama dokumentacija
pt_br: Documentação disponível
ru: Доступная документация
sk: Dostupná dokumentácia
zh_cn: 可用文档

source: The following documentation is available for {productname} version {productnumber}.
cs: Pro verzi {productname} modifikaci {productnumber} je k dispozici tato dokumentace.
ja: {productname} バージョン {productnumber} に対しては、下記のドキュメンテーションが提供されています。
ko: {productname} 버전 {productnumber}에 대하여 사용할 수 있는 설명서는 다음과 같습니다.
lt: Toliau pateikiama dokumentacija yra prieinama {productname} versijai {productnumber}.
ru: Следующая документация доступна для {productname} версии {productnumber}.
sk: Nasledujúca dokumentácia je k dispozícii pre {productname} verzia {productnumber}.
zh_cn: 为 {productname} 版本 {productnumber} 提供了以下文档。

source: | View HTML | View PDF | View HTML | View PDF | xref:quickstart:quickstart-overview.adoc[Quick Start] | icon:file-pdf[link="../pdf/suse_manager_quickstart_guide.pdf", window="_blank" role="green"] | xref:retail:retail-overview.adoc[Retail Guide] | icon:file-pdf[link="../pdf/suse_manager_retail_guide.pdf", window="_blank" role="green"] | xref:installation-and-upgrade:installation-and-upgrade-overview.adoc[Installation/Upgrade Guide] | icon:file-pdf[link="../pdf/suse_manager_installation-and-upgrade_guide.pdf", window="_blank" role="green"] | xref:reference:reference-overview.adoc[Reference Guide] | icon:file-pdf[link="../pdf/suse_manager_reference_guide.pdf", window="_blank" role="green"] | xref:client-configuration:client-config-overview.adoc[Client Configuration Guide] | icon:file-pdf[link="../pdf/suse_manager_client-configuration_guide.pdf", window="_blank" role="green"] | xref:common-workflows:common-workflows-overview.adoc[Common Workflows] | icon:file-pdf[link="../pdf/suse_manager_common-workflows_guide.pdf", window="_blank" role="green"] | xref:administration:admin-overview.adoc[Administration Guide] | icon:file-pdf[link="../pdf/suse_manager_administration_guide.pdf", window="_blank" role="green"] | xref:specialized-guides:specialized-guides-overview.adoc[Specialized Guides] | icon:file-pdf[link="../pdf/suse_manager_specialized-guides_guide.pdf", window="_blank" role="green"] ||
sk: | Zobraziť HTML | Zobraziť PDF | Zobraziť HTML | Zobraziť PDF | xref:quickstart:quickstart-overview.adoc[Stručný úvod] | icon:file-pdf[link="../pdf/suse_manager_quickstart_guide.pdf", window="_blank" role="green"] | xref:retail:retail-overview.adoc[Podrobný sprievodca] | icon:file-pdf[link="../pdf/suse_manager_retail_guide.pdf", window="_blank" role="green"] | xref:installation-and-upgrade:installation-and-upgrade-overview.adoc[Príručka inštalačná/zvýšenia verzie] | icon:file-pdf[link="../pdf/suse_manager_installation-and-upgrade_guide.pdf", window="_blank" role="green"] | xref:reference:reference-overview.adoc[Referenčná príručka] | icon:file-pdf[link="../pdf/suse_manager_reference_guide.pdf", window="_blank" role="green"] | xref:client-configuration:client-config-overview.adoc[Príručka konfigurácie klienta] | icon:file-pdf[link="../pdf/suse_manager_client-configuration_guide.pdf", window="_blank" role="green"] | xref:common-workflows:common-workflows-overview.adoc[Spoločné pracovné postupy] | icon:file-pdf[link="../pdf/suse_manager_common-workflows_guide.pdf", window="_blank" role="green"] | xref:administration:admin-overview.adoc[Príručka pre správu] | icon:file-pdf[link="../pdf/suse_manager_administration_guide.pdf", window="_blank" role="green"] | xref:specialized-guides:specialized-guides-overview.adoc[Špecializované príručky] | icon:file-pdf[link="../pdf/suse_manager_specialized-guides_guide.pdf", window="_blank" role="green"] ||

source: Download all PDFs icon:caret-right[] icon:file-archive[link="../susemanager-docs_en-pdf.zip"]
ko: 전체 PDF 다운로드 icon:caret-right[] icon:file-archive[link="../susemanager-docs_en-pdf.zip"]
sk: Stiahnuť všetky PDF icon:caret-right[] icon:file-archive[link="../susemanager-docs_en-pdf.zip"]
zh_cn: 下载所有 PDF icon:caret-right[] icon:file-archive[link="../susemanager-docs_en-pdf.zip"]

source: {productname} documentation is available in several locations and formats. For the most up-to-date version of this documentation, see https://documentation.suse.com/suma/. ====
ja: {productname} のドキュメンテーションはさまざまな場所にてさまざまな形式で公開されています。 このドキュメンテーションの最新版については、 https://documentation.suse.com/suma/ をお読みください。 ====
ko: {productname} 설명서는 다양한 위치 및 형식으로 사용할 수 있습니다. 이 설명서의 가장 최신 버전은 https://documentation.suse.com/suma/에서 확인할 수 있습니다. ====
sk: Dokumentácia {productname} je k dispozícii na viacerých miestach a vo viacerých formátoch. Najnovšiu verziu tejto dokumentácie nájdete na https://documentation.suse.com/suma/. ====
zh_cn: {productname} 文档在多个位置以多种格式提供。 有关本文档的最新版本，请参见 https://documentation.suse.com/suma/。 ====

source: | View HTML | View PDF | View HTML | View PDF | xref:quickstart:quickstart-overview.adoc[Quick Start] | icon:file-pdf[link="../pdf/uyuni_quickstart_guide.pdf", window="_blank" role="green"] | xref:retail:retail-overview.adoc[Retail Guide] | icon:file-pdf[link="../pdf/uyuni_retail_guide.pdf", window="_blank" role="green"] | xref:installation-and-upgrade:installation-and-upgrade-overview.adoc[Installation/Upgrade Guide] | icon:file-pdf[link="../pdf/uyuni_installation-and-upgrade_guide.pdf", window="_blank" role="green"] | xref:reference:reference-overview.adoc[Reference Guide] | icon:file-pdf[link="../pdf/uyuni_reference_guide.pdf", window="_blank" role="green"] | xref:client-configuration:client-config-overview.adoc[Client Configuration Guide] | icon:file-pdf[link="../pdf/uyuni_client-configuration_guide.pdf", window="_blank" role="green"] | xref:common-workflows:common-workflows-overview.adoc[Common Workflows] | icon:file-pdf[link="../pdf/uyuni_common-workflows_guide.pdf", window="_blank" role="green"] | xref:administration:admin-overview.adoc[Administration Guide] | icon:file-pdf[link="../pdf/uyuni_administration_guide.pdf", window="_blank" role="green"] | xref:specialized-guides:specialized-guides-overview.adoc[Specialized Guides] | icon:file-pdf[link="../pdf/uyuni_specialized-guides_guide.pdf", window="_blank" role="green"] ||
sk: | Zobraziť HTML | Zobraziť PDF | Zobraziť HTML | Zobraziť PDF | xref:quickstart:quickstart-overview.adoc[Stručný úvod] | icon:file-pdf[link="../pdf/uyuni_quickstart_guide.pdf", window="_blank" role="green"] | xref:retail:retail-overview.adoc[Podrobný sprievodca] | icon:file-pdf[link="../pdf/uyuni_retail_guide.pdf", window="_blank" role="green"] | xref:installation-and-upgrade:installation-and-upgrade-overview.adoc[Príručka inštalačná/zvýšenia verzie] | icon:file-pdf[link="../pdf/uyuni_installation-and-upgrade_guide.pdf", window="_blank" role="green"] | xref:reference:reference-overview.adoc[Referenčná príručka] | icon:file-pdf[link="../pdf/uyuni_reference_guide.pdf", window="_blank" role="green"] | xref:client-configuration:client-config-overview.adoc[Príručka konfigurácie klienta] | icon:file-pdf[link="../pdf/uyuni_client-configuration_guide.pdf", window="_blank" role="green"] | xref:common-workflows:common-workflows-overview.adoc[Spoločné pracovné postupy] | icon:file-pdf[link="../pdf/uyuni_common-workflows_guide.pdf", window="_blank" role="green"] | xref:administration:admin-overview.adoc[Príručka pre správu] | icon:file-pdf[link="../pdf/uyuni_administration_guide.pdf", window="_blank" role="green"] | xref:specialized-guides:specialized-guides-overview.adoc[Špecializované príručky] | icon:file-pdf[link="../pdf/uyuni_specialized-guides_guide.pdf", window="_blank" role="green"] ||

source: Download all PDFs icon:caret-right[] icon:file-archive[link="../uyuni-docs_en-pdf.zip"]
ja: 全ての PDF をダウンロード: icon:caret-right[] icon:file-archive[link="../uyuni-docs_en-pdf.zip"]
ko: 전체 PDF 다운로드 icon:caret-right[] icon:file-archive[link="../uyuni-docs_en-pdf.zip"]
sk: Stiahnuť všetky PDF icon:caret-right[] icon:file-archive[link="../uyuni-docs_en-pdf.zip"]
zh_cn: 下载所有 PDF icon:caret-right[] icon:file-archive[link="../uyuni-docs_en-pdf.zip"]

source: xref:common_gfdl1.2_i.adoc[License]
cs: xref:common_gfdl1.2_i.adoc[License] (Licence)
lt: xref:common_gfdl1.2_i.adoc[Licencija]
ru: xref:common_gfdl1.2_i.adoc[Лицензия]

source: {productname} is a solution for organizations that require robust control over maintenance and package deployment on their servers. {productname} enables you to manage large sets of Linux systems and keep them up-to-date, with automated software management, asset management, and system provisioning. {productname} allows you to maintain a high level of security while effectively managing system life-cycle requirements.
lt: {productname} yra sprendimas organizacijoms, kurioms reikia patikimos priežiūros ir paketų diegimo savo serveriuose kontrolės. {productname} leidžia valdyti didelius Linux sistemų rinkinius ir palaikyti jų naujausią būseną, naudojant automatizuotą programinės įrangos valdymą, turto valdymą ir sistemų parengimą. {productname} leidžia išlaikyti aukštą saugumo lygį, efektyviai valdant sistemų gyvavimo ciklo reikalavimus.
ru: {productname} — это решение для организаций, которым требуется надежный контроль над обслуживанием и развертыванием пакетов на своих серверах. {productname} позволяет вам управлять большими наборами Linux-систем и поддерживать их в актуальном состоянии благодаря автоматизированному управлению программным обеспечением, управлению активами и подготовке систем. {productname} позволяет поддерживать высокий уровень безопасности, эффективно управляя требованиями к жизненному циклу систем.

source: {productname} uses Salt to provide event-driven configuration and management control. The Salt-master orchestrates tens of thousands of Salt clients ({productname} Clients) using remote execution.
cs: {productname} používá Salt k zajištění konfigurace a správy řízené událostmi. Salt-master spravuje desítky tisíc klientů Salt (klienti {productname}) pomocí vzdáleného spuštění.
lt: {productname} naudoja Salt, kad užtikrintų įvykių valdomą konfigūravimo ir valdymo kontrolę. Salt-master, naudodamas nuotolinį vykdymą, orkestruoja dešimtis tūkstančių Salt klientų ({productname} klientų).
ru: {productname} использует Salt для обеспечения событийно-ориентированного контроля конфигурации и управления. Salt-master оркестрирует десятки тысяч клиентов Salt ({productname} Clients), используя удаленное выполнение.
