Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: Check the details and click btn:[Delete Profile] to confirm.
ca: Comproveu els detalls i feu clic a btn:[Suprimeix el perfil] per a confirmar-ho.
ja: 詳細を確認し、btn:[プロファイルの削除]をクリックして確認します。
ko: 상세 정보를 확인하고 btn:[프로파일 삭제]를 클릭하여 확인합니다.
zh_cn: 检查细节并单击 btn:[删除配置文件] 确认。

source: For {salt} clients, {productname} attempts to clean up additional configuration. If the client cannot be contacted, you are given the option to cancel the deletion, or delete the client without cleaning up the configuration files.
ca: Per als clients de Salt, {productname} intenta netejar la configuració addicional. Si no es pot contactar amb el client, se li dona l'opció de cancel·lar la supressió, o eliminar el client sense netejar els fitxers de configuració.

source: You can also delete multiple clients using the System Set Manager. For more information about the System Set Manager, see xref:client-configuration:system-set-manager.adoc[].
ca: Podeu aplicar accions de gestió d'energia a múltiples clients al mateix temps, afegint-les al gestor de conjunts de sistemes. Per obtenir més informació sobre l'ús del gestor de conjunts de sistemes, vegeu xref:client-configuration:system-set-manager.adoc[].

source: Cleaning up a client only disables {salt} and stops the service if possible. It does not uninstall the package.
ca: La neteja d'un client només desactiva {salt} i atura el servei si és possible. No desinstal·la el paquet.

source: Delete a client on the command line (with API call)
ca: Suprimeix un client a la línia d'ordres (amb crida API)

source: Procedure: Deleting a client from the server
ca: Procediment: suprimir un client del servidor

source: Delete the client with the FQDN (Fully Qualified Domain Name):
ca: Suprimeix el client amb el FQDN (Nom de domini complet):
ja: FQDN (完全修飾ドメイン名)を持つクライアントを削除します。
ko: FQDN(정규화된 도메인 이름)이 있는 클라이언트를 삭제합니다.
zh_cn: 使用 FQDN（完全限定的域名）删除客户端：

source: [command]``spacecmd system_delete`` also deletes the {salt} key.
ca: [command].spacecmd systemdelete. també elimina la tecla {salt}.

source: [command]``system_delete`` offers the following options:
ca: [ordre]:systemdelete the ofereix les següents opcions:
ja: [command]``system_delete``は以下のオプションを提供します。
ko: [command]``system_delete``에서 제공되는 옵션은 다음과 같습니다.
zh_cn: [command]``system_delete`` 提供以下选项：

source: usage: system_delete [options] <SYSTEMS>
ca: ús: systemdelete [opcions] <SYSTEMS>
zh_cn: usage: system_delete [选项] <系统>

source: options: -c TYPE - Possible values: * 'FAIL_ON_CLEANUP_ERR' - fail in case of cleanup error, * 'NO_CLEANUP' - do not cleanup, just delete, * 'FORCE_DELETE' - try cleanup first but delete server anyway in case of error
ca: opcions: -c TIPUS - Valors possibles: * 'FAILONCLEANUPERR' - falla en cas d'error de neteja, * 'NOCLEANUP' - no netejar, només esborrar, * 'FORCEDELETE' - intenteu netejar primer però suprimiu el servidor de totes maneres en cas d'error
ko: 옵션: -c TYPE - 사용할 수 있는 값: * 'FAIL_ON_CLEANUP_ERR' - 정리 오류 발생 시 실패, * 'NO_CLEANUP' - 삭제만 수행하고 정리하지 않음, * 'FORCE_DELETE' - 우선 정리를 시도하지만, 오류 발생 시 서버 삭제
zh_cn: 选项： -c TYPE - 可能的值： * 'FAIL_ON_CLEANUP_ERR' - 如果发生清理错误则失败， * 'NO_CLEANUP' - 不清理，仅删除， * 'FORCE_DELETE' - 先尝试清理，但在发生错误时仍会 删除服务器

source: Delete client from the command line
ca: Suprimeix el client des de la línia d'ordres

source: This process is for {productname} clients only. Do not run it on the {productname} Server itself.
ca: Aquest procés només és per a clients {productname}. No l'executeu al servidor {productname}.

source: You must not execute the following procedure on clients running {rhel}, {debian}, or clones. Instead of [command]``zypper`` use equivalent packager commands such as [command]``yum``, [command]``dnf``, or [command]``apt``.
ca: No heu d'executar el procediment següent als clients que executen {rhel}, {debian} o clons. En lloc de [ordre].zypper. utilitza ordres equivalents de paqueter com [ordre].yum,, [ordre].dnf., o [ordre].apt..
ja: {rhel}、{debian}、またはクローンを実行しているクライアントでは、次のプロシージャを実行しないでください。 [command]``zypper``の代わりに、[command]``yum``、[command]``dnf``、[command]``apt``のような同等のパッケージャコマンドを使用します。
ko: {rhel}, {debian} 또는 클론을 실행하는 클라이언트에서 다음 절차를 실행해서는 안 됩니다. [command]``zypper`` 대신, [command]``yum``, [command]``dnf`` 또는 [command]``apt``와 같은 패키지 작성 도구 명령을 사용하십시오.
zh_cn: 请勿在运行 {rhel}、{debian} 或克隆的客户端上执行以下过程，而是应使用与 [command]``zypper`` 效果相同的打包器命令，例如 [command]``yum``、[command]``dnf`` 或 [command]``apt``。

source: Procedure: Deleting SLES 12 and 15 clients
ca: Procediment: suprimir clients SLES 12 i 15

source: Stop the salt-minion service:
ca: Reinicia el servei [systemitem]:salt-minion::
ja: salt-minionサービスを停止します。
ko: 다음과 같이 salt-minion 서비스를 중지합니다.
zh_cn: 停止 salt-minion 服务：

source: systemctl stop salt-minion
ca: systemctl reinicia salt-minion

source: Remove the repositories and configuration files:
ca: Exemple: Fitxer de configuració JSON exportat:
ja: リポジトリと設定ファイルを削除します。
ko: 리포지토리 및 구성 파일 제거:
zh_cn: 去除储存库和配置文件：

source: Remove Client Packages:
ca: Procediment: Comparació de paquets de clients
ja: クライアントパッケージを削除します。
ko: 클라이언트 패키지 제거:
zh_cn: 去除客户端软件包：

source: zypper rm salt salt-minion python*-salt sle-manager-tools-release
ca: zypper rm sal sal-minió pitó*-sal sle-manager-tools-release

source: Procedure: {salt} bundle client - manual registration cleanup
ca: Procediment: client del paquet {salt}: neteja manual del registre

source: To unregister, run:
ca: Per a desregistrar, executeu:
ja: 登録解除するには、次のコマンドを実行します。
ko: 등록을 취소하려면 다음을 실행합니다.
zh_cn: 要取消注册，请运行以下命令：

source: Remove client machine ID:
ca: Supressió de l'ID de la màquina client:

source: For information about the {salt} bundle, see xref:client-configuration:contact-methods-saltbundle.adoc[].
ca: Per a més informació sobre el fibrat de sal, vegeu xref:client-configuration:contact-methods-saltbundle.adoc[Salt Bundle].

source: GPG Keys
ca: Tecles GPG
ko: GPG 키
zh_cn: GPG 密钥

source: In most cases, you do not need to adjust the GPG settings to be able to install software on your clients.
ca: En la majoria dels casos, no cal que ajusteu la configuració de GPG per a poder instal·lar programari als vostres clients.
ja: ほとんどの場合、クライアントにソフトウェアをインストールできるようにGPG設定を調整する必要はありません。
ko: 대부분의 경우 GPG 설정을 조정하지 않아도 클라이언트에 소프트웨어를 설치할 수 있습니다.
zh_cn: 在大多数情况下，您无需调整 GPG 设置即可在您的客户端上安装软件。

source: RPM packages can be signed directly, while Debian based systems sign only the metadata and use a chain of checksums to secure the packages. Most RPM based systems use signed metadata in addition to signed packages.
ca: Els paquets RPM es poden signar directament, mentre que els sistemes basats en Debian només signen les metadades i utilitzen una cadena de sumes de verificació per assegurar els paquets. La majoria de sistemes basats en RPM utilitzen metadades signades, a més de paquets signats.
ja: RPMパッケージに直接署名することはできますが、Debianベースのシステムではメタデータにのみ署名し、チェックサムのチェーンを使用してパッケージを保護します。 RPMベースのほとんどのシステムでは、署名されたパッケージに加え、署名されたメタデータも使用します。
ko: RPM 패키지에는 직접 서명할 수 있지만, Debian 기반 시스템은 메타데이터에만 서명하고 체크섬 체인을 사용하여 패키지를 보호합니다. 대부분의 RPM 기반 시스템은 서명된 패키지뿐만 아니라 서명된 메타데이터를 사용합니다.
zh_cn: 可以直接对 RPM 软件包签名，而基于 Debian 的系统仅会对元数据签名并使用校验和链来保障软件包的安全。大多数基于 RPM 的系统除了使用已签名软件包外，还会使用已签名元数据。

source: Package Management
ca: Gestió de paquets
ja: パッケージ管理
ko: 패키지 관리
zh_cn: 软件包管理

source: Clients use packages to install, uninstall, and upgrade software.
ca: Els clients utilitzen paquets per instal·lar, desinstal·lar i actualitzar programari.
ja: クライアントは、パッケージを使用してソフトウェアをインストール、アンインストール、およびアップグレードします。
ko: 클라이언트는 패키지를 사용해 소프트웨어를 설치, 제거 및 업그레이드합니다.
zh_cn: 客户端使用软件包来安装、卸装和升级软件。

source: To manage packages on a client, navigate to [guimenu]``Systems``, click the client to manage, and navigate to the menu:Systems[Software > Packages] subtab. The options available in this section vary depending on the type of client you have selected, and its current channel subscriptions.
ca: Per gestionar paquets en un client, navegueu a [guimenu].Sistemes., feu clic al client per gestionar-los i navegueu a la subpestanya menú:Sistemes[Software . Paquets]. Les opcions disponibles en aquesta secció varien en funció del tipus de client que hagis seleccionat, i de les seves subscripcions al canal actual.
ja: クライアントでパッケージを管理するには、［[guimenu]``システム``］に移動し、管理するクライアントをクリックし、menu:システム[ソフトウェア > パッケージ]サブタブに移動します。 このセクションで使用できるオプションは、選択したクライアントのタイプ、および現在のチャンネルのサブスクリプションによって異なります。
ko: 클라이언트에서 패키지를 관리하려면 [guimenu]``시스템``으로 이동하여 관리할 클라이언트를 클릭한 후 menu:시스템[소프트웨어 > 패키지] 하위 탭으로 이동하십시오. 이 섹션에서 사용 가능한 옵션은 선택한 클라이언트의 유형과 현재 채널 구독에 따라 달라집니다.
zh_cn: 要管理客户端上的软件包，请导航到[guimenu]``系统``，单击要管理的客户端，然后导航到menu:系统[软件 > 软件包]子选项卡。此部分提供的选项取决于您选择的客户端类型及其当前的通道订阅。

source: Most package management actions can be added to action chains. For more about action chains, see xref:reference:schedule/action-chains.adoc[].
ca: La majoria de les accions de gestió de paquets es poden afegir a les cadenes d'acció. Per obtenir més informació sobre les cadenes d'acció, vegeu xref:reference:schedule/action-chains.adoc[].
ja: ほとんどのパッケージ管理アクションは、アクションチェーンに追加できます。 アクションチェーンの詳細については、xref:reference:schedule/action-chains.adoc[]を参照してください。
ko: 대부분의 패키지 관리 작업을 작업 체인에 추가할 수 있습니다. 작업 체인에 대한 자세한 내용은 xref:reference:schedule/action-chains.adoc[]을 참조하십시오.
zh_cn: 大多数软件包管理操作都可以添加到操作链中。有关操作链的详细信息，请参见 xref:reference:schedule/action-chains.adoc[]。

source: When packages are installed or upgraded, licenses or EULAs are automatically accepted.
ca: Quan els paquets s'instal·len o s'actualitzen, les llicències o els EULA s'accepten automàticament.
ja: パッケージをインストールまたはアップグレードするとき、ライセンスまたはEULAは自動的に受け入れられます。
ko: 패키지가 설치되거나 업그레이드되면 라이선스 또는 EULA가 자동으로 수락됩니다.
zh_cn: 安装或升级软件包时，将自动接受许可证或 EULA。

source: Compare Packages Using Profiles
ca: Compara els paquets utilitzant perfils

source: You can compare the packages installed on a client with a stored profile, or with packages installed on another client. When the comparison is made, you can choose to modify the selected client to match.
ca: Podeu comparar els paquets instal·lats en un client amb un perfil emmagatzemat, o amb els paquets instal·lats en un altre client. Quan es faci la comparació, podeu triar modificar el client seleccionat perquè coincideixi.
ja: 保存されているプロファイルでクライアントにインストールされたパッケージを比較できます。または別のクライアントにインストールされたパッケージと比較できます。 比較を実行するとき、選択したクライアントを一致するように変更できます。
ko: 클라이언트에 설치한 패키지를 저장한 프로파일 또는 다른 클라이언트에 설치한 패키지와 비교할 수 있습니다. 비교할 때 선택한 클라이언트가 일치하도록 수정하는 쪽을 선택할 수 있습니다.
zh_cn: 您可以将某个客户端上安装的软件包与存储的配置文件进行比较，或者与其他客户端上安装的软件包进行比较。比较时，您可以选择修改选定要匹配的客户端。

source: To compare packages against a profile, you need to have stored a profile. Profiles are created from the packages on a currently installed client. When the profile has been created, you can use it to install more clients with the same packages installed.
ca: Per comparar paquets amb un perfil, heu de tenir emmagatzemat un perfil. Els perfils es creen a partir dels paquets en un client instal·lat actualment. Quan s'ha creat el perfil, podeu utilitzar-lo per instal·lar més clients amb els mateixos paquets instal·lats.
ja: パッケージをプロファイルと比較するには、プロファイルを保存済みである必要があります。 プロファイルは、現在インストールされているクライアントのパッケージから作成されます。 プロファイルを作成したら使用して、同じインストール済みパッケージで別のクライアントをインストールできます。
ko: 패키지를 프로파일과 비교하려면 프로파일을 이미 저장했어야 합니다. 프로파일은 현재 설치되어 있는 클라이언트의 패키지에서 생성합니다. 프로파일을 생성했으면 이 프로파일을 사용해 동일한 패키지가 설치된 클라이언트를 추가 설치할 수 있습니다.
zh_cn: 将软件包与某个配置文件进行比较之前，您需要先存储一个配置文件。配置文件基于当前安装的客户端上的软件包创建。如果已创建配置文件，您可以使用它安装更多客户端，这些客户端中均会安装相同的软件包。

source: Procedure: Creating a Stored Profile
ca: Procediment: Creació d'un perfil emmagatzemat
ja: プロシージャ: 保存されているプロファイルの作成
ko: 절차: 저장 프로파일 생성
zh_cn: 过程：创建存储的配置文件

source: In the {productname} {webui}, navigate to [guimenu]``Systems``, click the client to base your profile off, and navigate to the menu:Systems[Software > Packages > Profiles] subtab.
ca: A la {productname} {webui}, navegueu a [guimenu].Sistemes., feu clic al client per a desactivar el vostre perfil i navegueu al menú:Sistemes[Software . Paquets . Perfils] subpestanya.
ja: {productname}の{webui}で、［[guimenu]``システム``］に移動し、プロファイルのベースになっているクライアントをクリックし、menu:システム[ソフトウェア > パッケージ > プロファイル]サブタブに移動します。
ko: {productname} {webui}에서 [guimenu]``시스템``으로 이동하여 프로파일이 기반을 두고 있는 클라이언트를 클릭하고 menu:시스템[소프트웨어 > 패키지 > 프로파일] 하위 탭으로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到[guimenu]``系统``，单击配置文件要基于的客户端，然后导航到menu:系统[软件 > 软件包 > 配置文件]子选项卡。

source: Click btn:[Create System Profile].
ca: Feu clic a btn:[Crea el perfil del sistema].
ja: btn:[システムプロファイルの作成]をクリックします。
ko: btn:[시스템 프로파일 생성]을 클릭합니다.
zh_cn: 单击 btn:[创建系统配置文件]。

source: Type a name and description for your profile and click btn:[Create Profile].
ca: Escriviu un nom i una descripció per al vostre perfil i feu clic a btn:[Crea un perfil].
ja: プロファイルの名前と説明を入力し、btn:[プロファイルの作成]をクリックします。
ko: 프로파일 이름 및 설명을 입력하고 btn:[프로파일 생성]을 클릭합니다.
zh_cn: 键入您的配置文件的名称和说明，然后单击 btn:[创建配置文件]。

source: Procedure: Comparing Client Packages
ca: Procediment: Comparació de paquets de clients
ja: プロシージャ: クライアントパッケージの比較
ko: 절차: 클라이언트 패키지 비교
zh_cn: 过程：比较客户端软件包

source: In the {productname} {webui}, navigate to [guimenu]``Systems``, click the client to compare, and navigate to the menu:Systems[Software > Packages > Profiles] subtab.
ca: A la {productname} {webui}, navegueu a [guimenu].Sistemes., feu clic al client per comparar i navegueu al menú:Sistemes[Software . Paquets . Perfils] subpestanya.
ja: {productname}の{webui}で、［[guimenu]``システム``］に移動し、比較するクライアントをクリックし、menu:システム[ソフトウェア > パッケージ > プロファイル]サブタブに移動します。
ko: {productname} {webui}에서 [guimenu]``시스템``으로 이동하여 비교할 클라이언트를 클릭하고 menu:시스템[소프트웨어 > 패키지 > 프로파일] 하위 탭으로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到[guimenu]``系统``，单击要比较的客户端，然后导航到menu:系统[软件 > 安装包 > 配置文件]子选项卡。

source: To compare with a stored profile, select the profile and click btn:[Compare].
ca: Per comparar amb un perfil emmagatzemat, seleccioneu el perfil i feu clic a btn:[Compara].
ja: 保存されているプロファイルを比較するには、プロファイルを選択し、btn:[比較]をクリックします。
ko: 저장된 프로파일과 비교하려면 프로파일을 선택하고 btn:[비교]를 클릭하십시오.
zh_cn: 要与存储的配置文件进行比较，请选择该配置文件，然后单击 btn:[比较]。

source: To compare with another client, select the client name and click btn:[Compare] to see a list of differences between the two clients.
ca: Per comparar amb un altre client, seleccioneu el nom del client i feu clic a btn:[Compare] per veure una llista de diferències entre els dos clients.
ja: 別のクライアントと比較するには、クライアント名を選択し、btn:[比較]をクリックし、2つのクライアントの差異一覧を表示します。
ko: 다른 클라이언트와 비교하려면 클라이언트 이름을 선택하고 btn:[비교]를 클릭하여 두 클라이언트 간의 차이점 목록을 살펴봅니다.
zh_cn: 要与其他客户端进行比较，请选择客户端名称，然后单击 btn:[比较] 查看两个客户端之间的差别的列表。

source: Orphaned Packages
ca: Paquets instal·lats

source: Orphaned packages are packages synchronized by {productname} that are not associated with a software channel. Therefore, orphaned packages are usually not available to {productname} clients and users cannot install such packages without additional effort.
ca: Els paquets orfes són paquets sincronitzats per {productname} que no estan associats amb un canal de programari. Per tant, els paquets orfes normalment no estan disponibles per als clients de {productname} i els usuaris no poden instal·lar aquests paquets sense un esforç addicional.

source: A package can become orphaned as a result of one of the following events:
ca: Un paquet pot quedar orfe com a resultat d'un dels següents esdeveniments:

source: A synchronized repository removes a package. By default, {productname} unlinks such a package from the channel, but does not remove the package.
ca: Un repositori sincronitzat elimina un paquet. De manera predeterminada, {productname} desenllaça aquest paquet del canal, però no el suprimeix.

source: A repository supersedes a package with a newer version and thus removes the previous version.
ca: Un repositori substitueix un paquet amb una versió més nova i, per tant, elimina la versió anterior.

source: The reposync process got interrupted (for example, because of an out of space exception) and thus downloaded packages were not associated with a channel.
ca: El procés de reposync es va interrompre (per exemple, a causa d'una excepció d'espai) i per tant els paquets descarregats no estaven associats amb un canal.

source: Users manually uploaded packages, but did not associate them with any channel.
ca: Els usuaris van carregar manualment els paquets, però no els van associar a cap canal.

source: Orphaned packages cost space in user environment and cannot be easily distributed to clients because they are not associated with a channel. Orphaned package can make sense with specific workflows like bootstrapping or customer-specific procedures.
ca: Els paquets orfes costen espai en l'entorn d'usuari i no es poden distribuir fàcilment als clients perquè no estan associats amb un canal. El paquet orfatitzat pot tenir sentit amb fluxos de treball específics com el bootstrapping o els procediments específics del client.

source: You can view orphaned packages in the {webui} by clicking menu:Software[Manage > Packages > view Packages in no channel].
ca: Podeu veure els paquets orfes a {webui} fent clic a menú:Software[Gestionar the Paquets the veure Paquets en cap canal].

source: {productname} periodically runs a taskomatic job that searches for orphaned packages and modifies the package organization ID to 1. This means that you can delete orphaned packages only after the taskomatic job execution. If you encounter an orphaned package that you cannot delete, wait 24 hours and try the deletion again.
ca: {productname} executa periòdicament una tasca taskomatic que cerca paquets orfes i modifica l'ID de l'organització de paquets a 1. Això significa que només podeu suprimir paquets orfes després de l'execució de la tasca taskomatic. Si trobeu un paquet orfe que no podeu suprimir, espereu 24 hores i torneu a intentar suprimir-lo.

source: Delete orphaned packages:
ca: Paquets instal·lats

source: with command line tools targeting individual packages. For example:
ca: amb eines de línia d'ordres orientades a paquets individuals. Per exemple:

source: spacecmd package_remove zypper-1.14.52-150400.1.9.x86_64
ca: spacecmd paquet Elimina el zypper-1.14.52-150400.1.9.x8664

source: with command line tools targeting all orphaned packages at once:
ca: amb eines de línia d'ordres orientades a tots els paquets orfes alhora:

source: Patch Management
ca: Gestió de pedaços
ja: パッチ管理
ko: 패치 관리
zh_cn: 补丁管理

source: You can use custom patches within your organization to manage clients. This allows you to issue patch alerts for packages in custom channels, schedule patch installation, and manage patches across organizations.
ca: Pots utilitzar pedaços personalitzats dins de la teva organització per gestionar clients. Això permet emetre alertes de pedaç per als paquets en canals personalitzats, programar la instal·lació de pedaç i gestionar pedaços entre les organitzacions.
ja: 組織内でカスタムパッチを使用してクライアントを管理できます。 この方法では、カスタムチャンネルのパッケージのパッチ警告の発行、パッチインストールのスケジュール、組織間のパッチの管理を実行できます。
ko: 조직 내 사용자 정의 패치를 사용해 클라이언트를 관리할 수 있습니다. 이를 통해 사용자 정의 채널에 있는 패키지에 대해 패치 경고를 발급하고, 패치 설치 일정을 잡고, 여러 조직에 걸쳐 패치를 관리할 수 있습니다.
zh_cn: 您可以在组织中使用自定义补丁来管理客户端。通过这种方式，您可以在自定义通道中发布软件包的补丁警报、安排补丁安装，并在组织中管理补丁。

source: Create Patches
ca: Crea pedaços
ja: パッチの作成
ko: 패치 생성
zh_cn: 创建补丁

source: To use a custom patch, you need to create the patch, add packages to it and add it to one or more channels.
ca: Per utilitzar un pedaç personalitzat, heu de crear el pedaç, afegir-hi paquets i afegir-lo a un o més canals.
ja: カスタムパッチを使用するには、パッチを作成し、これにパッケージを追加し、1つまたは複数のチャンネルに追加する必要があります。
ko: 사용자 정의 패치를 사용하려면 패치를 생성하여 패키지를 추가하고 패치를 하나 이상의 채널에 추가하십시오.
zh_cn: 要使用自定义补丁，您需要创建一个补丁，向其添加软件包，并将其添加到一个或多个通道。

source: Procedure: Creating a Custom Patch
ca: Procediment: Creació d'un pedaço personalitzat
ja: プロシージャ: カスタムパッチの作成
ko: 절차: 사용자 정의 패치 생성
zh_cn: 过程：创建自定义补丁

source: In the {productname} {webui}, navigate to menu:Patches[Manage Patches], click btn:[Create Patch].
ca: A {productname} {webui}, navegueu al menú:Patches[Manage Patches], feu clic a btn:[Create Patch].
ja: {productname}の{webui}で、menu:パッチ[パッチの管理]に移動し、btn:[パッチの作成]をクリックします。
ko: {productname} {webui}에서 menu:패치[패치 관리]로 이동하여 btn:[패치 생성]을 클릭합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:补丁[管理补丁]，单击 btn:[创建补丁]。

source: In the ``Create Patch`` section, use these details:
ca: A la secció Crea un pedaç, useu aquests detalls:
ja: ［``パッチの作成``］セクションで、次の詳細を使用します。
ko: ``패치 생성`` 섹션에서 다음과 같은 상세 정보를 사용합니다.
zh_cn: 在``创建补丁``部分，使用以下细节：

source: In the ``Synopsis`` field, type a short description of the patch.
ca: En el camp .Sinopsi., escriviu una breu descripció del pedaç.
ja: ［``概要``］フィールドにパッチの短い説明を入力します。
ko: ``기본 설명`` 필드에 패치에 대한 짧은 설명을 입력합니다.
zh_cn: 在``摘要``字段中，键入补丁的简要说明。

source: In the ``Advisory`` field, type a label for the patch.
ca: Al camp .Assessoria., escriviu una etiqueta per al pedaç.
ja: ［``アドバイザリ``］フィールドにパッチのラベルを入力します。
ko: ``권고`` 필드에 패치의 레이블을 입력합니다.
zh_cn: 在``建议``字段中，键入补丁的标签。

source: We recommend you devise a naming convention for your organization to make patch management easier.
ca: Et recomanem que dissenyis una convenció de naming per a la teva organització per facilitar la gestió de patch.
ja: 組織の命名規則を使用して、パッチの管理を簡単にすることをお勧めします。
ko: 조직이 패치 관리를 더 쉽게 할 수 있도록 명명 규칙을 고안하는 것이 좋습니다.
zh_cn: 建议您为组织设计一个命名约定，以便于进行补丁管理。

source: In the ``Advisory Release`` field, enter a release number for your patch.
ca: Al camp .Advisory Release., introduïu un número de llançament per al vostre pedaç.
ja: ［``アドバイザリリリース``］フィールドにパッチのリリース番号を入力します。
ko: ``권고 릴리스`` 필드에 패치의 릴리스 번호를 입력합니다.
zh_cn: 在``建议版本``字段中，输入补丁的版本号。

source: For example, if this is the first version of this patch, use ``1``.
ca: Per exemple, si aquesta és la primera versió d'aquest pedaç, utilitzeu 11..
ja: たとえば、このパッチの最初のバージョンの場合、``1``を使用します。
ko: 예를 들어 해당 패치의 첫 버전인 경우 ``1``을 사용하십시오.
zh_cn: 例如，如果这是该补丁的第一个版本，请使用 ``1``。

source: In the ``Advisory Type`` field, select the type of patch to use.
ca: Al camp .Tipus d'assessorament., seleccioneu el tipus de pedaç a utilitzar.
ja: ［``アドバイザリタイプ``］フィールドで、使用するパッチのタイプを選択します。
ko: ``권고 유형`` 필드에서 사용할 패치의 유형을 선택합니다.
zh_cn: 在``建议类型``字段中，选择要使用的补丁类型。

source: For example, ``Bug Fix Advisory`` for a patch that fixes errors.
ca: Per exemple, .Bug Fix Advisory. per a un pedaç que corregeix els errors.
ko: 예를 들어 오류를 수정하는 패치의 경우 ``버그 수정 권고``입니다.
zh_cn: 例如，针对修复错误的补丁选择 ``Bug 修复建议``。

source: If you selected an advisory type of ``Security Advisory``, in the ``Advisory Severity`` field, select the severity level to use.
ca: Si heu seleccionat un tipus d'assessorament de .Security Advisory., en el camp .Severity Assessora., seleccioneu el nivell de gravetat a utilitzar.
ja: ［``セキュリティアドバイザリ``］のアドバイザリタイプを選択した場合、使用するセキュリティレベルを［``アドバイザリの重要度``］フィールドで選択します。
ko: ``보안 권고``라는 권고 유형을 선택한 경우 ``권고 심각도`` 필드에서, 사용할 심각도 수준을 선택하십시오.
zh_cn: 如果您选择``安全建议``建议类型，请在``建议严重性``字段中选择要使用的严重性级别。

source: In the ``Product`` field, type the name of the product this patch refers to.
ca: En el camp .Producte., escriviu el nom del producte al qual es refereix aquest pedaç.
ja: ［``製品``］フィールドに、パッチが参照する製品の名前を入力します。
ko: ``제품`` 필드에서 이 패치가 참조하는 제품의 이름을 입력합니다.
zh_cn: 在``产品``字段中，键入该补丁所代表的产品的名称。

source: OPTIONAL: In the ``Author`` field, type the name of the author of the patch.
ca: OPCIONAL: En el camp .Autor., escriviu el nom de l'autor del pedaç.
ja: オプション: ［``Author``］（作成者）フィールドにパッチの作成者の名前を入力します。
ko: 옵션: ``원저자`` 필드에서 패치 원저자의 이름을 입력합니다.
zh_cn: 可选：在``作者``字段中，键入补丁作者的名称。

source: Complete the ``Topic``, ``Description``, and ``Solution`` fields with further information about the patch.
ca: Completeu els camps .Topic., .Description. i .Solution. amb més informació sobre el pedaç.
ja: ［``トピック``］、［``説明``］、［``ソリューション``］の各フィールドにパッチに関する追加情報を入力します。
ko: ``주제``, ``설명``, ``솔루션`` 필드를 패치에 대한 추가 정보로 완성합니다.
zh_cn: 在``主题``、``说明``和``解决方案``字段中填写补丁的其他相关信息。

source: OPTIONAL: In the ``Bugs`` section, specify the information of any related bugs, using these details:
ca: OPCIONAL: a la secció Errors, especifiqueu la informació de qualsevol error relacionat, usant aquests detalls:
ja: オプション: ［``バグ``］セクションで、次の詳細を使用して関連するバグの情報を指定します。
ko: 옵션: ``버그`` 섹션에서 다음 상세 정보를 사용해 관련이 있는 모든 버그에 관한 정보를 지정합니다.
zh_cn: 可选：在 ``Bug`` 部分，使用以下细节指定任何相关 Bug 的信息：
