Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: To avoid unintentionally installing or updating unsupported packages, we recommended that you implement a content lifecycle management (CLM) strategy that initially denies all EPEL packages. You can then explicitly enable the specific packages you require. For more information about content lifecycle management, see xref:administration:content-lifecycle.adoc[].
ca: Per evitar instal·lar o actualitzar paquets no suportats sense voler, us recomanem que implementeu una estratègia de gestió de cicle de vida de contingut (CLM) que inicialment negui tots els paquets EPEL. A continuació, podeu habilitar explícitament els paquets específics que necessiteu. Per obtenir més informació sobre la gestió del cicle de vida del contingut, vegeu xref:administration:content-lifecycle.adoc[].
ja: サポートされていないパッケージを誤ってインストールまたは更新しないためには、最初にすべてのEPELパッケージを拒否するコンテンツライフサイクル管理(CLM)戦略の実装をお勧めします。 その後、必要なパッケージを明示的に有効にできます。 コンテンツライフサイクル管理の詳細については、xref:administration:content-lifecycle.adoc[]を参照してください。
ko: 지원되지 않는 패키지를 의도치 않게 설치하거나 업데이트하지 않도록 하려면 처음에 모든 EPEL 패키지를 거부하는 컨텐트 라이프싸이클 관리(CLM) 전략을 구현하는 것이 좋습니다. 그러면 필요한 특정 패키지를 명시적으로 활성화할 수 있습니다. 컨텐트 라이프싸이클 관리에 대한 자세한 내용은 xref:administration:content-lifecycle.adoc[]을 참조하십시오.
zh_cn: 为了避免无意间安装或更新不支持的软件包，建议您实施一开始会拒绝所有 EPEL 软件包的内容生命周期管理 (CLM) 策略。然后，您可以显式启用所需的特定软件包。有关内容生命周期管理的详细信息，请参见 xref:administration:content-lifecycle.adoc[]。

source: {unifiedinstaller} Updates Channels on {sle} Clients
ca: {unifiedinstaller} Actualitza els canals a {sle} Clients
ja: {sle}クライアントの{unifiedinstaller}更新チャンネル
ko: {sle} 클라이언트의 {unifiedinstaller} 업데이트 채널
zh_cn: {sle} 客户端的 {unifiedinstaller} 更新通道

source: This channel is used by the {unifiedinstaller} to ensure it is up to date before it installs the operating system. All {sle} products should have access to the installer updates channel during installation.
ca: Aquest canal és utilitzat pel {unifiedinstaller} per assegurar que està actualitzat abans d'instal·lar el sistema operatiu. Tots els productes {sle} haurien de tenir accés al canal d'actualitzacions de l'instal·lador durant la instal·lació.
ja: このチャンネルは、オペレーティングシステムをインストールする前に、{unifiedinstaller}が最新であることを確認するために{unifiedinstaller}で使用されます。 すべての{sle}製品は、インストール中にインストーラ更新チャンネルにアクセスできる必要があります。
ko: 이 채널은 운영 체제를 설치하기 전에 최신 상태인지 확인하기 위해 {unifiedinstaller}에서 사용합니다. 모든 {sle} 제품은 설치 중에 설치 프로그램 업데이트 채널에 액세스할 수 있는 권한이 있어야 합니다.
zh_cn: {unifiedinstaller} 使用此通道来确保其在安装操作系统前是最新的。所有 {sle} 产品在安装期间都应能够访问安装程序更新通道。

source: For {sles} clients the installer updates channel is synchronized by default when you add a product that contains them, and are enabled when you create an autoinstallable distribution with these product channels.
ca: Per a {sles} clients, el canal d'actualitzacions de l'instal·lador es sincronitza per defecte quan afegiu un producte que el contingui, i s'habilita quan creeu una distribució autoinstal·lable amb aquests canals de producte.
ja: {sles}クライアントでは、更新を含む製品を追加するときにデフォルトでインストーラ更新チャンネルが同期します。また、これらの製品チャンネルで自動インストールディストリビューションを作成するときに有効になります。
ko: {sles} 클라이언트의 경우 설치 프로그램 업데이트 채널은 이 채널을 포함하는 제품을 추가하면 기본적으로 동기화되고 이 제품 채널로 자동 설치 가능한 배포판을 생성하면 활성화됩니다.
zh_cn: 对于 {sles} 客户端，默认会在您添加包含安装程序更新通道的产品时对这些通道进行同步，并会在您创建包含这些产品通道的可自动安装发行套件时予以启用。

source: For all other {sle} variants, including {sle} for SAP, you must add the installer updates channel manually. To do this, clone the appropriate {sles} installer updates channel below the base channel of these {sle} variants. When creating an autoinstallable distribution for these {sle} variants after the channel was cloned, it is used automatically.
ca: Per a totes les altres variants de {sle}, incloent-hi {sle} per SAP, heu d'afegir el canal d'actualitzacions de l'instal·lador manualment. Per fer-ho, cloneu el canal d'actualització apropiat de l'instal·lador {sles} sota el canal base d'aquestes variants {sle}. Quan es crea una distribució autoinstal·lable per a aquestes {sle} variants després de clonar el canal, s'utilitza automàticament.
ja: {sle} for SAPなどその他すべての{sle}の亜種では、インストーラ更新チャンネルを手動で追加する必要があります。 そのためには、適切な{sles}インストーラ更新チャンネルをこれらの{sle}亜種のベースチャンネルの下に複製します。 チャンネルを複製した後にこれらの{sle}亜種の自動インストールディストリビューションを作成するとき、そのインストーラ更新チャンネルが自動的に使用されます。
ko: SAP용 {sle}를 포함한 다른 모든 {sle} 변형의 경우 설치 프로그램 업데이트 채널을 수동으로 추가해야 합니다. 이 작업을 수행하려면 {sle} 변형의 기본 채널 아래에 적절한 {sles} 설치 프로그램 업데이트 채널을 복제해야 합니다. 채널을 복제한 후 {sle} 변형에 대해 자동 설치 가능한 배포판을 생성할 때 이 채널이 자동으로 사용됩니다.
zh_cn: 对于所有其他 {sle} 变体，包括 {sle} for SAP，您必须手动添加安装程序更新通道。要完成此操作，请克隆这些 {sle} 变体的基础通道下的相应 {sles} 安装程序更新通道。克隆通道后，为这些 {sle} 变体创建可自动安装的发行套件时，会自动使用相应通道。

source: Client Configuration Guide
ca: Visió general de la guia de configuració del client

source: **Publication Date:** {docdate}
ca: **Actualitzat:** {docdate}

source: Preface
ca: Prefaci

source: After installing {productname}, the first step is registering clients. Managing these clients will be a key part of your workflow.
ca: Després d'instal·lar {productname}, el primer pas és registrar clients. La gestió d'aquests clients serà una part clau del vostre flux de treball.

source: {productname} supports {sle} and other Linux distributions, offering compatibility across various hardware options.
ca: {productname} admet {sle} i altres distribucions de Linux, oferint compatibilitat entre diverses opcions de maquinari.

source: For a complete list of supported clients and features, refer to xref:client-configuration:supported-features.adoc[Supported Clients and Features].
ca: Per obtenir una llista completa de clients i característiques compatibles, vegeu xref:client-configuration:supported-features.adoc[].

source: This guide covers both manual and automated client registration and configuration.
ca: Aquesta guia cobreix tant el registre i la configuració manual i automatitzada del client.

source: Copyright Notice
ca: Avís de copyright

source: Copyright © {copyrightdate} SUSE LLC and contributors. All rights reserved. Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.2 or (at your option) version 1.3; with the Invariant Section being this copyright notice and license. A copy of the license version 1.2 is included in the section entitled xref:legal:license.adoc[GNU Free Documentation License].
ca: Copyright . {copyrightdate} SUSE LLC i col·laboradors. Tots els drets reservats. Es concedeix el permís per copiar, distribuir i/o modificar aquest document sota els termes de la Llicència de Documentació Lliure de GNU, versió 1.2 o (segons la vostra opció) versió 1.3; amb la Secció Invariant com a aquesta nota de copyright i llicència. Una còpia de la versió 1.2 de la llicència s'inclou a la secció titulada xref:legal:license.adoc[GNU Free Documentation License].

source: Copyright © 2011–2025 Uyuni contributors. All rights reserved. Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.2 or (at your option) version 1.3; with the Invariant Section being this copyright notice and license. A copy of the license version 1.2 is included in the section entitled xref:legal:license.adoc[GNU Free Documentation License].
ca: Drets d'autor © 2011–2025 Col·laboradors d'Uyuni. Tots els drets reservats. Es concedeix el permís per copiar, distribuir i/o modificar aquest document sota els termes de la Llicència de Documentació Lliure de GNU, versió 1.2 o (segons la vostra opció) versió 1.3; amb la Secció Invariant com a aquesta nota de copyright i llicència. Una còpia de la versió 1.2 de la llicència s'inclou a la secció titulada xref:legal:license.adoc[GNU Free Documentation License].

source: Trademarks
ca: Marques

source: For SUSE trademarks, see https://www.suse.com/company/legal/ . All third-party trademarks are the property of their respective owners. Trademark symbols (®, ™ etc.) denote trademarks of SUSE and its affiliates. Asterisks (*) denote third-party trademarks. All information found in this book has been compiled with utmost attention to detail. However, this does not guarantee complete accuracy. Neither SUSE LLC, its affiliates, the authors nor the translators shall be held liable for possible errors or the consequences thereof.
ca: Per a les marques de SUSE, vegeu https://www.suse.com/company/legal/. Totes les marques de tercers són propietat dels seus respectius propietaris. Els símbols de marca (,, TM etc.) denoten marques comercials de SUSE i els seus afiliats. Asteriscs (*) denota marques de tercers. Tota la informació que es troba en aquest llibre ha estat compilada amb la màxima atenció als detalls. Tanmateix, això no garanteix una exactitud completa. Ni SUSE LLC, ni els seus afiliats, ni els autors ni els traductors respondran dels possibles errors o conseqüències d'aquests.

source: Client Configuration Guide | {productname} {productnumber}
ca: Guia de configuració del client | {productname} {productnumber}

source: Client Operations
ca: Operacions del client
ja: クライアントの操作
ko: 클라이언트 작업
zh_cn: 客户端操作

source: In addition to registering, upgrading, installing software, or deleting clients other operations can be performed. {productname} clients can be managed individually or as a set of clients. A set of clients can grouped with System Set Manager for a one time action or permanently with System Groups.
ca: A més de registrar, actualitzar, instal·lar programari o eliminar clients es poden realitzar altres operacions. {productname} clients es poden gestionar individualment o com un conjunt de clients. Un conjunt de clients poden agrupar-se amb el Gestor de conjunts de sistemes per a una acció d'un sol cop o permanentment amb els grups de sistemes.

source: For advanced client configuratin options general Configuration Management is available. You can obtain Custom System Information, power on or off, and reboot clients using the {productname} {webui}.
ca: Per a opcions avançades de configuració del client està disponible la Gestió General de Configuració. Podeu obtenir informació personalitzada del sistema, activar o desactivar i reiniciar clients utilitzant {productname} {webui}.

source: The following sections contain detailed descriptions for each of these operations.
ca: Les següents seccions contenen descripcions detallades per a cadascuna d'aquestes operacions.

source: Register Clients to a Proxy on the Command Line
ca: Procediment: Registre de clients a un servidor intermediari utilitzant la línia d'ordres

source: Instead of the {webui}, you can use the command line to register a client to a proxy. This procedure requires that you have installed the Salt package on the client before registration. For SLE 12 based clients, you also must have activated the [systemitem]``Advanced Systems Management`` module.
ca: En lloc de {webui}, podeu utilitzar la línia d'ordres per registrar un client a un servidor intermediari. Aquest tràmit requereix que tingueu instal·lat el paquet Salt al client abans de la inscripció. Per a clients basats en SLE 12 també has d'haver activat el mòdul [systemitem].Advanced Systems Management..

source: Procedure: Registering Clients to a Proxy Using the Command Line
ca: Procediment: Registre de clients a un servidor intermediari utilitzant la línia d'ordres
ja: プロシージャ: コマンドラインを使用してクライアントをプロキシに登録する
ko: 절차: 명령줄을 사용해 클라이언트를 프록시에 등록
zh_cn: 过程：使用命令行将客户端注册到代理

source: Choose a client configuration file located at:
ca: Trieu un fitxer de configuració del client situat a:
ja: 次の場所にあるクライアント設定ファイルを選択します。
ko: 다음 위치에 있는 클라이언트 구성 파일을 선택합니다.
zh_cn: 选择位于以下位置的客户端配置文件：

source: or:
ca: o:
ja: または
ko: 또는:
zh_cn: 或：

source: This is sometimes also called a minion file.
ca: De vegades també s'anomena fitxer minion.
ja: これはminionファイルと呼ばれることもあります。
ko: 이 파일을 종종 minion 파일이라고도 합니다.
zh_cn: 该文件有时也称为受控端文件。

source: Add the proxy FQDN as the `master` to the client configuration file:
ca: Afegeix el FQDN del servidor intermediari com a mestre al fitxer de configuració del client:
ja: プロキシFQDNを `マスタ` としてクライアント設定ファイルに追加します。
ko: 다음과 같이 프록시 FQDN을 클라이언트 구성 파일에 ``master``로 추가합니다.
zh_cn: 将代理 FQDN 作为 `master` 添加到客户端配置文件：

source: master: PROXY123.EXAMPLE.COM
ca: mestre: PROXY123.EXAMPLE.COM

source: Restart the [systemitem]``salt-minion`` service:
ca: Reinicia el servei [systemitem]:salt-minion::
ja: [systemitem]``salt-minion``サービスを再起動します。
ko: 다음과 같이 [systemitem]``salt-minion`` 서비스를 다시 시작합니다.
zh_cn: 重启动 [systemitem]``salt-minion`` 服务：

source: systemctl restart salt-minion
ca: systemctl reinicia salt-minion

source: On the server, accept the new client key; replace [systemitem]``<client>`` with the name of your client:
ca: Al servidor, accepteu la nova clau del client; reemplaceu [systemitem] {<client> the amb el nom del vostre client:
ja: サーバで、新しいクライアントキーを受け入れます。[systemitem]``<client>``をクライアントの名前に置き換えます。
ko: 서버에서 새로운 클라이언트 키를 수락하고, [systemitem]``<client>``를 클라이언트 이름으로 대체합니다.
zh_cn: 在服务器上，接受新客户端密钥（将 [systemitem]``<client>`` 替换为您客户端的名称）：

source: salt-key -a '<client>'
ca: sal-clau -a '<client>'

source: Register Clients to a Proxy with a Bootstrap Script
ca: Procediment: Registre de clients a un servidor intermediari amb un script Bootstrap

source: Clients can be registered through the {productname} Proxy with a bootstrap script. This is done almost the same way as registering clients directly with the {productname} Server.
ca: Els clients es poden registrar a través del servidor intermediari {productname} amb un script d'arrencada. Això es fa gairebé de la mateixa manera que registrar clients directament amb el servidor {productname}.

source: Create the bootstrap script in the {productname} Server container with the [command]``mgr-bootstrap`` command line tool. [command]``mgr-bootstrap`` requires parameters such as the fully qualified domain name (FQDN) of the proxy, activation keys, or GPG keys. FQDN of the proxy is mandatory. All other parameters depend on the specific setup.
ca: Crea l'script d'arrencada al contenidor del servidor {productname} amb l'eina de línia d'ordres [command].mgr-bootstrap.. [command].mgr-bootstrap. requereix paràmetres com el nom de domini completament qualificat (FQDN) del proxy, claus d'activació o claus GPG. FQDN del servidor intermediari és obligatori. Tots els altres paràmetres depenen de la configuració específica.

source: The bootstrap script then deploys all necessary information to the clients.
ca: L'script bootstrap desplega llavors tota la informació necessària als clients.

source: Procedure: Registering Clients to a Proxy with a Bootstrap Script
ca: Procediment: Registre de clients a un servidor intermediari amb un script Bootstrap
ja: プロシージャ: ブートストラップスクリプトを使用してクライアントをプロキシに登録する
ko: 절차: 부트스트랩 스크립트로 클라이언트를 프록시에 등록
zh_cn: 过程：使用引导脚本将客户端注册到代理

source: Create a client activation key on the {productname} Server using the {webui}. For more information, see xref:client-configuration:activation-keys.adoc[].
ca: Heu creat una clau d'activació. Per obtenir més informació sobre la creació de claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].

source: On the container host of the server, start a terminial in the container:
ca: A l'amfitrió del contenidor del servidor, inicieu un terminial al contenidor:

source: mgrctl term
ca: terme mgrctl

source: In the container, to create the bootstrap script, execute the [command]``mgr-bootstrap`` command, for example, with these options:
ca: Al servidor intermediari, executeu l'eina de línia d'ordres [command]}.mgr-bootstrap}. com a {rootuser}.

source: mgr-bootstrap --hostname=MLM_PROXY --activation-keys=ACTIVATION_KEY \ --script bootstrap-MLM_PROXY.sh
ca: mgr-bootstrap --hostname=MLMPROXY --activation-keyssACTIVATIONKEY \ --script bootstrap-MLMPROXY.sh

source: Replace [literal]``MLM_PROXY`` with the host name of your proxy.
ca: Substitueix [literal].MLMPROXY. amb el nom de l'amfitrió del vostre servidor intermediari.

source: With the [option]``--script`` option you save the bootstrap script with a descriptive name. If needed, use additional command line options to customize your bootstrap script. To view available options type [command]``mgr-bootstrap --help`` from the command line.
ca: Amb l'opció [option].--script. deseu l'script d'arrencada amb un nom descriptiu. Si cal, utilitzeu opcions addicionals de línia d'ordres per personalitzar el vostre script d'arrencada. Per a veure les opcions disponibles, escriviu [ordre].mgr-bootstrap --help. des de la línia d'ordres.

source: OPTIONAL: Edit the resulting bootstrap script.
ca: OPCIONAL: Edita l'script d'arrencada resultant.
ja: オプション: 結果として得られたブートストラップスクリプトを編集します。
ko: 옵션: 출력된 부트스트랩 스크립트를 편집합니다.
zh_cn: 可选：编辑生成的引导脚本。

source: Execute the bootstrap script. There are two options:
ca: Executa l'script bootstrap. Hi ha dues opcions:

source: Transfer the script to the client and run it directly on the clients. Alternatively, because the proxy forwards requests to the server, the client can download it from http://MLM_PROXY/pub/bootstrap-MLM_PROXY.sh. Replace [literal]``MLM_PROXY`` with the host name of your proxy.
ca: Transfereix l'script al client i executa'l directament als clients. Alternativament, com que el servidor intermediari reenvia les sol·licituds al servidor, el client pot descarregar-lo des de http://MLMPROXY/pub/bootstrap-MLMPROXY.sh. Substitueix [literal].MLMPROXY. amb el nom de l'amfitrió del vostre servidor intermediari.

source: Execute the script from the proxy with [command]``ssh``. Replace [literal]``MLM_PROXY`` with the host name of the proxy and [systemitem]`` <client.example.com>`` with the host name of the client:
ca: Executa l'script bootstrap directament als clients o des del servidor intermediari amb [command].ssh.. Reemplaça [systemitem] {<bootstrap> the amb el nom de l'script bootstrap i [systemitem] { <client.example.com> the amb el nom de l'amfitrió del vostre client:

source: Register Clients to a Proxy With the {webui}
ca: Registra clients a un servidor intermediari amb {webui}

source: You can register clients to the {productname} Proxy using the {webui}.
ca: Creeu una clau d'activació del client al servidor {productname} utilitzant la {webui}.

source: A bootstrap repository is needed for non-SLE clients in general and for SLE clients before version 15.
ca: Es necessita un repositori d'arrencada per a clients que no siguin clients SLE en general i per a clients SLE abans de la versió 15.

source: For information about creating a bootstrap repository, see xref:client-configuration:bootstrap-repository.adoc[].
ca: Per obtenir més informació sobre l'ús de CD-ROM per proveir clients, vegeu xref:client-configuration:autoinst-cdrom.adoc[].

source: Procedure: Registering Clients to a Proxy with the {webui}
ca: Procediment: Registre de clients a un servidor intermediari amb {webui}
ja: プロシージャ: {webui}を使用してクライアントをプロキシに登録する
ko: 절차: {webui}로 클라이언트를 프록시에 등록
zh_cn: 过程：使用 {webui} 将客户端注册到代理

source: In the {productname} {webui}, navigate to menu:Systems[Bootstrapping].
ca: A {productname} {webui}, navegueu al menú:Systems[Bootstrapping].
ja: {productname}の{webui}で、menu:システム[ブートストラップ]に移動します。
ko: {productname} {webui}에서 menu:시스템[부트스트랩]으로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[引导]。

source: In the [guimenu]``Host`` field, type the fully qualified domain name (FQDN) of the client to be bootstrapped.
ca: Al camp [guimenu].Host., escriviu el nom de domini (FQDN) completament qualificat del client a arrencar.
ja: ［[guimenu]``ホスト``］フィールドに、ブートストラップするクライアントの完全修飾ドメイン名(FQDN)を入力します。
ko: [guimenu]``호스트`` 필드에 부트스트랩할 클라이언트의 정규화된 도메인 이름(FQDN)을 입력합니다.
zh_cn: 在[guimenu]``主机``字段中，键入要引导的客户端的完全限定域名 (FQDN)。

source: In the [guimenu]``SSH Port`` field, type the SSH port number to use to connect and bootstrap the client.
ca: En el camp [guimenu].Port SSH., escriviu el número de port SSH a usar per a connectar i arrencar el client.
ja: ［[guimenu]``SSHポート``］フィールドに、クライアントを接続してブートストラップするために使用するSSHポート番号を入力します。
ko: [guimenu]``SSH 포트`` 필드에서 클라이언트를 연결하고 부트스트랩하는 데 사용할 SSH 포트 번호를 입력합니다.
zh_cn: 在 [guimenu]``SSH 端口``字段中，键入用于连接和引导客户端的 SSH 端口号。

source: By default, the SSH port is [systemitem]``22``.
ca: Per defecte, el port SSH és [systemitem].22..
ja: デフォルトでは、SSHポートは[systemitem]``22``です。
ko: 기본적으로 SSH 포트는 [systemitem]``22``입니다.
zh_cn: SSH 端口默认为 [systemitem]``22``。

source: In the [guimenu]``User`` field, type the username to log in to the client.
ca: Al camp [guimenu].Usuari., escriviu el nom d'usuari per a iniciar sessió amb el client.
ja: ［[guimenu]``ユーザ``］フィールドに、クライアントにログインするユーザ名を入力します。
ko: [guimenu]``사용자`` 필드에서 클라이언트에 로그인할 사용자 이름을 입력합니다.
zh_cn: 在[guimenu]``用户``字段中，键入用于登录客户端的用户名。

source: By default, the username is [systemitem]``root``.
ca: Per defecte, el nom d'usuari és [systemitem].root..
ja: デフォルトでは、ユーザ名は[systemitem]``root``です。
ko: 기본적으로 사용자 이름은 [systemitem]``root``입니다.
zh_cn: 用户名默认为 [systemitem]``root``。

source: In the [guimenu]``Authentication Method`` field, select the authentication method to use for bootstrapping the client.
ca: Al camp [guimenu].Mètode d'autenticació., seleccioneu el mètode d'autenticació a utilitzar per arrencar el client.
ja: ［[guimenu]``Authentication Method``］（認証メソッド）フィールドで、クライアントのブートストラップに使用する認証メソッドを選択します。
ko: [guimenu]``인증 방법`` 필드에서 클라이언트를 부트스트랩하는 데 사용할 인증 방법을 선택합니다.
zh_cn: 在[guimenu]``身份验证方法``字段中，选择用于引导客户端的身份验证方法。

source: For password authentication, in the [guimenu]``Password`` field, type password to log in to the client.
ca: Per a l'autenticació de contrasenya, al camp [guimenu].Contrasenya., escriviu la contrasenya per a iniciar sessió amb el client.
ja: パスワード認証の場合、［[guimenu]``パスワード``］フィールドに、パスワードを入力してクライアントにログインします。
ko: 비밀번호 인증의 경우 [guimenu]``비밀번호`` 필드에서 클라이언트에 로그인할 때 사용할 비밀번호를 입력합니다.
zh_cn: 如果选择的是口令身份验证，请在[guimenu]``口令``字段中，键入用于登录客户端的口令。

source: For SSH Private key authentication, enter the private key and the associated passphrase.
ca: Per a l'autenticació de la clau privada SSH, introduïu la clau privada i la contrasenya associada.
ja: SSH秘密鍵認証の場合、秘密鍵と関連パスフレーズを入力します。
ko: SSH 개인 키 인증의 경우 개인 키와 개인 키에 연결된 비밀번호를 입력합니다.
zh_cn: 如果选择的是 SSH 私用密钥身份验证，请输入私用密钥和关联的通行口令。

source: The key is only stored for as long as the bootstrapping process takes to complete.
ca: La clau només s'emmagatzemarà durant el temps que el procés d'arrencada es requereixi per completar-se.
ja: ブートストラッププロセスの実行が完了するまでの間のみ、この鍵は保存されます。
ko: 이 키는 부트스트랩 프로세스를 완료하는 데 필요한 기간 동안만 보관됩니다.
zh_cn: 该密钥的存储期截止到引导过程完成。

source: In the [guimenu]``Activation Key`` field, select the activation key that is associated with the software channel you want to use to bootstrap the client.
ca: Al camp [guimenu].Clau d'activitat., seleccioneu la clau d'activació associada al canal de programari que voleu utilitzar per arrencar el client.
ja: ［[guimenu]``アクティベーションキー``］フィールドで、クライアントのブートストラップに使用するソフトウェアチャンネルに関連付けられているアクティベーションキーを選択します。
ko: [guimenu]``활성화 키`` 필드에서 클라이언트를 부트스트랩하는 데 사용할 소프트웨어 채널과 연결된 활성화 키를 선택합니다.
zh_cn: 在[guimenu]``激活密钥``字段中，选择与您要用于引导客户端的软件通道关联的激活密钥。

source: In the [guimenu]``Proxy`` field, select the proxy server you want to register to.
ca: Al camp [guimenu].Proxy., seleccioneu el servidor intermediari al qual voleu registrar-vos.
ja: ［[guimenu]``プロキシ``］フィールドで、登録先にするプロキシサーバを選択します。
ko: [guimenu]``프록시`` 필드에서 등록하려는 프록시 서버를 선택합니다.
zh_cn: 在[guimenu]``代理``字段中，选择要注册到的代理服务器。

source: By default, the [guimenu]``Disable SSH Strict Key Host Checking`` checkbox is selected.
ca: De manera predeterminada, està seleccionada la casella [guimenu].Desactiva la comprovació de l'amfitrió de claus estrictes SSH``.
ja: デフォルトでは、［[guimenu]``Disable SSH Strict Key Host Checking``］（SSH厳格キーホストの確認を無効にする）チェックボックスにチェックが付いています。
ko: 기본적으로 [guimenu]``SSH Strict 키 호스트 점검 비활성화`` 확인란이 선택되어 있습니다.
zh_cn: 默认会选中[guimenu]``禁用 SSH 严格密钥主机检查`` 复选框。
