Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: This allows the bootstrap process to automatically accept SSH host keys without requiring you to manually authenticate.
ca: Això permet que el procés bootstrap accepti automàticament les claus de l'amfitrió SSH sense requerir que us autentiqueu manualment.
ja: このチェックボックスにチェックが付いていると、ブートストラッププロセスは、手動認証なしでSSHホストキーを自動的に受け入れます。
ko: 따라서 사용자가 수동으로 인증할 필요 없이 부트스트랩 프로세스가 자동으로 SSH 호스트 키를 수락할 수 있습니다.
zh_cn: 如此可让引导过程自动接受 SSH 主机密钥，而无需您手动进行身份验证。

source: OPTIONAL: Check the [guimenu]``Manage System Completely via SSH`` checkbox.
ca: OPCIONAL: Marqueu la casella de selecció [guimenu].Gestioneu el sistema completament mitjançant SSH..
ja: オプション: ［[guimenu]``Manage System Completely via SSH``］（SSHでシステムを完全に管理する）チェックボックスにチェックを付けます。
ko: 옵션: [guimenu]``SSH를 통해 시스템을 완전히 관리`` 확인란을 선택합니다.
zh_cn: 可选：选中[guimenu]``完全通过 SSH 管理系统`` 复选框。

source: If you check this option, the client is configured to use SSH for its connection to the server, and no other connection method is configured.
ca: Si marqueu aquesta opció, el client està configurat per utilitzar SSH per a la seva connexió al servidor, i no hi ha cap altre mètode de connexió configurat.
ja: このオプションにチェックを付けると、サーバへの接続にSSHを使用するようにクライアントは設定され、その他の接続方法は設定されません。
ko: 이 옵션을 선택하면 서버에 연결하기 위해 SSH를 사용하도록 클라이언트가 구성되고 다른 연결 방법은 구성되지 않습니다.
zh_cn: 如果您选中此选项，客户端将会配置为使用 SSH 来连接服务器，且不再配置其他连接方法。

source: Click btn:[Bootstrap] to begin registration.
ca: Feu clic a btn:[Bootstrap] per començar el registre.
ja: btn:[ブートストラップ]をクリックして、登録を開始します。
ko: btn:[부트스트랩]을 클릭하여 등록을 시작합니다.
zh_cn: 单击 btn:[Bootstrap] 开始注册。

source: When the bootstrap process has completed, your client is listed at menu:Systems[System List].
ca: Quan el procés d'arrencada s'ha completat, el vostre client es llista al menú:Systems[Llista de sistema].
ja: ブートストラッププロセスが完了したら、クライアントは［menu:システム[システム一覧]］にリストされます。
ko: 부트스트랩 프로세스가 완료되면 클라이언트가 menu:시스템[시스템 목록]에 나열됩니다.
zh_cn: 引导过程完成时,您的客户端即会列在menu:系统[系统列表]中。

source: Client Registration to a Proxy
ca: Registre del client

source: Proxy servers can act as a broker and package cache for clients. Registering clients to a proxy is similar to registering them directly to the {productname} Server, with a few key differences.
ca: Els servidors intermediaris poden actuar com a corredor i paquet de memòria cau per als clients. Registrar clients a un servidor intermediari és similar a registrar-los directament al servidor {productname}, amb algunes diferències clau.

source: These sections contain information on registering clients to a proxy using the {webui}, commands on the command line, or a bootstrap script. There are also procedures how you can move clients from one {productname} Proxy to another one or to the {productname} Server.
ca: Aquestes seccions contenen informació sobre el registre de clients a un servidor intermediari utilitzant {webui}, ordres a la línia d'ordres o un script d'arrencada. També hi ha procediments de com podeu moure clients d'un servidor intermediari {productname} a un altre o al servidor {productname}.

source: Within the {webui}, proxy pages show information about clients. You can see a list of clients that are connected to a proxy by clicking the name of the proxy in menu:Systems[System List > Proxy], then select the [guimenu]``Proxy`` subtab of the [guimenu]``Details`` tab.
ca: Dins del {webui}, les pàgines del servidor intermediari mostren informació sobre els clients. Podeu veure una llista de clients que estan connectats a un intermediari fent clic al nom del intermediari al menú:Systems[Llista de sistemes . Proxy], després seleccioneu la subtab [guimenu].Proxy. de la pestanya [guimenu].Detalls..

source: A list of chained proxies for a client can be seen by clicking the name of the client in menu:Systems[All], then select the [guimenu]``Connection`` subtab of the [guimenu]``Details`` tab.
ca: Es pot veure una llista de servidors intermediaris encadenats per a un client fent clic al nom del client al menú:Systems[Tots], després seleccioneu la subtaba [guimenu].Connectió. de la pestanya [guimenu].Detalls..

source: Move Clients Between Proxies
ca: Mou els clients dels servidors intermediaris al servidor

source: You can move clients ({salt}) and {salt} SSH push clients between proxies without the need to repeat the registration process.
ca: Podeu moure clients ({salt}) i {salt} SSH empenyent clients entre servidors intermediaris sense necessitat de repetir el procés de registre.

source: You cannot move chained proxies. Instead of moving a chained proxy, create a new proxy, move the clients, and delete the old proxy.
ca: No es poden moure intermediaris encadenats. En lloc de moure un servidor intermediari encadenat, creeu un servidor intermediari nou, moveu els clients i suprimiu el servidor intermediari antic.
ja: チェーンされたプロキシを移動することはできません。 チェーンされたプロキシを移動する代わりに、新しいプロキシを作成し、クライアントを移動して、古いプロキシを削除します。
ko: 체인으로 연결된 프록시는 이동할 수 없습니다. 체인으로 연결된 프록시를 이동하는 대신, 새 프록시를 만들고 클라이언트를 이동한 다음 이전 프록시를 삭제하십시오.
zh_cn: 链式代理无法移动。您应创建新代理，移动客户端，然后删除旧代理，而不是移动链式代理。

source: Procedure: Moving Clients or {salt} SSH Push Client Between Proxies
ca: Procediment: S'estan movent els clients o {salt} SSH es mou el client entre els servidors

source: In the {productname} {webui}, navigate to the [guimenu]``System Details`` page for the client you want to move between proxies.
ca: A {productname} {webui}, navegueu a la pàgina [guimenu].Detalls del sistema. per al client que voleu moure entre servidors intermediaris.
ja: {productname}の{webui}で、プロキシ間で移動するクライアントの［[guimenu]``システムの詳細``］ページに移動します。
ko: {productname} {webui}에서 프록시 간에 이동하려는 클라이언트의 [guimenu]``시스템 정보`` 페이지로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到要在代理之间移动的客户端的[guimenu]``系统细节``页面。

source: Navigate to the [guimenu]``Connection`` tab. Then follow the [guimenu]``Change proxy`` link to see the drop-down menu.
ca: Navega a la pestanya [guimenu].Connection.. A continuació, seguiu l'enllaç [guimenu].Canvia el servidor intermediari. per a veure el menú desplegable.
ja: ［[guimenu]``接続``］タブに移動します。次に［[guimenu]``プロキシの変更``］リンクをたどって、ドロップダウンメニューを表示します。
ko: [guimenu]``연결`` 탭으로 이동합니다. 그런 다음 [guimenu]``프록시 변경`` 링크를 따라 드롭다운 메뉴를 확인합니다.
zh_cn: 导航到[guimenu]``连接``选项卡，然后单击[guimenu]``更改代理``链接，您会看到下拉菜单。

source: From the [guimenu]``New Proxy`` drop-down menu select the proxy you want the client to move to, and click btn:[Change Proxy].
ca: Des del menú desplegable [guimenu]].Servei intermediari nou]. seleccioneu el servidor intermediari al qual voleu que es mogui el client i feu clic a btn:[Canvia el servidor intermediari].
ja: ［[guimenu]``新しいプロキシ``］ドロップダウンメニューから、クライアントの移動先のプロキシを選択し、btn:[プロキシの変更]をクリックします。
ko: [guimenu]``새 프록시`` 드롭다운 메뉴에서 클라이언트가 이동할 프록시를 선택하고 btn:[프록시 변경]을 클릭합니다.
zh_cn: 在[guimenu]``新代理``下拉菜单中，选择要移动到的目标代理，然后单击 btn:[更改代理]。

source: Procedure: Moving Multiple Clients or {salt} SSH Push Clients Between Proxies with SSM
ca: Procediment: Afegir múltiples clients a un grup amb SSM

source: In the {productname} {webui}, navigate to menu:Systems[System List] and check each client to move, this adds the clients to the system set manager.
ca: A {productname} {webui}, navegueu al menú:Systems[Llista de sistemes] i comproveu cada client per moure, això afegeix els clients al gestor de conjunts del sistema.
ja: {productname}の{webui}で、menu:システム[システム一覧]に移動し、移動するそれぞれのクライアントを確認します。クライアントがシステムセットマネージャに追加されます。
ko: {productname} {webui}에서 menu:시스템[시스템 목록]으로 이동하여 이동할 각 클라이언트의 확인란을 선택하면 클라이언트가 시스템 세트 관리자에 추가됩니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[系统列表]，然后选中要移动的每个客户端，如此会将这些客户端添加到系统集管理器中。

source: Navigate to menu:Systems[System Set Manager], and go to the menu:Misc[Proxy]`` tab.
ca: Navega al menú:Sistemes[Gestor de conjunts del sistema], i ves a la pestanya menu:Misc[Proxy]..
ja: menu:システム[システムセットマネージャ]に移動し、［menu:その他[プロキシ]］タブに移動します。
ko: menu:시스템[시스템 세트 관리자]로 이동한 후 menu:기타[프록시] 탭으로 이동합니다.
zh_cn: 导航到menu:系统[系统集管理器]，然后转到menu:其他[代理]选项卡。

source: From the [guimenu]``New Proxy`` drop-down menu select the proxy you want the clients to move to, and click btn:[Change Proxy].
ca: Des del menú desplegable [guimenu]].Servidor intermediari nou]. seleccioneu el servidor intermediari al qual voleu que es moguin els clients i feu clic a btn:[Canvia el servidor intermediari].
ja: ［[guimenu]``新しいプロキシ``］ドロップダウンメニューから、クライアントの移動先のプロキシを選択し、btn:[プロキシの変更]をクリックします。
ko: [guimenu]``새 프록시`` 드롭다운 메뉴에서 클라이언트를 이동할 프록시를 선택한 후 btn:[프록시 변경]을 클릭합니다.
zh_cn: 在[guimenu]``新代理``下拉菜单中，选择要将客户端移动到的目标代理，然后单击 btn:[更改代理]。

source: The same functionality is also available with the [systemitem]``system.changeProxy`` API call.
ca: La mateixa funcionalitat també està disponible amb la crida de l'API [systemitem].system.changeProxy..
ja: [systemitem]``system.changeProxy`` API呼び出しでも同じ機能を利用できます。
ko: [systemitem]``system.changeProxy`` API 호출을 통해서도 동일한 기능을 이용할 수 있습니다.
zh_cn: 通过调用 [systemitem]``system.changeProxy`` 也能使用该功能。

source: Background Information
ca: Informació de fons
ja: 背景情報
ko: 배경 정보
zh_cn: 背景信息

source: The effect of this function differs between normal Salt clients and Salt SSH push clients.
ca: L'efecte d'aquesta funció difereix entre clients de Salt normals i clients de Salt SSH push.
ja: この機能の効果は、通常のSaltクライアントとSalt SSHプッシュクライアントで異なります。
ko: 이 함수의 효과는 일반 Salt 클라이언트와 Salt SSH 푸시 클라이언트 간에 다릅니다.
zh_cn: 此功能对常规 Salt 客户端与 Salt SSH Push 客户端的作用有所不同。

source: Default Clients
ca: Registra clients

source: The function schedules a {salt} state action, which modifies [literal]``master:`` setting in the [path]``susemanager.conf`` {salt} client configuration file to point to the new proxy. Then the function restarts the {salt} client.
ca: La funció programa una acció d'estat {salt}, que modifica la configuració [literal].master:. al fitxer de configuració del client [path].susemanager.conf. {salt} per apuntar al nou servidor intermediari. Llavors la funció reinicia el client {salt}.

source: Changing [literal]``master:`` by manually editing the [path]``susemanager.conf`` file has the same effect and is supported, too.
ca: Canviar [literal].master:. editant manualment el fitxer [path].susemanager.conf. té el mateix efecte i també és compatible.
ja: [path]``susemanager.conf``ファイルを手動で編集して[literal]``master:``を変更しても同じ効果があり、この方法もサポートされています。
ko: [path]``susemanager.conf`` 파일을 수동으로 편집하여 [literal]``master:``를 변경해도 효과가 같으며 이러한 기능도 지원됩니다.
zh_cn: 通过手动编辑 [path]``susemanager.conf`` 文件来更改 [literal]``master:`` 也有同样的效果，并且系统也支持这种方式。

source: When the client restarts and reconnects via the new proxy, the server updates the proxy path in the database and schedules another action for refreshing the channel URLs.
ca: La funció actualitza el camí del servidor intermediari immediatament a la base de dades i es programa una nova acció per a actualitzar els URL del canal.

source: {salt} SSH Push Clients
ca: {salt} Clients SSH Push

source: The function updates the proxy path immediately in the database and new action for refreshing the channel URLs is scheduled.
ca: La funció actualitza el camí del servidor intermediari immediatament a la base de dades i es programa una nova acció per a actualitzar els URL del canal.
ja: この機能はデータベース内のプロキシパスをただちに更新し、チャンネルURLを更新するための新しいアクションがスケジュールされます。
ko: 이 함수는 데이터베이스에서 즉시 프록시 경로를 업데이트하며 채널 URL을 새로 고치는 새로운 작업이 예약됩니다.
zh_cn: 该功能会立即在数据库中更新代理路径并安排新操作来刷新通道 URL。

source: Move Clients from Proxies to the Server
ca: Mou els clients dels servidors intermediaris al servidor
ja: プロキシからサーバへのクライアントの移動
ko: 프록시에서 서버로 클라이언트 이동
zh_cn: 将客户端从代理移到服务器

source: If you want to move a client from a proxy to the server, select [literal]``None`` from proxy list.
ca: Si voleu moure un client des d'un servidor intermediari al servidor, seleccioneu [literal].None. des de la llista de servidor intermediari.

source: Upgrade Using the Content Lifecycle Manager
ca: Actualitza usant el gestor de cicle de vida de contingut
ja: コンテンツライフサイクルマネージャを使用したアップグレード
ko: 컨텐트 라이프싸이클 관리자를 사용하여 업그레이드
zh_cn: 使用内容生命周期管理器升级

source: When you have many {sles} clients to manage, you can automate in-place upgrades using the content lifecycle manager.
ca: Quan teniu molts {sles} clients per gestionar, podeu automatitzar actualitzacions in-place utilitzant el gestor de cicle de vida de contingut.
ja: 管理する{sles}クライアントが多数ある場合、コンテンツライフサイクルマネージャを使用してインプレースアップグレードを自動化できます。
ko: 관리할 {sles} 클라이언트가 많은 경우 컨텐트 라이프싸이클 관리자를 사용하여 현재 위치에 업그레이드를 자동화할 수 있습니다.
zh_cn: 如果您需要管理的 {sles} 客户端有很多，可以使用内容生命周期管理器自动执行就地升级。

source: Prepare to Upgrade
ca: Prepara't per actualitzar
ja: アップグレードの準備
ko: 업그레이드 준비
zh_cn: 准备升级

source: Before you can upgrade your clients, you need to make these preparations:
ca: Abans de poder actualitzar els teus clients, has de fer aquests preparatius:
ja: クライアントをアップグレードするには、その前に次の準備を行う必要があります。
ko: 클라이언트를 업그레이드하려면 먼저 다음과 같은 준비 작업을 마쳐야 합니다.
zh_cn: 升级客户端之前，需要完成以下准备工作：

source: Create a content lifecycle project
ca: Crea un projecte de cicle de vida de contingut
ja: コンテンツライフサイクルプロジェクトの作成
ko: 새 컨텐트 라이프싸이클 프로젝트 만들기
zh_cn: 创建内容生命周期项目

source: Create an activation key
ca: Crea una clau d'activació
ja: アクティベーションキーの作成
ko: 활성화 키 생성
zh_cn: 创建激活密钥

source: Create an autoinstallable distribution
ca: Crea una distribució autoinstal·lable
ja: 自動インストールのディストリビューションの作成
ko: 자동 설치 가능한 배포판 생성
zh_cn: 创建可自动安装的发行套件

source: Create an autoinstallation profile
ca: Crea un perfil d'autoinstal·lació
ja: 自動インストールプロファイルの作成
ko: 자동 설치 프로파일 생성
zh_cn: 创建自动安装配置文件

source: Procedure: Creating a Content Lifecycle Project
ca: Procediment: Creació d'un projecte de cicle de vida de contingut
ja: プロシージャ: コンテンツライフサイクルプロジェクトの作成
ko: 절차: 컨텐트 라이프싸이클 프로젝트 생성
zh_cn: 过程：创建内容生命周期项目

source: Create a content lifecycle project for your distribution.
ca: Crea un projecte de cicle de vida de contingut per a la teva distribució.
ja: ディストリビューション用のコンテンツライフサイクルプロジェクトを作成します。
ko: 배포를 위한 컨텐트 라이프싸이클 프로젝트를 생성합니다.
zh_cn: 为您的发行套件创建内容生命周期项目。

source: For more information, see xref:administration:content-lifecycle.adoc[].
ca: Per a més informació, vegeu xref:administration:content-lifecycle.adoc[].
ja: 詳細については、xref:administration:content-lifecycle.adoc[]を参照してください。
ko: 자세한 내용은 xref:administration:content-lifecycle.adoc[]을 참조하십시오.
zh_cn: 有关详细信息，请参见 xref:administration:content-lifecycle.adoc[]。

source: Ensure you a choose a short but descriptive name for your project.
ca: Assegureu-vos que trieu un nom curt però descriptiu per al vostre projecte.
ja: プロジェクトの名前は、短いがわかりやすい名前にします。
ko: 프로젝트에 대해 설명하는 짧은 이름을 선택해야 합니다.
zh_cn: 务必为您的项目选择简短的非描述性名称。

source: Include all source channel modules that you require for your distribution.
ca: Inclou tots els mòduls del canal d'origen que necessiteu per a la vostra distribució.
ja: ディストリビューションに必要なソースチャンネルモジュールをすべて含めます。
ko: 배포에 필요한 모든 소스 채널 모듈을 포함합니다.
zh_cn: 添加您的发行套件所需的所有源通道模块。

source: Add filters as required, and set up at least one environment.
ca: Afegiu filtres com calgui i configureu almenys un entorn.
ja: 必要に応じてフィルタを追加し、1つ以上の環境を設定します。
ko: 필요에 따라 필터를 추가하고 하나 이상의 환경을 설정합니다.
zh_cn: 视需要添加过滤器，并至少设置一个环境。

source: Create an activation key for your distribution.
ca: Creeu una clau d'activació per a la vostra distribució.
ja: ディストリビューション用のアクティベーションキーを作成します。
ko: 배포를 위한 활성화 키를 생성합니다.
zh_cn: 为您的发行套件创建激活密钥。

source: For more information, see xref:client-configuration:activation-keys.adoc[].
ca: Per a més informació, vegeu xref:client-configuration:activation-keys.adoc[].
ja: 詳細については、 xref:client-configuration:activation-keys.adoc[]を参照してください。
ko: 자세한 내용은 xref:client-configuration:activation-keys.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关详细信息，请参见 xref:client-configuration:activation-keys.adoc[]。

source: Ensure your activation key includes all filtered project channels.
ca: Assegureu-vos que la vostra clau d'activació inclou tots els canals filtrats del projecte.
ja: フィルタされたプロジェクトチャンネルのすべてがアクティベーションキーに含まれていることを確認します。
ko: 활성화 키에 필터링된 프로젝트 채널이 모두 포함되어 있어야 합니다.
zh_cn: 确保您的激活密钥包含所有过滤出的项目通道。

source: Procedure: Creating an Autoinstallable Distribution
ca: Procediment: Creació d'una distribució autoinstal·lable
ja: プロシージャ: 自動インストール可能なディストリビューションの作成
ko: 절차: 자동 설치 가능한 배포 생성
zh_cn: 过程：创建可自动安装的发行套件

source: Create an autoinstallable distribution for every base channel you want to migrate.
ca: Creeu una distribució autoinstal·lable per a cada canal base que vulgueu migrar.
ja: 移行するベースチャンネルごとに自動インストールのディストリビューションを作成します。
ko: 마이그레이션하려는 모든 기본 채널에 대해 자동 설치 가능한 배포판을 생성합니다.
zh_cn: 为要迁移的每个基础通道创建可自动安装的发行套件。

source: For more information, see xref:client-configuration:autoinst-distributions.adoc[].
ca: Per a més informació, vegeu xref:client-configuration:autoinst-distributions.adoc[].
ja: 詳細については、xref:client-configuration:autoinst-distributions.adoc[]を参照してください。
ko: 자세한 설명은 xref:client-configuration:autoinst-distributions.adoc[]를 참조하십시오.
zh_cn: 有关详细信息，请参见 xref:client-configuration:autoinst-distributions.adoc[]。

source: Give your distribution a label that references the name of the content lifecycle project.
ca: Doneu a la vostra distribució una etiqueta que faci referència al nom del projecte de cicle de vida del contingut.
ja: コンテンツライフサイクルプロジェクトの名前を表すディストリビューションラベルを付けます。
ko: 컨텐트 라이프싸이클 프로젝트의 이름을 참조하는 레이블을 배포에 지정합니다.
zh_cn: 为您的发行套件指定一个标签来表示内容生命周期项目的名称。

source: In the ``Installer Generation`` field, select the SLES version you are using.
ca: En el camp .Installer Generation., seleccioneu la versió SLES que esteu utilitzant.
ja: ［``インストーラ生成``］フィールドで、使用しているSLESのバージョンを選択します。
ko: ``설치 프로그램 생성`` 필드에서 사용 중인 SLES 버전을 선택합니다.
zh_cn: 在``安装程序代系``字段中，选择要使用的 SLES 版本。

source: Procedure: Creating an Autoinstallation Profile
ca: Procediment: Creació d'un perfil d'autoinstal·lació
ja: プロシージャ: 自動インストールプロファイルの作成
ko: 절차: 자동 설치 프로파일 생성
zh_cn: 过程：创建自动安装配置文件

source: Create an autoinstallation profile for every target distribution and service pack you want to upgrade to.
ca: Creeu un perfil d'autoinstal·lació per a cada paquet de distribució i servei de destinació al qual vulgueu actualitzar.
ja: アップグレードするディストリビューションおよびサービスパックごとに自動インストールプロファイルを作成します。
ko: 업그레이드하여 도달하려는 모든 대상 배포 및 서비스 팩에 대해 자동 설치 프로파일을 생성합니다.
zh_cn: 为要升级到的每个目标发行套件和服务包创建自动安装配置文件。

source: For more information, see xref:client-configuration:autoinst-profiles.adoc[].
ca: Per a més informació, vegeu xref:client-configuration:autoinst-profiles.adoc[].
ja: 詳細については、xref:client-configuration:autoinst-profiles.adoc[]を参照してください。
ko: 자세한 설명은 xref:client-configuration:autoinst-profiles.adoc[]를 참조하십시오.
zh_cn: 有关详细信息，请参见 xref:client-configuration:autoinst-profiles.adoc[]。

source: You can use variables in the profile to distinguish between the different lifecycle environments.
ca: Es poden utilitzar variables del perfil per distingir entre els diferents ambients del cicle de vida.
ja: プロファイルで変数を使用して、異なるライフサイクル環境を区別できます。
ko: 프로파일의 변수를 사용해 다양한 라이프싸이클 환경을 구별할 수 있습니다.
zh_cn: 您可以在配置文件中使用变量来区分不同的生命周期环境。

source: For example autoinstallation profiles, see https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST.
ca: Per exemple perfils d'autoinstal·lació, vegeu https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST.
ja: 自動インストールプロファイルのサンプルについては、link:https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST[]を参照してください。
ko: 자동 설치 프로파일의 예는 https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST[]를 참조하십시오.
zh_cn: 有关自动安装配置文件的示例，请参见 https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST[]。

source: Use these variables in your autointallation profiles for automating in-place upgrades:
ca: Utilitzeu aquestes variables en els vostres perfils d'autoinstal·lació per automatitzar actualitzacions in-place:
ja: インプレースアップグレードを自動化するための自動インストールプロファイルでこれらの次の変数を使用します。
ko: 현재 위치에 업그레이드를 자동화하기 위해 자동 설치 프로파일에서 다음 변수를 사용합니다.
zh_cn: 在自动安装配置文件中使用以下变量来实现自动就地升级：

source: Example: Variables for Use in Autoinstallation Profiles
ca: Exemple: Variables d'ús en perfils d'autoinstal·lació
ja: 例: 自動インストールプロファイルで使用する変数
ko: 예: 자동 설치 프로파일에서 사용할 변수
zh_cn: 例如：在自动安装配置文件中使用的变量

source: registration_key=1-15sp1-demo-test org=1 channel_prefix=15sp1-demo-test distro_label=15sp1-demo-test
ca: registrationkey1-1-15sp1-demo-test org11 channelprefix1515sp1-demo-test distrolabel1515sp1-demo-test

source: Example: Entry for Use in Autoinstallation Profiles
ca: Exemple: Entrada per al seu ús en els perfils d'autoinstal·lació
ja: 例: 自動インストールプロファイルで使用するエントリ
ko: 예: 자동 설치 프로파일에서 사용할 항목
zh_cn: 例如：在自动安装配置文件中使用的项

source: <listentry> <ask_on_error config:type="boolean">true</ask_on_error> <media_url>https://$redhat_management_server/ks/dist/child/$channel_prefix-sle-module-web-scripting15-sp1-pool-x86_64/$distro_label</media_url> <name>$channel_prefix SLE-Module-Web-Scripting15-SP1 Pool for x86_64 </name> <product>Web Scripting Module 15 SP1 x86_64 Pool</product> </listentry>
ca: <listentry> <askonerror config:type="boolean">true</askonerror> <mediaurl>https://$redhatmanagementserver/ks/dist/child/$channelprefix-sle-module-web-scripting15-sp1-pool-x8664/$distrolabel</mediaurl> <name>$channelprefix SLE-Module-Web-Scripting15-SP1 Pool per a x8664 </name> <product>Web Scripting Module 15 SP1 x8664 Pool</product> </listentry>

source: Upgrade
ca: Actualitza
ja: アップグレード
ko: 업그레이드
zh_cn: 升级

source: When you have prepared the server for the upgrade, you can provision the clients.
ca: Quan hàgiu preparat el servidor per a l'actualització, podeu proporcionar els clients.
ja: サーバをアップグレードする準備ができたら、クライアントをプロビジョニングできます。
ko: 업그레이드를 위해 서버 준비를 완료했으면 이제 클라이언트를 조달할 수 있습니다.
zh_cn: 准备好要升级的服务器后，您便可置备客户端。

source: Procedure: Provisioning the Clients
ca: Procediment: Aprovisionament dels Clients
ja: プロシージャ: クライアントのプロビジョニング
ko: 절차: 클라이언트 조달
zh_cn: 过程：置备客户端

source: In the {productname} {webui}, navigate to menu:Systems[System List], and select the clients you want to provision to add them to the system set manager.
ca: A {productname} {webui}, navegueu al menú:Systems[Llista de sistemes], i seleccioneu els clients que voleu proporcionar per afegir-los al gestor de conjunts del sistema.
ja: {productname}の{webui}で、menu:システム[システム一覧]に移動し、プロビジョニングするクライアントを選択してシステムセットマネージャに追加します。
ko: {productname} {webui}에서 menu:시스템[시스템 목록]으로 이동하여 프로비저닝할 클라이언트를 선택하고 선택한 클라이언트에 시스템 세트 관리자를 추가합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[系统列表]，选择要置备的客户端，以将其添加到系统集管理器中。

source: Navigate to menu:Systems[System Set Manager > Overview] and click the [guimenu]``Provisioning`` tab.
ca: Navega al menú:Sistemes[Gestor de conjunts del sistema . Visió general] i fes clic a la pestanya [guimenu].Provisionament..
ja: menu:システム[システムセットマネージャ > 概要]に移動し、［[guimenu]``プロビジョニング``］タブをクリックします。
ko: menu:시스템[시스템 세트 관리자 > 개요]로 이동하여 [guimenu]``프로비저닝`` 탭을 클릭합니다.
zh_cn: 导航到menu:系统[系统集管理器 > 概览]，然后单击[guimenu]``置备``选项卡。

source: Select the autoinstallation profile to use.
ca: Seleccioneu el perfil d'autoinstal·lació a utilitzar.
ja: 使用する自動インストールプロファイルを選択します。
ko: 사용할 자동 설치 프로파일을 선택합니다.
zh_cn: 选择要使用的自动安装配置文件。

source: For clients that are able to use PXE, the migration is automated as soon as you have provisioned them. For all other clients, you can use {cobbler} to perform the upgrade.
ca: Per als clients que poden utilitzar PXE, la migració s'automatitza tan aviat com els hagis aprovisionat. Per a tots els altres clients, podeu utilitzar {cobbler} per realitzar l'actualització.
ko: PXE를 사용할 수 있는 클라이언트의 경우 마이그레이션은 클라이언트를 조달하자마자 자동화됩니다. 기타 모든 클라이언트의 경우에는 {cobbler}를 사용해 업그레이드를 수행할 수 있습니다.
zh_cn: 对于可以使用 PXE 的客户端，当您完成置备后，客户端便会立即自动迁移。对于所有其他客户端，您可以使用 {cobbler} 来执行升级。

source: Procedure: Using {cobbler} to Upgrade Clients
ca: Procediment: Aprovisionament dels Clients
ko: 절차: {cobbler}를 사용한 클라이언트 업그레이드
zh_cn: 过程：使用 {cobbler} 升级客户端

source: At the command prompt, as root, to get to a shell inside the container, run:
ca: A l'indicador d'ordres, com a root, suprimiu les dades de registre i els repositoris:

source: Check the available {cobbler} profiles:
ca: Consulteu els perfils {cobbler} disponibles:

source: cobbler profile list
ca: llista de perfils de cobbler
ko: cobbler 프로파일 목록
