Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: SLE Micro Channels - CLI
ca: Canals ES - CLI
ja: SLE Microチャンネル - CLI
ko: SLE Micro 채널 - CLI
zh_cn: SLE Micro 通道 - CLI

source: | OS Version | Client Channel | {sle-micro} 5.5 | sle-micro-5.5-uyuni-client | {sle-micro} 5.4 | sle-micro-5.4-uyuni-client | {sle-micro} 5.3 | suse-micro-5.3-uyuni-client | {sle-micro} 5.2 | suse-microos-5.2-uyuni-client | {sle-micro} 5.1 | sle-microos-5.1-uyuni-client
ca: Versió del SO Canal client {sle-micro} 5,5 sle-micro-5.5-uyuni-client {sle-micro} 5.4 sle-micro-5.4-uyuni-client {sle-micro} 5.3 suse-micro-5.3-uyuni-client {sle-micro} 5.2 suse-microos-5.2-uyuni-client {sle-micro} 5.1 sle-microos-5.1-uyuni-client

source: {sle-micro} clients require a reboot after registering.
ca: {sle-micro} clients requereixen un reinici després de registrar-se.

source: Following the bootstrapping process, automatic booting is disabled on {sle-micro} clients. This change was implemented due to intermittent automatic reboots, which could occurr before {salt} could relay the results of applying the bootstrap {salt} state.
ca: Després del procés d'arrencada, l'arrencada automàtica està desactivada en {sle-micro} clients. Aquest canvi es va implementar a causa dels reinicis automàtics intermitents, que podrien produir-se abans que {salt} pogués transmetre els resultats de l'aplicació de l'estat d'arrencada {salt}.

source: Although a reboot is automatically scheduled after registration is completed, it is respecting the default reboot manager maintenance window. This window may be several hours after the client is registered. It is advisable to manually reboot the client after the registration script finishes, to speed up the registration and to see the system appear in the system list.
ca: Tot i que un reinici es programa automàticament després de completar el registre, es respecta la finestra predeterminada de manteniment del gestor de reinici. Aquesta finestra pot ser diverses hores després que el client estigui registrat. És aconsellable reiniciar manualment el client un cop finalitzat el script de registre, per accelerar el registre i per veure el sistema apareix a la llista de sistemes.

source: When using a bootstrap script with {sle-micro} systems, ensure that the certificate section of the script has this content:
ca: Quan utilitzeu un script d'arrencada amb sistemes {sle-micro}, assegureu-vos que la secció de certificat de l'script tingui aquest contingut:

source: ORG_CA_CERT=RHN-ORG-TRUSTED-SSL-CERT ORG_CA_CERT_IS_RPM_YN=0
ca: ORGCACERT=RHN-ORG-TRUSTED-SSL-CERT ORGCACERTISRPMYN00

source: Either edit the bootstrap script directly and add the settings, or create the bootstrap script with these parameters:
ca: O bé editeu l'script bootstrap directament i afegiu la configuració, o creeu l'script bootstrap amb aquests paràmetres:
ja: ブートストラップスクリプトを直接編集して設定を追加するか、次のパラメータを使用してブートストラップスクリプトを作成します。
ko: 부트스트랩 스크립트를 직접 편집하고 설정을 추가하거나 다음 매개변수를 사용하여 부트스트랩 스크립트를 생성하십시오.
zh_cn: 直接编辑引导脚本并添加该设置，或使用以下参数创建引导脚本：

source: Reboot {sle-micro}
ca: Reinicia {sle-micro}

source: {sle-micro} is a transactional system. Transactional updates in general support several reboot methods. It is recommended to use [systemitem]``systemd`` for rebooting in systems managed by {productname}. Using other methods can lead to undesired behavior.
ca: {sle-micro} és un sistema transaccional. Les actualitzacions transaccionals en general suporten diversos mètodes de reinici. Es recomana utilitzar [systemitem] tosystemd to per reiniciar en sistemes gestionats per {productname}. L'ús d'altres mètodes pot conduir a un comportament no desitjat.

source: When bootstrapping a transactional system on {productname}, [systemitem]``systemd`` will be configured as the reboot method ([literal]``REBOOT_METHOD``), if the system is in its default configuration. Such a configuration allows {productname} to control the reboot action, and rebooting can be performed immediately or scheduled with {productname} as wanted.
ca: En arrencar un sistema transaccional a {productname}, [systemitem],systemd, es configurarà com a mètode de reinici ([literal].REBOOTMETHOD.), si el sistema està en la seva configuració predeterminada. Aquesta configuració permet que {productname} controli l'acció de reinici, i es pot reiniciar immediatament o programar amb {productname} com es vulgui.
ja: {productname}でトランザクションシステムをブートストラップする場合、[systemitem]``systemd``が再起動方法([literal]``REBOOT_METHOD``)として設定されます(システムがデフォルト設定の場合)。 このような設定により、{productname}が再起動アクションを制御でき、必要に応じて再起動をすぐに実行したり、{productname}でスケジュールしたりできます。
ko: {productname}에서 트랜잭션 시스템을 부트스트랩할 때 시스템이 기본 구성인 경우 [systemitem]``systemd``는 재부팅 방법([literal]``REBOOT_METHOD``)대로 구성됩니다. 이러한 구성을 사용하면 {productname}가 재부팅 작업을 제어할 수 있으며 재부팅을 즉시 수행하거나 {productname}에서 원하는 일정을 예약할 수 있습니다.
zh_cn: 如果 {productname} 上的事务系统使用的是默认配置，引导该系统时，[systemitem]``systemd`` 将会配置为引导方法 ([literal]``REBOOT_METHOD``)。该默认配置允许 {productname} 控制重引导操作，重引导可以立即执行或使用 {productname} 根据需要安排重引导时间。

source: By default, the reboot method during client installation is set to [option]``auto``. With the [option]``auto`` boot method, [command]``rebootmgrd`` will be used to reboot the system according to the configured policies if the service is running. Policies can be to reboot instantly or during a maintenance window. For more information, see the [command]``rebootmgrd``(8) man page. Otherwise if [command]``rebootmgrd`` is not running, {productname} will call [command]``systemctl reboot``.
ca: Per defecte, el mètode de reinici durant la instal·lació del client està establert a [option].auto.. Amb el mètode d'arrencada [option].auto,, [command].rebootmgrd. s'utilitzarà per reiniciar el sistema d'acord amb les polítiques configurades si el servei s'està executant. Les polítiques poden ser reiniciar instantàniament o durant una finestra de manteniment. Per a més informació, vegeu la pàgina del manual [ordre].rebootmgrd.(8). En cas contrari, si [ordred].rebootmgrd, no s'està executant, {productname} cridarà [ordred].systemctl reboot..
ja: デフォルトでは、クライアントのインストール中の再起動方法は[option]``auto``に設定されています。 [option]``auto``ブート方法では、サービスが実行されている場合、[command]``rebootmgrd``を使用して、設定されたポリシーに従ってシステムを再起動します。 ポリシーにより、すぐに再起動することも、メンテナンスウィンドウ中に再起動することもできます。 詳細については、[command]``rebootmgrd``(8)のマニュアルページを参照してください。 それ以外の場合で[command]``rebootmgrd``が実行されていない場合、 {productname}は[command]``systemctl reboot``を呼び出します。
ko: 기본적으로 클라이언트를 설치하는 동안 재부팅 방법은 [옵션]``auto``로 설정됩니다. [option]``auto`` 부팅 방법을 사용하면 서비스가 실행 중인 경우 구성된 정책에 따라 시스템을 재부팅하기 위해 [command]``rebootmgrd``가 사용됩니다. 정책은 즉시 재부팅 또는 유지보수 기간 중 재부팅입니다. 자세한 내용은 [command]``rebootmgrd``(8) 사용자 지정 페이지를 참조하십시오. [command]``rebootmgrd``가 실행 중이 아닌 경우 {productname}는 [command]``systemctl reboot``를 호출합니다.
zh_cn: 默认情况下，在安装客户端的过程中会将重引导方法设置为 [option]``auto``。采用 [option]``auto`` 引导方法时，如果 [command]``rebootmgrd`` 正在运行，将使用该服务根据配置的策略来重引导系统。策略可能设置为立即重引导或在维护时段重引导。有关详细信息，请参见 [command]``rebootmgrd``(8) 手册页。如果 [command]``rebootmgrd`` 没有运行，{productname} 将会调用 [command]``systemctl reboot``。

source: Using any method different from [command]``systemd`` may cause undesired behavior.
ca: L'ús de qualsevol mètode diferent de [ordre].sistema may pot causar un comportament no desitjat.
ja: [command]``systemd``とは異なる方法を使用すると、望ましくない動作が発生する可能性があります。
ko: [command]``systemd`` 이외의 방법을 사용하면 원하지 않은 동작이 발생할 수 있습니다.
zh_cn: 使用 [command]``systemd`` 之外的任何其他方法都可能会导致系统出现意外行为。

source: Registering {sll} Clients
ca: S'estan registrant {sle} clients
ja: {sll}クライアントの登録
ko: {sll} 클라이언트 등록
zh_cn: 注册 {sll} 客户端

source: This section contains information about registering clients running {sll} operating systems. {sll} clients are based on {rhel} or {centos}.
ca: Aquesta secció conté informació sobre el registre de clients que executen sistemes operatius {sll}. {sll} clients es basen en {rhel} o {centos}.

source: {sll} clients are sometimes also called {sleses} (SLESES), Liberty, RES or {redhat} {es}.
ca: Els clients {sll} de vegades també s'anomenen {sleses} (SLESES), Liberty, RES o {redhat} {es}.
ja: {sll}クライアントは、{sleses} (SLESES)、Liberty、RES、または{redhat} {es}とも呼ばれます。
ko: {sll} 클라이언트를 {sleses}(SLESES), Liberty, RES 또는 {redhat} {es}라고도 합니다.
zh_cn: {sll} 客户端有时也称为 {sleses} (SLESES)、Liberty、RES 或 {redhat} {es}。

source: The {sll} software channels provided by {suse} only provide updates to packages, they do not provide the packages themselves. To register {sll} clients, you need to register the {sll} Product (outlined below) to create the necessary base channel, then import any required {redhat} or {centos} packages as custom child channels. You must obtain the initial packages directly from {redhat} or {centos} before you can apply the updates provided by the {sll} software channels.
ca: Els canals de programari {sll} proporcionats per {suse} només proporcionen actualitzacions als paquets, no proporcionen els mateixos paquets. Per registrar {sll} clients, heu de registrar el producte {sll} (esborrat a continuació) per crear el canal base necessari, i després importar qualsevol paquet {redhat} o {centos} requerit com a canals fills personalitzats. Heu d'obtenir els paquets inicials directament de {redhat} o {centos} abans de poder aplicar les actualitzacions proporcionades pels canals de programari {sll}.
ja: {suse}によって提供される{sll}ソフトウェアチャンネルは、パッケージの更新のみを提供します。パッケージそのものは提供しません。 {sll}クライアントを登録するには、{sll}製品(概要は以下を参照)を登録して必要なベースチャンネルを作成し、必要な{redhat}または{centos}パッケージをカスタム子チャンネルとしてインポートする必要があります。 {sll}ソフトウェアチャンネルで提供される更新を適用する前に、初期パッケージを{redhat}または{centos}から直接取得する必要があります。
ko: {suse}가 제공하는 {sll} 소프트웨어 채널은 패키지에 대한 업데이트만 제공하고 패키지 자체는 제공하지 않습니다. 필요한 기본 채널을 생성하려면 {sll} 제품(아래에 설명됨)을 등록한 다음 필요한 {redhat} 또는 {centos} 패키지를 맞춤 하위 채널로 임포트해야 합니다. 초기 패키지를 {redhat} 또는 {centos}에서 직접 가져와야 {sll} 소프트웨어 채널이 제공하는 업데이트를 적용할 수 있습니다.
zh_cn: {suse} 提供的 {sll} 软件通道只提供软件包更新，不提供软件包本身。要注册 {sll} 客户端，您需要注册（下面列出的）{sll} 产品以创建必需的基础通道，然后导入任何所需的 {redhat} 或 {centos} 软件包作为自定义子通道。您必须直接从 {redhat} 或 {centos} 获取初始软件包，然后才能应用 {sll} 软件通道提供的更新。

source: {sll} repository URLs are available from {scclongform}
ca: {sll} URL del repositori estan disponibles des de {scclongform}

source: Packages and metadata are provided by {suse}
ca: Paquets proporcionats per {phub}
ja: パッケージおよびメタデータは{suse}から提供されます。
ko: 패키지 및 메타데이터는 {suse}에서 제공합니다.
zh_cn: 软件包和元数据由 {suse} 提供

source: You are responsible for arranging access to {redhat} or {centos} base media repositories and installation media.
ca: Sou responsable d'organitzar l'accés a {redhat} o {centos} repositoris multimèdia base i mitjans d'instal·lació.
ja: ユーザは、{redhat}または{centos}のベースメディアリポジトリおよびインストールメディアをアクセスできるようにする必要があります。
ko: 사용자는 {redhat} 또는 {centos} 기본 미디어 리포지토리 및 설치 미디어에 대한 액세스를 정렬할 책임이 있습니다.
zh_cn: 您需负责安排对 {redhat} 或 {centos} 基础媒体储存库和安装媒体的访问权限。

source: You must obtain support from {suse} for all your {sll} systems.
ca: Heu d'obtenir suport de {suse} per a tots els vostres sistemes {sll}.
ja: 使用しているすべての{sll}システムに対して{suse}のサポートを取得する必要があります。
ko: 사용자는 모든 {sll} 시스템에 대해 {suse}의 지원을 받아야 합니다.
zh_cn: 对于您的所有 {sll} 系统，您均须从 {suse} 获取支持。

source: {suse} does not provide support for {sll} systems on {uyuni}.
ca: {suse} no proporciona suport per a sistemes {sll} a {uyuni}.
ja: {suse}は、{uyuni}での{sll}システムをサポートしていません。
ko: {suse}는 {uyuni}에서 {sll} 시스템에 대한 지원을 제공하지 않습니다.
zh_cn: 对于 {uyuni} 上的 {sll} 系统，{suse} 不提供支持。

source: For {sll} clients, some required packages are contained on the {rhel} or {centos} installation media. You must have these packages installed before you can register a {sll} client.
ca: Per a clients {sll}, alguns paquets obligatoris estan continguts en el mitjà d'instal·lació {rhel} o {centos}. Heu de tenir aquests paquets instal·lats abans de poder registrar un client {sll}.
ja: {sll}クライアントでは、必要なパッケージの一部が{rhel}または{centos}のインストールメディアに含まれています。 {sll}クライアントを登録するには、その前にこれらのパッケージをインストールする必要があります。
ko: {sll} 클라이언트의 경우 일부 필수 패키지는 {rhel} 또는 {centos} 설치 미디어에 포함되어 있습니다. 먼저 이 패키지를 설치해야 {sll} 클라이언트를 등록할 수 있습니다.
zh_cn: 对于 {sll} 客户端，所需的一些软件包包含在 {rhel} 或 {centos} 安装媒体中。您必须安装这些软件包才能注册 {sll} 客户端。

source: The {sll} product is provided by {scclongform}. This also includes the client tools package.
ca: El producte {sll} és proporcionat per {scclongform}. Això també inclou el paquet d'eines del client.

source: Before you register {sll} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de registrar {sle} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.
ja: {sll}クライアントを{productname}サーバに登録する前に、必要なソフトウェアチャンネルを追加して同期する必要があります。
ko: {sll} 클라이언트를 {productname} 서버에 등록하기 전에 필요한 소프트웨어 채널을 추가하고 이 채널을 동기화해야 합니다.
zh_cn: 将 {sll} 客户端注册到您的 {productname} 服务器之前，您需要添加所需的软件通道，并同步这些通道。

source: You need to select two different sets of channels, one for {sll} and the other for the Client Tools.
ca: Heu de seleccionar dos conjunts diferents de canals, un per {sll} i l'altre per a les Eines de Client.
ja: 2つの異なるチャンネルセットを選択する必要があります。一方は{sll}用、他方はクライアントツール用です。
ko: 하나는 {sll}용으로, 다른 하나는 클라이언트 도구용으로 두 가지 채널 세트를 선택해야 합니다.
zh_cn: 您需要选择两组不同的通道，一组通道用于提供 {sll}，另一组通道用于提供客户端工具。

source: You need an activation key associated with the correct {sll} channels. For more information about activation keys, see xref:client-configuration:activation-keys.adoc[].
ca: Heu creat una clau d'activació. Per obtenir més informació sobre la creació de claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].
ja: 正しい{sll}チャンネルに関連付けられているアクティベーションキーが必要です。 アクティベーションキーの詳細については、xref:client-configuration:activation-keys.adoc[]を参照してください。
ko: 올바른 {sll} 채널과 연결된 활성화 키가 필요합니다. 활성화 키에 대한 자세한 내용은 xref:client-configuration:activation-keys.adoc[]에서 확인할 수 있습니다.
zh_cn: 您需要与适当 {sll} 通道关联的激活密钥。有关激活密钥的详细信息，请参见 xref:client-configuration:activation-keys.adoc[]。

source: ES Products - WebUI
ca: Productes ES - WebUI
ja: ES製品 - WebUI
ko: ES 제품 - WebUI
zh_cn: ES 产品 - WebUI

source: | OS Version | Product Name | {sll} 9 | RHEL or SLES ES and Liberty 9 x86_64 | {sll} 8 | RHEL or SLES ES or CentOS 8 Base and SUSE Linux Enterprise Server with Expanded Support 8 x86_64 | {sll} 7 | SUSE Linux Enterprise Server with Expanded Support 7 x86_64 | {sll} LTSS 7 | SUSE Linux Enterprise Server with Expanded Support LTSS 7 x86_64 | {sll} LTSS for Oracle 7 | SUSE Linux Enterprise Server with Expanded Support LTSS for Oracle 7 x86_64
ca: Versió del SO Nom del producte {sll} 9 or RHEL o SLES ES i Liberty 9 x8664 {sll} 8 and RHEL o SLES ES o CentOS 8 Base i SUSE Linux Enterprise Server amb suport expandit 8 x8664 {sll} 7 SUSE Linux Enterprise Server amb suport expandit 7 x8664 {sll} LTSS 7 SUSE Linux Enterprise Server amb suport expandit LTSS 7 x8664 {sll} LTSS per a l'Oracle 7 SUSE Linux Enterprise Server amb suport expandit LTSS per a Oracle 7 x8664

source: {productname} requires tools channels that contain additional software. This procedure creates these tools channels:
ca: {productname} requereix canals d'eines que continguin programari addicional. Aquest procediment crea aquests canals d'eines:
ja: {productname}には、追加のソフトウェアが含まれているツールチャンネルが必要です。 このプロシージャは次のツールチャンネルを作成します。
ko: {productname}에는 추가 소프트웨어가 포함된 도구 채널이 필요합니다. 이 절차에서는 이러한 도구 채널을 생성합니다.
zh_cn: {productname} 需要包含其他软件的工具通道。此过程将创建以下工具通道：

source: ES Tools Channels
ca: Canals d'Eines d'ES
ja: ESツールチェンネル
ko: ES 도구 채널
zh_cn: ES 工具通道

source: | OS Version | Base Channel | Tools Channel | {sll} 9 | RHEL and Liberty 9 Base | EL9-Manager-Tools-Pool for x86_64 and EL9-Manager-Tools-Updates for x86_64 | {sll} 8 | RHEL or SLES ES or CentOS 8 Base | RES8-Manager-Tools-Pool for x86_64 and RES8-Manager-Tools-Updates for x86_64 | {sll} 7 | RHEL Expanded Support 7 | RES7-SUSE-Manager-Tools x86_64 | {sll} LTSS 7 | RHEL Expanded Support LTSS 7 | RES-7-SUSE-Manager-Tools for x86_64 LBT7 | {sll} LTSS for Oracle 7 | RHEL Expanded Support LTSS for Oracle 7 | RES-7-SUSE-Manager-Tools for x86_64 LBTOL7
ca: Versió del SO Canal base Canal d'eines and {sll} 9 and RHEL i Liberty 9 Base and EL9-Manager-Tools-Pool per a x8664 i EL9-Manager-Tools-Updates per a x8664 and {sll} 8 or RHEL o SLES ES o CentOS 8 Base and RES8-Manager-Tools-Pool per a x8664 i RES8-Manager-Tools-Updates per a x8664 {sll} 7 RHEL Expanded Support 7 RES7-SUSE-Manager-Tools x8664 s {sll} LTSS 7 RHEL Expanded Support LTSS 7 s RES-7-SUSE-Manager-Tools for x8664 LBT7 s {sll} LTSS for Oracle 7 RHEL Expanded Support LTSS for Oracle 7 s RES-7-SUSE-Manager-Tools for x8664 LBTOL7

source: ES Channels - CLI
ca: Canals ES - CLI
ja: ESチャンネル - CLI
ko: ES 채널 - CLI
zh_cn: ES 通道 - CLI

source: | OS Version | Base Channel | Client Channel | Tools Channel | {sll} 9 | el9-pool-x86_64 | - | el9-manager-tools-pool-x86_64 | {sll} 8 | rhel8-pool-x86_64 | - | res8-manager-tools-pool-x86_64 | {sll} 7 | rhel-x86_64-server-7 | - | res7-suse-manager-tools-x86_64 | {sll} LTSS 7 | res-7-ltss-updates-x86_64 | - | res-7-suse-manager-tools-x86_64-lbt7 | {sll} LTSS for Oracle 7 | res-7-ol-ltss-updates-x86_64 | - | res-7-suse-manager-tools-x86_64-lbtol7
ca: Versió del SO Canal base Canal client s Canal d'eines {sll} 9 el9-pool-x8664 el9-manager-tools-pool-x8664 {sll} 8 rhel8-pool-x8664 res8-manager-tools-pool-x8664 {sll} 7 rhel-x8664-server-7 res7-suse-manager-tools-x8664 {sll} LTSS 7 res-7-ltss-updates-x8664 res-7-suse-manager-tools-x8664-lbt7 {sll} LTSS per a l'Oracle 7 res-7-ol-ltss-updates-x8664 res-7-suse-manager-tools-x8664-lbtol7

source: | OS Version | Base Channel | Client Channel | Tools Channel | {sll} 9 | el9-pool-x86_64 | - | sll9-uyuni-client-x86_64 | {sll} 8 | rhel8-pool-x86_64 | - | sll8-uyuni-client-x86_64 | {sll} 7 | rhel-x86_64-server-7 | - | sll7-uyuni-client-x86_64
ca: Versió del SO Canal base Canal client s Canal d'eines {sll} 9 el9-pool-x8664 sll9-uyuni-client-x8664 {sll} 8 rhel8-pool-x8664 sll8-uyuni-client-x8664 {sll} 7 rhel-x8664-server-7 sll7-uyuni-client-x8664

source: Add Base Media
ca: Afegeix un suport base
ja: ベースメディアの追加
ko: 기본 미디어 추가
zh_cn: 添加基础媒体

source: The {sll} software channels only provide updates, not the packages themselves. To register {sll} clients, first register the {sll} Product (outlined below) to create the base channel, then import the necessary Red Hat or CentOS packages as custom child channels. Initial packages must be obtained directly from {redhat} or {centos} before applying updates from {sll}. Importantly, you do not need to maintain your Red Hat subscriptions, but consult your legal department to check for any ongoing payment obligations to Red Hat during migration. To ensure you have all the packages you need, use a full DVD image, not a minimal or {jeos} image.
ca: Els canals de programari {sll} només proporcionen actualitzacions, no els propis paquets. Per registrar {sll} clients, primer registreu el producte {sll} (esborrat a continuació) per crear el canal base, després importeu els paquets Red Hat o CentOS necessaris com a canals fills personalitzats. Els paquets inicials s'han d'obtenir directament de {redhat} o {centos} abans d'aplicar actualitzacions de {sll}. És important destacar que no cal mantenir les seves subscripcions de Red Hat, però consulti al seu departament legal per comprovar qualsevol obligació de pagament en curs a Red Hat durant la migració. Per assegurar-vos que teniu tots els paquets que necessiteu, utilitzeu una imatge de DVD completa, no una imatge mínima o {jeos}.

source: You can use {productname} custom channels to set up the {rhel} or {centos} media. All packages on the base media must be mirrored into a child channel.
ca: Podeu utilitzar {productname} canals personalitzats per configurar el suport {rhel} o {centos}. Tots els paquets del suport base s'han de reflectir en un canal fill.
ja: {productname}カスタムチャンネルを使用して、{rhel}または{centos}のメディアを設定できます。 ベースメディアのすべてのパッケージは、子チャンネルにミラーリングする必要があります。
ko: {productname} 사용자 정의 채널을 사용해 {rhel} 또는 {centos} 미디어를 설정할 수 있습니다. 기본 미디어의 모든 패키지는 하위 채널로 미러링해야 합니다.
zh_cn: 您可以使用 {productname} 自定义通道设置 {rhel} 或 {centos} 媒体。基础媒体上的所有软件包都必须镜像到一个子通道。

source: You can freely choose the names for the channels.
ca: Podeu triar lliurement els noms dels canals.
ja: チャンネルの名前は自由に選択できます。
ko: 채널의 이름을 자유롭게 선택할 수 있습니다.
zh_cn: 您可以自由选择通道名称。

source: Procedure: Adding Base Media to Custom Channels (SLES-ES-7 example)
ca: Procediment: afegir suports bàsics a canals personalitzats (exemple SLES-ES-7)

source: Copy the base media image to the {productname} Server container host to the [path]``/tmp/`` directory.
ca: Copieu els fitxers de certificat al vostre servidor {productname} i deseu-los al directori [path]./etc/pki/trust/anchors/..

source: To get the base media image into the {productname} Server container, use:
ca: Per a obtenir la imatge multimèdia base en el contenidor del servidor {productname}, utilitzeu:

source: The destination in the container will be [path]``/srv/www/distributions/sles-es-7``.
ca: La destinació en el contenidor serà [camí]./srv/www/distributions/sles-es-7..

source: Import the packages into the child channel you created earlier:
ca: Importeu els paquets al canal fill que heu creat anteriorment:
ja: 前に作成した子チャンネルにパッケージをインポートします。
ko: 다음과 같이 패키지를 앞서 생성한 하위 채널로 임포트합니다.
zh_cn: 将软件包导入您之前创建的子通道：

source: For version 9 and 8 clients, adjust label and directories accordingly and additionally, synchronize both the Base and AppStream channels:
ca: Per a clients de la versió 9 i 8, ajusteu l'etiqueta i els directoris en conseqüència i, a més, sincronitzeu els canals Base i AppStream:

source: Or:
ca: O bé:

source: OPTIONAL: Add Base Media from a Content URL
ca: OPCIONAL: Afegeix un suport base des d'un URL de contingut
ja: オプション: ベースチャンネルをコンテンツURLから追加する
ko: 옵션: 컨텐트 URL에서 기본 미디어 추가
zh_cn: 可选：通过内容 URL 添加基础媒体

source: Alternatively, if you have access to a content URL provided by {redhat} CDN or {centos}, you can create a custom repository to mirror the packages.
ca: Alternativament, si teniu accés a un URL de contingut proporcionat per {redhat} CDN o {centos}, podeu crear un repositori personalitzat per reflectir els paquets.
ja: または、{redhat} CDNまたは{centos}が提供するコンテンツURLにアクセスできる場合、カスタムリポジトリを作成してパッケージをミラーリングできます。
ko: 또는 {redhat} CDN이나 {centos}가 제공하는 컨텐트 URL에 대한 액세스 권한이 있는 경우 사용자 정의 리포지토리를 생성하여 패키지를 미러링할 수 있습니다.
zh_cn: 或者，如果您可以访问 {redhat} CDN 或 {centos} 提供的内容 URL，则可以创建自定义储存库以镜像软件包。

source: ES Custom Repository Settings
ca: Configuració personalitzada del repositori ES
ja: ESカスタムリポジトリ設定
ko: ES 사용자 정의 리포지토리 설정
zh_cn: ES 自定义储存库设置

source: | Option | Parameter | Repository URL | The content URL provided by {redhat} CDN or {centos} | Has Signed Metadata? | Uncheck all {redhat} Enterprise repositories | SSL CA Certificate | [systemitem]``redhat-uep`` ({redhat} only) | SSL Client Certificate | [systemitem]``Entitlement-Cert-date`` ({redhat} only) | SSL Client Key | ``Entitlement-Key-date`` ({redhat} only)
ca: Opció Paràmetre The URL del repositori The L'URL del contingut proporcionat per {redhat} CDN o {centos} ? Ha signat Metadades? es Desmarca tots els {redhat} repositoris empresarials ) Certificat CA SSL ) [systemitem])redhat-uep) (només{redhat}) ) Certificat de client SSL ) [systemitem])Entitlement-Cert-date) (només{redhat}) ) Clau de client SSL ) )Entitlement-Key-date) (només {$rehat})
ko: | 옵션 | 파라미터 | 리포지토리 URL | {redhat} CDN 또는 {centos} 가 제공하는 컨텐트 URL | 서명 메타데이터가 있습니까? | 모든 {redhat} Enterprise 리포지토리를 선택 취소 | SSL CA 인증서 | [systemitem]``redhat-uep``({redhat}만 해당됨) | SSL 클라이언트 인증서 | [systemitem]``Entitlement-Cert-date``({redhat}만 해당됨) | SSL 클라이언트 키 | ``Entitlement-Key-date``({redhat}만 해당됨)
zh_cn: | 选项 | 参数 | 储存库 URL | {redhat} CDN 或 {centos} 提供的内容 URL | 包含已签名的元数据？ | 取消选中所有 {redhat} Enterprise 储存库 | SSL CA 证书 | [systemitem]``redhat-uep``（仅适用于 {redhat}） | SSL 客户端证书 | [systemitem]``Entitlement-Cert-date``（仅适用于 {redhat}） | SSL 客户端密钥 | ``Entitlement-Key-date``（仅适用于 {redhat}）
