Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: Create the bootstrap repository, using the appropriate repository name as the product label:
ca: Crea el repositori bootstrap, utilitzant el nom de repositori adequat com a etiqueta del producte:
ja: 製品ラベルとして適切なリポジトリ名を使用して、ブートストラップリポジトリを作成します。
ko: 다음과 같이 적절한 리포지토리 이름을 제품 레이블로 사용해 부트스트랩 리포지토리를 생성합니다.
zh_cn: 创建引导储存库，并使用适当的储存库名称作为产品标签：

source: Alternatively, use the number shown next to the distribution name in the list of available distributions.
ca: Alternativament, utilitzeu el nombre que es mostra al costat del nom de la distribució a la llista de distribucions disponibles.

source: The client repository is located in [path]``/srv/www/htdocs/pub/repositories/``.
ca: El repositori del client es troba a [path]./srv/www/htdocs/pub/repositories/..
ja: クライアントリポジトリは[path]``/srv/www/htdocs/pub/repositories/``にあります。
ko: 클라이언트 리포지토리는 [path]``/srv/www/htdocs/pub/repositories/``에 있습니다.
zh_cn: 客户端储存库位于 [path]``/srv/www/htdocs/pub/repositories/ `` 中。

source: If you have mirrored more than one product (for example, SLES and SLES for SAP), or if you use custom channels, you might need to specify the parent channel to use when creating the bootstrap repository. This is not required in every situation. For example, some SLES{nbsp}15 versions have common code bases, so there is no need to specify a parent channel. Use this procedure only if your environment requires it.
ca: Si heu reflectit més d'un producte (per exemple, SLES i SLES per SAP), o si utilitzeu canals personalitzats, és possible que hàgiu d'especificar el canal pare a utilitzar en crear el repositori bootstrap. Això no és necessari en totes les situacions. Per exemple, algunes versions SLES{nbsp}15 tenen bases de codi comunes, de manera que no cal especificar un canal pare. Utilitzeu aquest procediment només si el vostre entorn ho requereix.
ja: 複数の製品(SLESとSLES for SAPなど)をミラーリング済みの場合、またはカスタムチャンネルを使用している場合、ブートストラップリポジトリを作成するときに使用する親チャンネルを指定する必要が生じる場合があります。 これは、あらゆる状況で必須ではありません。 たとえば、SLES{nbsp}15の一部のバージョンには共通のコードベースがあるため、親チャンネルを指定する必要はありません。 このプロシージャは、ご使用の環境で必要な場合のみ使用します。
ko: 제품을 두 개 이상 미러링한 경우(예: SLES, SAP용 SLES) 또는 사용자 지정 채널을 사용하는 경우 부트스트랩 리포지토리를 생성할 때 사용할 상위 채널을 지정해야 합니다. 이는 모든 상황에서 필수가 아닙니다. 예를 들어, 일부 SLES{nbsp}15 버전에는 공통 코드 기반이 있으므로, 상위 채널을 지정할 필요가 없습니다. 환경에서 필요한 경우에만 이 절차를 사용하십시오.
zh_cn: 如果您镜像了多个产品（例如 SLES 和 SLES for SAP），或者您使用的是自定义通道，在创建引导储存库时将需要指定要使用的父通道。并不是在所有情况下都需要如此。例如，部分 SLES{nbsp}15 版本使用共同的代码库，因此无需指定父通道。只有您的环境需要时，才需使用此过程。

source: OPTIONAL Procedure: Specifying a parent channel for a bootstrap repository
ca: Procediment OPCIONAL: especificació d'un canal pare per a un repositori de Bootstrap

source: Check which parent channels you have available:
ca: Comproveu quins canals pare teniu disponibles:
ja: 利用できる親チャンネルを確認します。
ko: 사용 가능한 상위 채널을 확인합니다.
zh_cn: 检查您有哪些父通道可用：

source: mgr-create-bootstrap-repo -c SLE-15-x86_64 Multiple options for parent channel found. Please use option --with-parent-channel <label> and choose one of: - sle-product-sles15-pool-x86_64 - sle-product-sles_sap15-pool-x86_64 - sle-product-sled15-pool-x86_64
ca: mgr-create-bootstrap-repo -c SLE-15-x8664 S'han trobat múltiples opcions per al canal pare. Utilitzeu l'opció --with-parent-channel <label> i trieu-ne un de: - sle-product-sles15-pool-x8664 - sle-product-slessap15-pool-x8664 - sle-product-sled15-pool-x8664
ja: mgr-create-bootstrap-repo -c SLE-15-x86_64 Multiple options for parent channel found.（親チャンネルの複数にオプションが表示されます。）Please use option --with-parent-channel <label> and choose one of:（オプション --with-parent-channel <label>を使用し、次のいずれかを選択してください。） - sle-product-sles15-pool-x86_64 - sle-product-sles_sap15-pool-x86_64 - sle-product-sled15-pool-x86_64
ko: mgr-create-bootstrap-repo -c SLE-15-x86_64 여러 개의 상위 채널용 옵션을 찾았습니다. --with-parent-channel <label>옵션을 사용하고 다음 중 하나를 선택하십시오. - sle-product-sles15-pool-x86_64 - sle-product-sles_sap15-pool-x86_64 - sle-product-sled15-pool-x86_64
zh_cn: mgr-create-bootstrap-repo -c SLE-15-x86_64 找到多个父通道选项。请使用 --with-parent-channel <label> 选项并选择以下其中一个父通道： - sle-product-sles15-pool-x86_64 - sle-product-sles_sap15-pool-x86_64 - sle-product-sled15-pool-x86_64

source: Specify the appropriate parent channel:
ca: Especifiqueu el canal pare apropiat:
ja: 適切な親チャンネルを指定します。
ko: 다음과 같이 적절한 상위 채널을 지정합니다.
zh_cn: 指定适当的父通道：

source: Repositories with multiple architectures
ca: Repositoris amb arquitectures múltiples

source: If you are creating bootstrap repositories that include multiple different architectures, you need to be careful that all architectures are updated correctly. For example, the {x86_64} and {ibmz} architectures for {slea} use the same bootstrap repository URL at ``/srv/www/htdocs/pub/repositories/sle/15/2/bootstrap/``.
ca: Si esteu creant repositoris d'arrencada que inclouen diverses arquitectures diferents, heu d'anar amb compte que totes les arquitectures s'actualitzin correctament. Per exemple, les arquitectures {x8664} i {ibmz} per a {slea} utilitzen la mateixa URL del repositori bootstrap a ./srv/www/htdocs/pub/repositories/sle/15/2/bootstrap/..
ja: 複数の異なるアーキテクチャを含むブートストラップリポジトリを作成している場合、すべてのアーキテクチャが正しく更新されることに注意を払う必要があります。 たとえば、{slea}の{x86_64}アーキテクチャおよび{ibmz}アーキテクチャは、同じブートストラップリポジトリURL(``/srv/www/htdocs/pub/repositories/sle/15/2/bootstrap/``)を使用します。
ko: 아키텍처가 여러 개 포함된 부트스트랩 리포지토리를 생성하는 경우 모든 아키텍처가 올바르게 업데이트되는지 주의 깊게 살펴봐야 합니다. 예를 들어 {slea}용 {ibmz} 및 {x86_64} 아키텍처가 ``/srv/www/htdocs/pub/repositories/sle/15/2/bootstrap/``에서 동일한 부트스트랩 리포지토리 URL을 사용합니다.
zh_cn: 如果您要创建包含多个不同体系结构的引导储存库，则需要确保所有体系结构是否都已正确更新。例如，{slea} 的 {x86_64} 和 {ibmz} 体系结构使用相同的引导储存库 URL：``/srv/www/htdocs/pub/repositories/sle/15/2/bootstrap/``。

source: When the ``flush`` option is enabled, and you attempt to generate the bootstrap repository for multiple architectures, only one architecture is generated. To avoid this, use the ``--no-flush`` option at the command prompt when creating additional architectures. For example:
ca: Quan l'opció .flush. està activada, i intenteu generar el repositori bootstrap per a diverses arquitectures, només es genera una arquitectura. Per a evitar-ho, utilitzeu l'opció .--no-flush at a l'indicador d'ordres en crear arquitectures addicionals. Per exemple:
ja: ``フラッシュ``オプションを有効にすると、複数のアーキテクチャのブートストラップリポジトリを生成しようとしても、生成されるアーキテクチャは1つのみです。 この動作を回避するには、追加のアーキテクチャを作成するとき、コマンドプロンプトで``--no-flush``オプションを使用します。 次に例を示します。
ko: ``flush`` 옵션이 활성화된 상태에서 여러 아키텍처에 대해 부트스트랩 리포지토리를 생성하려고 하면 하나의 아키텍처만 생성됩니다. 이를 방지하려면 추가 아키텍처를 생성할 때 명령 프롬프트에서 ``--no-flush`` 옵션을 사용하십시오. 예:
zh_cn: 如果启用 ``flush`` 选项，当您尝试生成多个体系结构的引导储存库时，将仅生成一个体系结构。要避免此问题，请在创建其他体系结构时于命令提示符处使用 ``--no-flush`` 选项。例如：

source: Bootstrap and custom channels
ca: Bootstrap i canals personalitzats

source: If you are using custom channels, you can use the [option]``--with-custom-channels`` option with the [command]``mgr-create-bootstrap-repo`` command. In this case, you also need to specify the parent channel to use.
ca: Si utilitzeu canals personalitzats, podeu utilitzar l'opció [option].--with-custom-channels. amb l'ordre [command].mgr-create-bootstrap-repo.. En aquest cas, també heu d'especificar el canal pare a utilitzar.
ja: カスタムチャンネルを使用している場合、[command]``mgr-create-bootstrap-repo``コマンドを使用して[option]``--with-custom-channels``オプションを使用できます。 この場合、使用する親チャンネルも指定する必要があります。
ko: 사용자 지정 채널을 사용 중인 경우 [option]``--with-custom-channels`` 옵션을 [command]``mgr-create-bootstrap-repo`` 명령과 함께 사용할 수 있습니다. 이 경우 사용할 상위 채널도 지정해야 합니다.
zh_cn: 如果您要使用自定义通道，则可以在 [command]``mgr-create-bootstrap-repo`` 命令中使用 [option]``--with-custom-channels`` 选项。在此情况下，您还需要指定要使用的父通道。

source: Automatic creation of a bootstrap repository might fail if you are using custom channels. In this case, you need to create the repository manually.
ca: La creació automàtica d'un repositori bootstrap pot fallar si esteu utilitzant canals personalitzats. En aquest cas, heu de crear el repositori manualment.
ja: カスタムチャンネルを使用すると、ブートストラップリポジトリの自動作成が失敗する場合があります。 この場合、リポジトリを手動で作成する必要があります。
ko: 사용자 지정 채널을 사용 중인 경우 부트스트랩 리포지토리 자동 생성에 실패할 수 있습니다. 이러한 경우에는 리포지토리를 수동으로 생성해야 합니다.
zh_cn: 如果您使用自定义通道，则自动创建引导储存库可能会失败。在这种情况下，您需要手动创建储存库。

source: For more information about custom channels, see xref:administration:custom-channels.adoc[].
ca: Per a més informació sobre els canals personalitzats, vegeu xref:administration:custom-channels.adoc[].
ja: カスタムチャンネルの詳細については、xref:administration:custom-channels.adoc[]を参照してください。
ko: 사용자 지정 채널에 대한 자세한 내용은 xref:administration:custom-channels.adoc[]에서 참조하십시오.
zh_cn: 有关自定义通道的详细信息，请参见 xref:administration:custom-channels.adoc[]。

source: Software Channels
ca: Canals de programari
ja: ソフトウェアチャンネル
ko: 소프트웨어 채널
zh_cn: 软件通道

source: Channels are a method of grouping software packages. Software packages are provided by repositories, and repositories are associated with channels. Subscribing a client to a software channel allows the client to install and update any of the software associated with it.
ca: Els canals són un mètode d'agrupar paquets de programari. Els paquets de programari són proporcionats per repositoris, i els repositoris estan associats amb canals. La subscripció d'un client a un canal de programari permet al client instal·lar i actualitzar qualsevol dels programes associats a aquest.
ja: チャンネルは、ソフトウェアパッケージをグループ化する方法です。 ソフトウェアパッケージはリポジトリによって提供され、リポジトリはチャンネルに関連付けられています。 クライアントをソフトウェアチャンネルにサブスクライブすると、クライアントは、これに関連付けられたソフトウェアをインストールし、更新できます。
ko: 채널은 소프트웨어 패키지를 그룹화하는 방법입니다. 소프트웨어 패키지는 리포지토리가 제공하며, 리포지토리는 채널과 연결되어 있습니다. 클라이언트를 소프트웨어 채널에 가입하면 클라이언트는 자신과 연결된 모든 소프트웨어를 설치하고 업데이트할 수 있습니다.
zh_cn: 通道是一种用于对软件包分组的方法。软件包由储存库提供，而储存库与通道关联。客户端订阅软件通道后，便可安装并更新与其关联的任何软件。

source: In {productname}, channels are divided into base channels and child channels. Organizing channels in this way ensures that only compatible packages are installed on each system. A client must be subscribed to only one base channel, assigned during registration based on the client operating system and architecture. For paid channels provided by a vendor, you must have an associated subscription.
ca: A {productname}, els canals es divideixen en canals base i canals fills. Organitzar els canals d'aquesta manera assegura que només s'instal·len paquets compatibles en cada sistema. Un client ha d'estar subscrit a només un canal base, assignat durant el registre basat en el sistema operatiu i l'arquitectura del client. Per als canals de pagament proporcionats per un proveïdor, heu de tenir una subscripció associada.
ja: {productname}では、チャンネルはベースチャンネルと子チャンネルに分割されます。 この方法でチャンネルを編成すると、互換性のあるパッケージのみが各システムにインストールされるようになります。 クライアントは、1つのベースチャンネルのみをサブスクライブして、登録中にクライアントのオペレーティングシステムおよびアーキテクチャに基づいて割り当てる必要があります。 ベンダによって提供される有料チャンネルでは、関連づけされたサブスクリプションを持っている必要があります。
ko: {productname}에서 채널은 기본 채널과 하위 채널로 구분됩니다. 이런 식으로 채널을 구성하면 호환되는 패키지만 각 시스템에 설치됩니다. 클라이언트는 등록 중에 클라이언트 운영 체제 및 아키텍처에 따라 할당된 하나의 기본 채널에만 가입되어야 합니다. 벤더가 제공하는 유료 채널에 대해서는 연결된 구독이 있어야 합니다.
zh_cn: 在 {productname} 中，通道分为基础通道和子通道。以此方式组织通道可确保每个系统上只安装兼容的软件包。客户端只能订阅一个基础通道，该通道是在注册期间根据客户端操作系统和体系结构指派的。对于供应商提供的付费通道，您必须具有关联的订阅。

source: A base channel consists of packages built for a specific operating system type, version, and architecture. For example, the {sles}{nbsp}15 {x86_64} base channel contains only software compatible with that operating system and architecture.
ca: Un canal base consisteix en paquets construïts per a un tipus de sistema operatiu específic, versió i arquitectura. Per exemple, el canal base {sles}{nbsp}15 {x8664} només conté programari compatible amb aquest sistema operatiu i arquitectura.
ja: ベースチャンネルは、特定のオペレーティングシステムの種類、バージョン、およびアーキテクチャのために構築されたパッケージから構成されています。 たとえば、{sles}{nbsp}15 {x86_64}のベースチャンネルには、そのオペレーティングシステムおよびアーキテクチャと互換性のあるソフトウェアのみが含まれています。
ko: 기본 채널은 특정 운영 체제 유형, 버전 및 아키텍처를 위해 구축된 패키지로 구성됩니다. 예를 들어 {sles}{nbsp}15 {x86_64} 기본 채널에는 이 운영 체제 및 아키텍처와 호환되는 소프트웨어만 포함되어 있습니다.
zh_cn: 基础通道中包含为特定操作系统类型、版本和体系结构构建的软件包。例如，{sles}{nbsp}15 {x86_64} 基础通道中仅包含与该操作系统和体系结构兼容的软件。

source: A child channel is associated with a base channel and provides only packages that are compatible with the base channel. A system can be subscribed to multiple child channels of its base channel. When a system has been assigned to a base channel, it is only possible for that system to install the related child channels. For example, if a system has been assigned to the {sles}{nbsp}15 `x86_64` base channel, they can only install or update packages made available through the compatible base channel, or any of its associated child channels.
ca: Un canal fill s'associa amb un canal base i només proporciona paquets compatibles amb el canal base. Un sistema es pot subscriure a múltiples canals fills del seu canal base. Quan s'ha assignat un sistema a un canal base, només és possible que aquest sistema instal·li els canals fills relacionats. Per exemple, si s'ha assignat un sistema al canal base {sles}{nbsp}15 .x8664., només poden instal·lar o actualitzar els paquets posats a disposició a través del canal base compatible, o qualsevol dels seus canals fills associats.
ja: 子チャンネルはベースチャンネルに関連付けられていて、ベースチャンネルと互換性のあるパッケージのみを提供します。 システムは、ベースチャンネルの複数の子チャンネルにサブスクライブできます。 システムがベースチャンネルに割り当てられている場合、そのシステムは関連する子チャンネルをインストールできます。 たとえば、システムが{sles}{nbsp}15 `x86_64` ベースチャンネルに割り当てられている場合、互換性のあるベースチャンネルまたは関連する子チャンネルのいずれかから利用できるパッケージのみインストールまたは更新できます。
ko: 하위 채널은 기본 채널과 연결되어 있으며 기본 채널과 호환되는 패키지만 제공합니다. 시스템은 기본 채널의 여러 하위 채널에 가입할 수 있습니다. 시스템이 기본 채널에 할당된 경우 해당 시스템은 관련 하위 채널만 설치할 수 있습니다. 예를 들어 시스템에 {sles}{nbsp}15 `x86_64` 기본 채널이 할당된 경우 호환되는 기본 채널이나 기본 채널과 연결된 하위 채널 중 하나를 통해 사용할 수 있는 패키지만 설치하거나 업데이트할 수 있습니다.
zh_cn: 子通道与基础通道关联，仅提供与基础通道兼容的软件包。一个系统可订阅其基础通道的多个子通道。将系统指派到基础通道后，该系统便只能安装相关的子通道。例如，如果将系统指派到 {sles}{nbsp}15 `x86_64` 基础通道，那么便只能安装或更新通过兼容基础通道或它的任何关联子通道提供的软件包。

source: In the {productname} {webui} you can browse your available channels by navigating to menu:Software[Channel List > All]. You can modify or create new channels by navigating to menu:Software[Manage > Channels].
ca: A {productname} {webui} podeu navegar pels canals disponibles navegant al menú:Software[Llista de canals ]. Tot]. Podeu modificar o crear nous canals navegant al menú:Software[Gestionar ]. Canals].
ja: {productname}の{webui}で、menu:ソフトウェア[チャンネル一覧 > すべて]に移動して、利用できるチャンネルをブラウズできます。 menu:ソフトウェア[管理 > チャンネル]に移動して、チャンネルを変更又は新しいチャンネルを作成できます。
ko: {productname} {webui}에서 menu:소프트웨어[채널 목록 > 전체]로 이동하여 사용 가능한 채널을 검색할 수 있습니다. menu:소프트웨어[관리 > 채널]로 이동하여 새 채널을 수정하거나 생성할 수 있습니다.
zh_cn: 在 {productname} {webui} 中，您可以导航到menu:软件[通道列表 > 所有]来浏览可用通道。您可以通过导航到menu:软件[管理 > 通道]修改或创建新通道。

source: For more on using channels, including custom channels, see xref:administration:channel-management.adoc[].
ca: Per obtenir més informació sobre l'ús de canals, inclosos els canals personalitzats, vegeu xref:administration:channel-management.adoc[].
ja: カスタムチャンネルなどチャンネルを使用する方法の詳細については、xref:administration:channel-management.adoc[]を参照してください。
ko: 사용자 지정 채널을 포함한 채널 사용에 대한 자세한 내용은 xref:administration:channel-management.adoc[]를 참조하십시오.
zh_cn: 有关使用通道（包括自定义通道）的详细信息，请参见 xref:administration:channel-management.adoc[]。

source: Handling the Installer Updates Channel after Bootstrapping
ca: Gestionar el canal d'actualitzacions de l'instal·lador després d'iniciar

source: Once a client system has been bootstrapped, the **Installer Updates** channel should be removed. The standard update channel already includes the necessary updates, making this channel redundant.
ca: Un cop s'ha arrencat un sistema client, s'hauria d'eliminar el canal **Actualitzacions de l'Installer**. El canal d'actualització estàndard ja inclou les actualitzacions necessàries, fent que aquest canal sigui redundant.

source: Additionally, during migrations, this channel is unnecessary and should not be used.
ca: A més, durant les migracions, aquest canal és innecessari i no s'ha d'utilitzar.

source: Packages Provided by {phub}
ca: Paquets proporcionats per {phub}
ja: {phub}で提供されるパッケージ
ko: {phub}가 제공하는 패키지
zh_cn: 通过 {phub} 提供的软件包

source: {phub} is an extension to {sle} products that provides additional open source software provided by the {opensuse} community.
ca: {phub} és una extensió de {sle} productes que proporciona programari de codi obert addicional proporcionat per la comunitat {opensuse}.
ja: {phub}は{sle}製品の拡張機能で、{opensuse}コミュニティで提供する追加オープンソースソフトウェアを提供しています。
ko: {phub}는 {sle} 제품의 확장으로, {opensuse} 커뮤니티가 제공하는 추가 오픈 소스 소프트웨어를 제공합니다.
zh_cn: {phub} 是 {sle} 产品的扩展，用于提供额外的开源软件（由 {opensuse} 社区提供）。

source: The packages in {phub} are provided by the {opensuse} community. They are not supported by {suse}.
ca: Els paquets de {phub} són proporcionats per la comunitat {opensuse}. No són compatibles amb {suse}.
ja: {phub}のパッケージは、{opensuse}コミュニティによって提供されます。 パッケージは{suse}ではサポートされていません。
ko: {phub}의 패키지는 {opensuse} 커뮤니티가 제공합니다. 이 패키지는 {suse}에서 지원되지 않습니다.
zh_cn: {phub} 中的软件包由 {opensuse} 社区提供。{suse} 不会为这些软件包提供支持。

source: If you are using {sle} operating systems on your clients, you can enable the {phub} extension to access these additional packages. This provides the {phub} channels, which you can subscribe your clients to.
ca: Si utilitzeu sistemes operatius {sle} als vostres clients, podeu habilitar l'extensió {phub} per accedir a aquests paquets addicionals. Això proporciona els {phub} canals, als quals podeu subscriure els vostres clients.
ja: クライアントで{sle}オペレーティングシステムを使用している場合、{phub}拡張機能を有効にして、これらの追加パッケージにアクセスできます。 アクセスすると、クライアントのサブスクライブ先にできる{phub}チャンネルが提供されます。
ko: 클라이언트에서 {sle} 운영 체제를 사용 중인 경우 {phub} 확장을 활성화하여 이러한 추가 패키지에 액세스할 수 있습니다. 이렇게 하면 클라이언트를 가입할 수 있는 {phub} 채널이 제공됩니다.
zh_cn: 如果您在客户端上使用的是 {sle} 操作系统，则可启用 {phub} 扩展来访问这些额外的软件包。这样会提供 {phub} 通道，您可以为客户端订阅这些通道。

source: {phub} provides a large number of packages, which can take a long time to synchronize and consume a large amount of disk space. Do not enable {phub} unless you require the packages it provides.
ca: {phub} proporciona un gran nombre de paquets, que poden trigar molt de temps a sincronitzar-se i consumir una gran quantitat d'espai al disc. No habiliteu {phub} a menys que necessiteu els paquets que proporciona.
ja: {phub}は多数のパッケージを提供しており、大量のディスク容量を使用してパッケージの同期に長時間かかる場合があります。 提供するパッケージが必要でない場合、{phub}を有効にしないでください。
ko: {phub}는 다수의 패키지를 제공하므로 동기화하는 데 시간이 오래 걸리고 대량의 디스크 공간을 소비할 수 있습니다. SUSE Package Hub가 제공하는 패키지가 필요하지 않은 경우 {phub}를 활성화하지 마십시오.
zh_cn: {phub} 提供了大量软件包，可能需要花很长时间进行同步，并会占用大量磁盘空间。除非您确实需要 {phub} 提供的软件包，否则请不要启用它。

source: To avoid unintentionally installing or updating unsupported packages, we recommend that you implement a content lifecycle management strategy that initially denies all {phub} packages. You can then explicitly enable the specific packages you require. For more information about content lifecycle management, see xref:administration:content-lifecycle.adoc[].
ca: Per evitar instal·lar o actualitzar paquets no suportats sense voler, us recomanem que implementeu una estratègia de gestió del cicle de vida del contingut que inicialment nega tots els paquets {phub}. A continuació, podeu habilitar explícitament els paquets específics que necessiteu. Per obtenir més informació sobre la gestió del cicle de vida del contingut, vegeu xref:administration:content-lifecycle.adoc[].
ja: サポートされていないパッケージを誤ってインストールまたは更新しないためには、最初にすべての{phub}パッケージを拒否するコンテンツライフサイクル管理戦略の実装をお勧めします。 その後、必要なパッケージを明示的に有効にできます。 コンテンツライフサイクル管理の詳細については、xref:administration:content-lifecycle.adoc[]を参照してください。
ko: 지원되지 않는 패키지를 의도치 않게 설치하거나 업데이트하지 않도록 하려면 처음에 모든 {phub} 패키지를 거부하는 컨텐트 라이프싸이클 관리 전략을 구현하는 것이 좋습니다. 그러면 필요한 특정 패키지를 명시적으로 활성화할 수 있습니다. 컨텐트 라이프싸이클 관리에 대한 자세한 내용은 xref:administration:content-lifecycle.adoc[]을 참조하십시오.
zh_cn: 为了避免无意间安装或更新不支持的软件包，建议您实施一开始会拒绝所有 {phub} 软件包的内容生命周期管理策略。然后，您可以显式启用所需的特定软件包。有关内容生命周期管理的详细信息，请参见 xref:administration:content-lifecycle.adoc[]。

source: Packages Provided by AppStream
ca: Paquets proporcionats per AppStream
ja: AppStreamで提供されるパッケージ
ko: AppStream이 제공하는 패키지
zh_cn: 通过 AppStream 提供的软件包

source: For {redhat} based clients, additional packages are available through AppStream. In most cases, the AppStream packages are required to ensure that you have all the software you need.
ca: Per als clients basats en {redhat}, hi ha paquets addicionals disponibles a través d'AppStream. En la majoria dels casos, els paquets d'AppStream són necessaris per assegurar-te que tens tot el programari que necessites.
ja: {redhat}ベースのクライアントの場合、AppStreamから追加パッケージを利用できます。 ほとんどの場合、AppStreamパッケージでは、必要なソフトウェアをすべて持っていることを確認する必要があります。
ko: {redhat} 기반 클라이언트의 경우 AppStream을 통해 추가 패키지가 제공됩니다. 대부분의 경우 AppStream 패키지가 있어야 필요한 소프트웨어를 모두 보유할 수 있습니다.
zh_cn: 对于基于 {redhat} 的客户端，通过 AppStream 来提供额外的软件包。大多数情况下都需要 AppStream 软件包来确保您已拥有所有必需的软件。

source: Packages Provided by EPEL
ca: Paquets proporcionats per EPEL
ja: EPELで提供されるパッケージ
ko: EPEL이 제공하는 패키지
zh_cn: 通过 EPEL 提供的软件包

source: For {redhat} based clients, additional packages are available through EPEL (extra packages for enterprise Linux). EPEL is an optional package repository that provides additional software.
ca: Per als clients basats en {redhat}, hi ha paquets addicionals disponibles a través d'EPEL (paquets addicionals per a l'empresa Linux). EPEL és un repositori de paquets opcional que proporciona programari addicional.
ja: {redhat}ベースのクライアントの場合、EPEL(エンタープライズ版Linux用の追加パッケージ)から追加パッケージを利用できます EPELはオプションのパッケージリポジトリで、追加ソフトウェアが提供されます。
ko: {redhat} 기반 클라이언트의 경우 EPEL(엔터프라이즈 Linux용 추가 패키지)을 통해 추가 패키지가 제공됩니다. EPEL은 추가 소프트웨어를 제공하는 옵션 패키지 리포지토리입니다.
zh_cn: 对于基于 {redhat} 的客户端，通过 EPEL 提供额外的软件包（适用于企业版 Linux 的额外软件包）。EPEL 是可选软件包储存库，用于提供额外的软件。

source: The packages in EPEL are provided by the Fedora community. They are not supported by {suse}.
ca: Els paquets d'EPEL són proporcionats per la comunitat de Fedora. No són compatibles amb {suse}.
ja: EPELのパッケージは、Fedoraコミュニティによって提供されます。 このパッケージは{suse}ではサポートされていません。
ko: EPEL의 패키지는 Fedora 커뮤니티가 제공합니다. 이 패키지는 {suse}에서 지원하지 않습니다.
zh_cn: EPEL 中的软件包由 Fedora 社区提供。{suse} 不会为这些软件包提供支持。

source: If you are using {redhat} operating systems on your clients, you can enable the EPEL extension to access these additional packages. This provides the EPEL channels, which you can subscribe your clients to.
ca: Si utilitzeu sistemes operatius {redhat} als vostres clients, podeu habilitar l'extensió EPEL per accedir a aquests paquets addicionals. Això proporciona els canals EPEL, als quals podeu subscriure els vostres clients.
ja: クライアントで{redhat}オペレーティングシステムを使用している場合、EPEL拡張機能を有効にして、これらの追加パッケージにアクセスできます。 アクセスすると、クライアントのサブスクライブ先にできるEPELチャンネルが提供されます。
ko: 클라이언트에서 {redhat} 운영 체제를 사용 중인 경우 EPEL 확장을 활성화하여 이러한 추가 패키지에 액세스할 수 있습니다. 이렇게 하면 클라이언트를 가입할 수 있는 EPEL 채널이 제공됩니다.
zh_cn: 如果您在客户端上使用的是 {redhat} 操作系统，则可启用 EPEL 扩展来访问这些额外的软件包。这样会提供 EPEL 通道，您可以为客户端订阅这些通道。

source: EPEL provides a large number of packages, which can take a long time to synchronize and consume a large amount of disk space. Do not enable the EPEL repositories unless you require the packages it provides.
ca: EPEL proporciona un gran nombre de paquets, que poden trigar molt de temps a sincronitzar-se i consumir una gran quantitat d'espai en disc. No habiliteu els repositoris EPEL a menys que necessiteu els paquets que proporciona.
ja: EPELは多数のパッケージを提供しており、大量のディスク容量を使用してパッケージの同期に長時間かかる場合があります。 提供するパッケージが必要でない場合、EPELリポジトリを有効にしないでください。
ko: EPEL은 다수의 패키지를 제공하므로 동기화하는 데 시간이 오래 걸리고 대량의 디스크 공간을 소비할 수 있습니다. EPEL이 제공하는 패키지가 필요하지 않은 경우 EPEL 리포지토리를 활성화하지 마십시오.
zh_cn: EPEL 提供了大量软件包，可能需要花很长时间进行同步，并会占用大量磁盘空间。除非您确实需要 EPEL 提供的软件包，否则请不要启用 EPEL 储存库。
