Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: These repositories can also be synchronized within {productname} if you extract the required **GPG keys** and your personal **Bearer Token** from a system registered to Ubuntu Pro.
ca: Aquests repositoris també es poden sincronitzar dins de {productname} si extraieu les **claus GPG** necessàries i el vostre **Testimoni de benvinguda** personal d'un sistema registrat a Ubuntu Pro.

source: Extract GPG keys and Bearer Token
ca: Extreu les claus GPG i el testimoni del portador

source: Register an Ubuntu host with Ubuntu Pro. You will find your personal registration token in the https://ubuntu.com/pro/dashboard[Ubuntu Pro Dashbaord]. An https://login.ubuntu.com/[Ubuntu One acconut] is required for this.
ca: Registra un host d'Ubuntu amb Ubuntu Pro. Trobareu el vostre testimoni de registre personal a https://ubuntu.com/pro/dashboard[Ubuntu Pro Dashbaord]. Es requereix un https://login.ubuntu.com/[Ubuntu One acconut] per a això.

source: sudo apt-get install ubuntu-advantage-tools sudo pro attach <perosnal_token>
ca: sudo apt-get install ubuntu-advantage-tools sudo pro adjunta <perosnaltoken>

source: After registration, you will find the Bearer Token in the file `/etc/apt/auth.conf.d/90ubuntu-advantage`:
ca: Després de la inscripció, trobareu el Testimoni de Bearer al fitxer the/etc/apt/auth.conf.d/90ubuntu-advantage the:

source: machine esm.ubuntu.com/apps/ubuntu/ login bearer password <token> # ubuntu-pro-client machine esm.ubuntu.com/infra/ubuntu/ login bearer password <token> # ubuntu-pro-client
ca: màquina esm.ubuntu.com/apps/ubuntu/ contrasenya d'inici de sessió <token> ubuntu-pro-client màquina esm.ubuntu.com/infra/ubuntu/ contrasenya d'inici de sessió <token> ubuntu-pro-client

source: One dedicated bearer token is used per repository.
ca: S'utilitza un testimoni de portador dedicat per repositori.

source: Configure the following repositories within {productname}:
ca: Configura els dipòsits següents dins de {productname}:

source: Configure Ubuntu ESM repositories
ca: Configura els dipòsits ESM d'Ubuntu

source: Use the following URLs for creating the repositories:
ca: Utilitzeu els URL següents per a crear els repositoris:

source: Ubuntu ESM repositories
ca: Dipòsits ESM d'Ubuntu

source: | URL | Description | https://bearer:<token>@esm.ubuntu.com/infra/ubuntu/dists/<release>-infra-updates/main/binary-<arch>/ | Operating system functional updates | https://bearer:<token>@esm.ubuntu.com/infra/ubuntu/dists/<release>-infra-security/main/binary-<arch>/ | Operating system security updates | https://bearer:<token>@esm.ubuntu.com/apps/ubuntu/dists/<release>-apps-updates/main/binary-<arch>/ | Application functional updates | https://bearer:<token>@esm.ubuntu.com/apps/ubuntu/dists/<release>-apps-security/main/binary-<arch>/ | Application security updates
ca: URL Descripció https://bearer:<token> esm.ubuntu.com/infra/ubuntu/dists/<release>-infra-updates/main/binary-<arch>/ Actualitzacions funcionals del sistema operatiu https://bearer:<token> esm.ubuntu.com/infra/ubuntu/dists/<release>-infra-security/main/binary-<arch>/ Actualitzacions de seguretat del sistema operatiu https://bearer:<token>:esm.ubuntu.com/apps/ubuntu/dists/<release>-apps-updates/main/binary-<arch>/ Actualitzacions funcionals de l'aplicació https://bearer:<token>:esm.ubuntu.com/apps/ubuntu/dists/<release>-apps-security/main/binary-<arch>/ Actualitzacions de seguretat de l'aplicació

source: Replace `<token>` with your personal Bearer Token. Also, `arch` and `release` must be replaced with one of the following values:
ca: Substitueix .<token>. pel teu testimoni personal. A més, ,arch, i ,release the han de ser reemplaçats per un dels valors següents:

source: Ubuntu ESM architectures and releases
ca: Arquitectures i llançaments d'Ubuntu ESM

source: | Architectures | Releases | `amd64`, `arm64`, `armel`, `armhf`, `i386`, `powerpc`, `ppc64el`, `s390x` | `bionic`, `focal`, `jammy`, `noble`, `trusty`, `xenial`
ca: Arquitectures Publicacions , ,amd64,, ,arm64,, ,armel,, ,armhf,, ,i386,, ,powerpc,, ,ppc64el,, ,s390x, , ,bionic,, ,focal,, ,jammy,, ,noble,, ,trusty,, ,xenial,

source: In order for {productname} to synchronize the repositories, the corresponding GPG keys (`ubuntu-advantage-esm-infra-trusty.gpg`, `ubuntu-advantage-esm-apps.gpg`) must be imported. These are located on a system registered with Ubuntu Pro under `/etc/apt/trusted.gpg.d`. Copy these files to the {productname} system and import them as follows:
ca: Perquè {productname} sincronitzi els repositoris, s'han d'importar les claus GPG corresponents (.ubuntu-advantage-esm-infra-trusty.gpg,, ,ubuntu-advantage-esm-apps.gpg.). Aquests es troben en un sistema registrat amb Ubuntu Pro sota ./etc/apt/trusted.gpg.d.. Copia aquests fitxers al sistema {productname} i els importa de la següent manera:

source: mgradm gpg add /path/to/gpg.key
ca: mgradm gpg afegeix /camí/a/gpg.key

source: Create the appropriate child channels below already synchronized {ubuntu} parent channels. After that, repositories can be synchronized.
ca: Creeu els canals fills apropiats a sota dels canals pare {ubuntu} ja sincronitzats. Després d'això, els repositoris es poden sincronitzar.

source: The procedure shown here can be used to circumvent the subscription limitations - however, this constitutes a breach of the Terms of Service and may have **legal consequences**. There must always be sufficient subscriptions for the number of systems used.
ca: El procediment que es mostra aquí es pot utilitzar per eludir les limitacions de subscripció - però, això constitueix una violació dels Termes del Servei i pot tenir **conseqüències legals**. Sempre ha d'haver-hi subscripcions suficients per al nombre de sistemes utilitzats.

source: {ubuntu} channels can be very large. Synchronization can sometimes take several hours.
ca: {ubuntu} canals poden ser molt grans. La sincronització de vegades pot trigar diverses hores.
ja: {ubuntu}チャンネルは非常に大きいことがあります。 同期に数時間かかる場合があります。
ko: {ubuntu} 채널은 규모가 매우 클 수 있습니다. 때로 동기화에 몇 시간이 걸릴 수 있습니다.
zh_cn: {ubuntu} 通道可能会非常大。同步所需的时间可能会长达数小时。

source: The root user on {ubuntu} is disabled by default for SSH access.
ca: L'usuari root de {ubuntu} està desactivat per defecte per a l'accés SSH.
ja: {ubuntu}のrootユーザはデフォルトでSSHアクセスが無効になっています。
ko: {ubuntu}의 루트 사용자는 SSH 액세스에 대해 기본적으로 비활성화되어 있습니다.
zh_cn: 默认会为 {ubuntu} 上的 root 用户禁用 SSH 访问权限。

source: This issue happens with self-installed versions of {ubuntu}. If the default user has been granted administrative privileges during installation time, a password is required to perform privilege escalation using [command]``sudo``. With cloud instances this does not happen because [command]``cloud-init`` automatically creates a file under [path]``/etc/sudoers.d`` and grants privilege escalation through [command]``sudo`` without the need for a password.
ca: Aquest problema passa amb versions autoinstal·lades de {ubuntu}. Si s'ha concedit a l'usuari per defecte privilegis administratius durant el temps d'instal·lació, es requereix una contrasenya per a realitzar l'escalada de privilegis utilitzant [ordre].sudo.. Amb les instàncies del núvol això no passa perquè [ordre].cloud-init. crea automàticament un fitxer sota [camí]./etc/sudoers.d. i concedeix una escalada de privilegis a través de [ordred].sudo. sense necessitat de contrasenya.

source: Grant Root User Access
ca: Procediment: Concedir l'accés a l'usuari root

source: Bootstrap as Install-created User via SSH
ca: Bootstrap com a usuari creat per la instal·lació via SSH

source: To bootstrap an Ubuntu client via SSH you must add the install-created user to the sudo group. Then run the bootstrap script from the client.
ca: Per arrencar un client d'Ubuntu a través de SSH heu d'afegir l'usuari creat a la instal·lació al grup sudo. A continuació, executeu l'script d'arrencada del client.

source: Procedure: Adding Install-created User to sudo Group and Bootstrapping via SSH
ca: Procediment: S'està afegint l'usuari creat a sudo Group i s'està arrencant a través de SSH

source: On the client, as root, run from the command line (replace [literal]``<username>`` with the name of the install-created user):
ca: Al client, com a root, executeu-lo des de la línia d'ordres (substitueix [literal] the<username> the amb el nom de l'usuari instal·lat):

source: Bootstrap the client system from its command line (replace [literal]``<SERVER_FQDN>`` with the fully qualified domain name of the {productname} Server):
ca: Atrapa el sistema client des de la seva línia d'ordres (substitueix [literal] the<SERVERFQDN> the amb el nom de domini completament qualificat del servidor {productname}):

source: sudo su - curl -Sks https://<SERVER_FQDN>/pub/bootstrap/bootstrap-script.sh | /bin/bash
ca: curl -Sks https://server_hostname/pub/bootstrap/bootstrap-sles15.sh | /bin/bash

source: {ubuntu} can only be bootstrapped using the corresponding {ubuntu} bootstrap script run from the client system's command line after issuing [command]``sudo su -`` as above. It cannot be bootstrapped via the {productname} {webui} due to the fact that the root user is disabled on {ubuntu} by default, and that the {webui} does not permit for privilege escalation of the {ubuntu} install-created user.
ca: {ubuntu} només es pot arrencar amb l'script d'arrencada {ubuntu} corresponent que s'executa des de la línia d'ordres del sistema client després d'emetre [ordre].sudo su -. com s'ha dit anteriorment. No es pot arrencar a través del {productname} {webui} a causa del fet que l'usuari root està desactivat a {ubuntu} per defecte, i que el {webui} no permet l'escalada de privilegis de l'usuari {ubuntu} creat per instal·lar.

source: Configuration Basics
ca: Conceptes bàsics de configuració
ja: 設定の基本
ko: 구성 기본
zh_cn: 配置基本知识

source: {productname} requires a number of steps to prepare the environment for clients registration before a wide range of its operations can be utilized.
ca: {productname} requereix una sèrie de passos per preparar l'entorn per al registre dels clients abans que es pugui utilitzar una àmplia gamma de les seves operacions.
ja: 広範な操作を利用できるようにするためにクライアント登録のための環境を準備するには、{productname}で複数の手順を実行する必要があります。
ko: {productname}에서는 클라이언트 등록을 위한 환경을 준비하기 위해 여러 단계를 거친 후 매우 다양한 작업을 활용해야 합니다.
zh_cn: {productname} 需要您执行一些步骤来准备客户端注册环境，然后才能使用该环境的各项操作。

source: This section contains summary of the initial configuration steps that are necessary to support environment operations following successful {productname} installation and setting up.
ca: Aquesta secció conté un resum dels passos de configuració inicials que són necessaris per donar suport a les operacions d'entorn després de la instal·lació i configuració de {productname}.
ja: このセクションには、{productname}を正しくインストールおよびセットアップした後の 環境操作をサポートするために必要な初期設定手順のまとめが記載されています。
ko: 이 섹션에는 성공적인 {productname} 설치 및 설정 후 환경 작업을 지원하기 위해 필요한 초기 구성 단계에 대한 요약이 포함되어 있습니다.
zh_cn: 本章总结了在成功安装和设置 {productname} 后为支持环境操作而必须执行的初始配置步骤。

source: For more information about installing and setting up {productname}, see xref:installation-and-upgrade:uyuni-installation-and-upgrade-overview.adoc[].
ca: Per obtenir més informació sobre la instal·lació i la configuració de {productname}, vegeu xref:installation-and-upgrade:uyuni-installation-and-upgrade-overview.adoc[].

source: Configuration Management
ca: Gestió de la configuració
ja: 設定管理
ko: 구성 관리
zh_cn: 配置管理

source: You can use configuration files and channels to manage configuration for your clients, rather than configuring each client manually.
ca: Podeu utilitzar fitxers de configuració i canals per gestionar la configuració dels vostres clients, en lloc de configurar cada client manualment.
ja: クライアントそれぞれを手動で設定するのではなく、設定ファイルおよびチャンネルを使用してクライアントの設定を管理できます。
ko: 각 클라이언트를 수동으로 구성하는 대신에 구성 파일 및 채널을 사용해 클라이언트에 대한 구성을 관리할 수 있습니다.
zh_cn: 您可以使用配置文件和通道管理客户端的配置，而无需手动配置每个客户端。

source: Configuration parameters are scripted and stored in configuration files. You can write configuration files directly using the {productname} {webui}, or you can upload or link to files that exist in other locations.
ca: Els paràmetres de configuració es programen i s'emmagatzemen als fitxers de configuració. Podeu escriure fitxers de configuració directament utilitzant el {productname} {webui}, o podeu pujar o enllaçar fitxers que existeixen en altres ubicacions.
ja: 設定パラメータは、スクリプト化され、設定ファイルに保存されます。 {productname}の{webui}を使用して設定ファイルを直接書き込むことができます。または、別の場所にあるファイルをアップロードまたはリンクできます。
ko: 구성 파라미터는 스크립트되고 구성 파일에 저장됩니다. {productname} {webui}를 사용해 직접 구성 파일을 작성할 수 있습니다. 또는 다른 위치에 있는 파일을 업로드하거나 그러한 파일에 링크할 수 있습니다.
zh_cn: 配置参数编写在脚本中并存储在配置文件中。您可以使用 {productname} {webui} 直接写入配置文件，也可以上载或关联到其他位置存在的文件。

source: Configuration files can be centrally managed. Centrally managed configuration files are provided by global configuration channels and can be applied to any client subscribed to the {productname} Server.
ca: Els fitxers de configuració es poden gestionar centralment. Els fitxers de configuració gestionats centralment són proporcionats per canals de configuració globals i es poden aplicar a qualsevol client subscrit al servidor {productname}.

source: Configuration channels are used to organize configuration files. You can subscribe clients to configuration channels, and deploy configuration files as required.
ca: Els canals de configuració s'utilitzen per organitzar fitxers de configuració. Podeu subscriure clients als canals de configuració i desplegar fitxers de configuració segons sigui necessari.
ja: 設定チャンネルは、設定ファイルの編成に使用されます。 クライアントを設定チャンネルにサブスクライブして、必要に応じて設定ファイルを展開できます。
ko: 구성 채널은 구성 파일을 체계적으로 정리하는 데 사용됩니다. 클라이언트를 구성 채널에 가입하고 필요에 따라 구성 파일을 배포할 수 있습니다.
zh_cn: 配置通道用于组织配置文件。您可以为客户端订阅配置通道，并根据需要部署配置文件。

source: Configuration files are version-controlled, so you can add configuration settings, test them on your clients, and roll back to a previous revision as required. When you have created your configuration channels, you can also perform comparisons between various configuration files, and between revisions of the same configuration file.
ca: Els fitxers de configuració estan controlats per versions, de manera que podeu afegir paràmetres de configuració, provar-los en els vostres clients i tornar a una revisió anterior segons sigui necessari. Quan hàgiu creat els vostres canals de configuració, també podreu realitzar comparacions entre diversos fitxers de configuració i entre revisions del mateix fitxer de configuració.
ja: 設定ファイルはバージョン管理されるため、設定を追加し、クライアントで設定をテストし、必要に応じて前のリビジョンにロールバックできます。 設定チャンネルを作成したら、さまざまな設定ファイル間の比較や同じ設定ファイルの異なるリビジョン間の比較も実行できます。
ko: 구성 파일은 버전이 관리되므로 구성 설정을 추가하고, 이를 클라이언트에서 테스트하고, 필요에 따라 이전 리비전으로 롤백할 수 있습니다. 구성 채널을 생성했다면 다양한 구성 파일 간에, 그리고 동일한 구성 파일의 리비전 간에 비교를 수행할 수도 있습니다.
zh_cn: 配置文件有版本控制，因此您可以添加配置设置，在您的客户端上对其进行测试，并根据需要将其回滚到之前的修订版。如果您已创建配置通道，还可以在不同的配置文件以及同一配置文件的不同修订版之间进行比较。

source: Centrally managed configuration files are provided by global configuration channels.
ca: Els fitxers de configuració gestionats centralment són proporcionats pels canals de configuració globals.

source: This table shows the supported features, where:
ca: Aquesta taula mostra les característiques admeses, on:

source: {check} features are supported by {suse}
ca: {check} clients que executen aquest sistema operatiu són compatibles amb {suse}
ja: {check}: この機能は{suse}でサポートされています。
ko: {check} 기능은 {suse}에서 지원합니다.
zh_cn: {check} 功能受 {suse} 支持

source: {cross} features are not supported by {suse}
ca: {cross} clients que executen aquest sistema operatiu no són compatibles amb {suse}
ja: {cross}: この機能は{suse}ではサポートされていません。
ko: {cross} 기능은 {suse}에서 지원하지 않습니다.
zh_cn: {cross} 功能不受 {suse} 支持

source: {question} features are under consideration, and may or may not be supported at a later date.
ca: {question} clients estan sota consideració i poden o no ser admesos més tard.
ja: {question}: この機能は検討中であり、後日使用できる場合と、使用できない場合があります。
ko: {question} 기능은 현재 지원 고려 중이며, 이후에 지원될 수도 있고 지원되지 않을 수도 있습니다.
zh_cn: {question} 功能正在考虑之中，日后可能受支持，也可能不受支持。

source: Configuration Management Supported Features
ca: Funcionalitats compatibles amb la gestió de la configuració
ja: 設定管理でサポートされる機能
ko: 지원되는 구성 관리 기능
zh_cn: 配置管理支持的功能

source: | Feature | Status | Global Configuration Channels | {check} | Deploying Files | {check} | Comparing Files | {question} | Locally Managed Files | {check} (with {salt} features) | Sandbox Files | {cross} | Applying the Highstate | {check} | File Import from a Client | {cross} | Jinja Templating | {check} | Configuration Macros | {check} (with {salt} features: grains, pillar data, etc.)
ca: Fe Característica Estat s Canals de configuració globals {check} ing Desplegant fitxers {check} s Comparació de fitxers {question} s Fitxers gestionats localment with {check} (amb {salt} funcions) s Fitxers Sandbox {cross} the Aplicació de l'estat alt {check} a Fitxer Importa des d'un client {cross} ing Plantilla Jinja {check} s Macros de configuració , {check} (amb {salt} característiques: grans, dades de pilars, etc.)

source: Create Configuration Channels
ca: Crea canals de configuració
ja: 設定チャンネルの作成
ko: 구성 채널 생성
zh_cn: 创建配置通道

source: Central Configuration Channel
ca: Crea canals de configuració

source: To create a new central configuration channel:
ca: Per a crear un canal de configuració central nou:
ja: 新しいセントラル設定チャンネルを作成するには:
ko: 새로운 중앙 구성 채널을 생성하려면:
zh_cn: 要创建新的中心配置通道，请执行以下操作：

source: Procedure: Creating Central Configuration Channel
ca: Procediment: Creació d'un canal de configuració central
ja: プロシージャ: セントラル設定チャンネルの作成
ko: 절차: 중앙 구성 채널 생성
zh_cn: 过程：创建中心配置通道

source: In the {productname} {webui}, navigate to menu:Configuration[Channels], and click btn:[Create Config Channel].
ca: A la {productname} {webui}, navegueu al menú:Configuration[Channels], i feu clic a btn:[Create Config Channel].
ja: {productname}の{webui}で、menu:設定[チャンネル]に移動し、btn:[設定チャンネルの作成]をクリックします。
ko: {productname} {webui}에서 menu:구성[채널]로 이동하여 btn:[구성 채널 생성]을 클릭합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:配置[通道]，然后单击 btn:[创建配置通道]。

source: Type a name for the channel.
ca: Escriviu un nom per al canal.
ja: チャンネルの名前を入力します。
ko: 채널의 이름을 입력합니다.
zh_cn: 键入通道的名称。

source: Type a label for the channel.
ca: Escriviu una etiqueta per al canal.
ja: チャンネルのラベルを入力します。
ko: 채널의 레이블을 입력합니다.
zh_cn: 键入通道的标签。

source: This field must contain only letters, numbers, hyphens (``-``) and underscores (``_``).
ca: Aquest camp ha de contenir només lletres, números, guions ().-).) i guions baixos ().).
ja: このフィールドには、半角の英字、数字、ハイフン(``-``)、および下線(``_``)のみを含める必要があります。
ko: 이 필드는 글자, 숫자, 하이픈(``-``), 밑줄(``_``)만 포함해야 합니다.
zh_cn: 此字段只能包含字母、数字、连字符 (``-``) 和下划线 (``_``)。

source: Type a description for the channel that allows you to distinguish it from other channels.
ca: Escriviu una descripció per al canal que us permeti distingir-lo d'altres canals.
ja: 他のチャンネルから区別できるようにチャンネルの説明を入力します。
ko: 다른 채널과 구별할 수 있게 해주는 채널 설명을 입력합니다.
zh_cn: 键入用于与其他通道进行区分的通道说明。

source: Click btn:[Create Config Channel] to create the new channel.
ca: Feu clic a btn:[Crea el canal de configuració] per a crear el canal nou.
ja: btn:[設定チャンネルの作成]をクリックして新しいチャンネルを作成します。
ko: btn:[구성 채널 생성]을 클릭하여 새 채널을 생성합니다.
zh_cn: 单击 btn:[创建配置通道] 以创建新通道。

source: Salt State Channel
ca: Canal pare per defecte

source: You can also use a configuration channel to manage {salt} states on clients:
ca: També podeu utilitzar un canal de configuració per gestionar {salt} estats en clients:

source: Procedure: Creating a {salt} State Channel
ca: Procediment: Creació de canals personalitzats

source: In the {productname} {webui}, navigate to menu:Configuration[Channels], and click btn:[Create State Channel].
ca: A la {productname} {webui}, navegueu al menú:Configuration[Channels], i feu clic a btn:[Create State Channel].
ja: {productname}の{webui}で、menu:設定[チャンネル]に移動し、btn:[状態チャンネルの作成]をクリックします。
ko: {productname} {webui}에서 menu:구성[채널]로 이동하여 btn:[상태 채널 생성]을 클릭합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:配置[通道]，然后单击 btn:[创建状态通道]。

source: Type the [guimenu]``SLS Contents`` for the [path]``init.sls`` file.
ca: Escriviu el [guimenu].Continguts SLS for per al fitxer [path].init.sls..
ja: [path]``init.sls``ファイルの［[guimenu]``SLSコンテンツ``］を入力します。
ko: [path]``init.sls`` 파일에 대해 [guimenu]``SLS 컨텐트``를 입력합니다.
zh_cn: 为 [path]``init.sls`` 文件键入 [guimenu]``SLS 内容``。

source: Add Configuration Files, Directories, or Symbolic Links
ca: Afegeix fitxers de configuració, directoris o enllaços simbòlics
ja: 設定ファイル、ディレクトリ、またはシンボリックリンクの追加
ko: 구성 파일, 디렉토리 또는 심볼 링크 추가
zh_cn: 添加配置文件、目录或符号链接

source: When you have created a configuration channel you can add a configuration file, directory, or symbolic link:
ca: Quan hàgiu creat un canal de configuració, podeu afegir un fitxer de configuració, directori o enllaç simbòlic:
ja: 設定チャンネルを作成済みの場合、設定ファイル、ディレクトリ、またはシンボリックリンクを追加できます。
ko: 구성 채널을 생성했으면 이제 구성 파일, 디렉토리 또는 심볼 링크를 추가할 수 있습니다.
zh_cn: 如果您已创建配置通道，则可以添加配置文件、目录或符号链接：

source: Procedure: Adding a Configuration File, Directory, or Symbolic Link
ca: Procediment: Afegir un fitxer de configuració, directori o enllaç simbòlic
ja: プロシージャ: 設定ファイル、ディレクトリ、またはシンボリックリンクの追加
ko: 절차: 구성 파일, 디렉토리 또는 심볼 링크 추가
zh_cn: 过程：添加配置文件、目录或符号链接

source: In the {productname} {webui}, navigate to menu:Configuration[Channels], and click the name of the configuration channel that you want to add a configuration file to, and navigate to the menu:Add Files[Create File] subtab.
ca: A la {productname} {webui}, navegueu a menu:Configuration[Channels], i feu clic al nom del canal de configuració al qual voleu afegir un fitxer de configuració, i navegueu a la sub pestanya menu:Afegeix fitxers[Crea un fitxer].
ja: {productname}の{webui}で、menu:設定[チャンネル]に移動し、設定ファイルに追加する設定チャンネルの名前をクリックし、menu:ファイルの追加[ファイルの作成]サブタブに移動します。
ko: {productname} {webui}에서 menu:구성[채널]로 이동하여 구성 파일을 추가하려는 구성 채널의 이름을 클릭한 후, menu:파일 추가[파일 생성] 하위 탭으로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:配置[通道]，单击要向其添加配置文件的配置通道的名称，然后导航到menu:添加文件[创建文件]子选项卡。

source: In the [guimenu]``File Type`` field, choose whether you want to create a text file, directory, or symbolic link.
ca: Al camp [guimenu].Tipus de fitxer., trieu si voleu crear un fitxer de text, directori o enllaç simbòlic.
ja: ［[guimenu]``ファイルタイプ``］フィールドで、テキストファイル、ディレクトリ、またはシンボリックリンクを作成するかどうかを選択します。
ko: [guimenu]``파일 형식`` 필드에서 텍스트 파일, 디렉토리, 심볼 링크 중 생성하려는 것을 선택합니다.
zh_cn: 在[guimenu]``文件类型``字段中，选择是要创建文本文件、目录还是符号链接。

source: In the [path]``Filename/Path`` field, type the absolute path to the location where the file should be deployed.
ca: En el camp [camí].nomfitxer/Path., escriviu el camí absolut cap a la ubicació on s'ha de desplegar el fitxer.
ja: ［[path]``ファイル名/パス``］フィールドで、ファイルを展開する場所への絶対パスを入力します。
ko: [path]``파일 이름/경로`` 필드에 파일을 배포해야 하는 위치의 절대 경로를 입력합니다.
zh_cn: 在[path]``文件名/路径``字段中，键入应部署文件的位置的绝对路径。

source: If you are creating a symbolic link, type the target file and path in the [guimenu]``Symbolic Link Target Filename/Path`` field.
ca: Si esteu creant un enllaç simbòlic, escriviu el fitxer de destinació i el camí en el camp [guimenu].Enllaç simbòlic Nom del fitxer de destinació/Path..
ja: シンボリックリンクを作成している場合、［[guimenu]``シンボリックリンクの目的ファイル名/パス``］フィールドにターゲットのファイルおよびパスを入力します。
ko: 심볼 링크를 생성하려면 [guimenu]``심볼 링크 대상 파일 이름/경로`` 필드에 대상 파일 및 경로를 입력하십시오.
zh_cn: 如果您要创建符号链接，请在[guimenu]``符号链接目标文件名/路径``字段中键入目标文件和路径。

source: Type the [guimenu]``User name`` and [guimenu]``Group name`` for the file in the [guimenu]``Ownership`` field, and the [guimenu]``File Permissions Mode``.
ca: Escriviu el [guimenu].Nom de l'usuari. i el [guimenu].Nom del grup. per al fitxer al camp [guimenu].Propietat., i el [guimenu].Mode de permisos de fitxer..
ja: ［[guimenu]``所有権``］フィールドおよび［[guimenu]``ファイルアクセス許可モード``］にファイルの［[guimenu]``ユーザ名``］および［[guimenu]``グループ名``］を入力します。
ko: [guimenu]``소유권`` 필드에서 파일의 [guimenu]``사용자 이름`` 및 [guimenu]``그룹 이름``을 입력하고 [guimenu]``파일 권한 모드``를 입력합니다.
zh_cn: 在[guimenu]``所有权``字段中键入该文件的[guimenu]``用户名``和[guimenu]``组名称``，以及[guimenu]``文件权限模式``。
