Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: For already onboarded clients that use those repositories, the workaround is to disable GPG key checking on them.
ca: Per als clients ja incorporats que utilitzen aquests repositoris, la solució consisteix a desactivar la comprovació de la clau GPG.
ja: リポジトリを使用するオンボード済みのクライアントの場合、修正方法は、そのクライアントでGPGキーのチェックを無効にすることです。
ko: 그러한 리포지토리를 사용하는 클라이언트를 이미 온보딩한 경우 해결 방법은 해당 클라이언트에서 GPG 키 확인을 비활성화하는 것입니다.
zh_cn: 如果一些已初始配置的客户端使用的是这些储存库，可以暂时对它们禁用 GPG 密钥检查。

source: Autoinstallation Profiles
ca: Perfils d'autoinstal·lació
ja: 自動インストールプロファイル
ko: 자동 설치 프로파일
zh_cn: 自动安装配置文件

source: Within {productname}, you can use two different types of profiles, depending on the operating system of the clients you want to install:
ca: Dins de {productname}, podeu utilitzar dos tipus diferents de perfils, depenent del sistema operatiu dels clients que vulgueu instal·lar:
ja: {productname}内では、インストールするクライアントのオペレーティングシステムに応じて、2つの異なる種類のプロファイルを使用できます。
ko: {productname}에서 설치할 클라이언트의 운영 체제에 따라 두 가지 유형의 프로파일을 사용할 수 있습니다.
zh_cn: 在 {productname} 中，您可以使用两种不同的配置文件，具体取决于您要安装的客户端的操作系统：

source: For {sle} or {opensuse} clients, use {ay}.
ca: Per a {rhel} clients, utilitzeu {kickstart}.
ja: {sle}クライアントまたは{opensuse}クライアントの場合、{ay}を使用します。
ko: {sle} 또는 {opensuse} 클라이언트에 대해서는 {ay}를 사용하십시오.
zh_cn: 对于 {sle} 或 {opensuse} 客户端，请使用 {ay}。

source: For {rhel} clients, use {kickstart}.
ca: Per a {rhel} clients, utilitzeu {kickstart}.
ja: {rhel}クライアントの場合、{kickstart}を使用します。
ko: {rhel} 클라이언트에 대해서는 {kickstart}를 사용하십시오.
zh_cn: 对于 {rhel} 客户端，请使用 {kickstart}。

source: An autoinstallation profile determines how the operating system will be installed. For example, you can specify additional kernel parameters to be passed to the installer.
ca: Un perfil d'autoinstal·lació determina com s'instal·larà el sistema operatiu. Per exemple, podeu especificar paràmetres addicionals del nucli que es passaran a l'instal·lador.
ja: 自動インストールプロファイルによって、オペレーティングシステムをインストールする方法が決定されます。 たとえば、インストーラに渡す追加のカーネルパラメータを指定できます。
ko: 운영 체제가 설치되는 방법은 자동 설치 프로파일에 따라 다릅니다. 예를 들어, 설치 프로그램에 전달한 추가 커널 파라미터를 지정할 수 있습니다.
zh_cn: 自动安装配置文件决定了如何安装操作系统。例如，您可以指定更多要传递给安装程序的内核参数。

source: The most important part of the profile is the *autoinstallation file*. When you perform an installation manually, you must provide information to the installer, such as partitioning and networking information and user details. The autoinstallation file is a method of providing this information in a scripted form. This type of file is sometimes also referred to as an *answers file*.
ca: La part més important del perfil és el fitxer d'autoinstal·lació. Quan realitzeu una instal·lació manualment, heu de proporcionar informació a l'instal·lador, com ara la informació de la partició i la xarxa i els detalls de l'usuari. El fitxer d'autoinstal·lació és un mètode per a proporcionar aquesta informació en forma de script. Aquest tipus de fitxer de vegades també es coneix com a fitxer de respostes.

source: You can use both {ay} and {kickstart} profiles if you want to install clients with different operating systems.
ca: Podeu utilitzar els perfils {ay} i {kickstart} si voleu instal·lar clients amb diferents sistemes operatius.
ja: 異なるオペレーティングシステムでクライアントをインストールする場合、{ay}プロファイルと{kickstart}プロファイルの両方を使用できます。
ko: 운영 체제가 다양한 클라이언트를 설치하려는 경우 {ay} 및 {kickstart} 프로파일을 모두 사용할 수 있습니다.
zh_cn: 如果您要安装具有不同操作系统的客户端，可以使用 {ay} 和 {kickstart} 配置文件。

source: For information about how to declare profiles, see xref:client-configuration:autoinst-profiles.adoc#declare-profile[Declare the Profile]
ca: Per obtenir informació sobre com declarar els perfils, vegeu xref:client-configuration:autoinst-profiles.adoc]declare-profile[Declarar el perfil]
ja: プロファイルを宣言する方法については、xref:client-configuration:autoinst-profiles.adoc#declare-profile[プロファイルを宣言する]を参照してください。
ko: 프로파일을 선언하는 방법은 xref:client-configuration:autoinst-profiles.adoc#declare-profile[프로파일 선언]에서 확인할 수 있습니다.
zh_cn: 有关如何声明配置文件的信息，请参见xref:client-configuration:autoinst-profiles.adoc#declare-profile[声明配置文件]。

source: For information about {ay} profiles, see xref:client-configuration:autoinst-profiles.adoc#autoyast[{ay} Profiles].
ca: Per obtenir informació sobre els perfils {kickstart}, vegeu xref:client-configuration:autoinst-profiles.adoc].kickstart[Kickstart Profiles].
ja: {ay}プロファイルについては、xref:client-configuration:autoinst-profiles.adoc#autoyast[{ay}プロファイル]を参照してください。
ko: {ay} 프로파일에 대한 설명은 xref:client-configuration:autoinst-profiles.adoc#autoyast[{ay} 프로파일]을 참조하십시오.
zh_cn: 有关 {ay} 配置文件的信息，请参见 xref:client-configuration:autoinst- profiles.adoc#autoyast[{ay} 配置文件]。

source: For information about {kickstart} profiles, see xref:client-configuration:autoinst-profiles.adoc#kickstart[Kickstart Profiles].
ca: Per obtenir informació sobre els perfils {kickstart}, vegeu xref:client-configuration:autoinst-profiles.adoc].kickstart[Kickstart Profiles].
ja: {kickstart}プロファイルについては、xref:client-configuration:autoinst-profiles.adoc#kickstart[Kickstartプロファイル]を参照してください。
ko: {kickstart} 프로파일에 대한 설명은 xref:client-configuration:autoinst-profiles.adoc#kickstart[Kickstart 프로파일]을 참조하십시오.
zh_cn: 有关 {kickstart} 配置文件的信息，请参见 xref:client-configuration:autoinst-profiles.adoc#kickstart[Kickstart 配置文件]。

source: The autoinstallation file contained in the profile can include variables and code snippets. For information about variables and code snippets, see xref:client-configuration:autoinst-profiles.adoc#templates-syntax[Templates Syntax].
ca: El fitxer d'autoinstal·lació que conté el perfil pot incloure variables i fragments de codi. Per obtenir informació sobre variables i fragments de codi, vegeu xref:client-configuration:autoinst-profiles.adoc].templates-syntax[Templates Syntax].
ja: プロファイルに含まれる自動インストールファイルには、変数とコードスニペットを格納できます。 変数とコードスニペットについては、xref:client-configuration:autoinst-profiles.adoc#templates-syntax[テンプレートの構文]を参照してください。
ko: 프로파일에 포함된 자동 설치 파일에는 변수 및 코드 조각이 포함될 수 있습니다. 변수 및 코드 조각에 대한 설명은 xref:client-configuration:autoinst-profiles.adoc#templates-syntax[템플릿 구문]을 참조하십시오.
zh_cn: 配置文件中包含的自动安装文件可以包含变量和代码段。有关变量和代码段的信息，请参见xref:client-configuration:autoinst-profiles.adoc#templates-syntax[模板语法]。

source: Declare the Profile
ca: Declara el perfil
ja: プロファイルを宣言する
ko: 프로파일 선언
zh_cn: 声明配置文件

source: When you have prepared an autoinstallation file and distribution, you can create profiles to manage autoinstallation on your {productname} Server. The profile will determine how to install this distribution you selected. One way to create a profile is to upload an {ay} or {kickstart} file. Alternatively, for {kickstart} only, you can use the {webui} wizard.
ca: Quan hàgiu preparat un fitxer d'instal·lació automàtica i una distribució, podeu crear perfils per gestionar l'autoinstal·lació al vostre servidor {productname}. El perfil determinarà com instal·lar aquesta distribució que heu seleccionat. Una manera de crear un perfil és carregar un fitxer {ay} o {kickstart}. Alternativament, només per a {kickstart}, podeu utilitzar l'assistent {webui}.
ko: 자동 설치 파일 및 배포를 준비했으면 프로파일을 생성하여 {productname} 서버에서 자동 설치를 관리할 수 있습니다. 프로파일은 선택한 이 배포판을 설치하는 방법을 결정합니다. 프로파일을 만드는 한 가지 방법은 {ay} 또는 {kickstart} 파일을 업로드하는 것입니다. 또는 {kickstart}의 경우에만 {webui} 마법사를 사용할 수 있습니다.
zh_cn: 准备好自动安装文件和发行套件后，您可以创建配置文件来管理 {productname} 服务器上的自动安装。配置文件会决定如何安装您选择的此发行套件。创建配置文件的其中一个方式是上载 {ay} 或 {kickstart} 文件。或者，您也可以使用 {webui} 向导（仅针对 {kickstart}）。

source: Procedure: Creating an Autoinstallation Profile by Upload
ca: Procediment: Creació d'un perfil d'autoinstal·lació mitjançant la pujada
ja: 手順: アップロードによる自動インストールプロファイルの作成
ko: 절차: 업로드하여 자동 설치 프로파일 생성
zh_cn: 过程：通过上载创建自动安装配置文件

source: In the {productname} {webui}, navigate to menu:Systems[Autoinstallation > Profiles].
ca: A {productname} {webui}, navegueu a menu:Systems[Autoinstallation ]. Profiles].
ja: {productname}の{webui}で、menu:システム[自動インストール > プロファイル]に移動します。
ko: {productname} {webui}에서 menu:시스템[자동 설치 > 프로파일]로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[自动安装 > 配置文件]。

source: Click btn:[Upload Kickstart/{ay} File].
ca: Feu clic a btn:[Crea el perfil de Kickstart].
ja: btn:[キックスタート/{ay}ファイルをアップロード]をクリックします。
ko: btn:[Kickstart/{ay} 파일 업로드]를 클릭합니다.
zh_cn: 单击 btn:[上载 Kickstart/{ay} 文件]。

source: In the [guimenu]``Label`` field, type a name for the profile. Do not use spaces.
ca: Al camp [guimenu].Etiqueta., escriviu un nom per al perfil. No facis servir espais.
ja: ［[guimenu]``ラベル``］フィールドにプロファイルの名前を入力します。 スペースは使用しません。
ko: [guimenu]``레이블`` 필드에 프로파일의 이름을 입력합니다. 공백을 사용하면 안 됩니다.
zh_cn: 在[guimenu]``标签``字段中，键入配置文件的名称。不要使用空格。

source: In the [guimenu]``Autoinstall Tree`` field, select the autoinstallable distribution to use for this profile.
ca: Al camp [guimenu].Arbre d'autoinstal·lació., seleccioneu la distribució autoinstal·lable a utilitzar per a aquest perfil.
ja: ［[guimenu]``自動インストールツリー``］フィールドで、このプロファイルに使用する自動インストールのディストリビューションを選択します。
ko: [guimenu]``자동 설치 트리`` 필드에서 이 프로파일에 사용할 자동 설치 가능한 배포판을 선택합니다.
zh_cn: 在[guimenu]``自动安装树``字段中，选择要用于此配置文件的可自动安装的发行套件。

source: In the [guimenu]``Virtualization Type`` field, select the type of virtualization to use for this profile, or select ``None`` if you do not want to use this profile to create a new virtual machine.
ca: Al camp [guimenu].Tipus de virtualització., seleccioneu el tipus de virtualització a utilitzar per a aquest perfil, o seleccioneu .Cap if si no voleu utilitzar aquest perfil per a crear una màquina virtual nova.
ja: ［[guimenu]``仮想化タイプ``］フィールドで、このプロファイルに使用する仮想化の種類を選択します。または、このプロファイルを使用して新しい仮想マシンを作成しない場合には［``なし``］を選択します。
ko: [guimenu]``가상화 유형`` 필드에서 이 프로파일에 사용할 가상화 유형을 선택하거나, 이 프로파일을 사용하여 새로운 가상 시스템을 생성하지 않으려면 ``없음``을 선택합니다.
zh_cn: 在[guimenu]``虚拟化类型``字段中，选择要用于此配置文件的虚拟化类型，或选择``无``（如果您不想使用此配置文件创建新的虚拟机）。

source: Copy the contents of your autoinstallation file into the [guimenu]``File Contents`` field, or upload the file directly using the [guimenu]``File to Upload`` field.
ca: Copieu el contingut del fitxer d'autoinstal·lació al camp [guimenu].Continguts del fitxer into, o pugeu el fitxer directament utilitzant el camp [guimenu].Fitxer per a pujar``.
ja: 自動インストールファイルの内容を［[guimenu]``ファイルの内容``］フィールドにコピーするか、または［[guimenu]``アップロードするファイル``］フィールドを使用してファイルを直接アップロードします。
ko: 자동 설치 파일의 내용을 [guimenu]``파일 내용`` 필드에 복사하거나 [guimenu]``업로드할 파일`` 필드를 사용하여 직접 파일을 업로드합니다.
zh_cn: 将自动安装文件的内容复制到[guimenu]``文件内容``字段，或使用[guimenu]``要上载的文件``字段直接上载文件。

source: For more information about the details to include here, see xref:client-configuration:autoinst-profiles.adoc#autoyast[{ay} Profiles] or xref:client-configuration:autoinst-profiles.adoc#kickstart[Kickstart Profiles].
ca: Per obtenir informació sobre els perfils {kickstart}, vegeu xref:client-configuration:autoinst-profiles.adoc].kickstart[Kickstart Profiles].
ja: ここに記載する詳細については、xref:client-configuration:autoinst-profiles.adoc#autoyast[{ay}プロファイル]またはxref:client-configuration:autoinst-profiles.adoc#kickstart[Kickstartプロファイル]を参照してください。
ko: 여기에 포함되는 세부 정보에 대한 자세한 설명은 xref:client-configuration:autoinst-profiles.adoc#autoyast[{ay} 프로파일] 또는 xref:client-configuration:autoinst-profiles.adoc#kickstart[Kickstart 프로파일]을 참조하십시오.
zh_cn: 有关此处要包含的细节的详细信息，请参见 xref:client-configuration:autoinst-profiles.adoc#autoyast[{ay} 配置文件] 或 xref:client-configuration:autoinst-profiles.adoc#kickstart[Kickstart 配置文件]。

source: Click btn:[Create] to create the profile.
ca: Feu clic a btn:[Crea] per a crear el perfil.
ja: btn:[作成]をクリックしてプロファイルを作成します。
ko: btn:[생성]을 클릭하여 프로파일을 생성합니다.
zh_cn: 单击 btn:[创建] 以创建配置文件。

source: Procedure: Creating a {kickstart} Profile by Wizard
ca: Procediment: Creació d'un perfil {kickstart} per l'auxiliar
ja: プロシージャ: ウィザードで{kickstart}プロファイルを作成する
ko: 절차: 마법사로 {kickstart} 프로파일 생성
zh_cn: 过程：通过向导创建 {kickstart} 配置文件

source: Click btn:[Create Kickstart Profile].
ca: Feu clic a btn:[Crea el perfil de Kickstart].
ja: btn:[キックスタートプロファイルを作成]をクリックします。
ko: btn:[Kickstart 프로파일 생성]을 클릭합니다.
zh_cn: 单击 btn:[创建 Kickstart 配置文件]。

source: In the [guimenu]``Base Channel`` field, select the base channel to use for this profile. This field is populated from the distributions available. If the base channel you need is not available, check that you have created the distribution correctly.
ca: Al camp [guimenu].Canal base., seleccioneu el canal base a utilitzar per a aquest perfil. Aquest camp està poblat per les distribucions disponibles. Si el canal base que necessiteu no està disponible, comproveu que heu creat la distribució correctament.
ja: ［[guimenu]``ベースチャンネル``］フィールドで、このプロファイルに使用するベースチャンネルを選択します。このフィールドは利用できるディストリビューションから入力されます。 必要なベースチャンネルが利用できない場合、ディストリビューションを正しく作成したことを確認してください。
ko: [guimenu]``기본 채널`` 필드에서 이 프로파일에 사용할 기본 채널을 선택합니다. 이 필드는 사용 가능한 배포에서 채워집니다. 필요한 기본 채널을 사용할 수 없는 경우 배포를 올바르게 생성하였는지 확인하십시오.
zh_cn: 在[guimenu]``基础通道``字段中，选择要用于此配置文件的基础通道。系统会根据可用的发行套件填充此字段。如果您需要的基础通道不可用，请检查您是否正确创建了发行套件。

source: In the [guimenu]``Virtualization Type`` field, select the type of virtualization to use for this profile, or select ``None`` for no virtualization.
ca: Al camp [guimenu].Tipus de virtualització., seleccioneu el tipus de virtualització a utilitzar per a aquest perfil, o seleccioneu .Cap. per a no virtualitzar.
ja: ［[guimenu]``仮想化タイプ``］フィールドで、このプロファイルに使用する仮想化の種類を選択します。または、仮想化しない場合には［``なし``］を選択します。
ko: [guimenu]``가상화 유형`` 필드에서 이 프로파일에 사용할 가상화의 유형을 선택합니다. 가상화가 없는 경우 ``없음``을 선택합니다.
zh_cn: 在[guimenu]``虚拟化类型``字段中，选择要用于此配置文件的虚拟化类型，或选择``无``（表示不进行虚拟化）。

source: Click btn:[Next].
ca: Feu clic a btn:[Següent].
ja: btn:[次へ]をクリックします。
ko: btn:[다음]을 클릭합니다.
zh_cn: 单击 btn:[下一步]。

source: In the [guimenu]``Distribution File Location`` type the path to the installation media installed on the {productname} Server.
ca: Al [guimenu].ubicació del fitxer de distribució. escriviu el camí al mitjà d'instal·lació instal·lat al servidor {productname}.
ja: ［[guimenu]``配信ファイルの場所``］で、{productname}サーバにインストールするインストールメディアへのパスを入力します。
ko: [guimenu]``배포 파일 위치``에서 {productname} 서버에 설치된 설치 미디어의 경로를 입력합니다.
zh_cn: 在[guimenu]``发行套件文件位置``中，键入 {productname} 服务器上安装的安装媒体的路径。

source: Provide a password for the root user on the client.
ca: Proporcioneu una contrasenya per a l'usuari root al client.
ja: クライアントのrootユーザのパスワードを入力します。
ko: 클라이언트에서 루트 사용자에게 비밀번호를 제공합니다.
zh_cn: 提供客户端上 root 用户的口令。

source: Click btn:[Finish].
ca: Feu clic a btn:[Finalitza].
ja: btn:[完了]をクリックします。
ko: btn:[완료]를 클릭합니다.
zh_cn: 单击 btn:[完成]。

source: Review the details of your new profile, and customize as required.
ca: Revisa els detalls del teu nou perfil i personalitza segons sigui necessari.
ja: 新しいプロファイルの詳細を確認し、必要に応じてカスタマイズします。
ko: 새 프로파일의 상세 정보를 검토하고 필요에 따라 사용자 정의합니다.
zh_cn: 查看新配置文件的细节，并视需要进行自定义。

source: When you are creating your autoinstallation profile, you can check [guimenu]``Always use the newest Tree for this base channel``. This setting allows {productname} to automatically pick the latest distribution that is associated with the specified base channel. If you add new distributions later, {productname} uses the most recently created or modified.
ca: Quan creeu el vostre perfil d'autoinstal·lació, podeu marcar [guimenu].Sempre utilitzar l'arbre més nou per a aquest canal base.. Aquest paràmetre permet que {productname} triï automàticament l'última distribució associada amb el canal base especificat. Si afegiu distribucions noves més tard, {productname} utilitza les més recentment creades o modificades.
ja: 自動インストールプロファイルを作成している場合、［[guimenu]``このベースチャンネルに最新のツリーを常に使用します``］にチェックを付けることができます。 この設定では、指定ベースチャンネルに関連付けられた最新ディストリビューションを{productname}で自動選択できます。 新しいディストリビューションを後で追加する場合、{productname}は、最後に作成または変更されたディストリビューションを使用します。
ko: 자동 설치 프로파일을 생성할 때 [guimenu]``이 기본 채널에 항상 최신 트리를 사용합니다.``의 확인란을 선택할 수 있습니다. 이 설정은 {productname}가 특정 기본 채널과 연결된 최신 배포를 자동으로 선택하도록 허용합니다. 나중에 새 배포를 추가하는 경우 {productname}는 최근에 생성되거나 수정된 것을 사용합니다.
zh_cn: 创建自动安装配置文件时，您可以选中[guimenu]``始终为此基础通道使用最新的树``。此设置可让 {productname} 自动提取与指定基础通道关联的最新发行套件。如果您以后添加新发行套件，{productname} 会使用最近创建或修改的发行套件。

source: Changing the [guimenu]``Virtualization Type`` usually requires changes to the profile bootloader and partition options. This can overwrite your customization. Verify new or changed settings before saving them, by navigating to the [guimenu]``Partitioning`` tab.
ca: Si canvieu el [guimenu].Tipus de virtualització. d'un perfil existent de {kickstart}, també podria modificar el carregador d'arrencada i les opcions de partició, potencialment sobreescrivint qualsevol configuració personalitzada. Reviseu atentament la pestanya [guimenu].Particionar to per a verificar aquests paràmetres abans de fer canvis.
ja: [guimenu]``仮想化の種類``を変更すると、通常、プロファイルのブートローダおよびパーティションオプションを変更する必要があります。 この操作を実行すると、カスタマイズが上書きされます。 新しい設定または変更した設定を保存前に確認します。そのためには、［[guimenu]``パーティション設定``］タブに移動します。
ko: [guimenu]`` 가상화 유형``을 변경하려면 일반적으로 프로파일 부트로더 및 파티션 옵션을 변경해야 합니다. 이렇게 하면 사용자 정의가 덮어쓰기될 수 있습니다. 신규 또는 변경된 설정을 저장하기 전에 [guimenu]``파티셔닝`` 탭으로 이동하여 확인하십시오.
zh_cn: 更改[guimenu]``虚拟化类型``通常需要更改配置文件加载程序和分区选项。这会重写您的自定义设置。请在保存前导航到[guimenu]``分区``选项卡校验新的或更改后的设置。

source: The kernel options from the distribution and the profile are combined.
ca: Es combinen les opcions del nucli de la distribució i el perfil.
ja: ディストリビューションとプロファイルのカーネルオプションは統合されます。
ko: 배포판 및 프로파일의 커널 옵션은 결합되어 있습니다.
zh_cn: 来自发行套件和配置文件的内核选项会进行合并。

source: You can change the details and settings of your autoinstallation profiles by navigating to menu:Systems[Autoinstallation > Profiles] and clicking the name of the profile you want to edit. Alternatively, navigate to menu:Systems[System List], select the client you want to provision, and navigate to the menu:Provisioning[Autoinstallation] subtab.
ca: Podeu canviar els detalls i la configuració dels vostres perfils d'autoinstal·lació navegant al menú:Sistemes[Autoinstal·lació . Perfils] i fent clic al nom del perfil que voleu editar. Alternativament, navegueu a menu:Systems[Llista de sistemes], seleccioneu el client que voleu proporcionar i navegueu a la subpestanya menu:Provisioning[Autoinstallation].
ja: 自動インストールプロファイルの詳細および設定を変更できます。そのためには、menu:システム[自動インストール > プロファイル]に移動し、編集するプロファイルの名前をクリックします。 または、menu:システム[システム一覧]に移動し、プロビジョニングするクライアントを選択し、menu:プロビジョニング[自動インストール]サブタブに移動します。
ko: menu:시스템[자동 설치 > 프로파일]로 이동해 편집하려는 프로파일의 이름을 클릭하여 자동 설치 프로파일의 상세 정보 및 설정을 변경할 수 있습니다. 또는 menu:시스템[시스템 목록]으로 이동하여 프로비저닝할 클라이언트를 선택한 후 menu:프로비저닝[자동 설치] 하위 탭으로 이동합니다.
zh_cn: 您可以更改自动安装配置文件的细节和设置，方法是导航到menu:系统[自动安装 > 配置文件]，然后单击要编辑的配置文件的名称。或者，可导航到menu:系统[系统列表]，选择要置备的客户端，然后导航到menu:置备[自动安装]子选项卡。

source: {ay} Profiles
ca: Perfils del Kickstart
ja: {ay}プロファイル
ko: {ay} 프로파일
zh_cn: {ay} 配置文件

source: An {ay} profile consists of a [guimenu]``Label`` that identifies the profile, an [guimenu]``Autoinstall Tree`` that points to an autoinstallable distribution, various options, and, most importantly, an {ay} installation file.
ca: Un perfil {ay} consisteix en un [guimenu].Etiqueta. que identifica el perfil, un [guimenu].Arbre d'autoinstal·lació. que apunta a una distribució autoinstal·lable, diverses opcions i, el més important, un fitxer d'instal·lació {ay}.
ja: {ay}プロファイルは、プロファイルを識別する[guimenu]``ラベル``、自動インストールのディストリビューションをポイントする[guimenu]``自動インストールツリー``、さまざまなオプション、最も重要な{ay}インストールファイルで構成されます。
ko: {ay} 프로파일은 프로파일을 식별하는 [guimenu]``레이블``, 자동 설치 가능한 배포판을 가리키는 [guimenu]``자동 설치 트리``, 여러 옵션과 가장 중요한 {ay} 설치 파일로 구성됩니다.
zh_cn: {ay} 配置文件由标识该配置文件的[guimenu]``标签``、指向可自动安装的发行套件的[guimenu]``自动安装树``、各种选项以及最重要的 {ay} 安装文件组成。

source: The {ay} installation file is an XML file that give directions to the {ay} installer. {ay} calls it a "control file." For the full syntax of {ay} installation files, see https://doc.opensuse.org/projects/autoyast/#cha-configuration-installation-options.
ca: El fitxer d'instal·lació {ay} és un fitxer XML que dona indicacions a l'instal·lador {ay}. {ay} l'anomena un "fitxer de control". Per a la sintaxi completa dels fitxers d'instal·lació de {ay}, vegeu https://doc.opensuse.org/projects/autoyast/.cha-configuration-installation-options.
ja: {ay}インストールファイルは、{ay}インストーラに指示を与えるXMLファイルです。{ay}では、「制御ファイル」と呼ばれます。 {ay}インストールファイルの構文の詳細については、link:https://doc.opensuse.org/projects/autoyast/#cha-configuration-installation-options[]を参照してください。
ko: {ay} 설치 파일은 {ay} 설치 프로그램에 방향을 제공하는 XML 파일입니다. {ay}에서는 이 파일을 "제어 파일"이라고 부릅니다. {ay} 설치 파일의 전체 구문은 https://doc.opensuse.org/projects/autoyast/#cha-configuration-installation-options[]를 참조하십시오.
zh_cn: {ay} 安装文件是一个 XML 文件，用于向 {ay} 安装程序提供指示。{ay} 将其称为“控制文件”。有关 {ay} 安装文件的完整语法，请参见 link:https://doc.opensuse.org/projects/autoyast/#cha-configuration-installation-options[]。

source: {suse} provides templates of {ay} installation files that you can use as a starting point for your own custom files. You will find the templates at https://github.com/SUSE/manager-build-profiles in the [path]``AutoYast`` directory. Each of these profiles requires you to set some variables before you use it. Check the [path]``README`` file included with the script to determine which variables you need. For more information about using variables in {ay} scripts, see xref:client-configuration:autoinst-profiles#variables[Variables].
ca: {suse} proporciona plantilles de fitxers d'instal·lació {ay} que podeu utilitzar com a punt de partida per als vostres propis fitxers personalitzats. Trobareu les plantilles a https://github.com/SUSE/manager-build-profiles al directori [path].AutoYast.. Cadascun d'aquests perfils requereix que establiu algunes variables abans d'utilitzar-les. Comproveu el fitxer [camí] theREADME. inclòs amb l'script per determinar quines variables necessiteu. Per a més informació sobre l'ús de variables en scripts {ay}, vegeu xref:client-configuration:autoinst-profiles].variables[Variables].
ja: {suse}には、独自のカスタムファイルの雛形として使用できる{ay}インストールファイルのテンプレートが用意されています。 このテンプレートは、link:https://github.com/SUSE/manager-build-profiles[]の[path]``AutoYast``ディレクトリにあります。 各プロファイルを使用するにはその前に、一部の変数を設定する必要があります。 スクリプトに含まれている[path]``README``ファイルを確認して、必要な変数を判別してください。 {ay}スクリプトで変数を使用する方法の詳細については、xref:client-configuration:autoinst-profiles#variables[変数]を参照してください。
ko: {suse}는 사용자 정의 파일의 시작점으로 사용할 수 있는 {ay} 설치 파일의 템플릿을 제공합니다. 이 템플릿은 [path]``AutoYast`` 디렉토리의 https://github.com/SUSE/manager-build-profiles[]에서 확인할 수 있습니다. 이러한 각 프로파일은 사용하기 전 일부 변수를 설정해야 합니다. 필요한 변수는 스크립트에 포함된 [path]``README`` 파일에서 확인합니다. {ay} 스크립트에서 변수 사용에 대한 자세한 설명은 xref:client-configuration:autoinst-profiles#variables[변수]를 참조하십시오.
zh_cn: {suse} 提供了 {ay} 安装文件模板，您可以基于它们创建自己的自定义文件。您可在 https://github.com/SUSE/manager-build-profiles 上的 [path]``AutoYast`` 目录中找到这些模板。使用前，需要为其中的每个配置文件设置一些变量。请参见脚本随附的 [path]``README`` 文件确定您需要的变量。有关在 {ay} 脚本中使用变量的详细信息，请参见xref:client-configuration:autoinst-profiles#variables[变量]。

source: Provided {ay} templates do not set any user password. Consider setting up root and other user accounts and passwords or other means of authentication. For more information about user accounts in the {ay} profiles, see https://doc.opensuse.org/projects/autoyast/#Configuration-Security-users-and-groups.
ca: Les plantilles {ay} proporcionades no defineixen cap contrasenya d'usuari. Penseu a configurar comptes d'usuari d'arrel i altres comptes d'usuari i contrasenyes o altres mitjans d'autenticació. Per obtenir més informació sobre els comptes d'usuari als perfils {ay}, consulteu https://doc.opensuse.org/projects/autoyast/#Configuration-Security-users-and-groups.

source: These are the most important sections in the {ay} installation file for installing with {productname}:
ca: Aquestes són les seccions més importants del fitxer d'instal·lació {ay} per instal·lar amb {productname}:
ja: {productname}でインストールするための{ay}インストールファイルで、最も重要なセクションを次に示します。
ko: 다음은 {productname}로 설치하기 위한 {ay} 설치 파일에서 가장 중요한 부분입니다.
zh_cn: 在 {ay} 安装文件中，用于通过 {productname} 安装的最重要的部分如下：

source: ``<add-on>`` allows to add child channels to the installation. For an example, see https://doc.opensuse.org/projects/autoyast/#Software-Selections-additional.
ca: to<add-on> to permet afegir canals fills a la instal·lació. Per exemple, vegeu https://doc.opensuse.org/projects/autoyast/.Software-Selections-additional.
