Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: The {sl-micro} is an ultra-reliable, lightweight operating system purpose built for edge computing. It leverages the enterprise hardened security and compliance components of SUSE Linux Enterprise and merges them with a modern, immutable, developer-friendly OS platform.
ja: {sl-micro}は、エッジコンピューティング向けに構築された、極めて信頼性が高く軽量なオペレーティングシステムです。SUSE Linux Enterpriseのエンタープライズレベルの強化されたセキュリティおよびコンプライアンスコンポーネントを活用し、最新の不変の開発者向けOSプラットフォームと統合します。
ko: {sl-micro}는 에지 컴퓨팅을 위해 특별히 제작된 매우 안정적인 경량 운영 체제입니다. 그리고 SUSE Linux Enterprise의 엔터프라이즈 강화 보안 및 규정 준수 구성 요소를 활용하며, 최신의 변경 불가능하고 개발자 친화적인 OS 플랫폼과 병합합니다.
zh_cn: {sl-micro} 是一个超级可靠的轻量级操作系统，专为边缘计算而构建。它利用了 SUSE Linux Enterprise 的企业强化安全性和合规组件，并将它们整合到一个对开发人员友好的现代化、不可变操作系统平台。

source: The {sl-micro} uses transactional updates. Transactional updates are atomic (all updates are applied only if all updates succeed) and support rollbacks. They do not affect a running system as no changes are activated until after the system is rebooted. This information is displayed in the menu:Systems[Details > Overview] subtab.
ja: {sl-micro}はトランザクション更新を使用します。トランザクション更新はアトミックであり(すべての更新はすべての更新が成功した場合にのみ適用されます)、ロールバックをサポートします。システムが再起動されるまで変更はアクティブ化されないため、実行中のシステムには影響しません。この情報は、menu:システム[詳細 > 概要]サブタブに表示されます。
ko: {sl-micro}는 트랜잭션 업데이트를 사용합니다. 트랜잭션 업데이트는 원자적(모든 업데이트가 성공한 경우에만 모든 업데이트가 적용됨)이며 롤백을 지원합니다. 시스템이 재부팅될 때까지 변경 사항이 적용되지 않으므로 실행 중인 시스템에 영향을 주지 않습니다. 이와 관련된 정보는 menu:Systems[세부 정보 > 개요] 하위 탭에 표시됩니다.
zh_cn: {sl-micro} 使用事务更新。事务更新是原子更新（仅当所有更新都成功时，才应用所有更新）且支持回滚。它们不会影响正在运行的系统，因为在系统重引导之前，任何更改都不会生效。此信息显示在menu:系统[细节 > 概览]子选项卡中。

source: Before you register {sl-micro} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ja: {sl-micro}クライアントを{productname}サーバに登録する前に、必要なソフトウェアチャンネルを追加して同期する必要があります。
ko: {sl-micro} 클라이언트를 {productname} 서버에 등록하기 전에 필요한 소프트웨어 채널을 추가하고 이 채널을 동기화해야 합니다.
zh_cn: 将 {sl-micro} 客户端注册到您的 {productname} 服务器之前，您需要添加所需的软件通道，并同步这些通道。

source: SL Micro Products - WebUI
ja: SL Micro製品 - WebUI
ko: SL Micro 제품 - WebUI
zh_cn: SL Micro 产品 - WebUI

source: SL Micro Products - CLI
ja: SL Micro製品 - CLI
ko: SL Micro 제품 - CLI
zh_cn: SL Micro 产品 - CLI

source: Registering {ubuntu} 20.04 and 22.04 Clients
ja: {ubuntu} 20.04および22.04 クライアントの登録
ko: {ubuntu} 20.04 및 22.04 클라이언트 등록
zh_cn: 注册 {ubuntu} 20.04 和 22.04 客户端

source: {ubuntu} 20.04 and 22.04 repository URLs are available from {scc}
ja: {ubuntu} 20.04および22.04リポジトリのURLは{scc}で使用できます。
ko: {ubuntu} 20.04 및 22.04 리포지토리 URL은 {scc}에서 사용할 수 있습니다.
zh_cn: {ubuntu} 20.04 和 22.04 储存库 URL 可从 {scc} 获取

source: Packages and metadata are provided by Ubuntu, not by {suse}
ja: パッケージおよびメタデータは{suse}ではなくUbuntuから提供されます。
ko: 패키지 및 메타데이터는 {suse}가 아닌 Ubuntu에서 제공합니다.
zh_cn: 软件包和元数据由 Ubuntu 而不是 {suse} 提供

source: This issue happens with self-installed versions of {ubuntu}. If the default user has been granted administrative privileges during installation time, a password is requiered to perform privilege escalation using [command]``sudo``. With cloud instances this does not happen because [command]``cloud-init`` automatically creates a file under [path]``/etc/sudoers.d`` and grants privilege escalation through [command]``sudo`` without the need for a password.
ja: この問題は、自己インストールされたバージョンの{ubuntu}で発生します。 インストール時にデフォルトのユーザが管理特権を付与されている場合、[command]``sudo``を使用して特権エスカレーションを実行するにはパスワードが必要です。 クラウドインスタンスでは、[command]``cloud-init``が[path]``/etc/sudoers.d``の下にファイルを自動的に作成し、パスワードを必要とせずに[command]``sudo``を介して特権エスカレーションを付与するため、この問題は発生しません。
ko: 이 문제는 {ubuntu}의 자체 설치 버전에서 발생합니다. 설치 중에 기본 사용자에게 관리자 권한이 부여된 경우 [command]``sudo``를 사용하여 권한 에스컬레이션을 수행하려면 비밀번호가 필요합니다. 클라우드 인스턴스에서는 이런 일이 발생하지 않습니다. 왜냐하면 [command]``cloud-init``는 [path]``/etc/sudoers.d`` 아래에 자동으로 파일을 생성하고 비밀번호를 사용할 필요 없이 [command]``sudo``를 사용하여 권한 에스컬레이션을 부여하기 때문입니다.
zh_cn: 自行安装版 {ubuntu} 会发生此问题。如果在安装期间为默认用户授予了管理权限，则需要使用 [command]``sudo`` 提供口令来进行权限升级。云实例不会出现此问题，因为 [command]``cloud-init`` 会自动在 [path]``/etc/sudoers.d`` 下创建一个文件，并且无需口令即可通过 [command]``sudo`` 进行权限升级。

source: For more information about installing {productname}, see xref:installation-and-upgrade:install-uyuni.adoc[].
ja: {productname}のインストールの詳細については、xref:installation-and-upgrade:install-uyuni.adoc[]を参照してください。
ko: {productname} 설치에 대한 자세한 정보는 xref:installation-and-upgrade:install-uyuni.adoc[]에서 참조하십시오.
zh_cn: 有关安装 {productname} 的详细信息，请参见 xref:installation-and-upgrade:install-uyuni.adoc[]。

source: For more information about setting up {productname}, see xref:installation-and-upgrade:uyuni-server-setup.adoc[].
ja: {productname}のセットアップの詳細については、xref:installation-and-upgrade:uyuni-server-setup.adoc[]を参照してください。
ko: {productname} 설정에 대한 자세한 정보는 xref:installation-and-upgrade:uyuni-server-setup.adoc[]에서 참조하십시오.
zh_cn: 有关设置 {productname} 的详细信息，请参见 xref:installation-and-upgrade:uyuni-server-setup.adoc[]。

source: Client Registration with Salt Bundle as a Minion
ja: Salt Bundleを使用してクライアントをMinionとして登録する
ko: Salt Bundle을 Minion으로 클라이언트 등록
zh_cn: 使用 Salt 捆绑包将客户端注册为受控端

source: Procedure: Switching with [literal]``util.mgr_switch_to_venv_minion`` state to [package]``venv-salt-minion``
ja: プロシージャ: [literal]``util.mgr_switch_to_venv_minion``を使用して状態を[package]``venv-salt-minion``に切り替える
ko: 절차: [literal]``util.mgr_switch_to_venv_minion`` 상태를 [package]``venv-salt-minion``으로 전환
zh_cn: 过程：使用 [literal]``util.mgr_switch_to_venv_minion`` 状态切换到 [package]``venv-salt-minion``

source: In case of running the second step of switching with skipping the first step, state apply process could fail as it requires stopping the [systemitem]``salt-minion`` which is used to execute the command on the client side.
ja: 切り替えの最初の手順をスキップして2番目の手順を実行すると、クライアント側でコマンドを実行するために使用される[systemitem]``salt-minion``を停止する必要があるため、状態適用プロセスは失敗する可能性があります。
ko: 첫 번째 단계를 건너뛰고 두 번째 전환 단계를 실행하는 경우 클라이언트 측에서 명령을 실행하기 위해 사용되는 [systemitem]``salt-minion``을 중지해야 하므로 상태 적용 프로세스가 실패할 수 있습니다.
zh_cn: 如果切换过程中跳过第一步来运行第二步，状态应用过程可能会失败，因为此过程需要停止用于在客户端执行命令的 [systemitem]``salt-minion``。

source: On the other hand, it is also possible to avoid installing the Salt Bundle and keep using [package]``salt-minion`` instead. In this case, specify one of these options:
ja: 他方、Salt Bundleのインストールを回避して代わりに[package]``salt-minion``の使用を続けることも可能です。 この場合、次のいずれかのオプションを指定します。
ko: 반면에 Salt Bundle을 설치하지 않고 대신 [package]``salt-minion``을 계속 사용하는 것도 가능합니다. 이 경우 다음 옵션 중 하나를 지정:
zh_cn: 反过来，您也可以不安装 Salt 捆绑包，而是继续使用 [package]``salt-minion``。在此情况下，请指定以下其中一个选项：

source: For bootstrap state set the [literal]``mgr_avoid_venv_salt_minion`` pillar to [literal]``True``.
ja: ブートストラップ状態の場合、[literal]``mgr_avoid_venv_salt_minion`` pillarを[literal]``True``に設定します。
ko: 부트스트랩 상태에 대하여 [literal]``mgr_avoid_venv_salt_minion`` 열을 [literal]``True``로 설정합니다.
zh_cn: 对于引导状态，将 [literal]``mgr_avoid_venv_salt_minion`` pillar 设为 [literal]``True``。

source: Extend Salt Bundle with Python packages using pip
ja: pipを使用したPythonパッケージによるSalt Bundleの拡張
ko: pip를 사용하여 Python 패키지와 함께 Salt Bundle 확장
zh_cn: 使用 pip 通过 Python 软件包扩展 Salt 捆绑包

source: On the {productname} Server, in the [path]``/etc/rhn/rhn.conf`` configuration file, add or amend this line to include the unprivileged username:
ja: {productname}サーバの[path]``/etc/rhn/rhn.conf``設定ファイルで、次の行を追加または修正して、非特権ユーザ名を含めます。
ko: {productname} 서버의 [path]``/etc/rhn/rhn.conf`` 구성 파일에서 다음과 같은 줄을 추가하거나 수정하여 권한이 없는 사용자 이름을 포함합니다.
zh_cn: 在 {productname} 服务器上，于 [path]``/etc/rhn/rhn.conf`` 配置文件中添加或修改下面一行以包含非特权用户名：

source: `default` (pull)
ko: `default`(풀)

source: For more information
ja: 詳細情報
ko: 자세한 내용은
zh_cn: 更多信息

source: About Salt SSH in general, see xref:specialized-guides:salt/salt-ssh.adoc[] and https://docs.saltstack.com/en/latest/topics/ssh/.
ja: Salt SSH全般については、xref:specialized-guides:salt/salt-ssh.adoc[]およびlink:https://docs.saltstack.com/en/latest/topics/ssh/[]を参照してください。
ko: 일반적인 Salt SSH와 관련하여 xref:specialized-guides:salt/salt-ssh.adoc[] 및 https://docs.saltstack.com/en/latest/topics/ssh[]에서 확인할 수 있습니다.
zh_cn: 有关 Salt SSH 的一般信息，请参见 xref:specialized-guides:salt/salt-ssh.adoc[] 和 https://docs.saltstack.com/en/latest/topics/ssh/[]。

source: About SSH key rotation, see xref:specialized-guides:salt/salt-ssh.adoc#salt.ssh.key_rotation[].
ja: SSHキーのローテーションについては、xref:specialized-guides:salt/salt-ssh.adoc#salt.ssh.key_rotation[]を参照してください。
ko: SSH 키 순환에 대한 내용은 xref:specialized-guides:salt/salt-ssh.adoc#salt.ssh.key_rotation[]에서 확인할 수 있습니다.
zh_cn: 有关 SSH 密钥轮替的信息，请参见 xref:specialized-guides:salt/salt-ssh.adoc#salt.ssh.key_rotation[]。

source: Procedure: Deleting a Client
ja: プロシージャ: クライアントの削除
ko: 절차: 클라이언트 삭제
zh_cn: 过程：删除客户端

source: For Salt clients, {productname} attempts to clean up additional configuration. If the client cannot be contacted, you are given the option to cancel the deletion, or delete the client without cleaning up the configuration files.
ja: Saltクライアントの場合、{productname}は、追加の設定をクリーンアップしようとします。 クライアントに接続できない場合、削除をキャンセルするオプションや、設定ファイルをクリーンアップせずにクライアントを削除するオプションがあります。
ko: Salt 클라이언트의 경우 {productname}는 추가 구성을 정리하려 합니다. 클라이언트에 연결할 수 없는 경우 삭제를 취소하거나 구성 파일을 정리하지 않고 클라이언트를 삭제할 수 있는 옵션이 제공됩니다.
zh_cn: 对于 Salt 客户端，{productname} 会尝试清理其他配置。如果无法联系客户端，您可以选择取消删除，或者仅删除客户端而不清理配置文件。

source: Procedure: Deleting a Client from the Server
ja: プロシージャ: サーバからのクライアントの削除
ko: 절차: 서버에서 클라이언트 삭제
zh_cn: 过程：从服务器上删除客户端

source: Delete a Client from the Command Line
ja: コマンドラインからのクライアントの削除
ko: 명령 줄에서 클라이언트 삭제
zh_cn: 从命令行删除客户端

source: Procedure: Salt Bundle Client - Manual Registration Cleanup
ja: プロシージャ: Salt Bundleクライアント - 手動登録のクリーンアップ
ko: 절차: Salt 번들 클라이언트 - 수동 등록 정리
zh_cn: 过程：Salt 捆绑包客户端 - 手动进行注册清理

source: Verify Packages
ja: パッケージの検証
ko: 패키지 검증
zh_cn: 校验软件包

source: You can check that packages you have installed on a client match the current state of the database they were installed from. The metadata of the installed package is compared to information in the database, including the file checksum, file size, permissions, owner, group, and type.
ja: クライアントにインストールしたパッケージがインストール元のデータベースの現在の状態と一致していることを確認できます。 インストールしたパッケージのメタデータが、ファイルのチェックサム、ファイルサイズ、パーミッション、オーナー、グループ、タイプなど、データベースの情報と比較されます。
ko: 클라이언트에 설치한 패키지가 설치가 시작된 곳인 데이터베이스의 현재 상태와 일치해야 합니다. 설치한 패키지의 메타데이터는 파일 체크섬, 파일 크기, 권한, 소유자, 그룹, 유형 등 데이터베이스 내 정보와 비교됩니다.
zh_cn: 您可以检查客户端上安装的软件包是否与作为其安装源的数据库的当前状态匹配。系统会对安装的软件包的元数据与数据库中的信息（包括文件校验和、文件大小、权限、拥有者、组和类型）进行比较。

source: Procedure: Verifying Installed Packages
ja: プロシージャ: インストールしたパッケージの検証
ko: 절차: 설치한 패키지 검증
zh_cn: 过程：校验安装的软件包

source: In the {productname} {webui}, navigate to [guimenu]``Systems``, click the client the package is installed on, and navigate to the menu:Systems[Software > Packages > Verify] subtab.
ja: {productname}の{webui}で、［[guimenu]``システム``］に移動し、パッケージをインストールしたクライアントをクリックし、menu:システム[ソフトウェア > パッケージ > 検証]サブタブに移動します。
ko: {productname} {webui}에서 [guimenu]``시스템``으로 이동하여 패키지가 설치된 클라이언트를 클릭하고 menu:시스템[소프트웨어 > 패키지 > 검증] 하위 탭으로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到[guimenu]``系统``，单击安装了软件包的客户端，然后导航到menu:系统[软件 > 软件包 > 校验]子选项卡。

source: Select the packages you want to verify and click btn:[Verify Selected Packages].
ja: 検証するパッケージを選択し、btn:[選択したパッケージの検証]をクリックします。
ko: 검증하려는 패키지를 선택하고 btn:[선택한 패키지 검증]을 클릭합니다.
zh_cn: 选择要校验的软件包，然后单击 btn:[校验所选软件包]。

source: When the verification is complete, navigate to menu:Systems[Events > History] to see the results.
ja: 検証を完了したら、menu:システム[イベント > 履歴]に移動し、結果を表示します。
ko: 검증이 완료되면 menu:시스템[이벤트 > 이력]으로 이동하여 결과를 확인합니다.
zh_cn: 校验完成后，导航到menu:系统[事件 > 历史记录]查看结果。

source: Compare Packages
ja: パッケージの比較
ko: 패키지 비교
zh_cn: 比较软件包

source: For Redfish, ensure you can establish a valid SSL connection between the client and the {productname} Server. You must have trusted the certificate authority used to sign the SSL Server Certificate of the Redfish management controller. The CA certificate must be in ``.pem`` format, and stored on the {productname} Server at [path]``/etc/pki/trust/anchors/``. When you have saved the certificate, run [command]``update-ca-certificate``.
ko: Redfish의 경우 클라이언트와 {productname} 서버 간의 타당한 SSL 연결을 설정할 수 있는지 확인하십시오. 사용자는 Redfish 관리 컨트롤러의 SSL 서버 인증서에 서명하는 데 사용되는 인증 주체를 신뢰했어야 합니다. CA 인증서는 ``.pem`` 형식이어야 하며 {productname} 서버의 [path]``/etc/pki/trust/anchors/``에 저장됩니다. 인증서 저장을 완료했으면 [command]``update-ca-certificate``을 실행하십시오.
zh_cn: 对于 Redfish，请确保您可以在客户端和 {productname} 服务器之间建立有效的 SSL 连接。您必须信任用于对 Redfish 管理控制器的 SSL 服务器证书签名的证书颁发机构。CA 证书必须为 ``.pem`` 格式，并存储在 {productname} 服务器上的 [path]``/etc/pki/trust/anchors/`` 中。保存证书后，请运行 [command]``update-ca-certificate``。

source: GPG Keys and Uyuni Client Tools
ja: GPGキーおよびUyuniクライアントツール
ko: GPG 키 및 Uyuni 클라이언트 도구
zh_cn: GPG 密钥和 Uyuni 客户端工具

source: Procedure: Creating a Bootstrap Script
ja: プロシージャ: ブートストラップスクリプトの作成
ko: 절차: 부트스트랩 스크립트 생성
zh_cn: 过程：创建引导脚本

source: Procedure: Modifying a Bootstrap Script
ja: プロシージャ: ブートストラップスクリプトの変更
ko: 절차: 부트스트랩 스크립트 수정
zh_cn: 过程：修改引导脚本

source: Procedure: Running the Bootstrap Script
ja: プロシージャ: ブートストラップスクリプトの実行
ko: 절차: 부트스트랩 스크립트 실행
zh_cn: 过程：运行引导脚本

source: In most cases, Salt clients are registered accurately with the default bootstrap methods. However, you can use Salt to register the client to the {productname} Server manually by editing the Salt minion file on the client, and providing the fully qualified domain name (FQDN) of the server. This method uses ports 4505 and 4506 inbound to the server. This method requires no configuration on the {productname} Server aside from ensuring that these ports are open.
ja: ほとんどの場合、Saltクライアントは、デフォルトのブートストラップメソッドで正確に登録されます。 ただし、Saltを使用してクライアントを{productname}サーバに手動で登録できます。そのためには、クライアントでSalt Minionファイルを編集し、サーバの完全修飾ドメイン名(FQDN)を指定します。 このメソッドは、サーバで受信するポート4505および4506を使用します。 このメソッドでは{productname}サーバの設定は不要です。ただし、上記のポートを開いている必要があります。
ko: 대부분의 경우 Salt 클라이언트는 기본 부트스트랩 방법으로 정확히 등록됩니다. 하지만 Salt를 사용하면 클라이언트의 Salt Minion 파일을 편집하고 서버의 전체 도메인 이름(FQDN)을 제공하여 수동으로 {productname} 서버에 클라이언트를 등록할 수 있습니다. 이 방법에서는 서버에 대한 4505 및 4506 인바운드 포트가 사용됩니다. 이 방법은 해당 포트가 열려 있는지 확인하는 것 외에 {productname} 서버에서 구성할 필요가 없습니다.
zh_cn: 在大多数情况下，使用默认的引导方法即可正确注册 Salt 客户端。不过，您也可以在客户端上编辑 Salt 受控端文件，并提供服务器的完全限定域名 (FQDN)，使用 Salt 手动将客户端注册到 {productname} 服务器。此方法使用传入服务器的端口 4505 和 4506 来进行。除了需确保这些端口处于打开状态之外，此方法无需在 {productname} 服务器上进行任何配置。

source: This procedure requires that you have installed the [package]``venv-salt-minion`` (Salt bundle) or the [package]``salt-minion`` package on the Salt client before registration. Both use configuration files in different locations and filenames remain the same. The systemd service filename is different.
ja: このプロシージャでは、登録する前に[package]``venv-salt-minion`` (Salt bundle)または[package]``salt-minion``パッケージをSaltクライアントにインストール済みである必要があります。 両方ともさまざまな場所で設定ファイルを使用しますが、ファイル名は同じままです。 systemdサービスファイル名は異なります。
ko: 이 절차를 수행하려면 Salt 클라이언트에 [package]``venv-salt-minion`` (Salt 번들) 또는 [package]``salt-minion`` 패키지를 설치한 후 등록해야 합니다. 둘 다 다른 위치에서 구성 파일을 사용하며 파일 이름은 동일하게 유지됩니다. systemd 서비스 파일 이름이 다릅니다.
zh_cn: 要执行此过程，您需要在注册前于 Salt 客户端上安装 [package]``venv-salt-minion``（Salt 捆绑包）或 [package]``salt-minion`` 软件包。两种安装会使用位于不同位置但文件名相同的配置文件。systemd 服务文件名不同。

source: For more information about the Salt minion configuration file, see https://docs.saltstack.com/en/latest/ref/configuration/minion.html.
ja: Salt minion設定ファイルの詳細については、link:https://docs.saltstack.com/en/latest/ref/configuration/minion.html[]を参照してください。
ko: Salt 미니언 구성 파일에 대한 자세한 내용은 https://docs.saltstack.com/en/latest/ref/configuration/minion.html[]을 참조하십시오.
zh_cn: 有关 Salt 受控端配置文件的详细信息，请参见 https://docs.saltstack.com/en/latest/ref/configuration/minion.html[]。

source: Register Clients with the {webui}
ja: {webui}でクライアントを登録する
ko: {webui}로 클라이언트 등록
zh_cn: 使用 {webui} 注册客户端

source: As Salt Bundle is shipped with the bootstrap repository, the repository must be created before starting the bootstrap process for the client. A shell script detects the operating system on the client and deploys the Salt Bundle from the appropriate bootstrap repository, using the same logic as the bootstrap script. For more information, see xref:client-configuration:bootstrap-repository.adoc#_prepare_to_create_a_bootstrap_repository[Prepare to Create a Bootstrap Repository].
ja: Salt Bundleはブートストラップリポジトリーに付属しているため、クライアントでブートストラッププロセスを開始する前にリポジトリーを作成する必要があります。 シェルスクリプトは、クライアントのオペレーティングシステムを検出し、適切なブートストラップリポジトリーからSalt Bundleを配備し、ブートストラップスクリプトと同じロジックを使用します。 詳細については、xref:client-configuration:bootstrap-repository.adoc#_prepare_to_create_a_bootstrap_repository[ブートストラップリポジトリーの作成準備]を参照してください。
ko: Salt Bundle은 부트스트랩 리포지토리와 함께 제공되므로 리포지토리를 생성한 후 클라이언트의 부트스트랩 프로세스를 시작해야 합니다. 셸 스크립트가 클라이언트에서 운영 체제를 감지하고 부트스트랩 스크립트와 동일한 논리를 사용하여 적절한 부트스트랩 리포지토리로부터 Salt Bundle을 배포합니다. 자세한 내용은 xref:client-configuration:bootstrap-repository.adoc#_prepare_to_create_a_bootstrap_repository[부트스트랩 리포지토리 생성 준비]를 참조하십시오.
zh_cn: 由于 Salt 捆绑包通过引导储存库提供，因此在启动客户端的引导过程前，必须创建该储存库。外壳脚本会使用与引导脚本相同的逻辑检测客户端上的操作系统，并部署来自适当引导储存库的 Salt 捆绑包。有关详细信息，请参见xref:client-configuration:bootstrap-repository.adoc#_prepare_to_create_a_bootstrap_repository[准备创建引导储存库]。

source: Procedure: Registering Clients with the {webui}
ja: プロシージャ: {webui}でクライアントを登録する
ko: 절차: {webui}로 클라이언트 등록
zh_cn: 过程：使用 {webui} 注册客户端

source: To bootstrap the client with SSH, in the [guimenu]``Authentication`` field, check [guimenu]``SSH Private Key``, and upload the SSH private key to use to log in to the client.
ko: SSH로 클라이언트를 부트스트래핑하려면 [guimenu]``인증`` 필드에서 [guimenu]``SSH 개인 키``를 확인하고 클라이언트에 로그인할 때 사용할 SSH 개인 키를 업로드하십시오.
zh_cn: 要使用 SSH 引导客户端，请在[guimenu]``身份验证``字段中选中 [guimenu]``SSH 私用密钥``，并上载用于登录客户端的 SSH 私用密钥。

source: At the command prompt on the {productname} Server, as root, use the [command]``spacewalk-common-channels`` command to add the appropriate channels:
ja: {productname} サーバのコマンドプロンプトで root になり、 [command]``spacewalk-common-channels`` コマンドを特定のチャンネルに対して実行します:
ko: {productname} 서버의 명령 프롬프트에서 루트로 [command]``spacewalk-common-channels`` 명령을 사용하여 적절한 채널을 추가합니다.
zh_cn: 在 {productname} 服务器上的命令提示符下，以 root 身份使用 [command]``spacewalk-common-channels`` 命令添加相应的通道：

source: Synchronize the channels:
ja: チャンネルの同期:
ko: 채널을 다음과 같이 동기화합니다.
zh_cn: 同步通道：

source: At the command prompt on the {productname} Server, as root, use the [command]``spacewalk-common-channels`` command to add the appropriate channels. Ensure you specify the correct architecture:
ja: {productname} サーバのコマンドプロンプトで root になり、 [command]``spacewalk-common-channels`` コマンドを特定のチャンネルに対して実行します。このとき、正しいアーキテクチャを指定してください:
ko: {productname} 서버의 명령 프롬프트에서 root 권한으로 [command]``spacewalk-common-channels`` 명령을 사용해 적절한 채널을 추가합니다. 다음과 같이 올바른 아키텍처를 지정했는지 확인합니다.
zh_cn: 在 {productname} 服务器上的命令提示符处，以 root 身份使用 [command]``spacewalk-common-channels`` 命令添加相应的通道。请确保指定正确的体系结构：

source: At the command prompt on the {productname} Server, as root, use the [command]``mgr-sync`` command to add the appropriate channels:
ja: {productname} サーバのコマンドプロンプトで root になり、 [command]``mgr-sync`` コマンドを特定のチャンネルに対して実行します:
ko: {productname} 서버의 명령 프롬프트에서 root 권한으로 다음과 같이 [command]``mgr-sync`` 명령을 사용해 적절한 채널을 추가합니다.
zh_cn: 在 {productname} 服务器上的命令提示符处，以 root 身份使用 [command]``mgr-sync`` 命令添加相应的通道：

source: Procedure: Checking Synchronization Progress from the Command Prompt
ja: プロシージャ: コマンドプロンプトから同期の進捗状況を確認する
ko: 절차: 명령 프롬프트에서 동기화 진행 상태 확인
zh_cn: 过程：在命令提示符处检查同步进度

source: At the command prompt on the {productname} Server, as root, use the [command]``tail`` command to check the synchronization log file:
ja: {productname}サーバのコマンドプロンプトで、rootとして、[command]``tail``コマンドを使用して同期ログファイルを確認します。
ko: {productname} 서버의 명령 프롬프트에서 루트 권한으로 다음과 같이 [command]``tail`` 명령을 사용해 동기화 로그 파일을 확인합니다.
zh_cn: 在 {productname} 服务器上的命令提示符处，以 root 身份使用 [command]``tail`` 命令检查同步日志文件：

source: Each child channel generates its own log during the synchronization progress.
ja: それぞれの子チャンネルは、同期の進捗中にそれぞれのログを生成します。
ko: 각 하위 채널은 동기화가 진행되는 동안 자체 로그를 생성합니다.
zh_cn: 每个子通道在同步过程中都会生成自己的日志。

source: You need to check all the base and child channel log files to be sure that the synchronization is complete.
ja: 同期が完了したことを確認するには、ベースチャンネルと子チャンネルのログファイルをすべて確認する必要があります。
ko: 동기화가 완료되었는지 알아보려면 모든 기본 및 하위 채널 로그 파일을 확인해야 합니다.
zh_cn: 您需要检查所有基础通道和子通道日志文件，以确保同步已完成。

source: Procedure: Checking Synchronization Progress from the {webui}
ja: 手順: {webui}からの同期の進捗状況の確認
ko: 절차: {webui}에서 동기화 진행 상태 확인
zh_cn: 过程：在 {webui} 中检查同步进度

source: Procedure: Checking Synchronization Progress from the {webui}
ja: プロシージャ: {webui}から同期の進捗状況を確認する
ko: 절차: {webui}에서 동기화 진행 상태 확인
zh_cn: 过程：在 {webui} 中检查同步进度

source: To register your clients, you need a bootstrap repository. By default, bootstrap repositories are automatically created, and regenerated daily for all synchronized products. You can manually create the bootstrap repository from the command prompt, using this command:
ja: クライアントを登録するには、ブートストラップリポジトリが必要です。 デフォルトでは、ブートストラップリポジトリは自動的に作成され、すべての同期製品に対して毎日再生成されます。 次のコマンドを使用して、コマンドプロンプトからブートストラップリポジトリを手動で作成できます。
ko: 클라이언트를 등록하려면 부트스트랩 리포지토리가 필요합니다. 기본적으로 부트스트랩 리포지토리는 자동으로 생성되며 동기화된 모든 제품에 대해 매일 재생성됩니다. 명령 프롬프트에서 다음 명령을 사용해 부트스트랩 리포지토리를 수동으로 생성할 수 있습니다.
zh_cn: 要注册您的客户端，需要有引导储存库。默认会自动创建引导储存库，并且每天会为所有同步的产品重新生成该储存库。您可以在命令提示符处使用以下命令手动创建引导储存库：

source: User defined GPG keys
ja: ユーザ定義のGPGキー
ko: 사용자 정의 GPG 키
zh_cn: 用户定义的 GPG 密钥

source: Supported Features on {micro} Operating Systems
ja: {micro}オペレーティングシステムでサポートされている機能
ko: {micro} 운영 체제에서 지원하는 기능
zh_cn: {micro} 操作系统上支持的功能

source: The operating system you run on a client is supported by the organization that supplies the operating system. {micro} is supported by {suse}.
ja: クライアントで実行しているオペレーティングシステムは、オペレーティングシステムを提供している組織によってサポートされています。 {micro} は{suse}でサポートされています。
ko: 클라이언트에서 실행하는 운영 체제는 운영 체제를 제공하는 조직이 지원합니다. {suse}는 {micro}를 지원합니다.
zh_cn: 客户端上运行的操作系统由提供操作系统的组织支持。{micro} 由 {suse} 支持。

source: {micro} is only supported as regular minion ([systemitem]``default`` contact method) for the time being. We are working on managing it as Salt SSH client ([systemitem]``salt-ssh`` contact method), too.
ja: 現時点では、{micro}は正規のミニオンとして([systemitem]``デフォルト``接続メソッド)のみサポートされています。Salt SSHクライアント([systemitem]``salt-ssh``接続メソッド)として管理できるように目指しています。
ko: {micro}는 당분간 일반 미니언([systemitem]``기본`` 연락 방법)으로만 지원됩니다. Salt SSH 클라이언트([systemitem]``salt-ssh`` 연락 방법)로도 관리하는 작업을 진행하고 있습니다.
zh_cn: 目前，{micro} 仅支持作为常规的受控端（[systemitem]``默认``联系方法）。我们正在努力实现也将其作为 Salt SSH 客户端（[systemitem]``salt-ssh`` 联系方法）的功能。

source: {star}{star} On {micro}, only the Node exporter and the Blackbox exporter are available.
ko: {star}{star} {micro}의, 노드 엑스포트 및 블랙박스 엑스포트만 사용할 수 있습니다.
zh_cn: {star}{star} 在 {micro} 上，只能使用 Node Exporter 和 Blackbox Exporter。

source: This table lists the availability of various features on {suse} and {opensuse} clients. This table covers all variants of the {sle} operating system, including {slsa}, {sleda}, {sles} for SAP, and {sles} for HPC.
ja: この表には、{suse}および{opensuse}クライアントのさまざまな機能の使用可否がリストされています。 この表では、{slsa}、{sleda}、{sles} for SAP、{sles} for HPCなど、{sle}オペレーティングシステムのすべての亜種について記載しています。
ko: 아래 표는 {suse} 및 {opensuse} 클라이언트에서 다양한 기능의 사용 가능 여부를 정리한 것입니다. 이 표에서는 SAP용 {slsa}, {sleda}, {sles} 및 HPC용 {sles}를 포함한 {sle} 운영 체제의 모든 변형에 대해 설명합니다.
zh_cn: 下表列出了 {suse} 和 {opensuse} 客户端上各种功能的可用性。该表涵盖了 {sle} 操作系统的所有变体，包括 {slsa}、{sleda}、{sles} for SAP 和 {sles} for HPC。

source: The operating system you run on a client is supported by the organization that supplies the operating system. {sle} is supported by {suse}. {opensuse} is supported by the {suse} community.
ja: クライアントで実行しているオペレーティングシステムは、オペレーティングシステムを提供している組織によってサポートされています。 {sle}は{suse}でサポートされています。 {opensuse}は{suse}コミュニティでサポートされています。
ko: 클라이언트에서 실행하는 운영 체제는 운영 체제를 제공하는 조직이 지원합니다. {sle}는 {suse}가 지원합니다. {opensuse}는 {suse} 커뮤니티가 지원합니다.
zh_cn: 客户端上运行的操作系统由提供操作系统的组织支持。{sle} 由 {suse} 支持。{opensuse} 由 {suse} 社区支持。

source: Supported Features on {suse} and {opensuse} Operating Systems
ja: {suse}および{opensuse}オペレーティングシステムでサポートされている機能
ko: {suse} 및 {opensuse} 운영 체제에서 지원하는 기능
zh_cn: {suse} 和 {opensuse} 操作系统上支持的功能
