Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: | Feature | {rhela}{nbsp}7 | {rhela}{nbsp}8 | {rhela}{nbsp}9 | Client | {check} | {check} | {check} | System packages | {redhat} | {redhat} | {redhat} | Registration | {check} | {check} | {check} | Install packages | {check} | {check} | {check} | Apply patches | {check} | {check} | {check} | Remote commands | {check} | {check} | {check} | System package states | {check} | {check} | {check} | System custom states | {check} | {check} | {check} | Group custom states | {check} | {check} | {check} | Organization custom states | {check} | {check} | {check} | System set manager (SSM) | {check} | {check} | {check} | Product migration | N/A | N/A | N/A | Basic Virtual Guest Management {star} | {check} | {check} | {check} | Advanced Virtual Guest Management {star} | {check} | {check} | {check} | Virtual Guest Installation (Kickstart), as Host OS | {cross} | {cross} | {cross} | Virtual Guest Installation (image template), as Host OS | {check} | {check} | {check} | System deployment (PXE/Kickstart) | {check} | {check} | {check} | System redeployment (Kickstart) | {check} | {check} | {check} | Contact methods | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | Works with {productname} Proxy | {check} | {check} | {check} | Action chains | {check} | {check} | {check} | Staging (pre-download of packages) | {check} | {check} | {check} | Duplicate package reporting | {check} | {check} | {check} | CVE auditing | {check} | {check} | {check} | SCAP auditing | {check} | {check} | {check} | Package verification | {cross} | {cross} | {cross} | Package locking | {check} | {check} | {check} | System locking | {cross} | {cross} | {cross} | Maintenance Windows | {check} | {check} | {check} | System snapshot | {cross} | {cross} | {cross} | Configuration file management | {check} | {check} | {check} | Snapshots and profiles | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | Power management | {check} | {check} | {check} | Monitoring server | {cross} | {cross} | {cross} | Monitored clients | {check} | {check} | {check} | Docker buildhost | {check} | {check} | {check} | Build Docker image with OS | {question} | {question} | {question} | Kiwi buildhost | {cross} | {cross} | {cross} | Build Kiwi image with OS | {cross} | {cross} | {cross} | Recurring Actions | {check} | {check} | {check} | AppStreams | N/A | {check} | {check} | Yomi | N/A | N/A | N/A
ca: Fe Característica {rhela}{nbsp}7 {rhela}{nbsp}8 {rhela}{nbsp}9 Client {check} {check} {check} Paquets del sistema {redhat} {redhat} {redhat} Inscripció {check} {check} {check} Instal·la paquets {check} {check} {check} es Aplica els pedaços {check} {check} {check} s Ordres remotes {check} {check} {check} Estats del paquet del sistema {check} {check} {check} Estats personalitzats del sistema {check} {check} {check} Agrupa estats personalitzats {check} {check} {check} Organització d'estats personalitzats {check} {check} {check} ) Gestor de conjunts de sistemes (SSM) {check} {check} {check} Migració de producte N/A N/A N/A Gestió bàsica de convidats virtual {star} {check} {check} {check} Gestió de convidats virtual avançada {star} {check} {check} {check} ), Instal·lació de convidat virtual (Kickstart), com a servidor {cross} {cross} {cross} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {check} {check} {check} ) Desplegament del sistema (PXE/Kickstart) {check} {check} {check} ) Redesplegament del sistema (Kickstart) {check} {check} {check} Mètodes de contacte , {check} ZeroMQ, Salt-SSH , {check} ZeroMQ, Salt-SSH , {check} ZeroMQ, Salt-SSH with Funciona amb el servidor intermediari {productname} {check} {check} {check} Cadenes d'acció {check} {check} {check} ) Estadificació (pre-descàrrega de paquets) {check} {check} {check} Informe de paquets duplicat {check} {check} {check} ing Auditoria CVE {check} {check} {check} ing Auditoria SCAP {check} {check} {check} Verificació de paquets {cross} {cross} {cross} ing Bloqueig de paquets {check} {check} {check} ing Bloqueig del sistema {cross} {cross} {cross} Finestres de manteniment {check} {check} {check} Instantània del sistema {cross} {cross} {cross} Gestió de fitxers de configuració {check} {check} {check} and Instantànies i perfils , {check} Perfils admesos, la sincronització no és compatible , {check} Perfils admesos, la sincronització no és compatible , {check} Perfils admesos, la sincronització no és compatible Gestió d'energia {check} {check} {check} Servidor de seguiment {cross} {cross} {cross} Clients monitoritzats {check} {check} {check} Constructor Docker {check} {check} {check} Construeix la imatge Docker amb el SO {question} {question} {question} Constructor de Kiwi {cross} {cross} {cross} Construeix la imatge de Kiwi amb el SO {cross} {cross} {cross} s Accions recurrents {check} {check} {check} s AppStreams N/A {check} {check} Yomi N/A N/A N/A

source: Supported {rocky} Features
ca: Característiques de {rocky} suportades
ja: サポートされている{rocky}の機能
ko: 지원하는 {rocky} 기능
zh_cn: 支持的 {rocky} 功能

source: This table lists the availability of various features on {rocky} clients.
ca: Aquesta taula llista la disponibilitat de diverses característiques en {rocky} clients.
ja: この表には、{rocky}クライアントのさまざまな機能の使用可否がリストされています。
ko: 아래 표는 {rocky} 클라이언트에서 다양한 기능의 사용 가능 여부를 정리한 것입니다.
zh_cn: 下表列出了 {rocky} 客户端上各种功能的可用性。

source: The operating system you run on a client is supported by the organization that supplies the operating system. {rocky} is supported by the {rocky} community.
ca: El sistema operatiu que executeu en un client és compatible amb l'organització que subministra el sistema operatiu. {rocky} és compatible amb la comunitat {rocky}.
ja: クライアントで実行しているオペレーティングシステムは、オペレーティングシステムを提供している組織によってサポートされています。 {rocky}は{rocky}コミュニティでサポートされています。
ko: 클라이언트에서 실행하는 운영 체제는 운영 체제를 제공하는 조직이 지원합니다. {rocky}는 {rocky} 커뮤니티가 지원합니다.
zh_cn: 客户端上运行的操作系统由提供操作系统的组织提供支持。{rocky} 由 {debian} 社区提供支持。

source: Supported Features on {rocky} Operating Systems
ca: Característiques suportades en sistemes operatius {rocky}
ja: {rocky}オペレーティングシステムでサポートされている機能
ko: {rocky} 운영 체제에서 지원하는 기능
zh_cn: {rocky} 操作系统上支持的功能

source: | Feature | {rocky}{nbsp}8 | {rocky}{nbsp}9 | Client | {check} (plain {rocky}) | {check} (plain {rocky}) | System packages | {rocky} Community | {rocky} Community | Registration | {check} | {check} | Install packages | {check} | {check} | Apply patches | {check} | {check} | Remote commands | {check} | {check} | System package states | {check} | {check} | System custom states | {check} | {check} | Group custom states | {check} | {check} | Organization custom states | {check} | {check} | System set manager (SSM) | {check} | {check} | Product migration {star} | {check} | {check} | Basic Virtual Guest Management {star}{star} | {check} | {check} | Advanced Virtual Guest Management {star}{star} | {check} | {check} | Virtual Guest Installation (Kickstart), as Host OS | {cross} | {cross} | Virtual Guest Installation (image template), as Host OS | {check} | {check} | System deployment (PXE/Kickstart) | {check} | {check} | System redeployment (Kickstart) | {check} | {check} | Contact methods | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | Works with {productname} Proxy | {check} | {check} | Action chains | {check} | {check} | Staging (pre-download of packages) | {check} | {check} | Duplicate package reporting | {check} | {check} | CVE auditing | {check} | {check} | SCAP auditing | {check} | {check} | Package verification | {cross} | {cross} | Package locking | {check} | {check} | System locking | {cross} | {cross} | Maintenance Windows | {check} | {check} | System snapshot | {cross} | {cross} | Configuration file management | {check} | {check} | Snapshots and profiles | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | Power management | {check} | {check} | Monitoring server | {cross} | {cross} | Monitored clients | {check} | {check} | Docker buildhost | {cross} | {cross} | Build Docker image with OS | {cross} | {cross} | Kiwi buildhost | {cross} | {cross} | Build Kiwi image with OS | {cross} | {cross} | Recurring Actions | {check} | {check} | AppStreams | {check} | {check} | Yomi | N/A | N/A
ca: Fe Característica {rocky}{nbsp}8 {rocky}{nbsp}9 Client ) {check} (plana {rocky}) ) {check} (plana {rocky}) Paquets del sistema Comunitat {rocky} Comunitat {rocky} Inscripció {check} {check} Instal·la paquets {check} {check} es Aplica els pedaços {check} {check} s Ordres remotes {check} {check} Estats del paquet del sistema {check} {check} Estats personalitzats del sistema {check} {check} Agrupa estats personalitzats {check} {check} Organització d'estats personalitzats {check} {check} ) Gestor de conjunts de sistemes (SSM) {check} {check} Migració de producte {star} {check} {check} Gestió bàsica de convidats virtual {star}{star} {check} {check} Gestió de convidats virtual avançada {star}{star} {check} {check} ), Instal·lació de convidat virtual (Kickstart), com a servidor {cross} {cross} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {check} {check} ) Desplegament del sistema (PXE/Kickstart) {check} {check} ) Redesplegament del sistema (Kickstart) {check} {check} Mètodes de contacte , {check} ZeroMQ, Salt-SSH , {check} ZeroMQ, Salt-SSH with Funciona amb el servidor intermediari {productname} {check} {check} Cadenes d'acció {check} {check} ) Estadificació (pre-descàrrega de paquets) {check} {check} Informe de paquets duplicat {check} {check} ing Auditoria CVE {check} {check} ing Auditoria SCAP {check} {check} Verificació de paquets {cross} {cross} ing Bloqueig de paquets {check} {check} ing Bloqueig del sistema {cross} {cross} Finestres de manteniment {check} {check} Instantània del sistema {cross} {cross} Gestió de fitxers de configuració {check} {check} and Instantànies i perfils , {check} Perfils admesos, la sincronització no és compatible , {check} Perfils admesos, la sincronització no és compatible Gestió d'energia {check} {check} Servidor de seguiment {cross} {cross} Clients monitoritzats {check} {check} Constructor Docker {cross} {cross} Construeix la imatge Docker amb el SO {cross} {cross} Constructor de Kiwi {cross} {cross} Construeix la imatge de Kiwi amb el SO {cross} {cross} s Accions recurrents {check} {check} s AppStreams {check} {check} Yomi N/A N/A

source: Supported {sl-micro} Client Features
ca: Clients i característiques compatibles
ja: サポートされている{sl-micro}クライアント機能
ko: 지원되는 {sl-micro} 클라이언트 기능
zh_cn: 支持的 {sl-micro} 客户端功能

source: The operating system you run on a client is supported by the organization that supplies the operating system. {sl-micro} is supported by {suse}.
ca: El sistema operatiu que executeu en un client és compatible amb l'organització que subministra el sistema operatiu. {rhel} és compatible amb {redhat}.
ja: クライアントで実行しているオペレーティングシステムは、オペレーティングシステムを提供している組織によってサポートされています。{sl-micro}は{suse}でサポートされています。
ko: 클라이언트에서 실행하는 운영 체제는 운영 체제를 제공하는 조직이 지원합니다. {suse}는 {sl-micro}를 지원합니다.
zh_cn: 客户端上运行的操作系统由提供操作系统的组织支持。{sl-micro} 由 {suse} 支持。

source: {sl-micro} is currently supported as a {salt} client with the [systemitem]``default`` contact method only.
ca: {sl-micro} està suportat actualment com a client {salt} amb el mètode de contacte [systemitem].default..
ja: {sl-micro}は、[systemitem]``デフォルト``接続メソッドのみの{salt}クライアントとして現在サポートされています。
ko: {sl-micro}는 현재 [systemitem]``기본`` 연락 방법으로만 {salt} 클라이언트로 지원됩니다.
zh_cn: 目前 {sl-micro} 仅支持作为使用[systemitem]``默认``联系方法的 {salt} 客户端。

source: Supported Features on {sl-micro} Operating Systems
ca: Característiques suportades en sistemes operatius {rocky}

source: | Feature | {sl-micro} | Client | {salt} | Operating system packages | {salt} | Registration | {salt} | Install packages | {salt} | Apply patches (requires CVE ID) | {salt} | Remote commands | {salt} | System package states | {salt} | System custom states | {salt} | Group custom states | {salt} | Organization custom states | {salt} | System set manager (SSM) | {salt} | Product migration | {salt} | Basic Virtual Guest Management {star} | {question} | Advanced Virtual Guest Management {star} | {question} | Virtual Guest Installation (Kickstart), as Host OS | {cross} | Virtual Guest Installation (image template), as Host OS | {question} | System deployment (PXE/Kickstart) | {question} | System redeployment (Kickstart) | {cross} | Contact methods | {salt}: ZeroMQ | Works with {productname} Proxy | {salt} | Action chains | {salt} | Staging (pre-download of packages) | {question} | Duplicate package reporting | {salt} | CVE auditing (requires CVE ID) | {salt} | SCAP auditing | {question} | Package verification | {question} | Package locking | {salt} | System locking | {question} | Maintenance Windows | {question} | System snapshot | {cross} | Configuration file management | {salt} | Snapshots and profiles | {salt}: Profiles supported, Sync not supported | Power management | {salt} | Monitoring server | {cross} | Monitored clients {star}{star} | {salt} | Docker buildhost | {cross} | Build Docker image with OS | {cross} | Kiwi buildhost | {cross} | Build Kiwi image with OS | {salt} | Recurring Actions | {salt} | AppStreams | N/A | Yomi | {question}
ca: Fe Característica {sl-micro} Client {salt} Paquets de sistema operatiu {salt} Inscripció {salt} Instal·la paquets {salt} ) Aplica els pedaços (requereix l'ID CVE) {salt} s Ordres remotes {salt} Estats del paquet del sistema {salt} Estats personalitzats del sistema {salt} Agrupa estats personalitzats {salt} Organització d'estats personalitzats {salt} ) Gestor de conjunts de sistemes (SSM) {salt} Migració de producte {salt} Gestió bàsica de convidats virtual {star} {question} Gestió de convidats virtual avançada {star} {question} ), Instal·lació de convidat virtual (Kickstart), com a servidor {cross} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {question} ) Desplegament del sistema (PXE/Kickstart) {question} ) Redesplegament del sistema (Kickstart) {cross} Mètodes de contacte : {salt}: ZeroMQ with Funciona amb el servidor intermediari {productname} {salt} Cadenes d'acció {salt} ) Estadificació (pre-descàrrega de paquets) {question} Informe de paquets duplicat {salt} audit auditoria CVE (requereix l'ID CVE) {salt} ing Auditoria SCAP {question} Verificació de paquets {question} ing Bloqueig de paquets {salt} ing Bloqueig del sistema {question} Finestres de manteniment {question} Instantània del sistema {cross} Gestió de fitxers de configuració {salt} and Instantànies i perfils , {salt}: Perfils admesos, la sincronització no és compatible Gestió d'energia {salt} Servidor de seguiment {cross} Clients supervisats {star}{star} {salt} Constructor Docker {cross} Construeix la imatge Docker amb el SO {cross} Constructor de Kiwi {cross} Construeix la imatge de Kiwi amb el SO {salt} s Accions recurrents {salt} s AppStreams N/A Yomi {question}

source: {star}{star} On {sl-micro}, only the Node exporter and the Blackbox exporter are available.
ca: {star}{star} A {sl-micro} només hi ha disponible l'exportador de Node i l'exportador de Blackbox.
ja: {star}{star} {sl-micro}では、Node exporterとBlackbox exporterのみが利用できます。
ko: {star}{star} {sl-micro}의, 노드 엑스포트 및 블랙박스 엑스포트만 사용할 수 있습니다.
zh_cn: {star}{star} 在 {sl-micro} 上，只能使用 Node Exporter 和 Blackbox Exporter。

source: Supported {sle-micro} Features
ca: Característiques de {rocky} suportades

source: The operating system you run on a client is supported by the organization that supplies the operating system. {sle-micro} is supported by {suse}.
ca: El sistema operatiu que executeu en un client és compatible amb l'organització que subministra el sistema operatiu. {rhel} és compatible amb {redhat}.

source: {sle-micro} is only supported as regular minion ([systemitem]``default`` contact method) for the time being. We are working on managing it as Salt SSH client ([systemitem]``salt-ssh`` contact method), too.
ca: {sle-micro} només està suportat com a minion regular ([systemitem].mètode de contacte predeterminat.) de moment. Estem treballant en la gestió d'ell com a client Salt SSH ([systemitem].mètode de contacte sal-ssh.), també.

source: Supported Features on {sle-micro} Operating Systems
ca: Característiques suportades en sistemes operatius {rocky}

source: | Feature | {sle-micro} | Client | {check} | Operating system packages | {check} | Registration | {check} | Install packages | {check} | Apply patches (requires CVE ID) | {check} | Remote commands | {check} | System package states | {check} | System custom states | {check} | Group custom states | {check} | Organization custom states | {check} | System set manager (SSM) | {check} | Product migration | {check} | Basic Virtual Guest Management {star} | {check} | Advanced Virtual Guest Management {star} | {check} | Virtual Guest Installation (Kickstart), as Host OS | {check} | Virtual Guest Installation (image template), as Host OS | {check} | System deployment (PXE/Kickstart) | {check} | System redeployment (Kickstart) | {check} | Contact methods | {check} ZeroMQ | Works with {productname} Proxy | {check} | Action chains | {check} | Staging (pre-download of packages) | {question} | Duplicate package reporting | {check} | CVE auditing (requires CVE ID) | {check} | SCAP auditing | {question} | Package verification | {question} | Package locking | {check} | System locking | {question} | Maintenance Windows | {question} | System snapshot | {cross} | Configuration file management | {check} | Snapshots and profiles | {check} Profiles supported, Sync not supported | Power management | {check} | Monitoring server | {cross} | Monitored clients {star}{star} | {check} | Docker buildhost | {cross} | Build Docker image with OS | {cross} | Kiwi buildhost | {cross} | Build Kiwi image with OS | {check} | Recurring Actions | {check} | AppStreams | N/A | Yomi | {question}
ca: Fe Característica {sle-micro} Client {check} Paquets de sistema operatiu {check} Inscripció {check} Instal·la paquets {check} ) Aplica els pedaços (requereix l'ID CVE) {check} s Ordres remotes {check} Estats del paquet del sistema {check} Estats personalitzats del sistema {check} Agrupa estats personalitzats {check} Organització d'estats personalitzats {check} ) Gestor de conjunts de sistemes (SSM) {check} Migració de producte {check} Gestió bàsica de convidats virtual {star} {check} Gestió de convidats virtual avançada {star} {check} ), Instal·lació de convidat virtual (Kickstart), com a servidor {check} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {check} ) Desplegament del sistema (PXE/Kickstart) {check} ) Redesplegament del sistema (Kickstart) {check} Mètodes de contacte {check} ZeroMQ with Funciona amb el servidor intermediari {productname} {check} Cadenes d'acció {check} ) Estadificació (pre-descàrrega de paquets) {question} Informe de paquets duplicat {check} audit auditoria CVE (requereix l'ID CVE) {check} ing Auditoria SCAP {question} Verificació de paquets {question} ing Bloqueig de paquets {check} ing Bloqueig del sistema {question} Finestres de manteniment {question} Instantània del sistema {cross} Gestió de fitxers de configuració {check} and Instantànies i perfils , {check} Perfils admesos, la sincronització no és compatible Gestió d'energia {check} Servidor de seguiment {cross} Clients supervisats {star}{star} {check} Constructor Docker {cross} Construeix la imatge Docker amb el SO {cross} Constructor de Kiwi {cross} Construeix la imatge de Kiwi amb el SO {check} s Accions recurrents {check} s AppStreams N/A Yomi {question}

source: {star}{star} On {sle-micro}, only the Node exporter and the Blackbox exporter are available.
ca: {star}{star} A {sle-micro} només hi ha disponible l'exportador de Node i l'exportador de Blackbox.

source: Supported {slsa} and {leap} Features
ca: Funcions compatibles amb {slsa} i {leap}

source: This table lists the availability of various features on {suse} and {leap} clients. This table covers all variants of the {sle} operating system, including {slsa}, {sleda}, {sles} for SAP, and {sles} for HPC.
ca: Aquesta taula enumera la disponibilitat de diverses funcions als clients {suse} i {leap}. Aquesta taula cobreix totes les variants del sistema operatiu {sle}, incloent-hi {slsa}, {sleda}, {sles} per a SAP i {sles} per a HPC.

source: The operating system you run on a client is supported by the organization that supplies the operating system. {sle} is supported by {suse}. {leap} is supported by the {opensuse} community.
ca: El sistema operatiu que executeu en un client és compatible amb l'organització que subministra el sistema operatiu. {suse} és compatible amb {sle}. {leap} és compatible amb la comunitat {opensuse}.

source: Supported Features on {suse} and {leap} Operating Systems
ca: Funcions compatibles amb els sistemes operatius {suse} i {leap}
