Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: For more information on using a VHM with Amazon Web Services, see xref:client-configuration:vhm-aws.adoc[].
ca: Per obtenir més informació sobre l'ús d'una VHM amb Amazon Web Services, vegeu xref:client-configuration:vhm-aws.adoc[].
ko: Amazon Web Services에서 VHM을 사용하는 방법에 대한 자세한 내용은 xref:client-configuration:vhm-aws.adoc[]를 참조하십시오.
zh_cn: 有关将 VHM 与 Amazon Web Services 搭配使用的详细信息，请参见 xref:client-configuration:vhm-aws.adoc[]。

source: For more information on using a VHM with Microsoft Azure, see xref:client-configuration:vhm-azure.adoc[].
ca: Per obtenir més informació sobre l'ús d'una VHM amb Microsoft Azure, vegeu xref:client-configuration:vhm-azure.adoc[].
ja: Microsoft AzureでVHMを使用する方法の詳細については、xref:client-configuration:vhm-azure.adoc[]を参照してください。
ko: Microsoft Azure에서 VHM을 사용하는 방법에 관한 자세한 내용은 xref:client-configuration:vhm-azure.adoc[]를 참조하십시오.
zh_cn: 有关将 VHM 与 Microsoft Azure 搭配使用的详细信息，请参见 xref:client-configuration:vhm-azure.adoc[]。

source: For more information on using a VHM with Google Compute Engine, see xref:client-configuration:vhm-gce.adoc[].
ca: Per obtenir més informació sobre l'ús d'un VHM amb Google Compute Engine, vegeu xref:client-configuration:vhm-gce.adoc[].
ja: Google Compute EngineでVHMを使用する方法の詳細については、xref:client-configuration:vhm-gce.adoc[]を参照してください。
ko: Google Compute Engine에서 VHM을 사용하는 방법에 대한 자세한 내용은 xref:client-configuration:vhm-gce.adoc[]를 참조하십시오.
zh_cn: 有关将 VHM 与 Google Compute Engine 搭配使用的详细信息，请参见 xref:client-configuration:vhm-gce.adoc[]。

source: For more information on using a VHM with Nutanix, see xref:client-configuration:vhm-nutanix.adoc[].
ca: Per a més informació sobre l'ús d'una VHM amb Nutanix, vegeu xref:client-configuration:vhm-nutanix.adoc[].
ja: NutanixでVHMを使用する方法の詳細については、xref:client-configuration:vhm-nutanix.adoc[]を参照してください。
ko: Nutanix에서 VHM을 사용하는 방법에 대한 자세한 내용은 xref:client-configuration:vhm-nutanix.adoc[]를 참조하십시오.
zh_cn: 有关将 VHM 与 Nutanix 搭配使用的详细信息，请参见 xref:client-configuration:vhm-nutanix.adoc[]。

source: For more information on using a VHM with VMWare vSphere, see xref:client-configuration:vhm-vmware.adoc[].
ca: Per obtenir més informació sobre l'ús d'una VHM amb VMWare vSphere, vegeu xref:client-configuration:vhm-vmware.adoc[].
ja: VMWare vSphereでVHMを使用する方法の詳細については、xref:client-configuration:vhm-vmware.adoc[]を参照してください。
ko: VMWare vSphere에서 VHM을 사용하는 방법에 대한 자세한 내용은 xref:client-configuration:vhm-vmware.adoc[]를 참조하십시오.
zh_cn: 有关将 VHM 与 VMWare vSphere 搭配使用的详细信息，请参见 xref:client-configuration:vhm-vmware.adoc[]。

source: For more information on using a VHM with other hosts, see xref:client-configuration:vhm-file.adoc[].
ca: Per obtenir més informació sobre l'ús d'una VHM amb altres ordinadors, vegeu xref:client-configuration:vhm-file.adoc[].
ja: その他のホストでVHMを使用する方法の詳細については、xref:client-configuration:vhm-file.adoc[]を参照してください。
ko: 다른 호스트에서 VHM을 사용하는 방법에 대한 자세한 내용은 xref:client-configuration:vhm-file.adoc[]을 참조하십시오.
zh_cn: 有关将 VHM 与其他主机搭配使用的详细信息，请参见 xref:client-configuration:vhm-file.adoc[]。

source: Procedure: Adding Software Channels at the Command Prompt
ca: Procediment: Afegir canals de programari al senyal d'ordres
ja: 手順: コマンドプロンプトからのソフトウェアチャンネルの追加
ko: 명령 프롬프트에서 소프트웨어 채널 추가
zh_cn: 过程：在命令提示符处添加软件通道

source: With the [command]``spacewalk-common-channels`` command you can add the appropriate channels. At the command prompt on the {productname} container host, as root, execute the following command:
ca: Amb l'ordre [command] spacewalk-common-channels podeu afegir els canals adequats. A l'indicador d'ordres de l'amfitrió del contenidor {productname}, com a arrel, executeu l'ordre següent:

source: To list all available repositories, execute the command:
ca: Per a llistar tots els repositoris disponibles, executeu l'ordre:

source: If xref:administration:custom-channels.adoc#_custom_channel_synchronization[automatic synchronization] is turned off, synchronize the channels:
ca: Si xref:administration:custom-channels.adoc,customchannelsynchronization[automatic synchronization] està desactivat, sincronitza els canals:
ja: xref:administration:custom-channels.adoc#_custom_channel_synchronization[自動同期]がオフになっている場合は、チャンネルを同期します。
ko: xref:administration:custom-channels.adoc#_custom_channel_synchronization[automatic synchronization]이 꺼진 경우 다음 채널을 동기화하십시오.
zh_cn: 如果 xref:administration:custom-channels.adoc#_custom_channel_synchronization[自动同步] 处于关闭状态，请同步通道：

source: Ensure the synchronization is complete before continuing.
ca: Assegureu-vos que la sincronització està completada abans de continuar.
ja: 続行前に、同期が完了していることを確認してください。
ko: 계속하기 전에 동기화가 완료되었는지 확인합니다.
zh_cn: 确保同步已完成，然后再继续操作。

source: With the [command]``spacewalk-common-channels`` command you can add the appropriate channels. At the command prompt on the {productname} container host, as root, execute the following command. Ensure you specify the correct architecture:
ca: Amb l'ordre [command] spacewalk-common-channels podeu afegir els canals adequats. A l'indicador d'ordres de l'amfitrió del contenidor {productname}, com a arrel, executeu l'ordre següent. Assegureu-vos d'especificar l'arquitectura correcta:

source: If xref:administration:custom-channels.adoc#_custom_channel_synchronization[automatic synchronization] is turned off, synchronize the channels on the container host with the following command:
ca: Si xref:administration:custom-channels.adoc#_custom_channel_synchronization[automatic synchronization] està desactivat, sincronitzeu els canals a l'amfitrió del contenidor amb l'ordre següent:

source: At the command prompt on the {productname} container host, as root, add the appropriate channels:
ca: A l'indicador d'ordres del servidor {productname}, com a root, utilitzeu l'ordre [command] tomgr-sync: per afegir els canals adequats:

source: Synchronization starts automatically. If you want to synchronize the channels manually, use:
ca: La sincronització s'inicia automàticament. Si voleu sincronitzar els canals manualment, utilitzeu:
ja: 同期は自動的に開始されます。 チャンネルを手動で同期する場合、次のコマンドを使用します。
ko: 동기화가 자동으로 시작됩니다. 채널을 수동으로 동기화하려면 다음 명령을 사용하십시오.
zh_cn: 同步会自动启动。如果您要手动同步通道，请使用以下命令：

source: Procedure: Adding Software Channels
ca: Procediment: Afegir canals de programari
ja: プロシージャ: ソフトウェアチャンネルの追加
ko: 절차: 소프트웨어 채널 추가
zh_cn: 过程：添加软件通道

source: In the {productname} {webui}, navigate to menu:Admin[Setup Wizard > Products].
ca: A {productname} {webui}, navegueu al menú:Admin[Auxiliar de configuració ]. Productes].
ja: {productname}の{webui}で、menu:管理[セットアップウィザード > 製品]に移動します。
ko: {productname} {webui}에서 menu:관리[설치 마법사 > 제품]으로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:管理[安装向导 > 产品]。

source: Locate the appropriate products for your client operating system and architecture using the search bar, and check the appropriate product. This will automatically check all mandatory channels. Also all recommended channels are checked as long as the [guimenu]``include recommended`` toggle is turned on. Click the arrow to see the complete list of related products, and ensure that any extra products you require are checked.
ca: Localitza els productes adequats per al sistema operatiu i l'arquitectura del teu client mitjançant la barra de cerca, i comprova el producte adequat. Això comprovarà automàticament tots els canals obligatoris. També es comprovaran tots els canals recomanats sempre que s'activi l'opció [guimenu].inclou recomanat.. Feu clic a la fletxa per veure la llista completa de productes relacionats i assegureu-vos que els productes addicionals que necessiteu estan marcats.
ja: 検索バーを使用してクライアントのオペレーティングシステムおよびアーキテクチャに適切な製品を探し、適切な製品にチェックを付けます。 こうすることによって、すべての必須チャンネルに自動的にチェックが付きます。 また、[guimenu]``include recommended``トグルがオンになっている場合、すべての推奨チャンネルにもチェックが付きます。 矢印をクリックして関連製品の一覧を表示し、必要な追加製品にチェックが付いていることを確認します。
ko: 검색 창을 사용하여 클라이언트 운영 체제 및 아키텍처에 적합한 제품을 찾고 해당 제품을 확인하십시오. 모든 필수 채널은 자동으로 확인됩니다. 또한, [guimenu]``추천 포함`` 토글이 켜져 있으면 모든 추천 채널이 확인됩니다. 관련 제품의 전체 목록을 보려면 화살표를 클릭하고 필요한 추가 제품이 선택되어 있는지 확인하십시오.
zh_cn: 使用搜索栏找到适用于您的客户端操作系统和体系结构的产品，然后选中相应产品。这样会自动选中所有必需的通道。此外，建议的所有通道也将选中，并且[guimenu]``包括建议项``开关会打开。单击箭头以查看相关产品的完整列表，确保您需要的所有额外产品都已选中。

source: Click btn:[Add Products] and wait until the products have finished synchronizing.
ca: Feu clic a btn:[Afegeix productes] i espereu fins que els productes hagin finalitzat la sincronització.
ja: btn:[製品の追加]をクリックし、製品の同期が完了するまで待機します。
ko: btn:[제품 추가]를 클릭하고 제품이 동기화를 마칠 때까지 기다립니다.
zh_cn: 单击 btn:[添加产品] 并等待产品完成同步。

source: In the following section, descriptions often default to the [literal]``x86_64`` architecture. Replace it with other architectures if appropriate.
ca: A la secció següent, les descripcions sovint són predeterminades per a l'arquitectura [literal].x8664.. Substitueix-la per altres arquitectures si escau.
ja: 次のセクションでは、[literal]``x86_64``アーキテクチャに基づく説明が多いです。 必要に応じて他のアーキテクチャに置き換えてください。
ko: 다음 섹션에서 설명은 종종 [literal]``x86_64`` 아키텍처로 기본 설정됩니다. 해당될 경우 다른 아키텍처로 교체하십시오.
zh_cn: 下面的小节中的说明通常默认使用 x86_64 体系结构。请根据情况将其替换为其他体系结构。

source: Procedure: Checking Synchronization Progress From the Command Prompt
ca: Procediment: S'està comprovant el progrés de la sincronització des del senyal d'ordre

source: To list available logs before tailing, on the container host, run the following command:
ca: Per llistar els registres disponibles abans de fer la cua, a l'amfitrió del contenidor, executeu l'ordre següent:

source: At the command prompt on the {productname} container host, as root, check the synchronization of a channel log file:
ca: A l'indicador d'ordres de l'amfitrió del contenidor {productname}, com a arrel, comproveu la sincronització d'un fitxer de registre de canal:

source: mgrctl exec -ti -- tail -f /var/log/rhn/reposync/<channel-label>.log
ca: tail -f /var/log/rhn/reposync/<channel-label>.log

source: Each child channel generates its own log during the synchronization progress. You need to check all the base and child channel log files to be sure that the synchronization is complete.
ca: Heu de comprovar tots els fitxers de registre del canal base i del canal fill per a assegurar-vos que la sincronització està completada.

source: Procedure: Checking Synchronization Progress From the {webui}
ca: Procediment: S'està comprovant el progrés de la sincronització des de {webui}

source: In the {productname} {webui}, navigate to menu:Admin[Setup Wizard] and select the [guimenu]``Products`` tab. This dialog displays a completion bar for each product when they are being synchronized.
ca: A {productname} {webui}, navegueu al menú:Admin[Auxiliar de configuració] i seleccioneu la pestanya [guimenu].Productes.. Aquest diàleg mostra una barra de compleció per a cada producte quan s'estan sincronitzant.
ja: {productname}の{webui}で、menu:管理[セットアップウィザード]に移動し、［[guimenu]``製品``］タブを選択します。 このダイアログには、同期中の各製品の完了バーが表示されます。
ko: {productname} {webui}에서 menu:관리[설치 마법사]로 이동하여 [guimenu]``제품`` 탭을 선택합니다. 이 대화 상자는 동기화되는 중에 각 제품에 대한 진행률 막대를 표시합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:管理[安装向导]，然后选择[guimenu]``产品``选项卡。当同步产品时，此对话框会为每个产品显示一个完成栏。

source: Alternatively, you can navigate to menu:Software[Manage > Channels], then click the channel associated to the repository. Navigate to the [guimenu]``Repositories`` tab, then click [guimenu]``Sync`` and check [systemitem]``Sync Status``.
ca: Alternativament, podeu navegar al menú:Software[Gestionar . Canals] i, a continuació, fer clic al canal associat al repositori. Navegueu a la pestanya [guimenu].Repositoris., després feu clic a [guimenu].Sincronitza. i marqueu [systemitem].Sincronitza l'estat..
ja: 代わりに、menu:ソフトウェア[管理 > チャンネル]に移動し、リポジトリに関連付けられているチャンネルをクリックします。 ［[guimenu]``リポジトリ``］タブに移動し、［[guimenu]``同期``］をクリックし、［[systemitem]``同期状態``］をクリックします。
ko: 또는 menu:소프트웨어[관리 > 채널]로 이동한 다음, 리포지토리에 연결된 채널을 클릭하면 됩니다. [guimenu]``리포지토리`` 탭으로 이동한 다음, [guimenu]``동기화``를 클릭하고 [systemitem]``동기화 상태``를 선택합니다.
zh_cn: 或者，您可以导航到menu:软件[管理 > 通道]，然后单击与该储存库关联的通道。导航到[guimenu]``储存库``选项卡，然后单击[guimenu]``同步``并选中[systemitem]``同步状态``。

source: Procedure: Checking Synchronization Progress From the {webui}
ca: Procediment: S'està comprovant el progrés de la sincronització des de {webui}

source: In the {productname} {webui}, navigate to menu:Software[Manage > Channels], then click the channel associated to the repository.
ca: A {productname} {webui}, navegueu al menú:Software[Manage . Channels] i feu clic al canal associat al repositori.
ja: {productname}の{webui}で、menu:ソフトウェア[管理 > チャンネル]に移動し、リポジトリに関連付けられているチャンネルをクリックします。
ko: {productname} {webui}에서 menu:소프트웨어[관리 > 채널]로 이동한 다음, 리포지토리에 연결된 채널을 클릭합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:软件[管理 > 通道]，然后单击与储存库关联的通道。

source: Navigate to the [guimenu]``Repositories`` tab, then click [guimenu]``Sync`` and check [systemitem]``Sync Status``.
ca: Navegueu a la pestanya [guimenu].Repositoris., després feu clic a [guimenu].Sincronitza. i marqueu [systemitem].Sincronitza l'estat..
ja: ［[guimenu]``リポジトリ``］タブに移動し、［[guimenu]``同期``］をクリックし、［[systemitem]``同期状態``］をクリックします。
ko: [guimenu]``리포지토리`` 탭으로 이동한 다음, [guimenu]``동기화``를 클릭하고 [systemitem]``동기화 상태``를 확인합니다.
zh_cn: 导航到[guimenu]``储存库``选项卡，然后单击[guimenu]``同步``并选中[systemitem]``同步状态``。

source: To register your clients, you need a bootstrap repository. By default, bootstrap repositories are automatically created, and regenerated daily for all synchronized products. You can manually create the bootstrap repository from the command prompt on the container host:
ca: Per defecte, els repositoris bootstrap es regeneren diàriament. Podeu crear manualment el repositori bootstrap des de l'indicador d'ordres.

source: mgrctl exec -ti mgr-create-bootstrap-repo
ca: mgr-create-bootstrap-repo

source: For more information on registering your clients, see xref:client-configuration:registration-overview.adoc[].
ca: Per a més informació sobre el registre dels teus clients, consulta xref:client-configuration:registration-overview.adoc[].
ja: クライアントの登録については、xref:client-configuration:registration-overview.adoc[]を参照してください。
ko: 클라이언트 등록에 대한 자세한 내용은 xref:client-configuration:registration-overview.adoc[]에서 참조하십시오.
zh_cn: 有关注册客户端的详细信息，请参见 xref:client-configuration:registration-overview.adoc[]。

source: When the distibution reaches end-of-life, it enters grace period of 3 months when the support is considered deprecated. After that period, the product is considered unsupported. Any support may only be available on the best-effort basis.
ca: Quan la distibució arriba al final de la vida, entra en un període de gràcia de 3 mesos quan el suport es considera obsolet. Després d'aquest període, el producte es considera no suportat. Qualsevol suport només pot estar disponible sobre la base del millor esforç.
ja: 配布がサポート終了になると、サポートが廃止されたと見なされる3か月の猶予期間に入ります。 その期間が過ぎると、製品はサポート対象外と見なされます。 サポートは、努力ベースでのみ提供される場合があります。
ko: 배포의 수명이 만료하면 3개월의 유예 기간이 시작되며 지원은 중단한 것으로 간주됩니다. 이 기간이 경과하면 해당 제품은 지원하지 않는 것으로 간주됩니다. 모든 지원은 최선의 노력으로 제공합니다.
zh_cn: 发行套件到达生命周期结束日期时，将进入 3 个月的宽限期，届时支持将视为处于弃用状态。宽限期结束之后，产品即视为不受支持。此后我们将只能尽最大努力提供支持。

source: For more information about end-of-life dates, see https://endoflife.software/operating-systems.
ca: Per a més informació sobre {ay}, vegeu https://doc.opensuse.org/projects/autoyast/.
ja: サポート終了日の詳細については、link:https://endoflife.software/operating-systems[]を参照してください。
ko: 수명 종료에 대한 자세한 설명은 link:https://endoflife.software/operating-systems[]를 참조하십시오.
zh_cn: 有关生命周期结束日期的详细信息，请参见 https://endoflife.software/operating-systems[]。

source: Procedure: Managing Enabled AppStream Modules
ca: Procediment: Creació d'un perfil emmagatzemat

source: In the {productname} {webui}, navigate to menu:Systems[Software > AppStreams].
ca: A {productname} {webui}, navegueu al menú:Systems[Systems Groups].

source: From the table of module streams, select the streams to be enabled on the client.
ca: Des de la taula de fluxos de mòduls, seleccioneu els fluxos que s'habilitaran al client.

source: Click btn:[Apply Changes].
ca: Feu clic a btn:[Desa els canvis].

source: On the next page, check the list of changes to be made, and choose a time for the action to occur.
ca: Comproveu els canvis que esteu fent i trieu una hora perquè es produeixi l'acció.

source: Click btn:[Confirm] to schedule the changes to be applied.
ca: Feu clic a btn:[Confirm] per a programar els canvis.

source: When you have created all the channels, you can associate them with the repositories you created:
ca: Quan hàgiu creat tots els canals, els podeu associar als repositoris que heu creat:
ja: すべてのチャンネルを作成済みの場合、これらのチャンネルを、作成したリポジトリと関連付けできます。
ko: 모든 채널을 생성했으면 생성한 리포지토리를 다음과 같이 채널과 연결할 수 있습니다.
zh_cn: 创建所有通道之后，可以将其与您创建的储存库关联：

source: Procedure: Associating Channels with Repositories
ca: Procediment: Associar canals amb repositoris
ko: 절차: 채널을 리포지토리와 연결
zh_cn: 过程：将通道与储存库关联

source: On the {productname} Server {webui}, navigate to menu:Software[Manage > Channels], and click the channel to associate.
ca: Al {productname} Servidor {webui}, navegueu al menú:Software[Manage . Channels], i feu clic al canal per associar-lo.
ja: {productname}サーバの{webui}で、menu:ソフトウェア[管理 > チャンネル]に移動し、関連付けるチャンネルをクリックします。
ko: {productname} 서버 {webui}에서 menu:소프트웨어[관리 > 채널]로 이동한 다음, 연결할 채널을 클릭합니다.
zh_cn: 在 {productname} 服务器 {webui} 上，导航到menu:软件[管理 > 通道]，然后单击要关联的通道。

source: Navigate to the [guimenu]``Repositories`` tab, and check the repository to associate with this channel.
ca: Navegueu a la pestanya [guimenu].Repositoris. i marqueu el repositori per a associar-lo amb aquest canal.
ja: ［[guimenu]``リポジトリ``］タブに移動し、このチャンネルと関連付けるリポジトリにチェックを付けます。
ko: [guimenu]``리포지토리`` 탭으로 이동하여 이 채널에 연결할 리포지토리의 확인란을 선택합니다.
zh_cn: 导航到[guimenu]``储存库``选项卡，然后选中要与此通道关联的储存库。

source: Click btn:[Update Repositories] to associate the channel and the repository.
ca: Feu clic a btn:[Actualitza els repositoris] per associar el canal i el repositori.
ja: btn:[リポジトリの更新]をクリックし、チャンネルとリポジトリを関連付けます。
ko: btn:[리포지토리 업데이트]를 클릭하여 채널과 리포지토리를 연결합니다.
zh_cn: 单击 btn:[更新储存库] 以将通道与储存库相关联。

source: Repeat for all channels and repositories you need to associate.
ca: Repetiu per a tots els canals i repositoris que necessiteu associar.
ja: 関連付ける必要があるすべてのチャンネルとすべてのリポジトリを繰り返します。
ko: 연결하려는 모든 채널과 리포지토리에 대해 이를 반복합니다.
zh_cn: 对需要关联的所有通道和储存库重复以上步骤。

source: OPTIONAL: Navigate to the [guimenu]``Sync`` tab to set a recurring schedule for synchronization of this repository.
ca: OPCIONAL: Navega a la pestanya [guimenu].Sincronitza. per a establir una planificació periòdica per a la sincronització d'aquest repositori.
ja: オプション: ［[guimenu]``同期``］タブに移動し、このリポジトリの同期の繰り返しスケジュールを設定します。
ko: 옵션: [guimenu]``동기화`` 탭으로 이동하여 이 리포지토리의 동기화에 대해 정기적 일정을 설정합니다.
zh_cn: 可选：导航到[guimenu]``同步``选项卡，为此储存库设置定期同步日程安排。

source: Click btn:[Sync Now] to begin synchronization immediately.
ca: Feu clic a btn:[Sincronitza ara] per a començar la sincronització immediatament.
ja: btn:[今すぐ同期]をクリックし、すぐに同期を開始します。
ko: btn:[지금 동기화]를 클릭하여 즉시 동기화를 시작합니다.
zh_cn: 单击 btn:[立即同步] 以立即开始同步。

source: Procedure: Creating Custom Channels
ca: Procediment: Creació de canals personalitzats
ja: プロシージャ: カスタムチャンネルの作成
ko: 절차: 사용자 정의 채널 생성
zh_cn: 过程：创建自定义通道

source: On the {productname} Server {webui}, navigate to menu:Software[Manage > Channels].
ca: Al servidor {productname} {webui}, navegueu al menú:Software[Gestioneu ]. Canals].
ja: {productname}サーバの{webui}で、menu:ソフトウェア[管理 > チャンネル]に移動します。
ko: {productname} 서버 {webui}에서 menu:소프트웨어[관리 > 채널]로 이동합니다.
zh_cn: 在 {productname} 服务器 {webui} 上，导航到menu:软件[管理 > 通道]。

source: Click btn:[Create Channel] and set the appropriate parameters for the channels.
ca: Feu clic a btn:[Crea un canal] i establiu els paràmetres adequats per als canals.
ja: btn:[チャンネルの作成]をクリックし、チャンネルに適切なパラメータを設定します。
ko: btn:[채널 생성]을 클릭하여 채널에 적절한 파라미터를 설정합니다.
zh_cn: 单击 btn:[创建通道]，然后为通道设置相应的参数。

source: In the [guimenu]``Parent Channel`` field, select the appropriate base channel.
ca: Al camp [guimenu].Canal actual., seleccioneu el canal base apropiat.
ja: ［[guimenu]``親チャンネル``］フィールドで、適切なベースチャンネルを選択します。
ko: [guimenu]``상위 채널`` 필드에서 적절한 기본 채널을 선택합니다.
zh_cn: 在[guimenu]``父通道``字段中，选择相应的基础通道。

source: Click btn:[Create Channel].
ca: Feu clic a btn:[Crea un canal].
ja: btn:[チャンネルの作成]をクリックします。
ko: btn:[채널 생성]을 클릭합니다.
zh_cn: 单击 btn:[创建通道]。

source: Repeat for all channels you need to create. There should be one custom channel for each custom repository.
ca: Repetiu per a tots els canals que necessiteu crear. Hi ha d'haver un canal personalitzat per a cada repositori personalitzat.
ja: 作成する必要があるすべてのチャンネルで繰り返します。 各カスタムリポジトリに1つのカスタムチャンネルが必要です。
ko: 생성해야 하는 모든 채널에 대해 이를 반복합니다. 각 사용자 정의 리포지토리에는 하나의 사용자 정의 채널이 있어야 합니다.
zh_cn: 对需要创建的所有通道重复以上步骤。每个自定义储存库都应该有一个自定义通道。

source: You can check that you have created all the appropriate channels and repositories, by navigating to menu:Software[Channel List > All].
ca: Podeu comprovar que heu creat tots els canals i repositoris adequats, navegant al menú:Software[Llista de canals ]. Tot].
ja: 該当するすべてのチャンネルとリポジトリを作成したことを確認できます。そのためには、menu:ソフトウェア[チャンネル一覧 > すべて]に移動します。
ko: menu:소프트웨어[채널 목록 > 전체]로 이동하여 적절한 채널 및 리포지토리를 모두 생성했는지 확인할 수 있습니다.
zh_cn: 您可以导航到menu:软件[通道列表 > 所有]，以检查是否已创建所有相应的通道和储存库。

source: Procedure: Creating Custom Repositories
ca: Procediment: Creació de repositoris personalitzats
ja: プロシージャ: カスタムリポジトリの作成
ko: 절차: 사용자 정의 리포지토리 생성
zh_cn: 过程：创建自定义储存库

source: On the {productname} Server {webui}, navigate to menu:Software[Manage > Repositories].
ca: Al servidor {productname} {webui}, navegueu al menú:Software[Gestioneu ]. Repositoris].
ja: {productname}サーバの{webui}で、menu:ソフトウェア[管理 > リポジトリ]に移動します。
ko: {productname} 서버 {webui}에서 menu:소프트웨어[관리 > 리포지토리]로 이동합니다.
zh_cn: 在 {productname} 服务器 {webui} 上，导航到menu:软件[管理 > 储存库]。

source: Click btn:[Create Repository] and set the appropriate parameters for the repository.
ca: Feu clic a btn:[Crea Repositori] i establiu els paràmetres adequats per al repositori.
ja: btn:[リポジトリの作成]をクリックし、リポジトリに適切なパラメータを設定します。
ko: btn:[리포지토리 생성]을 클릭하여 리포지토리에 적절한 파라미터를 설정합니다.
zh_cn: 单击 btn:[创建储存库]，然后为储存库设置适当的参数。

source: Click btn:[Create Repository].
ca: Feu clic a btn:[Crea el repositori].
ja: btn:[リポジトリの作成]をクリックします。
ko: btn:[리포지토리 생성]을 클릭합니다.
zh_cn: 单击 btn:[创建储存库]。

source: Repeat for all repositories you need to create.
ca: Repetiu per a tots els repositoris que necessiteu crear.
ja: 作成する必要があるすべてのリポジトリで繰り返します。
ko: 생성해야 하는 모든 리포지토리에 대해 이를 반복합니다.
zh_cn: 对需要创建的所有储存库重复以上步骤。

source: Operating systems either trust their own GPG keys directly or at least ship them installed with the minimal system. But third party packages signed by a different GPG key need manual handling. The clients can be successfully bootstrapped without the GPG key being trusted. However, you cannot install new client tool packages or update them until the keys are trusted.
ca: Els sistemes operatius o bé confien directament en les seves pròpies claus GPG o almenys les envien instal·lades amb el sistema mínim. Però els paquets de tercers signats per una clau GPG diferent necessiten una gestió manual. Els clients poden arrencar amb èxit sense que es confiï en la clau GPG. No obstant això, no podeu instal·lar nous paquets d'eines de client o actualitzar-los fins que es confiï en les claus.
ja: オペレーティング システムは、独自のGPGキーを直接信頼するか、少なくとも最小限のシステムでインストールされて出荷されます。 ただし、別のGPGキーで署名されたサードパーティのパッケージは手動で処理する必要があります。 クライアントは、GPGキーを信頼していなくても正常にブートストラップできます。 ただし、キーが信頼されるまで、新しいクライアントツールパッケージをインストールしたり、更新したりできません。
ko: 운영 체제는 자체 GPG 키를 직접 신뢰하거나 최소 시스템 이상과 함께 설치된 상태로 제공됩니다. 그러나 다른 GPG 키로 서명된 타사 패키지는 수동으로 처리해야 합니다. 클라이언트는 신뢰할 수 있는 GPG 키가 없어도 성공적으로 부트스트래핑할 수 있습니다. 하지만 키를 신뢰할 수 있을 때까지는 새 클라이언트 도구 패키지를 설치하거나 업데이트할 수 없습니다.
zh_cn: 操作系统要么直接信任自己的 GPG 密钥，要么至少将它们与最小系统一起安装，但通过其他 GPG 密钥签名的第三方软件包需要手动处理。客户端可以在不信任 GPG 密钥的情况下成功引导，但除非密钥受信任，否则您将无法安装新的客户端工具软件包或更新软件包。
