Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: The authors of CEFS provide patches or errata on a best-effort basis, in the hope they are useful but with no guarantees of correctness or currency. This could mean that the patch dates could be incorrect, and in at least one case, the published data was shown to be more than a month old. For more information on these cases, see https://github.com/stevemeier/cefs/issues/28#issuecomment-656579382 and https://github.com/stevemeier/cefs/issues/28#issuecomment-656573607.
ca: Els autors del CEFS aporten pedaços o errates sobre una base de millor esforç, amb l'esperança que siguin útils però sense garanties de correcció ni de divisa. Això podria significar que les dates del pedaç podrien ser incorrectes, i en almenys un cas, es va mostrar que les dades publicades tenien més d'un mes d'antiguitat. Per a més informació sobre aquests casos, vegeu https://github.com/stevemeier/cefs/issues/28.issuecomment-656579382 i https://github.com/stevemeier/cefs/issues/28.issuecomment-656573607.
ja: CEFSの作成者は、パッチまたはエラータを、利便性向上を目指して努力ベースで提供していますが、これが正確であることや最新であることを保証していません。 つまり、パッチ日が正しくない場合があります。また、発行されたデータが1カ月以上遅れて示されたことが少なくとも1回ありました。 このような場合の情報については、link:https://github.com/stevemeier/cefs/issues/28#issuecomment-656579382[]およびlink:https://github.com/stevemeier/cefs/issues/28#issuecomment-656573607[]を参照してください。
ko: CEFS의 원저자는 도움이 됐으면 하는 마음으로 최선을 다해 패치나 정오표를 제공하지만 정확성이나 최신 상태를 보장하지는 않습니다. 따라서 패치 날짜가 부정확할 수 있습니다. 한번은 게시 날짜가 한 달 이상 늦은 날짜로 표시된 적도 있습니다. 이러한 경우에 대한 자세한 내용은 https://github.com/stevemeier/cefs/issues/28#issuecomment-656579382 및 https://github.com/stevemeier/cefs/issues/28#issuecomment-656573607[]을 참조하십시오.
zh_cn: CEFS 的作者会按照尽力而为的原则提供补丁或勘误，希望它们有用，但无法保证其正确性或及时性。这意味着补丁日期可能不正确，且至少在一种情况下所显示的发布数据滞后一个多月。有关这些情况的详细信息，请参见 https://github.com/stevemeier/cefs/issues/28#issuecomment-656579382 和 https://github.com/stevemeier/cefs/issues/28#issuecomment-656573607[]。

source: Any problems or delays with the patch data might result in unreliable patch information being imported to your {productname} Server. This would cause reports, audits, CVE updates, or other patch-related information to also be incorrect. Please consider alternatives to using this service, such as independently verifying patch data, or choosing a different operating system, depending on your security-related requirements and certifications criteria.
ca: Qualsevol problema o retard amb les dades del pedaç pot provocar que la informació del pedaç no sigui fiable que s'importi al vostre servidor {productname}. Això faria que els informes, auditories, actualitzacions de CVE o altres informacions relacionades amb el patch també fossin incorrectes. Considereu alternatives a l'ús d'aquest servei, com ara la verificació independent de les dades del pegat o l'elecció d'un sistema operatiu diferent, en funció dels requisits i criteris de certificació relacionats amb la seguretat.
ko: 패치 데이터 관련 문제나 지연으로 인해 {productname} 서버로 신뢰할 수 없는 패치 정보가 임포트될 수 있습니다. 이로 인해 보고서, 감사, CVE 업데이트 또는 기타 패치 관련 정보가 부정확해질 수도 있습니다. 패치 데이터를 독립적으로 확인하거나 보안 관련 요구사항 및 인증 기준에 따라 다른 운영 체제를 선택하는 등 이 서비스 사용을 대체할 수 있는 수단을 고려해 보시기 바랍니다.
zh_cn: 任何有关补丁数据的问题或滞后都可能导致将不可靠的补丁信息导入到您的 {productname} 服务器中， 进而导致报告、审计、CVE 更新或其他与补丁相关的信息也不正确。请考虑使用其他方案来替代此服务，例如独立校验补丁数据或选择其他操作系统，具体取决于您的安全相关要求和认证准则。

source: Procedure: Installing an Errata Service
ca: Procediment: Instal·lació d'un servei Errata
ja: プロシージャ: エラータサービスのインストール
ko: 절차: 정오표 서비스 설치
zh_cn: 过程：安装勘误服务

source: On the {productname} Server, from the command prompt, as root, add the ``sle-module-development-tools`` module:
ca: Al servidor {productname}, des de l'indicador d'ordres, com a root, afegiu el mòdul :sle-module-development-tools::

source: Install errata service dependencies:
ca: Instal·la dependències de servei errata:
ja: エラータサービスの依存関係をインストールします。
ko: 다음과 같이 오류 서비스 종속성을 설치합니다.
zh_cn: 安装勘误服务依赖项：

source: zypper in perl-Text-Unidecode
ca: zypper en perl-Text-Unidecode

source: Add or edit this line in [path]``/etc/rhn/rhn.conf``:
ca: Afegeix o edita aquesta línia a [path]:/etc/rhn/rhn.conf::
ja: [path]``/etc/rhn/rhn.conf``で次の行を追加または編集します。
ko: [path]``/etc/rhn/rhn.conf``에서 다음 줄을 추가하거나 편집합니다.
zh_cn: 在 [path]``/etc/rhn/rhn.conf`` 中添加或编辑下面一行：

source: Restart Tomcat:
ca: Reinicia el Tomcat:
ja: Tomcatを再起動します。
ko: Tomcat을 다시 시작합니다.
zh_cn: 重启动 Tomcat：

source: systemctl restart tomcat
ca: systemctl reinicia el tomcat

source: Create a file for your errata script:
ca: Creeu un fitxer per a l'script errata:
ja: エラータスクリプト用のファイルを作成します。
ko: 다음과 같이 오류 스크립트에 대해 파일을 생성합니다.
zh_cn: 为勘误脚本创建一个文件：

source: touch /usr/local/bin/cent-errata.sh
ca: toca /usr/local/bin/cent-errata.sh

source: Edit the new file to include this script, editing the repository details as required.
ca: Editeu el fitxer nou per a incloure aquest script, editant els detalls del repositori segons sigui necessari.
ja: 新しいファイルを編集してこのスクリプトを含め、必要に応じてリポジトリの詳細を編集します。
ko: 이 스크립트를 포함할 새 파일을 편집하고, 필요에 따라 리포지토리 상세 정보를 편집합니다.
zh_cn: 编辑新文件以包含此脚本，并视需要编辑储存库细节。

source: This script fetches the errata details from an external errata service, unpacks it, and publishes the details:
ca: Aquest script recull els detalls de les errates d'un servei extern d'errades, el desempaqueta i publica els detalls:
ja: このスクリプトは、外部のエラータサービスからエラータの詳細をフェッチして展開し、詳細を発行します。
ko: 이 스크립트는 외부 오류 서비스에서 오류 상세 정보를 가져와 압축을 풀고 세부 정보를 게시합니다.
zh_cn: 此脚本会从外部勘误服务提取勘误细节，将其解压缩，然后发布这些细节：

source: #!/bin/bash mkdir -p /usr/local/centos cd /usr/local/centos rm *.xml wget -c http://cefs.steve-meier.de/errata.latest.xml wget -c https://www.redhat.com/security/data/oval/v2/RHEL7/rhel-7.oval.xml.bz2 bzip2 -d rhel-7.oval.xml.bz2 wget -c http://cefs.steve-meier.de/errata-import.tar tar xvf errata-import.tar chmod +x /usr/local/centos/errata-import.pl export SPACEWALK_USER='<adminname>';export SPACEWALK_PASS='<password>' /usr/local/centos/errata-import.pl --server '<servername>' \ --errata /usr/local/centos/errata.latest.xml \ --include-channels=centos7-x86_64-updates,centos7-x86_64,centos7-x86_64-extras \ --publish --rhsa-oval /usr/local/centos/rhel-7.oval.xml
ca: !/bin/bash mkdir -p /usr/local/centos cd /usr/local/centos rm *.xml wget -c http://cefs.steve-meier.de/errata.latest.xml wget -c https://www.redhat.com/security/data/oval/v2/RHEL7/rhel-7.oval.xml.bz2 bzip2 -d rel-7.oval.xml.bz2 wget -c http://cefs.steve-meier.de/errata-import.tar tar xvf errata-import.tar chmod +x /usr/local/centos/errata-import.pl export SPACEWALKUSER {'<adminname>';export SPACEWALKPASS '<password>' /usr/local/centos/errata-import.pl --server '<servername>' \ --errata /usr/local/centos/errata.latest.xml \ --include-channels,centos7-x8664-updates,centos7-x8664,centos7-x8664-extras \ --publish --rhsa-oval /usr/local/centos/rhel-7.oval.xml

source: Set up a cron job to run the script daily:
ca: Configureu un treball del cron per a executar l'script diàriament:
ja: スクリプトを毎日実行するようcronジョブを設定します。
ko: 다음과 같이 cron 작업을 설정하여 매일 스크립트를 실행합니다.
zh_cn: 设置 cron 作业以每日运行该脚本：

source: For more information on this tool, see https://cefs.steve-meier.de/.
ca: Per a més informació sobre aquesta eina, vegeu https://cefs.steve-meier.de/.
ja: このツールの詳細については、link:https://cefs.steve-meier.de/[]を参照してください。
ko: 이 도구에 대한 자세한 내용은 https://cefs.steve-meier.de/[]를 참조하십시오.
zh_cn: 有关此工具的详细信息，请参见 https://cefs.steve-meier.de/[]。

source: Registering {debian} Clients
ca: S'estan registrant {debian} clients
ja: {debian}クライアントの登録
ko: {debian} 클라이언트 등록
zh_cn: 注册 {debian} 客户端

source: This section contains information about registering clients running {debian} operating systems.
ca: Aquesta secció conté informació sobre el registre de clients que executen sistemes operatius {debian}.

source: Bootstrapping can be used with {debian} clients for performing initial state runs, and for profile updates.
ca: El bootstrapping es pot utilitzar amb {debian} clients per realitzar execucions d'estat inicials i per actualitzacions de perfil.
ja: ブートストラップは、初期状態の実行およびプロファイルの更新のために{debian}クライアントで使用できます。
ko: {debian} 클라이언트에서는 부트스트래핑을 사용해 초기 상태 실행을 수행하고 프로파일을 업데이트할 수 있습니다.
zh_cn: 可以通过引导 {debian} 客户端来执行初始状态的运行以及配置文件的更新。

source: {debian} repository URLs are available from {scclongform}.
ca: Els URL del repositori {debian} estan disponibles des de {scclongform}.

source: Packages and metadata are provided by Debian, not by {suse}.
ca: Debian proporciona paquets i metadades, no {suse}.

source: For supported products, see the release notes and the support table at xref:client-configuration:supported-features-debian.adoc[].
ca: Per obtenir una llista completa de clients i característiques compatibles, vegeu xref:client-configuration:supported-features.adoc[].

source: Prepare to Register
ca: Prepara't per registrar-te
ja: 登録の準備
ko: 등록 준비
zh_cn: 准备注册

source: Some preparation is required before you can register {debian} clients to the {productname} Server:
ca: Cal una preparació prèvia per poder registrar {debian} clients al servidor {productname}:
ja: {debian}クライアントを{productname}サーバに登録するには、その前に準備が必要です。
ko: {debian} 클라이언트를 {productname} 서버에 등록하려면 다음과 같은 약간의 준비가 필요합니다.
zh_cn: 您需要完成一些准备工作，然后才能将 {debian} 客户端注册到 {productname} 服务器：

source: Ensure DNS is correctly configured and provides an entry for the client. Alternatively, you can configure the ``/etc/hosts`` files on both the {productname} Server and the client with the appropriate entries.
ca: Assegura't que el DNS està correctament configurat i proporciona una entrada per al client. Alternativament, podeu configurar els fitxers ./etc/hosts on tant al servidor {productname} com al client amb les entrades apropiades.
ja: DNSが正しく設定されていることを確認し、クライアントのエントリを提供します。 または、適切なエントリを使用して、{productname}サーバとクライアントの両方で``/etc/hosts``ファイルを設定できます。
ko: DNS가 올바르게 구성되어 있는지 확인하고 클라이언트에 항목을 제공합니다. 또는 {productname} 서버와 클라이언트에서 적절한 항목으로 ``/etc/hosts`` 파일을 구성할 수 있습니다.
zh_cn: 确保 DNS 配置正确并提供客户端对应的项。或者，您也可以配置 {productname} 服务器和客户端上的 ``/etc/hosts`` 文件，在其中添加相应的项。

source: The client must have the date and time synchronized with the {productname} Server before registration.
ca: El client ha de tenir la data i l'hora sincronitzades amb el servidor {productname} abans del registre.
ja: クライアントは、登録する前に{productname}サーバと日時が同期されている必要があります。
ko: 클라이언트의 날짜 및 시간을 {productname} 서버와 동기화한 후 등록해야 합니다.
zh_cn: 注册前，客户端的日期和时间必须已与 {productname} 服务器同步。

source: Before you can register {debian} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de poder registrar {debian} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.
ja: {debian}クライアントを{productname}サーバに登録する前に、必要なソフトウェアチャンネルを追加して同期する必要があります。
ko: {debian} 클라이언트를 {productname} 서버에 등록하려면 먼저 필요한 소프트웨어 채널을 추가하고 이 채널을 동기화해야 합니다.
zh_cn: 将 {debian} 客户端注册到您的 {productname} 服务器之前，您需要添加所需的软件通道，并同步这些通道。

source: Debian Products - WebUI
ca: Productes Debian - WebUI
ja: Debian製品 - WebUI
ko: Debian 제품 - WebUI
zh_cn: Debian 产品 - WebUI

source: | OS Version | Product Name | {debian} 12 | Debian 12
ca: | Versió del SO | Nom del producte | {alibabaclo} 2 | Alibaba Cloud Linux 2 x86_64

source: Debian Channels - CLI
ca: Canals de Debian - CLI
ja: Debianチャンネル - CLI
ko: Debian 채널 - CLI
zh_cn: Debian 通道 - CLI

source: | OS Version | Product Name | {debian} 12 | debian-12-pool-amd64
ca: | Versió del SO | Nom del producte | {alibabaclo} 2 | Alibaba Cloud Linux 2 x86_64

source: | OS Version | Base Channel | Client Channel | Updates Channel | Security Channel | {debian} 12 | debian-12-pool-amd64-uyuni | debian-12-amd64-uyuni-client | debian-12-amd64-main-updates-uyuni | debian-12-amd64-main-security-uyuni
ca: Versió del SO Canal base Canal client s Actualitza el canal Canal de Seguretat {debian} 12 debian-12-pool-amd64-uyuni debian-12-amd64-uyuni-client debian-12-amd64-main-updates-uyuni debian-12-amd64-main-security-uyuni

source: {debian} channels can be very large. Synchronization can sometimes take several hours.
ca: {debian} canals poden ser molt grans. La sincronització de vegades pot trigar diverses hores.
ja: {debian}チャンネルは非常に大きいことがあります。 同期に数時間かかる場合があります。
ko: {debian} 채널은 규모가 매우 클 수 있습니다. 때로 동기화에 몇 시간이 걸릴 수 있습니다.
zh_cn: {debian} 通道可能会非常大。同步所需的时间可能会长达数小时。

source: {debian} clients can require multiple GPG keys to be installed.
ca: {debian} clients poden requerir que s'instal·lin múltiples claus GPG.
ja: {debian}クライアントをインストールするには、複数のGPGキーが必要な場合があります。
ko: {debian} 클라이언트를 설치하려면 여러 개의 GPG 키가 필요할 수 있습니다.
zh_cn: {debian} 客户端可能需要安装多个 GPG 密钥。

source: When synchronizing third-party {debian} repositories, you will need to import the appropriate GPG key on the server. If the GPG key is missing, synchronization will fail.
ca: Quan sincronitzeu repositoris de tercers {debian}, haureu d'importar la clau GPG apropiada al servidor. Si falta la clau GPG, la sincronització fallarà.
ja: サードパーティの{debian}リポジトリを同期する場合は、適切なGPGキーをサーバにインポートする必要があります。 GPGキーがない場合、同期は失敗します。
ko: 타사 {debian} 리포지토리를 동기화하는 경우 서버에서 적절한 GPG 키를 가져와야 합니다. GPG 키가 누락되면 동기화에 실패합니다.
zh_cn: 同步第三方 {debian} 储存库时，您需要在服务器上导入相应的 GPG 密钥。如果缺少 GPG 密钥，同步将会失败。

source: For {debian} repositories, only the metadata is signed. Therefore importing a GPG key for the software channel is not needed. Packages will not be re-signed by Uyuni.
ca: Per als repositoris {debian}, només se signen les metadades. Per tant, no cal importar una clau GPG per al canal de programari. Els paquets no seran re-signats per Uyuni.
ja: {debian}リポジトリの場合、メタデータのみが署名されます。 したがって、ソフトウェアチャンネルのGPGキーをインポートする必要はありません。 パッケージはUyuniによって再署名されません。
ko: {debian} 리포지토리의 경우, 메타데이터만 서명됩니다. 그러므로 소프트웨어 채널용 GPG 키를 가져올 필요가 없습니다. Uyuni는 패키지에 다시 서명하지 않습니다.
zh_cn: 使用 {debian} 储存库时，系统只会对元数据签名。因此不需要导入软件通道的 GPG 密钥。Uyuni 将不会对软件包重新签名。

source: To see which GPG keys are already imported to {productname} Server, run the following command:
ca: Per veure quines claus GPG ja s'han importat al servidor {productname}, executeu l'ordre següent:
ja: {productname}サーバにすでにインポートされているGPGキーを確認するには、次のコマンドを実行します。
ko: {productname} 서버로 이미 임포트한 GPG 키를 살펴보려면 다음 명령을 실행합니다.
zh_cn: 要查看已导入 {productname} 服务器的 GPG 密钥，请运行以下命令：

source: To import a new GPG key, run the following command:
ca: Per a importar una clau GPG nova, executeu l'ordre següent:

source: mgradm gpg add <filename>.gpg
ca: mgradm gpg afegeix <filename>.gpg

source: Root Access
ca: Accés Root
ja: rootアクセス
ko: 루트 액세스
zh_cn: Root 访问权限

source: The root user on {debian} is disabled by default for SSH access.
ca: L'usuari root a {debian} està desactivat per defecte per a l'accés SSH.
ja: {debian}のrootユーザはデフォルトでSSHアクセスが無効になっています。
ko: {debian}의 루트 사용자는 SSH 액세스에 대해 기본적으로 비활성화되어 있습니다.
zh_cn: 默认会为 {debian} 上的 root 用户禁用 SSH 访问权限。

source: To be able to onboard using a regular user, you need to edit the [filename]``sudoers`` file.
ca: Al client, editeu el fitxer [filename]:sudoers::
ja: 標準ユーザを使用してオンボードできるようにするには、[filename]``sudoers``ファイルを編集する必要があります。
ko: 일반 사용자를 사용하여 온보딩하려면 [filename]``sudoers`` 파일을 편집해야 합니다.
zh_cn: 要想能够使用普通用户进行初始配置，您需要编辑 [filename]``sudoers`` 文件。

source: Procedure: Granting Root User Access
ca: Procediment: Concedir l'accés a l'usuari root
ja: プロシージャ: rootユーザアクセスの許可
ko: 절차: 루트 사용자에게 액세스 권한 부여
zh_cn: 过程：向 Root 用户授予访问权限

source: On the client, edit the [filename]``sudoers`` file:
ca: Al client, editeu el fitxer [filename]:sudoers::
ja: クライアントで、[filename]``sudoers``ファイルを編集します。
ko: 클라이언트에서 다음과 같이 [filename]``sudoers`` 파일을 편집합니다.
zh_cn: 在客户端上，编辑 [filename]``sudoers`` 文件：

source: Grant [command]``sudo`` access to the user by adding this line at the end of the [filename]``sudoers`` file. Replace [systemitem]``<user>`` with the name of the user that is bootstrapping the client in the {webui}:
ca: Concedeix l'accés [command].sudoudo a l'usuari afegint aquesta línia al final del fitxer [filename].sudoers.. Reemplaça [systemitem] {<user> the amb el nom de l'usuari que està arrencant el client a {webui}:
ja: この行を[filename]``sudoers``ファイルの末尾に追加して[command]``sudo``アクセス権をユーザに付与します。 {webui}でクライアントをブートストラップしているユーザの名前で[systemitem]``<user>``を置き換えます。
ko: 이 줄을 [filename]``sudoers`` 파일 끝에 추가하여 사용자에게 [command]``sudo`` 액세스 권한을 부여합니다. 다음과 같이 [systemitem]``<user>``를 {webui}에서 클라이언트를 부트스트래핑하고 있는 사용자의 이름으로 교체합니다.
zh_cn: 在 [filename]``sudoers`` 文件末尾添加下面一行，以向用户授予 [command]``sudo`` 访问权限。以在 {webui} 中引导客户端的用户的名称替换 [systemitem]``<user>``：

source: This procedure grants root access without requiring a password, which is required for registering the client. When the client is successfully installed it runs with root privileges, so the access is no longer required. We recommend that you remove the line from the [path]``sudoers`` file after the client has been successfully installed.
ca: Aquest procediment permet l'accés root sense necessitat d'una contrasenya, que és necessària per registrar el client. Quan el client s'instal·la correctament s'executa amb privilegis de root, de manera que l'accés ja no és necessari. Us recomanem que suprimiu la línia del fitxer [path].sudoers. després que el client s'hagi instal·lat correctament.
ja: このプロシージャによりrootアクセス権が付与されます。クライアントの登録に必要なパスワードは不要です。 クライアントは正常にインストールされると、root特権で実行されるため、アクセス権は不要です。 クライアントを正しくインストールした後、[path]``sudoers``ファイルからこの行を削除することをお勧めします。
ko: 이 절차는 클라이언트 등록에 필요한 비밀번호가 없어도 루트에 액세스 권한을 부여합니다. 클라이언트는 성공적으로 설치된 후 루트 권한으로 실행되므로 액세스 권한이 더 이상 필요 없습니다. 클라이언트가 성공적으로 설치된 후 [path]``sudoers`` 파일에서 이 줄을 제거하는 것이 좋습니다.
zh_cn: 此过程无需口令便可授予 root 访问权限，而注册客户端需要提供口令。客户端成功安装后会以 root 特权运行，因此将不再需要该访问权限。客户端成功安装之后，建议您从 [path]``sudoers`` 文件中去除该行。

source: Registering {oes} Clients
ca: S'estan registrant {sle} clients

source: This section contains information about registering clients running {oes} operating systems.
ca: Aquesta secció conté informació sobre el registre de clients de Salt que executen sistemes operatius {rocky}.

source: Before you register {oes} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de registrar {sle} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.

source: OES Products - WebUI
ca: Productes ES - WebUI

source: | OS Version | Product Name | {oes} 24.4 | Open Enterprise Server 24.4 x86_64 | {oes} 23.4 | Open Enterprise Server 23.4 x86_64
ca: Versió del SO Nom del producte {oes} 24.4 Open Enterprise Server 24.4 x8664 {oes} 23,4 Open Enterprise Server 23.4 x8664

source: OES Products - CLI
ca: Productes SLE - CLI

source: | OS Version | Base Channel | Name | {oes} 24.4 | oes24.4-pool-x86_64 | OES24.4-Pool for x86_64 | {oes} 23.4 | oes23.4-pool-x86_64" | OES23.4-Pool for x86_64
ca: Versió del SO Canal base Nom {oes} 24.4 oes24.4-pool-x8664 for OES24.4-Pool per a x8664 {oes} 23,4 oes23.4-pool-x8664" for OES23.4-Pool per a x8664

source: To find channel names of older products, at the command prompt on the {productname} Server, as root, use the [command]``mgr-sync`` command:
ca: Per a trobar els noms dels canals dels productes antics, a l'indicador d'ordres del servidor {productname}, com a root, utilitzeu l'ordre [command]:mgr-sync::
ja: 古い製品のチャンネル名を見つけるには、{productname}サーバのコマンドプロンプトで root になり、[command]``mgr-sync``コマンドを使用します:
ko: 이전 제품의 채널 이름을 찾으려면 {productname} 서버의 명령 프롬프트에서 루트 권한으로 [command]``mgr-sync`` 명령을 사용합니다.
zh_cn: 要查找较旧产品的通道名称，请在 {productname} 服务器上的命令提示符处以 root 身份使用 [command]``mgr-sync`` 命令：

source: Then specify the argument you are interested in. For example, [literal]``channels``:
ca: A continuació, especifiqueu l'argument que us interessa. Per exemple, [literal]:canals::
ja: 次に、関心のある引数を指定します。たとえば、[literal]``channels``を指定します:
ko: 그런 다음 원하는 인수를 지정합니다. 예를 들어, [literal]``channels``:
zh_cn: 然后指定您感兴趣的参数，例如 [literal]``channels``：

source: mgr-sync list channels [-c]
ca: mgr-sync llista els canals [-c]

source: To add the client tools, add these channels from the command prompt:
ca: Per a afegir les eines del client, afegiu aquests canals des de l'indicador d'ordres:
ja: クライアントツールを追加するには、コマンドプロンプトからこれらのチャンネルを追加します。
ko: 클라이언트 도구를 추가하려면 명령 프롬프트에서 다음 채널을 추가합니다.
zh_cn: 要添加客户端工具，请在命令提示符处添加以下通道：

source: Open Enterprise Channels - CLI
ca: Canals SUSE Linux Enterprise - CLI

source: | OS Version | Client Channel | Updates | {oes} 24.4 | oes24.4-sle-manager-tools15-pool-x86_64 | oes24.4-sle-manager-tools15-updates-x86_64 | {oes} 23.4 | oes23.4-sle-manager-tools15-pool-x86_64 | oes23.4-sle-manager-tools15-updates-x86_64
ca: Versió del SO Canal client s Actualitzacions {oes} 24.4 oes24.4-sle-manager-tools15-pool-x8664 oes24.4-sle-manager-tools15-updates-x8664 {oes} 23,4 oes23.4-sle-manager-tools15-pool-x8664 oes23.4-sle-manager-tools15-updates-x8664

source: {sle} channels can be very large. Synchronization can sometimes take several hours.
ca: {sle} canals poden ser molt grans. La sincronització de vegades pot trigar diverses hores.
ja: {sle}チャンネルは非常に大きいことがあります。 同期に数時間かかる場合があります。
ko: {sle} 채널은 규모가 매우 클 수 있습니다. 때로 동기화에 몇 시간이 걸릴 수 있습니다.
zh_cn: {sle} 通道可能会非常大。同步所需的时间可能会长达数小时。

source: Registering {openeuler} Clients
ca: S'estan registrant {sle} clients

source: This section contains information about registering clients running {openeuler} operating systems.
ca: Aquesta secció conté informació sobre el registre de clients que executen sistemes operatius {openeuler}.

source: {openeuler} repository URLs are available from {scclongform}.
ca: Les URL del repositori {openeuler} estan disponibles a {scclongform}.

source: Packages and metadata are provided by the OpenAtom Foundation, not by {suse}.
ca: Els paquets i les metadades els proporciona l'OpenAtom Foundation, no {suse}.

source: For supported products, see the support table and the release notes.
ca: Per als productes compatibles, consulteu la taula de compatibilitat i les notes de la versió.

source: When created at AWS, {openeuler} instances always have the same `machine-id` id at `/etc/machine-id`. Make sure you regenerate the `machine-id` after the instance is created. For more information, see xref:administration:troubleshooting/tshoot-registerclones.adoc[].
ca: Quan es crea a AWS, les instàncies {openeuler} sempre tenen el mateix idmachine-id. id a ,/etc/machine-id.. Assegureu-vos de regenerar el .machine-id. després de crear la instància. Per a més informació, vegeu xref:administration:troubleshooting/tshoot-registerclones.adoc[].

source: Before you register {openeuler} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de registrar {opensuse} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.

source: The architectures currently supported are: `x86_64` and `aarch64`.
ca: Les arquitectures actualment compatibles són x86_64 i aarch64.

source: {openeuler} Products - {webui}
ca: Productes {openeuler} - {webui}

source: | OS Version | Product Name | {openeuler} 24.03 | {openeuler} 24.03-LTS-SP1 (Tech Preview)
ca: | Versió del sistema operatiu | Nom del producte | {openeuler} 24.03 | {openeuler} 24.03-LTS-SP1 (Previsualització tècnica)

source: {openeuler} Channels - CLI
ca: Canals {openeuler} - CLI

source: | OS Version | Base Channel | {openeuler} 24.03 | openeuler2403-sp1-pool-x86_64
ca: | Versió del sistema operatiu | Canal base | {openeuler} 24.03 | openeuler2403-sp1-pool-x86_64

source: openEuler Channels - CLI
ca: Canals ES - CLI

source: | OS Version | Core Channel | Client Channel | Update Channel | EPOL Channel | Everything Channel | {openeuler} 22.03 | openeuler2203 | openeuler2203-uyuni-client | openeuler2203-update | openeuler2203-epol | openeuler2203-everything
ca: Versió del SO Canal central Canal client Actualitza el canal Canal EPOL Tot el canal {openeuler} 22,03 openeuler2203 openeuler2203-uyuni-client openeuler2203-update openeuler2203-epol openeuler2203-tot

source: You need to create an activation key that is associated with your {openeuler} channels.
ca: Heu de crear una clau d'activació que estigui associada als vostres canals {oracle}.
