Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: ``<general>$SNIPPET('spacewalk/sles_no_signature_checks')</general>` disables signature checks
ca: {<general>$SNIPPET('spacewalk/slesnosignaturechecks')</general>s inhabilita les comprovacions de signatura
ja: ``<general>$SNIPPET('spacewalk/sles_no_signature_checks')</general>``は、署名のチェックを無効にします。
ko: ``<general>$SNIPPET('spacewalk/sles_no_signature_checks')</general>``은 서명 확인을 비활성화합니다.
zh_cn: ``<general>$SNIPPET('spacewalk/sles_no_signature_checks')</general>`` 禁用签名检查

source: ``<software>`` allows to specify product for the {unifiedinstaller}
ca: to<software> to permet especificar el producte per al {unifiedinstaller}
ja: ``<software>``によって、{unifiedinstaller}に製品を指定できます。
ko: ``<software>``를 사용하면 {unifiedinstaller}에 제품을 지정할 수 있습니다.
zh_cn: ``<software>`` 用于为 {unifiedinstaller} 指定产品

source: See https://doc.opensuse.org/projects/autoyast/#CreateProfile-Software with a "<software>" example
ca: Vegeu https://doc.opensuse.org/projects/autoyast/ aCreateProfile-Software amb un exemple "<software>"

source: ``<init-scripts config:type="list">$SNIPPET('spacewalk/minion_script')</init-scripts>`` allows the client to register to {productname} as a Salt client.
ca: <init-scripts config:type="list"> $SNIPPET('spacewalk/slesregisterscript') </init-scripts>
ja: ``<init-scripts config:type="list">$SNIPPET('spacewalk/minion_script ')</init-scripts>``は、クライアントをSaltクライアントとして{productname}に登録できるようにします。
ko: ``<init-scripts config:type="list">$SNIPPET('spacewalk/minion_script')</init-scripts>`` 을 사용하면 클라이언트가 {productname}를 Salt client로 등록할 수 있습니다.
zh_cn: ``<init-scripts config:type="list">$SNIPPET('spacewalk/minion_script')</init-scripts>`` 用于将客户端作为 Salt 客户端注册到 {productname}。

source: ``<pre-scripts config:type="list">$SNIPPET('spacewalk/root_ca')</pre-scripts>`` will copy and deploy the server SSL CA certificate on the new machine.
ca: <pre-scripts config:type="list">$SNIPPET('spacewalk/root_ca')</pre-scripts> copiarà i implementarà el certificat SSLCA del servidor a la nova màquina.

source: ``<add-on><add_on_products config:type="list">$SNIPPET('spacewalk/autoyast_channels')</add_on_products></add-on>`` automatically adds all the channels of the selected distribution as sources. For more information about {ay}, see https://doc.opensuse.org/projects/autoyast/.
ca: <add-on><add_on_products config:type="list">$SNIPPET('spacewalk/autoyast_channels')</add_on_products></add-on> afegeix automàticament tots els canals de la distribució seleccionada com a fonts. Per obtenir més informació sobre {ay}, consulteu https://doc.opensuse.org/projects/autoyast/.

source: A more recent, {salt}-based alternative to {ay}, is Yomi. For information about Yomi, see xref:specialized-guides:salt/salt-yomi.adoc[Install with Yomi].
ca: Una alternativa més recent, basada en {salt} a {ay}, és Yomi. Per a informació sobre Yomi, vegeu xref: Specialized-guides:salt/salt-yomi.adoc[Instal·la amb Yomi].

source: Kickstart Profiles
ca: Perfils del Kickstart

source: {kickstart} profiles offer a large number of configuration options. To create these profiles, you can upload them, or use a dedicated wizard.
ca: Els perfils de {kickstart} ofereixen un gran nombre d'opcions de configuració. Per a crear aquests perfils, podeu pujar-los, o utilitzar un assistent dedicat.
ja: {kickstart}プロファイルには、多数の設定オプションがあります。 プロファイルを作成するには、プロファイルをアップロードするか、専用のウィザードを使用します。
ko: {kickstart} 프로파일은 매우 다양한 구성 옵션을 제공합니다. 이러한 프로파일을 생성하려면 해당 프로파일을 업로드하거나 전용 마법사를 사용합니다.
zh_cn: {kickstart} 配置文件提供了大量配置选项。要创建这些配置文件，您可以上载它们，也可以使用专用向导。

source: {kickstart} profiles allow you to use file preservation lists. If you have many custom configuration files located on a client you want to reinstall with {kickstart}, you can save them as a list, and associate that list with the {kickstart} profile.
ca: Els perfils de {kickstart} us permeten utilitzar llistes de preservació de fitxers. Si teniu molts fitxers de configuració personalitzats ubicats en un client que voleu reinstal·lar amb {kickstart}, podeu desar-los com una llista i associar aquesta llista amb el perfil {kickstart}.
ja: {kickstart}プロファイルでは、ファイル保持一覧を使用できます。 {kickstart}で再インストールするクライアントにあるカスタム設定ファイルが多数ある場合、リストにしてこれらのファイルを保存し、そのリストを{kickstart}プロファイルに関連付けることができます。
ko: {kickstart} 프로파일을 사용하면 파일 보관 목록을 사용할 수 있습니다. {kickstart}를 사용하여 다시 설치할 클라이언트에 사용자 정의 구성 파일이 여러 개 있는 경우 해당 파일을 목록으로 저장하고 사용할 {kickstart} 프로파일과 이 목록을 연결할 수 있습니다.
zh_cn: {kickstart} 配置文件允许您使用文件保留列表。如果您有许多自定义配置文件位于要使用 {kickstart} 重新安装的客户端上，则可以将它们保存为列表，并将该列表与 {kickstart} 配置文件相关联。

source: Procedure: Creating a File Preservation List
ca: Procediment: Creació d'una llista de preservació de fitxers

source: In the {productname} {webui}, navigate to menu:Systems[Autoinstallation > File Preservation] and click btn:[Create File Preservation List].
ca: A la {productname} {webui}, navegueu a menu:Systems[Autoinstallation ]. File Preservation] i feu clic a btn:[Create File Preservation List].
ja: {productname}の{webui}で、menu:システム[自動インストール > ファイル保持]に移動し、btn:[ファイル保持一覧の作成]をクリックします。
ko: {productname} {webui}에서 menu:시스템[자동 설치 > 파일 보관]으로 이동하여 btn:[파일 유지 목록 생성]을 클릭합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[自动安装 > 文件保留]，然后单击 btn:[创建文件保留列表]。

source: Enter a suitable label, and list absolute paths to all files and directories you want to save.
ca: Introduïu una etiqueta adequada i llisteu els camins absoluts a tots els fitxers i directoris que vulgueu desar.
ja: 適切なラベルを入力し、保存するすべてのファイルおよびディレクトリへの絶対パスをリストします。
ko: 적절한 레이블을 입력하고 저장하려는 모든 파일 및 디렉토리의 절대 경로를 나열합니다.
zh_cn: 输入适当的标签，并列出要保存的所有文件和目录的绝对路径。

source: Click btn:[Create List].
ca: Feu clic a btn:[Crea llista].
ja: btn:[一覧の作成]をクリックします。
ko: btn:[목록 생성]을 클릭합니다.
zh_cn: 单击 btn:[创建列表]。

source: Include the file preservation list in your {kickstart} profile.
ca: Incloeu la llista de preservació de fitxers al vostre perfil {kickstart}.
ja: {kickstart}プロファイルにファイル保持一覧を含めます。
ko: {kickstart} 프로파일에 파일 보관 목록을 포함시킵니다.
zh_cn: 将该文件保留列表包含到 {kickstart} 配置文件中。

source: Navigate to menu:Systems[Autoinstallation > Profiles] and select the profile you want to edit, go to the menu:System Details[File Preservation] subtab, and select the file preservation list to include.
ca: Navega al menú:Sistemes[Autoinstal·lació . Perfils] i selecciona el perfil que vols editar, ves al menú:Detalls del sistema[Preservació del fitxer] subtab, i selecciona la llista de preservació de fitxers a incloure.
ja: menu:システム[自動インストール > プロファイル]に移動して編集するプロファイルを選択し、menu:システムの詳細[ファイル保持]サブタブに移動して、含めるファイル保持一覧を選択します。
ko: menu:시스템[자동 설치 > 프로파일]로 이동한 후 편집할 프로파일을 선택하고 menu:시스템 세부 정보[파일 보관] 하위 탭으로 이동하여 포함할 파일 보관 목록을 선택합니다.
zh_cn: 导航到menu:系统[自动安装 > 配置文件]，选择要编辑的配置文件，转到menu:系统细节[文件保留]子选项卡，然后选择要包含的文件保留列表。

source: File preservation lists are limited to a total size of 1{nbsp}MB. Special devices like [path]``/dev/hda1`` and [path]``/dev/sda1`` cannot be preserved. Only use file and directory names, you cannot use regular expression wildcards.
ca: Les llistes de preservació de fitxers estan limitades a una mida total de 1{nbsp} MB. No es poden conservar dispositius especials com [path]./dev/hda1. i [path]./dev/sda1.. Utilitzeu només els noms de fitxer i directori, no podeu utilitzar comodins d'expressió regular.
ja: ファイル保持一覧の合計サイズは1{nbsp}MBに制限されています。 [path]``/dev/hda1``や[path]``/dev/sda1``などの特殊なデバイスは保持できません。 ファイル名とディレクトリ名のみ使用できます。正規表現のワイルドカードは使用できません。
ko: 파일 유지 목록은 전체 크기가 1{nbsp}MB로 제한됩니다. [path]``/dev/hda1`` 및 [path]``/dev/sda1``과 같은 특수 장치는 보관할 수 없습니다. 파일 및 디렉토리 이름만 사용하십시오. 정규식 와일드카드는 사용할 수 없습니다.
zh_cn: 文件保留列表总大小上限为 1{nbsp}MB。[path]``/dev/hda1`` 和 [path]``/dev/sda1`` 等特殊设备无法保留。只能使用文件名和目录名，不能使用正则表达式通配符。

source: For more information about Kickstart, see the Red Hat documentation.
ca: Per a més informació sobre Kickstart, vegeu la documentació de Red Hat.
ja: Kickstartの詳細については、Red Hatのドキュメントを参照してください。
ko: Kickstart에 대한 자세한 설명은 Red Hat 문서를 참조하십시오.
zh_cn: 有关 Kickstart 的详细信息，请参见 Red Hat 文档。

source: Templates Syntax
ca: Sintaxi de plantilles

source: Parts of your installation file are replaced during the installation. Variables are replaced with single values, and code snippets are replaced with whole sections of text. Escaped symbols or sections are not replaced.
ca: Parts del fitxer d'instal·lació es reemplacen durant la instal·lació. Les variables se substitueixen per valors únics, i els fragments de codi se substitueixen per seccions senceres de text. Els símbols o seccions escapades no es reemplacen.
ja: インストールファイルの一部は、インストール中に置き換えられます。 変数は単一の値に置き換えられ、コードスニペットはテキストのセクション全体に置き換えられます。 エスケープされた記号やセクションは置き換えられません。
ko: 설치 파일의 일부는 설치 중에 대체됩니다. 변수는 단일 값으로 대체되며 코드 조각은 텍스트의 전체 섹션으로 대체됩니다. 이스케이프된 기호 또는 섹션은 대체되지 않습니다.
zh_cn: 安装文件的部分内容在安装过程中会被替换。变量会被替换为相应的单个值，代码段会被替换为整段文本。转义符或转义部分不会被替换。

source: A template engine called Cheetah allows {cobbler} to do these replacements. This mechanism allows you to reinstall large numbers of systems, without having to manually create profiles for each of them.
ca: Un motor de plantilla anomenat Cheetah permet que {cobbler} faci aquests reemplaçaments. Aquest mecanisme permet reinstal·lar un gran nombre de sistemes, sense haver de crear manualment perfils per a cadascun d'ells.
ko: Cheetah라는 템플릿 엔진을 사용하면 {cobbler}가 해당 대체를 수행할 수 있습니다. 이 방식을 통해 각각에 대한 프로파일을 수동으로 생성할 필요 없이 대량의 시스템을 다시 설치할 수 있습니다.
zh_cn: 名为 Cheetah 的模板引擎允许 {cobbler} 进行这些替换。利用此机制，您在重新安装大量系统时就无需为每个系统手动创建配置文件。

source: You can create autoinstallation variables and code snippets within the {productname} {webui}. Within a profile, the [guimenu]``Autoinstallation File`` tab allows you to see the result of the substitutions.
ca: Podeu crear variables d'autoinstal·lació i fragments de codi dins de {productname} {webui}. Dins d'un perfil, la pestanya [guimenu].Fitxer d'autoinstal·lació. permet veure el resultat de les substitucions.
ja: 自動インストールの変数やコードスニペットは、{productname} {webui}内で作成できます。 プロファイル内の［[guimenu]``自動インストールファイル``］タブでは、置き換えの結果を確認できます。
ko: {productname} {webui}에서 자동 설치 변수 및 코드 조각을 생성할 수 있습니다. 프로파일의 [guimenu]``자동 설치 파일`` 탭을 사용하면 대체 결과를 확인할 수 있습니다.
zh_cn: 您可以在 {productname} {webui} 中创建自动安装变量和代码段。在配置文件中，[guimenu]``自动安装文件``选项卡可让您查看替换的结果。

source: For information about variables, see xref:client-configuration:autoinst-profiles#variables[Variables].
ca: Per obtenir informació sobre els perfils {kickstart}, vegeu xref:client-configuration:autoinst-profiles.adoc].kickstart[Kickstart Profiles].
ja: 変数については、xref:client-configuration:autoinst-profiles#variables[変数]を参照してください。
ko: 변수에 대한 설명은 xref:client-configuration:autoinst-profiles#variables[변수]를 참조하십시오.
zh_cn: 有关变量的信息，请参见xref:client-configuration:autoinst-profiles#variables[变量]。

source: For information about code snippets, see xref:client-configuration:autoinst-profiles#code-snippets[Code Snippets].
ca: Per obtenir informació sobre els perfils {kickstart}, vegeu xref:client-configuration:autoinst-profiles.adoc].kickstart[Kickstart Profiles].
ja: コードスニペットについては、xref:client-configuration:autoinst-profiles#code-snippets[コードスニペット]を参照してください。
ko: 코드 조각에 대한 설명은 xref:client-configuration:autoinst-profiles#code-snippets[코드 조각]을 참조하십시오.
zh_cn: 有关代码段的信息，请参见xref:client-configuration:autoinst-profiles#code-snippets[代码段]。

source: For information about escaping symbols or text blocks, see xref:client-configuration:autoinst-profiles#escaping[Escaping].
ca: Per obtenir informació sobre els perfils {kickstart}, vegeu xref:client-configuration:autoinst-profiles.adoc].kickstart[Kickstart Profiles].
ja: エスケープ記号またはテキストブロックについては、xref:client-configuration:autoinst-profiles#escaping[エスケープ]を参照してください。
ko: 이스케이프 기호 또는 텍스트 블록에 대한 설명은 xref:client-configuration:autoinst-profiles#escaping[이스케이핑]을 참조하십시오.
zh_cn: 有关转义符或文本块的信息，请参见xref:client-configuration:autoinst-profiles#escaping[转义]。

source: Autoinstallation variables can be used to substitute values into {kickstart} and {ay} profiles. To define a variable, from the profile, navigate to the [guimenu]``Variables`` subtab, and create a [replaceable]``name=value`` pair in the text box.
ca: Les variables d'autoinstal·lació es poden utilitzar per substituir valors en perfils {kickstart} i {ay}. Per definir una variable, des del perfil, navegueu a la subtab [guimenu].Variables. i creeu un parell [reemplaçable].nom.valor. en el quadre de text.
ja: 自動インストールの変数は、{kickstart}プロファイルおよび{ay}プロファイルに値を代入するために使用できます。 変数を定義するには、プロファイルから［[guimenu]``変数``］サブタブに移動し、テキストボックスで[replaceable]``name=value``ペアを作成します。
ko: 자동 설치 변수를 사용해 값을 {kickstart} 및 {ay} 프로파일로 대신할 수 있습니다. 변수를 정의하려면 프로파일에서 [guimenu]``변수`` 하위 탭으로 이동하여 텍스트 상자에서 [replaceable]``name=value`` 쌍을 생성합니다.
zh_cn: 可以使用自动安装变量来替换 {kickstart} 和 {ay} 配置文件中的值。要定义变量，请从配置文件中导航到[guimenu]``变量``子选项卡，然后在文本框中创建 [replaceable]``name=value`` 对。

source: For example, you could create a variable that holds the IP address of the client, and another that holds the address of its gateway. Those variables can then be defined for all the clients installed from the same profile. To do that, add these lines to the [guimenu]``Variables`` text box:
ca: Per exemple, es podria crear una variable que contingui l'adreça IP del client, i una altra que contingui l'adreça de la seva passarel·la. Aquestes variables es poden definir per a tots els clients instal·lats des del mateix perfil. Per a fer-ho, afegiu aquestes línies al quadre de text [guimenu] theVariables::
ja: たとえば、クライアントのIPアドレスを格納する変数と、ゲートウェイのアドレスを格納する変数を作成できます。 次に、作成した変数は、同じプロファイルからインストールされるすべてのクライアントに対して定義できます。 このためには、［[guimenu]``変数``］テキストボックスに次の行を追加します。
ko: 예를 들어, 클라이언트의 IP 주소를 가진 변수와 게이트웨이의 주소를 가진 변수를 생성할 수 있습니다. 그러면 이러한 변수를 동일한 프로파일에서 설치된 모든 클라이언트에 대해 정의할 수 있습니다. 이 작업을 수행하려면 [guimenu]``변수`` 텍스트 상자에 다음 줄을 추가합니다.
zh_cn: 例如，您可以创建一个变量来存储客户端的 IP 地址，创建另一个变量来存储其网关的地址。然后可以为通过同一配置文件安装的所有客户端定义这些变量。要执行此操作，请将下面几行添加到[guimenu]``变量``文本框中：

source: To use the variable, prepend a [option]``$`` sign in the profile to substitute the value. For example, the [option]``network`` part of a {kickstart} file may look like the following:
ca: Per utilitzar la variable, prem un signe [option].$. al perfil per substituir el valor. Per exemple, la part [option] thenetwork of d'un fitxer {kickstart} pot semblar la següent:
ja: 変数を使用するには、プロファイルで値の前に[option]``$``記号を付けて値を代入します。 たとえば、{kickstart}ファイルの［[option]``ネットワーク``］部分は次のようになることがあります。
ko: 변수를 사용하려면 프로파일에서 [option]``$`` 기호를 앞에 추가하여 변수를 대체합니다. 예를 들어, {kickstart} 파일의 [option]``네트워크`` 부분은 다음과 같습니다.
zh_cn: 要使用变量，请在配置文件中附加一个 [option]``$`` 符号来替换相应值。例如，{kickstart} 文件的 [option]``network`` 部分可能如下所示：

source: network --bootproto=static --device=eth0 --onboot=on --ip=$ipaddr \ --gateway=$gateway
ca: network --bootproto --static --device0eth0 --onboot --on --ip \$ipaddr \ --gateway=$gateway

source: The [option]``$ipaddr`` is resolved to ``192.168.0.28``, and the [option]``$gateway`` to ``192.168.0.1``.
ca: La [opció].$ipaddr. es resol a 19192.168.0.28., i la [opció].$gateway. a .192.168.0.1..
ja: [option]``$ipaddr``は``192.168.0.28``に解決され、[option]``$gateway``は``192.168.0.1``に解決されます。
ko: [option]``$ipaddr``은 ``192.168.0.28``로, [option]``$gateway``는 ``192.168.0.1``로 확인됩니다.
zh_cn: [option]``$ipaddr`` 会解析为 ``192.168.0.28``，[option]``$gateway`` 会解析为 ``192.168.0.1``。

source: In installation files, variables use a hierarchy. System variables take precedence over profile variables, which in turn take precedence over distribution variables.
ca: En els fitxers d'instal·lació, les variables utilitzen una jerarquia. Les variables del sistema tenen prioritat sobre les variables de perfil, que al seu torn tenen prioritat sobre les variables de distribució.
ja: インストールファイルでは、変数は階層的に使用します。 システム変数はプロファイル変数より優先され、プロファイル変数はディストリビューション変数より優先されます。
ko: 설치 파일에서 변수는 계층 구조를 사용합니다. 시스템 변수는 프로파일 변수에 우선하고, 프로파일 변수는 배포 변수에 우선합니다.
zh_cn: 在安装文件中，变量使用层次结构。系统变量优先于配置文件变量，而配置文件变量优先于发行套件变量。

source: Code Snippets
ca: Retalls de codi

source: {productname} comes with a large number of predefined code snippets. Navigate to menu:Systems[Autoinstallation > Autoinstallation Snippets] to see the list of existing snippets.
ca: {productname} ve amb un gran nombre de fragments de codi predefinits. Navega al menú:Systems[Autoinstallation . Autoinstallation Snippets] per veure la llista de fragments existents.
ko: {productname}는 미리 정의된 다양한 코드 조각과 함께 제공됩니다. menu:시스템[자동 설치 > 자동 설치 조각]으로 이동하여 기존 조각의 목록을 확인합니다.
zh_cn: {productname} 附带了大量预定义的代码段。导航到menu:系统[自动安装 > 自动安装代码段]，以查看现有代码段列表。

source: Use a snippet by inserting the [option]``$SNIPPET()`` macro in your autoinstallation file. For example, in {kickstart}:
ca: Utilitzeu un fragment inserint la macro [option].$SNIPPET(). al fitxer d'autoinstal·lació. Per exemple, a {kickstart}:
ja: 自動インストールファイルの[option]``$SNIPPET()``マクロに挿入してスニペットを使用します。 たとえば、{kickstart}では次のようになります。
ko: 자동 설치 파일에 [option]``$SNIPPET()`` 매크로를 삽입하여 코드 조각을 사용합니다. 예를 들어, {kickstart}에서는 다음과 같습니다.
zh_cn: 通过在自动安装文件中插入 [option]``$SNIPPET()`` 宏来使用代码段。例如，在 {kickstart} 中，插入该宏：

source: $SNIPPET('spacewalk/redhat_register_using_salt')
ca: $SNIPPET('spacewalk/rhelregisterscript')

source: Or, in {ay}:
ca: O, en {ay}:
ja: または、{ay}では次のようになります。
ko: 또는 {ay}에서는 다음과 같습니다.
zh_cn: 或者，在 {ay} 中，插入该宏：

source: <init-scripts config:type="list"> $SNIPPET('spacewalk/minion_script') </init-scripts>
ca: <init-scripts config:type="list"> $SNIPPET('spacewalk/slesregisterscript') </init-scripts>

source: The macro is parsed by {cobbler} and substituted with the contents of the snippet. You can also store your own code snippets to use in autoinstallation files later on. Click btn:[Create Snippet] to create a new code snippet.
ca: La macro és analitzada per {cobbler} i substituïda pel contingut del fragment. També podeu emmagatzemar els vostres propis fragments de codi per utilitzar-los en fitxers d'instal·lació automàtica més endavant. Feu clic a btn:[Crea un fragment] per a crear un fragment de codi nou.
ko: 매크로는 {cobbler}로 구문 분석되고 코드 조각의 컨텐트로 대체됩니다. 또한 나중에 자동 설치 파일에서 사용할 자체 코드 조각을 저장할 수 있습니다. btn:[조각 생성]을 클릭하여 새 코드 조각을 생성하십시오.
zh_cn: 宏会经过 {cobbler} 的分析，并会替换为代码段的内容。您还可以存储自己的代码段，以供日后在自动安装文件中使用。单击 btn:[创建代码段] 以创建新代码段。

source: This example sets up a {kickstart} snippet for a common hard drive partition configuration:
ca: Aquest exemple configura un fragment {kickstart} per a una configuració de partició de disc dur comú:
ja: この例では、一般的なハードドライブのパーティション設定の{kickstart}スニペットが設定されます。
ko: 다음 예에서는 일반 하드 드라이브 파티션 구성에 대한 {kickstart} 코드 조각을 다음과 같이 설정합니다.
zh_cn: 下面的示例设置了通用硬盘分区配置的 {kickstart} 代码段：

source: clearpart --all part /boot --fstype ext3 --size=150 --asprimary part / --fstype ext3 --size=40000 --asprimary part swap --recommended
ca: clearpart --all part /boot --fstype ext3 --size150150 --asprimary part / --fstype ext3 --size40040000 --asprimary part d'intercanvi --recomanada

source: part pv.00 --size=1 --grow
ca: part pv.00 --size11 --grow

source: volgroup vg00 pv.00 logvol /var --name=var vgname=vg00 --fstype ext3 --size=5000
ca: volgroup vg00 pv.00 logvol /var --name --var vgname=vg00 --fstype ext3 --size505000

source: Use the snippet with, for example:
ca: Utilitzeu el fragment amb, per exemple:
ja: たとえば、次のようにスニペットを使用します。
ko: 예를 들어, 다음과 같이 코드 조각을 사용합니다.
zh_cn: 下面是使用该代码段的一个示例：

source: $SNIPPET('my_partition')
ca: $SNIPPET('la meva partició')

source: Escaping
ca: Escapada
ja: エスケープ
ko: 이스케이핑
zh_cn: 转义

source: If the autoinstallation file contains shell script variables like ``$(example)``, the content needs to be escaped with a backslash: ``\$(example)``. Escaping the ``$`` symbol prevents the templating engine from evaluating the symbol as an internal variable.
ca: Si el fitxer d'autoinstal·lació conté variables de script de l'intèrpret d'ordres com $$(exemple)., el contingut s'ha d'escapar amb una barra inversa: .\$(exemple).. En escapar del símbol .$. s'evita que el motor de templating avaluï el símbol com una variable interna.
ja: 自動インストールファイルには、``$(example)``のようなシェルスクリプト変数が含まれています。コンテンツはバックスラッシュ(円記号)でエスケープする必要があります``\$(example)``。 ``$``記号をエスケープすると、テンプレートエンジンは記号を内部変数として評価しなくなります。
ko: 자동 설치 파일에 ``$(example)``와(과) 같은 셸 스크립트 변수가 포함된 경우 백슬래시를 사용하여 컨텐트를 이스케이프해야 합니다. ``\$(example)``. ``$`` 기호를 이스케이프하면 템플릿 엔진이 기호를 내부 변수로 평가하지 못하게 됩니다.
zh_cn: 如果自动安装文件包含 ``$(example)`` 这样的外壳脚本变量，则需要使用反斜杠对内容进行转义：``\$(example)``。对 ``$`` 符号进行转义可防止模板引擎将该符号评估为内部变量。

source: Text blocks such as code fragments or scripts can be escaped by wrapping them with the ``\#raw`` and ``\#end raw`` directives. For example:
ca: Els blocs de text com ara fragments de codi o scripts es poden escapar ajustant-los amb les directives and\.raw. i and\.end raw.. Per exemple:
ja: コードフラグメントやスクリプトなどのテキストブロックは、``\#raw``ディレクティブおよび``\#end raw``ディレクティブで囲むことによってエスケープできます。 次に例を示します。
ko: 코드 조각이나 스크립트와 같은 텍스트 블록은 ``\#raw`` 및 ``\#end raw`` 지시어로 래핑하여 이스케이프할 수 있습니다. 예:
zh_cn: 可以使用 ``\#raw`` 和 ``\#end raw`` 指令封装代码段或脚本等文本块，从而对其转义。例如：

source: #raw #!/bin/bash for i in {0..2}; do echo "$i - Hello World!" done #end raw
ca: raw !/bin/bash per i a {0..2}; fes eco "$i - Hello World!" fet end raw

source: Any line with a ``#`` symbol followed by a whitespace is treated as a comment and is therefore not evaluated. For example:
ca: Qualsevol línia amb un símbol . seguit d'un espai en blanc es tracta com un comentari i, per tant, no s'avalua. Per exemple:
ja: ``#``記号の後にスペースがある行はコメントとして扱われるため、評価されません。 次に例を示します。
ko: ``#`` 기호 다음에 공백이 있는 모든 줄은 주석으로 취급되므로 평가되지 않습니다. 예:
zh_cn: 所有包含 ``#`` 符号后接空格的行均视为注释行，因此不会对其进行评估。例如：

source: # start some section (this is a comment) echo "Hello, world" # end some section (this is a comment)
ca: ) comença una secció (aquest és un comentari) eco "Hola, món" ) acaba alguna secció (aquest és un comentari)
ko: # 특정 섹션 시작(주석임) echo "Hello, world" # 특정 섹션 종료(주석임)
zh_cn: # start some section（此为注释） echo "Hello, world" # end some section（此为注释）

source: Reinstall Registered Systems
ca: Torna a instal·lar els sistemes registrats
ja: 登録済みシステムを再インストールする
ko: 등록된 시스템 재설치
zh_cn: 重新安装已注册系统

source: The in-place reinstallation starts from the local client system. There is therefore no need for the client to be able to boot over network with PXE.
ca: La reinstal·lació in-place comença des del sistema de client local. Per tant, no cal que el client pugui arrencar per xarxa amb PXE.
ja: インプレースでの再インストールは、ローカルクライアントシステムから開始します。 したがって、クライアントがネットワークを通じてPXEブートを実行できる必要はありません。
ko: 현재 위치 다시 설치는 로컬 클라이언트 시스템에서 시작됩니다. 따라서 PXE를 사용하여 네트워크에서 클라이언트를 부팅할 필요가 없습니다.
zh_cn: 就地重新安装从本地客户端系统开始。因此，客户端不需要具有使用 PXE 通过网络引导的能力。

source: To reinstall a registered client in-place, you must define an autoinstallable distribution and an autoinstallation profile. For information, see xref:client-configuration:autoinst-distributions.adoc[Autoinstallable Distributions] and xref:client-configuration:autoinst-profiles.adoc[Autoinstallation Profiles].
ca: Per reinstal·lar un client registrat en el lloc, heu de definir una distribució autoinstal·lable i un perfil d'autoinstal·lació. Per obtenir informació, vegeu xref:client-configuration:autoinst-distributions.adoc[Autoinstallable Distributions] i xref:client-configuration:autoinst-profiles.adoc[Autoinstallation Profiles].
ja: 登録済みのクライアントをインプレースで再インストールするには、自動インストールのディストリビューションと自動インストールプロファイルを定義する必要があります。 詳細については、xref:client-configuration:autoinst-distributions.adoc[自動インストールのディストリビューション]とxref:client-configuration:autoinst-profiles.adoc[自動インストールプロファイル]を参照してください。
ko: 등록된 클라이언트를 현재 위치에 다시 설치하려면 자동 설치 가능한 배포판 및 자동 설치 프로파일을 정의해야 합니다. 관련 정보는 xref:client-configuration:autoinst-distributions.adoc[ 자동 설치 가능한 배포판] 및 xref:client-configuration:autoinst-profiles.adoc[자동 설치 프로파일]을 참조하십시오.
zh_cn: 要就地重新安装已注册客户端，必须定义可自动安装的发行套件和自动安装配置文件。有关信息，请参见 xref:client-configuration:autoinst-distributions.adoc[可自动安装的发行套件] 和 xref:client-configuration:autoinst-profiles.adoc[自动安装配置文件]。

source: When you have defined the autoinstallation profile and distribution, you can perform the reinstallation.
ca: Quan hàgiu definit el perfil i la distribució d'autoinstal·lació, podreu realitzar la reinstal·lació.
ja: 自動インストールプロファイルと自動インストールのディストリビューションを定義したら、再インストールを実行できます。
ko: 자동 설치 프로파일 및 배포판을 정의한 후 다시 설치를 실행할 수 있습니다.
zh_cn: 定义自动安装配置文件和发行套件后，便可执行重新安装。
