Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: | Feature | {openeuler}{nbsp} 24.03 | Client | {check} (plain {openeuler}) | System packages | {openeuler} Community | Registration | {check} | Install packages | {check} | Apply patches | {check} | Remote commands | {check} | System package states | {check} | System custom states | {check} | Group custom states | {check} | Organization custom states | {check} | System set manager (SSM) | {check} | Product migration | N/A | Basic Virtual Guest Management {star} | {check} | Advanced Virtual Guest Management {star} | {check} | Virtual Guest Installation (Kickstart), as Host OS | {cross} | Virtual Guest Installation (image template), as Host OS | {check} | System deployment (PXE/Kickstart) | {check} | System redeployment (Kickstart) | {check} | Contact methods | {check} ZeroMQ, Salt-SSH | Works with {productname} Proxy | {check} | Action chains | {check} | Staging (pre-download of packages) | {check} | Duplicate package reporting | {check} | CVE auditing | {check} | SCAP auditing | {check} | Package verification | {cross} | Package locking | {cross} | System locking | {cross} | Maintenance Windows | {check} | System snapshot | {cross} | Configuration file management | {check} | Snapshots and profiles | {check} Profiles supported, Sync not supported | Power management | {check} | Monitoring | {check} | Docker buildhost | {cross} | Build Docker image with OS | {cross} | Kiwi buildhost | {cross} | Build Kiwi image with OS | {cross} | Recurring Actions | {check} | Yomi | N/A
ca: | Característica | {openeuler}{nbsp} 24.03 | Client | {check} (plain {openeuler}) | Paquets del sistema | Comunitat {openeuler} | Registre | {check} | Instal·lació de paquets | {check} | Aplicació de pegats | {check} | Comandes remotes | {check} | Estats dels paquets del sistema | {check} | Estats personalitzats del sistema | {check} | Estats personalitzats del grup | {check} | Estats personalitzats de l'organització | {check} | Gestor de conjunts de sistemes (SSM) | {check} | Migració de productes | N/A | Gestió bàsica de convidats virtuals {star} | {check} | Gestió avançada de convidats virtuals {star} | {check} | Instal·lació de convidats virtuals (Kickstart), com a sistema operatiu amfitrió | {cross} | Instal·lació de convidats virtuals (plantilla d'imatge), com a sistema operatiu amfitrió | {check} | Desplegament del sistema (PXE/Kickstart) | {check} | Redistribució del sistema (Kickstart) | {check} | Mètodes de contacte | {check} ZeroMQ, Salt-SSH | Funciona amb el proxy {productname} | {check} | Cadenes d'accions | {check} | Posada en fase (predescàrrega de paquets) | {check} | Informes de paquets duplicats | {check} | Auditoria CVE | {check} | Auditoria SCAP | {check} | Verificació de paquets | {cross} | Bloqueig de paquets | {cross} | Bloqueig del sistema | {cross} | Finestres de manteniment | {check} | Instantànies del sistema | {cross} | Gestió de fitxers de configuració | {check} | Instantànies i perfils | {check} Perfils compatibles, sincronització no compatible | Gestió d'energia | {check} | Monitorització | {check} | Amfitrió de compilació de Docker | {cross} | Crea una imatge de Docker amb el sistema operatiu | {cross} | Amfitrió de compilació de Kiwi | {cross} | Crea una imatge de Kiwi amb el sistema operatiu | {cross} | Accions recurrents | {check} | Yomi | N/A

source: | Feature | {openeuler}{nbsp}22.03 | Client | {check} (plain {openeuler}) | System packages | {openeuler} Community | Registration | {check} | Install packages | {check} | Apply patches | {check} | Remote commands | {check} | System package states | {check} | System custom states | {check} | Group custom states | {check} | Organization custom states | {check} | System set manager (SSM) | {check} | Product migration | N/A | Basic Virtual Guest Management {star} | {check} | Advanced Virtual Guest Management {star} | {check} | Virtual Guest Installation (Kickstart), as Host OS | {cross} | Virtual Guest Installation (image template), as Host OS | {check} | System deployment (PXE/Kickstart) | {check} | System redeployment (Kickstart) | {check} | Contact methods | {check} ZeroMQ, Salt-SSH | Works with {productname} Proxy | {check} | Action chains | {check} | Staging (pre-download of packages) | {check} | Duplicate package reporting | {check} | CVE auditing | {check} | SCAP auditing | {check} | Package verification | {cross} | Package locking | {cross} | System locking | {cross} | Maintenance Windows | {check} | System snapshot | {cross} | Configuration file management | {check} | Snapshots and profiles | {check} Profiles supported, Sync not supported | Power management | {check} | Monitoring | {check} | Docker buildhost | {cross} | Build Docker image with OS | {cross} | Kiwi buildhost | {cross} | Build Kiwi image with OS | {cross} | Recurring Actions | {check} | Yomi | N/A
ca: Fe Característica {openeuler}{nbsp}22.03 Client ) {check} (plana {openeuler}) Paquets del sistema {openeuler} Comunitat Inscripció {check} Instal·la paquets {check} es Aplica els pedaços {check} s Ordres remotes {check} Estats del paquet del sistema {check} Estats personalitzats del sistema {check} Agrupa estats personalitzats {check} Organització d'estats personalitzats {check} ) Gestor de conjunts de sistemes (SSM) {check} Migració de producte N/A Gestió bàsica de convidats virtual {star} {check} Gestió de convidats virtual avançada {star} {check} ), Instal·lació de convidat virtual (Kickstart), com a servidor {cross} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {check} ) Desplegament del sistema (PXE/Kickstart) {check} ) Redesplegament del sistema (Kickstart) {check} Mètodes de contacte , {check} ZeroMQ, Salt-SSH with Funciona amb el servidor intermediari {productname} {check} Cadenes d'acció {check} ) Estadificació (pre-descàrrega de paquets) {check} Informe de paquets duplicat {check} ing Auditoria CVE {check} ing Auditoria SCAP {check} Verificació de paquets {cross} ing Bloqueig de paquets {cross} ing Bloqueig del sistema {cross} Finestres de manteniment {check} Instantània del sistema {cross} Gestió de fitxers de configuració {check} and Instantànies i perfils , {check} Perfils admesos, la sincronització no és compatible Gestió d'energia {check} Seguiment {check} Constructor Docker {cross} Construeix la imatge Docker amb el SO {cross} Constructor de Kiwi {cross} Construeix la imatge de Kiwi amb el SO {cross} s Accions recurrents {check} Yomi N/A

source: {leapmicro} Client Features
ca: Clients i característiques compatibles

source: {leapmicro} is supported by the {suse} community.
ca: {leapmicro} és compatible amb la comunitat {suse}.

source: Supported Features on {leapmicro} Operating Systems
ca: Funcionalitats suportades en sistemes operatius {amazon}

source: | Feature | {leapmicro} | Client | {check} | Operating system packages | {check} | Registration | {check} | Install packages | {check} | Apply patches (requires CVE ID) | {check} | Remote commands | {check} | System package states | {check} | System custom states | {check} | Group custom states | {check} | Organization custom states | {check} | System set manager (SSM) | {check} | Product migration | {check} | Basic Virtual Guest Management {star} | {check} | Advanced Virtual Guest Management {star} | {check} | Virtual Guest Installation (Kickstart), as Host OS | {check} | Virtual Guest Installation (image template), as Host OS | {check} | System deployment (PXE/Kickstart) | {check} | System redeployment (Kickstart) | {check} | Contact methods | {check} ZeroMQ | Works with {productname} Proxy | {check} | Action chains | {check} | Staging (pre-download of packages) | {question} | Duplicate package reporting | {check} | CVE auditing (requires CVE ID) | {check} | SCAP auditing | {question} | Package verification | {question} | Package locking | {check} | System locking | {question} | Maintenance Windows | {question} | System snapshot | {cross} | Configuration file management | {check} | Snapshots and profiles | {check} Profiles supported, Sync not supported | Power management | {check} | Monitoring server | {cross} | Monitored clients | {check} | Docker buildhost | {cross} | Build Docker image with OS | {cross} | Kiwi buildhost | {cross} | Build Kiwi image with OS | {check} | Recurring Actions | {check} | AppStreams | N/A | Yomi | {question}
ca: Fe Característica {leapmicro} Client {check} Paquets de sistema operatiu {check} Inscripció {check} Instal·la paquets {check} ) Aplica els pedaços (requereix l'ID CVE) {check} s Ordres remotes {check} Estats del paquet del sistema {check} Estats personalitzats del sistema {check} Agrupa estats personalitzats {check} Organització d'estats personalitzats {check} ) Gestor de conjunts de sistemes (SSM) {check} Migració de producte {check} Gestió bàsica de convidats virtual {star} {check} Gestió de convidats virtual avançada {star} {check} ), Instal·lació de convidat virtual (Kickstart), com a servidor {check} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {check} ) Desplegament del sistema (PXE/Kickstart) {check} ) Redesplegament del sistema (Kickstart) {check} Mètodes de contacte {check} ZeroMQ with Funciona amb el servidor intermediari {productname} {check} Cadenes d'acció {check} ) Estadificació (pre-descàrrega de paquets) {question} Informe de paquets duplicat {check} audit auditoria CVE (requereix l'ID CVE) {check} ing Auditoria SCAP {question} Verificació de paquets {question} ing Bloqueig de paquets {check} ing Bloqueig del sistema {question} Finestres de manteniment {question} Instantània del sistema {cross} Gestió de fitxers de configuració {check} and Instantànies i perfils , {check} Perfils admesos, la sincronització no és compatible Gestió d'energia {check} Servidor de seguiment {cross} Clients monitoritzats {check} Constructor Docker {cross} Construeix la imatge Docker amb el SO {cross} Constructor de Kiwi {cross} Construeix la imatge de Kiwi amb el SO {check} s Accions recurrents {check} s AppStreams N/A Yomi {question}

source: Supported Oracle Features
ca: Característiques d'Oracle compatibles
ja: サポートされているOracleの機能
ko: 지원하는 Oracle 기능
zh_cn: 支持的 Oracle 功能

source: This table lists the availability of various features on {oracle} clients.
ca: Aquesta taula llista la disponibilitat de diverses característiques en {oracle} clients.
ja: この表には、{oracle}クライアントのさまざまな機能の使用可否がリストされています。
ko: 아래 표는 {oracle} 클라이언트에서 다양한 기능의 사용 가능 여부를 정리한 것입니다.
zh_cn: 下表列出了 {oracle} 客户端上各种功能的可用性。

source: The operating system you run on a client is supported by the organization that supplies the operating system. {oracle} is supported by Oracle.
ca: El sistema operatiu que executeu en un client és compatible amb l'organització que subministra el sistema operatiu. Oracle és compatible amb {oracle}.
ja: クライアントで実行しているオペレーティングシステムは、オペレーティングシステムを提供している組織によってサポートされています。 {oracle}はOracleでサポートされています。
ko: 클라이언트에서 실행하는 운영 체제는 운영 체제를 제공하는 조직이 지원합니다. {oracle}는 Oracle이 지원합니다.
zh_cn: 客户端上运行的操作系统由提供操作系统的组织支持。{oracle} 由 Oracle 支持。

source: Supported Features on {oracle} Operating Systems
ca: Característiques suportades en sistemes operatius {oracle}
ja: {oracle}オペレーティングシステムでサポートされている機能
ko: {oracle} 운영 체제에서 지원하는 기능
zh_cn: {oracle} 操作系统上支持的功能

source: | Feature | {oracle}{nbsp}7 | {oracle}{nbsp}8 | {oracle}{nbsp}9 | Client | {check} | {check} | {check} | Operating system packages | {check} | {check} | {check} | Registration | {check} | {check} | {check} | Install packages | {check} | {check} | {check} | Apply patches (requires CVE ID) | {check} | {check} | {check} | Remote commands | {check} | {check} | {check} | System package states | {check} | {check} | {check} | System custom states | {check} | {check} | {check} | Group custom states | {check} | {check} | {check} | Organization custom states | {check} | {check} | {check} | System set manager (SSM) | {check} | {check} | {check} | Product migration {star} | {check} | {check} | {check} | Basic Virtual Guest Management {star}{star} | {check} | {check} | {check} | Advanced Virtual Guest Management {star}{star} | {check} | {check} | {check} | Virtual Guest Installation (Kickstart), as Host OS | {cross} | {check} | {check} | Virtual Guest Installation (image template), as Host OS | {check} | {check} | {check} | System deployment (PXE/Kickstart) | {check} | {check} | {check} | System redeployment (Kickstart) | {check} | {check} | {check} | Contact methods | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | Works with {productname} Proxy | {check} | {check} | {check} | Action chains | {check} | {check} | {check} | Staging (pre-download of packages) | {check} | {check} | {check} | Duplicate package reporting | {check} | {check} | {check} | CVE auditing (requires CVE ID) | {check} | {check} | {check} | SCAP auditing | {check} | {check} | {check} | Package verification | {cross} | {cross} | {cross} | Package locking | {check} | {check} | {check} | System locking | {cross} | {cross} | {cross} | Maintenance Windows | {check} | {check} | {check} | System snapshot | {cross} | {cross} | {cross} | Configuration file management | {check} | {check} | {check} | Snapshots and profiles | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | Power management | {check} | {check} | {check} | Monitoring server | {cross} | {cross} | {cross} | Monitored clients | {check} | {check} | {check} | Docker buildhost | {cross} | {cross} | {cross} | Build Docker image with OS | {cross} | {cross} | {cross} | Kiwi buildhost | {cross} | {cross} | {cross} | Build Kiwi image with OS | {cross} | {cross} | {cross} | Recurring Actions | {check} | {check} | {check} | AppStreams | N/A | {check} | {check} | Yomi | N/A | N/A | N/A
ca: Fe Característica {oracle}{nbsp}7 {oracle}{nbsp}8 {oracle}{nbsp}9 Client {check} {check} {check} Paquets de sistema operatiu {check} {check} {check} Inscripció {check} {check} {check} Instal·la paquets {check} {check} {check} ) Aplica els pedaços (requereix l'ID CVE) {check} {check} {check} s Ordres remotes {check} {check} {check} Estats del paquet del sistema {check} {check} {check} Estats personalitzats del sistema {check} {check} {check} Agrupa estats personalitzats {check} {check} {check} Organització d'estats personalitzats {check} {check} {check} ) Gestor de conjunts de sistemes (SSM) {check} {check} {check} Migració de producte {star} {check} {check} {check} Gestió bàsica de convidats virtual {star}{star} {check} {check} {check} Gestió de convidats virtual avançada {star}{star} {check} {check} {check} ), Instal·lació de convidat virtual (Kickstart), com a servidor {cross} {check} {check} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {check} {check} {check} ) Desplegament del sistema (PXE/Kickstart) {check} {check} {check} ) Redesplegament del sistema (Kickstart) {check} {check} {check} Mètodes de contacte , {check} ZeroMQ, Salt-SSH , {check} ZeroMQ, Salt-SSH , {check} ZeroMQ, Salt-SSH with Funciona amb el servidor intermediari {productname} {check} {check} {check} Cadenes d'acció {check} {check} {check} ) Estadificació (pre-descàrrega de paquets) {check} {check} {check} Informe de paquets duplicat {check} {check} {check} audit auditoria CVE (requereix l'ID CVE) {check} {check} {check} ing Auditoria SCAP {check} {check} {check} Verificació de paquets {cross} {cross} {cross} ing Bloqueig de paquets {check} {check} {check} ing Bloqueig del sistema {cross} {cross} {cross} Finestres de manteniment {check} {check} {check} Instantània del sistema {cross} {cross} {cross} Gestió de fitxers de configuració {check} {check} {check} and Instantànies i perfils , {check} Perfils admesos, la sincronització no és compatible , {check} Perfils admesos, la sincronització no és compatible , {check} Perfils admesos, la sincronització no és compatible Gestió d'energia {check} {check} {check} Servidor de seguiment {cross} {cross} {cross} Clients monitoritzats {check} {check} {check} Constructor Docker {cross} {cross} {cross} Construeix la imatge Docker amb el SO {cross} {cross} {cross} Constructor de Kiwi {cross} {cross} {cross} Construeix la imatge de Kiwi amb el SO {cross} {cross} {cross} s Accions recurrents {check} {check} {check} s AppStreams N/A {check} {check} Yomi N/A N/A N/A

source: Supported {raspberrypios} Features
ca: Funcionalitats de {rhel} suportades

source: This table lists the availability of various features on {raspberrypios} clients.
ca: Aquesta taula llista la disponibilitat de diverses característiques en {oracle} clients.

source: The operating system you run on a client is supported by the organization that supplies the operating system. {raspberrypios} is supported by the {raspberrypios} community.
ca: El sistema operatiu que executeu en un client és compatible amb l'organització que subministra el sistema operatiu. {centos} és compatible amb la comunitat {centos}.

source: Supported Features on {raspberrypios} Operating Systems
ca: Característiques suportades en {centos} Sistemes operatius

source: | Feature | {raspberrypios}{nbsp}12 | Client | {check} | System packages | {raspberrypios} Community | Registration | {check} | Install packages | {check} | Apply patches | {question} | Remote commands | {check} | System package states | {check} | System custom states | {check} | Group custom states | {check} | Organization custom states | {check} | System set manager (SSM) | {check} | Product migration | N/A | Basic Virtual Guest Management {star} | {check} | Advanced Virtual Guest Management {star} | {check} | Virtual Guest Installation (Kickstart), as Host OS | {cross} | Virtual Guest Installation (image template), as Host OS | {check} | System deployment (PXE/Kickstart) | {cross} | System redeployment (Kickstart) | {cross} | Contact methods | {check} ZeroMQ, Salt-SSH | Works with {productname} Proxy | {check} | Action chains | {check} | Staging (pre-download of packages) | {check} | Duplicate package reporting | {check} | CVE auditing | {question} | SCAP auditing | {question} | Package verification | {cross} | Package locking | {check} | System locking | {cross} | Maintenance Windows | {check} | System snapshot | {cross} | Configuration file management | {check} | Package profiles | {check} Profiles supported, Sync not supported | Power management | {check} | Monitoring server | {cross} | Monitoring clients | {check} | Docker buildhost | {question} | Build Docker image with OS | {check} | Kiwi buildhost | {cross} | Build Kiwi image with OS | {cross} | Recurring Actions | {check} | AppStreams | N/A | Yomi | N/A
ca: Fe Característica {raspberrypios}{nbsp}12 Client {check} Paquets del sistema Comunitat de {raspberrypios} Inscripció {check} Instal·la paquets {check} es Aplica els pedaços {question} s Ordres remotes {check} Estats del paquet del sistema {check} Estats personalitzats del sistema {check} Agrupa estats personalitzats {check} Organització d'estats personalitzats {check} ) Gestor de conjunts de sistemes (SSM) {check} Migració de producte N/A Gestió bàsica de convidats virtual {star} {check} Gestió de convidats virtual avançada {star} {check} ), Instal·lació de convidat virtual (Kickstart), com a servidor {cross} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {check} ) Desplegament del sistema (PXE/Kickstart) {cross} ) Redesplegament del sistema (Kickstart) {cross} Mètodes de contacte , {check} ZeroMQ, Salt-SSH with Funciona amb el servidor intermediari {productname} {check} Cadenes d'acció {check} ) Estadificació (pre-descàrrega de paquets) {check} Informe de paquets duplicat {check} ing Auditoria CVE {question} ing Auditoria SCAP {question} Verificació de paquets {cross} ing Bloqueig de paquets {check} ing Bloqueig del sistema {cross} Finestres de manteniment {check} Instantània del sistema {cross} Gestió de fitxers de configuració {check} Perfils del paquet , {check} Perfils admesos, la sincronització no és compatible Gestió d'energia {check} Servidor de seguiment {cross} Seguiment de clients {check} Constructor Docker {question} Construeix la imatge Docker amb el SO {check} Constructor de Kiwi {cross} Construeix la imatge de Kiwi amb el SO {cross} s Accions recurrents {check} s AppStreams N/A Yomi N/A

source: Supported {rhel} Features
ca: Funcionalitats de {rhel} suportades
ja: サポートされている{rhel}の機能
ko: 지원하는 {rhel} 기능
zh_cn: 支持的 {rhel} 功能

source: This table lists the availability of various features on native {rhel} clients (without Expanded Support).
ca: Aquesta taula llista la disponibilitat de diverses característiques en clients nadius {rhel} (sense suport expandit).
ja: この表には、{rhel}クライアントのさまざまな機能の使用可否がリストされています(拡張サポートがない場合)。
ko: 아래 표는 {rhel} 클라이언트에서 다양한 기능의 사용 가능 여부를 정리한 것입니다(Expanded Support 없음).
zh_cn: 下表列出了本机 {rhel} 客户端（没有扩展支持）上各种功能的可用性。

source: This table lists the availability of various features on native {rhel} clients.
ca: Aquesta taula llista la disponibilitat de diverses característiques en {oracle} clients.

source: The operating system you run on a client is supported by the organization that supplies the operating system. {rhel} is supported by {redhat}.
ca: El sistema operatiu que executeu en un client és compatible amb l'organització que subministra el sistema operatiu. {rhel} és compatible amb {redhat}.
ja: クライアントで実行しているオペレーティングシステムは、オペレーティングシステムを提供している組織によってサポートされています。 {rhel}は{redhat}でサポートされています。
ko: 클라이언트에서 실행하는 운영 체제는 운영 체제를 제공하는 조직이 지원합니다. {rhel}는 {redhat}이 지원합니다.
zh_cn: 客户端上运行的操作系统由提供操作系统的组织支持。{rhel} 由 {redhat} 支持。

source: Supported Features on {rhel} Operating Systems
ca: Funcionalitats suportades en sistemes operatius {rhel}
ja: {rhel}オペレーティングシステムでサポートされている機能
ko: {rhel} 운영 체제에서 지원하는 기능
zh_cn: {rhel} 操作系统上支持的功能
