Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: To manage repositories on your {redhat} client, you need to import the CA and entitlement certificates to the {productname} Server. This requires that you perform the import procedure three times, to create three entries: one each for the entitlement certificate, the entitlement key, and the {redhat} certificate.
ca: Per gestionar repositoris al vostre client {redhat}, heu d'importar la CA i els certificats de dret al servidor {productname}. Això requereix que realitzeu el procediment d'importació tres vegades, per crear tres entrades: una per al certificat de dret, la clau de dret i el certificat {redhat}.
ja: {redhat}クライアントでリポジトリを管理するには、CAおよびエンタイトルメント証明書を{productname}サーバにインポートする必要があります。 この操作を実行するには、インポートプロシージャを3回実行して、3つのエントリを作成する必要があります。 エンタイトルメント証明書、エンタイトルメントキーおよび{redhat}証明書にそれぞれ1つずつです。
ko: {redhat} 클라이언트에서 리포지토리를 관리하려면 CA 및 자격 인증서를 {productname} 서버로 임포트해야 합니다. 이렇게 하려면 임포트 절차를 세 차례 수행하여 자격 인증서, 자격 키, {redhat} 인증서 각각에 대해 하나씩 세 항목을 생성해야 합니다.
zh_cn: 要管理 {redhat} 客户端上的储存库，您需要将 CA 和权利证书导入 {productname} 服务器。这需要您执行三次导入过程以创建相应的三项： 三项分别对应权利证书、权利密钥和 {redhat} 证书。

source: Procedure: Importing Certificates to the Server
ca: Procediment: Importació de certificats al servidor
ja: プロシージャ: 証明書をサーバにインポートする
ko: 절차: 인증서를 서버에 임포트
zh_cn: 过程：将证书导入服务器

source: On the {productname} Server {webui}, navigate to menu:Systems[Autoinstallation > GPG and SSL Keys].
ca: Al servidor {productname} {webui}, navegueu al menú:Systems[Autoinstallation ]. GPG and SSL Keys].
ja: {productname}サーバの{webui}で、menu:システム[自動インストール > GPGキーとSSLキー]に移動します。
ko: {productname} 서버 {webui}에서 menu:시스템[자동 설치 > GPG 및 SSL 키]로 이동합니다.
zh_cn: 在 {productname} 服务器 {webui} 上，导航到menu:系统[自动安装 > GPG 和 SSL 密钥]。

source: Click btn:[Create Stored Key/Cert] and set these parameters for the entitlement certificate:
ca: Feu clic a btn:[Crea una clau emmagatzemada/Cert] i establiu aquests paràmetres per al certificat de títol:
ja: btn:[格納されているキーまたは証明書の作成]をクリックして、エンタイトルメント証明書用に次のパラメータを設定します。
ko: btn:[저장된 키/인증서 생성]을 클릭하고 자격 인증서에 대해 다음 파라미터를 설정합니다.
zh_cn: 单击 btn:[创建存储的密钥/证书]，并为权利证书设置下列参数：

source: In the [guimenu]``Description`` field, type [systemitem]``Entitlement-Cert-date``.
ca: Al camp [guimenu].Descripció., escriviu [systemitem].títol-Cert-date..
ja: ［[guimenu]``説明``］フィールドに[systemitem]``Entitlement-Cert-date``と入力します。
ko: [guimenu]``설명`` 필드에 [systemitem]``Entitlement-Cert-date``를 입력합니다.
zh_cn: 在[guimenu]``说明``字段中键入 [systemitem]``Entitlement-Cert-date``。

source: In the [guimenu]``Type`` field, select [systemitem]``SSL``.
ca: Al camp [guimenu].Tipus., seleccioneu [systemitem].SSL..
ja: ［[guimenu]``タイプ``］フィールドで、[systemitem]``SSL``を選択します。
ko: [guimenu]``유형`` 필드에서 [systemitem]``SSL``을 선택합니다.
zh_cn: 在[guimenu]``类型``字段中，选择 [systemitem]``SSL``。

source: In the [guimenu]``Select file to upload`` field, browse to the location where you saved the entitlement certificate, and select the [path]``.pem`` certificate file.
ca: Al camp [guimenu].Selecciona fitxer per pujar., navegueu fins a la ubicació on heu desat el certificat de títol i seleccioneu el fitxer de certificat [path]..pem..
ja: ［[guimenu]``アップロードするファイルの選択``］フィールドで、エンタイトルメント証明書を保存した場所をブラウズし、[path]``.pem``証明書ファイルを選択します。
ko: [guimenu]``업로드할 파일을 선택해주십시오`` 필드에서 자격 인증서를 저장한 위치로 이동하여 [path]``.pem`` 인증서 파일을 선택합니다.
zh_cn: 在[guimenu]``选择要上载的文件``字段中，浏览到您保存权利证书的位置，然后选择 [path]``.pem`` 证书文件。

source: Click btn:[Create Key].
ca: Feu clic a btn:[Crea una clau].
ja: btn:[キーの作成]をクリックします。
ko: btn:[키 생성]을 클릭합니다.
zh_cn: 单击 btn:[创建密钥]。

source: Click btn:[Create Stored Key/Cert] and set these parameters for the entitlement key:
ca: Feu clic a btn:[Crea una clau emmagatzemada/Cert] i establiu aquests paràmetres per a la clau de títol:
ja: btn:[格納されているキーまたは証明書の作成]をクリックして、エンタイトルメントキー用に次のパラメータを設定します。
ko: btn:[저장된 키/인증서 생성]을 클릭하고 자격 키에 대해 다음 파라미터를 설정합니다.
zh_cn: 单击 btn:[创建存储的密钥/证书]，并为权利密钥设置下列参数：

source: In the [guimenu]``Description`` field, type [systemitem]``Entitlement-key-date``.
ca: Al camp [guimenu].Descripció., escriviu [systemitem].Actualització-tecla-data..
ja: ［[guimenu]``説明``］フィールドに[systemitem]``Entitlement-key-date``と入力します。
ko: [guimenu]``설명`` 필드에 [systemitem]``Entitlement-key-date``를 입력합니다.
zh_cn: 在[guimenu]``说明``字段中键入 [systemitem]``Entitlement-key-date``。

source: In the [guimenu]``Select file to upload`` field, browse to the location where you saved the entitlement key, and select the [path]``.pem`` key file.
ca: Al camp [guimenu].Selecciona fitxer per pujar., navegueu fins a la ubicació on heu desat la clau de títol i seleccioneu el fitxer de clau [path]..pem..
ja: ［[guimenu]``アップロードするファイルの選択``］フィールドで、エンタイトルメントキーを保存した場所をブラウズし、[path]``.pem``キーファイルを選択します。
ko: [guimenu]``업로드할 파일을 선택해주십시오`` 필드에서 자격 키를 저장한 위치로 이동하여 [path]``.pem`` 키 파일을 선택합니다.
zh_cn: 在[guimenu]``选择要上载的文件``字段中，浏览到您保存权利密钥的位置，然后选择 [path]``.pem`` 密钥文件。

source: Click btn:[Create Stored Key/Cert] and set these parameters for the {redhat} certificate:
ca: Feu clic a btn:[Crea una clau emmagatzemada/Cert] i establiu aquests paràmetres per al certificat {redhat}:
ja: btn:[格納されているキーまたは証明書の作成]をクリックして、{redhat}証明書用に次のパラメータを設定します。
ko: btn:[저장된 키/인증서 생성]을 클릭하고 {redhat} 인증서에 대해 다음 파라미터를 설정합니다.
zh_cn: 单击 btn:[创建存储的密钥/证书]，并为 {redhat} 证书设置下列参数：

source: In the [guimenu]``Description`` field, type [systemitem]``redhat-uep``.
ca: Al camp [guimenu].Descripció., escriviu [systemitem].redhat-uep..
ja: ［[guimenu]``説明``］フィールドに[systemitem]``redhat-uep``と入力します。
ko: [guimenu]``설명`` 필드에 [systemitem]``redhat-uep``를 입력합니다.
zh_cn: 在[guimenu]``说明``字段中键入 [systemitem]``redhat-uep``。

source: In the [guimenu]``Select file to upload`` field, browse to the location where you saved the {redhat} certificate, and select the certificate file.
ca: Al camp [guimenu].Seleccioneu fitxer per pujar., navegueu fins a la ubicació on heu desat el certificat {redhat} i seleccioneu el fitxer de certificat.
ja: ［[guimenu]``アップロードするファイルの選択``］フィールドで、{redhat}証明書を保存した場所をブラウズし、証明書ファイルを選択します。
ko: [guimenu]``업로드할 파일을 선택해주십시오`` 필드에서 {redhat} 인증서를 저장한 위치로 이동하여 인증서 파일을 선택합니다.
zh_cn: 在[guimenu]``选择要上载的文件``字段中，浏览到您保存 {redhat} 证书的位置，然后选择证书文件。

source: Before you register {redhat} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de registrar {redhat} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.
ja: {redhat}クライアントを{productname}サーバに登録する前に、必要なソフトウェアチャンネルを追加して同期する必要があります。
ko: {redhat} 클라이언트를 {productname} 서버에 등록하기 전에 필요한 소프트웨어 채널을 추가하고 이 채널을 동기화해야 합니다.
zh_cn: 将 {redhat} 客户端注册到您的 {productname} 服务器之前，您需要添加所需的软件通道，并同步这些通道。

source: Your {susemgr} subscription entitles you to the tools channels for {sleses} (also known as {redhat} Expanded Support or RES). You must use the client tools channel to create the bootstrap repository. This procedure applies to Salt clients.
ca: La vostra subscripció {susemgr} us dona dret als canals d'eines per a {sleses} (també conegut com a {redhat} Suport expandit o RES). Heu d'utilitzar el canal d'eines del client per a crear el repositori bootstrap. Aquest procediment s'aplica als clients de Salt.

source: Red Hat Products - WebUI
ca: Productes Red Hat - WebUI
ja: Red Hat製品 - WebUI
ko: Red Hat 제품 - WebUI
zh_cn: Red Hat 产品 - WebUI

source: | OS Version | Product Name | {redhat} 9 | RHEL and Liberty 9 Base | {redhat} 8 | RHEL or SLES ES or CentOS 8 Base | {redhat} 7 | RHEL7 Base x86_64
ca: Versió del SO Nom del producte and {redhat} 9 and Base RHEL i Liberty 9 {redhat} 8 Base RHEL o SLES ES o CentOS 8 {redhat} 7 Base RHEL7 x8664

source: | OS Version | Product Name | {redhat} 9 | RHEL | {redhat} 8 | RHEL or CentOS 8 Base | {redhat} 7 | RHEL7 Base x86_64
ca: Versió del SO Nom del producte {redhat} 9 RHEL {redhat} 8 RHEL o CentOS 8 Base {redhat} 7 RHEL7 Base x8664

source: Red Hat Channels - CLI
ca: Canals Red Hat - CLI
ja: Red Hatチャンネル - CLI
ko: Red Hat 채널- CLI
zh_cn: Red Hat 通道 - CLI

source: | OS Version | Base Channel | Client Channel | Tools Channel | {redhat} 9 | rhel9-pool-uyuni | - | rhel9-uyuni-client | {redhat} 8 | rhel8-pool-uyuni | - | rhel8-uyuni-client | {redhat} 7 | rhel7-pool-uyuni | - | rhel7-uyuni-client
ca: Versió del SO Canal base Canal client s Canal d'eines {redhat} 9 rel9-pool-uyuni rel9-uyuni-client {redhat} 8 rel8-pool-uyuni rel8-uyuni-client {redhat} 7 rel7-pool-uyuni rel7-uyuni-client

source: Prepare Custom Repositories and Channels
ca: Prepara els repositoris i canals personalitzats
ja: カスタムリポジトリおよびチャンネルの準備
ko: 사용자 정의 리포지토리 및 채널 준비
zh_cn: 准备自定义储存库和通道

source: To mirror the software from the {redhat} CDN, you need to create custom channels and repositories in {productname} that are linked to the CDN by a URL. You must have entitlements to these products in your {redhat} Portal for this to work correctly. You can use the subscription manager tool to get the URLs of the repositories you want to mirror:
ca: Per a reflectir el programari del CDN {redhat}, heu de crear canals i repositoris personalitzats a {productname} que estan vinculats al CDN per una URL. Heu de tenir dret a aquests productes al vostre Portal {redhat} perquè això funcioni correctament. Podeu utilitzar l'eina del gestor de subscripcions per obtenir els URL dels repositoris que voleu reflectir:

source: subscription-manager repos
ca: repositoris de subscripcions

source: You can use these repository URLs to create custom repositories. This allows you to mirror only the content you need to manage your clients.
ca: Podeu utilitzar aquests URL de repositori per a crear repositoris personalitzats. Això et permet reflectir només el contingut que necessites per gestionar els teus clients.
ja: これらのリポジトリURLを使用して、カスタムリポジトリを作成できます。 クライアントを管理するために必要なコンテンツのみミラーリングできます。
ko: 이 리포지토리 URL을 사용해 사용자 정의 리포지토리를 생성할 수 있습니다. 이렇게 하면 클라이언트를 관리하는 데 필요한 컨텐트만 미러링할 수 있습니다.
zh_cn: 可以使用这些储存库 URL 来创建自定义储存库。这样您便可只镜像管理客户端所需的内容。

source: You can only create custom versions of {redhat} repositories if you have the correct entitlements in your {redhat} Portal.
ca: Només podeu crear versions personalitzades dels repositoris {redhat} si teniu els drets correctes al vostre Portal {redhat}.
ja: {redhat}ポータルに正しいエンタイトルメントがある場合、{redhat}リポジトリのカスタムバージョンのみ作成できます。
ko: {redhat} 포털에 올바른 자격이 있는 경우 {redhat} 리포지토리의 사용자 정의 버전만 생성할 수 있습니다.
zh_cn: 如果您在 {redhat} 门户中拥有正确的权利，就可以只创建 {redhat} 储存库的自定义版本。

source: The details you need for this procedure are:
ca: Les dades que necessites per a aquest tràmit són:
ja: このプロシージャに必要な詳細は次のとおりです。
ko: 이 절차에 필요한 상세 정보는 다음과 같습니다.
zh_cn: 此过程所需的细节包括：

source: Red Hat Custom Repository Settings
ca: Configuració del repositori personalitzat de Red Hat
ja: Red Hatカスタムリポジトリ設定
ko: Red Hat 사용자 정의 리포지토리 설정
zh_cn: Red Hat 自定义储存库设置

source: | Option | Setting | Repository URL | The content URL provided by {redhat} CDN | Has Signed Metadata? | Uncheck all {redhat} Enterprise repositories | SSL CA Certificate | [systemitem]``redhat-uep`` | SSL Client Certificate | [systemitem]``Entitlement-Cert-date`` | SSL Client Key | ``Entitlement-Key-date``
ca: Opció | Configuració The URL del repositori The L'URL del contingut proporcionat per {redhat} CDN ? Ha signat Metadades? es Desmarca tots els {redhat} repositoris empresarials Certificat CA SSL [systemitem] redhat-uep`` Certificat de client SSL [systemitem] Entitlement-Cert-date`` Clau de client SSL Entitlement-Key-date``
ko: | 옵션 | 설정 | 리포지토리 URL | {redhat} CDN이 제공하는 컨텐트 URL | 서명 메타데이터가 있습니까? | 모든 {redhat} Enterprise 리포지토리를 선택 취소 | SSL CA 인증서 | [systemitem]``redhat-uep`` | SSL 클라이언트 인증서 | [systemitem]``Entitlement-Cert-date`` | SSL 클라이언트 키 | ``Entitlement-Key-date``
zh_cn: | 选项 | 设置 |储存库 URL | {redhat} CDN 提供的内容 URL |包含已签名的元数据？ | 取消选中所有 {redhat} Enterprise 储存库 |SSL CA 证书 | [systemitem]``redhat-uep`` |SSL 客户端证书 | [systemitem]``Entitlement-Cert-date`` |SSL 客户端密钥 | ``Entitlement-Key-date``

source: Red Hat Custom Channels
ca: Canals personalitzats amb barret vermell
ja: Red Hatカスタムチャンネル
ko: Red Hat 사용자 정의 채널
zh_cn: Red Hat 自定义通道

source: | OS Version | Base Product | Base Channel | {redhat} 9 | RHEL and Liberty 9 Base | el9-pool-x86_64
ca: Versió del SO Producte base Canal base and {redhat} 9 and RHEL i Liberty 9 Base el9-pool-x8664

source: | {redhat} 8 | RHEL or SLES ES or CentOS 8 Base | rhel8-pool-x86_64 | {redhat} 7 | RHEL7 Base x86_64 | rhel7-pool-x86_64
ca: {redhat} 8 RHEL o SLES ES o CentOS 8 Base rhel8-pool-x8664 {redhat} 7 RHEL7 Base x8664 rhel7-pool-x8664

source: | OS Version | Base Channel | {redhat} 9 | rhel9-pool-uyuni | {redhat} 8 | rhel8-pool-uyuni | {redhat} 7 | rhel7-pool-uyuni
ca: Versió del SO Canal base {redhat} 9 rel9-pool-uyuni {redhat} 8 rel8-pool-uyuni {redhat} 7 rel7-pool-uyuni

source: For {redhat} 9 and {redhat} 8 clients, add both the Base and AppStream channels. You require packages from both channels. If you do not add both channels, you cannot create the bootstrap repository, due to missing packages.
ca: Per als clients {redhat} 9 i {redhat} 8, afegiu tant els canals Base com AppStream. Necessiteu paquets d'ambdós canals. Si no afegiu els dos canals, no podreu crear el repositori bootstrap, a causa de la manca de paquets.

source: {rhel} channels can be very large. Synchronization can sometimes take several hours.
ca: {rhel} canals poden ser molt grans. La sincronització de vegades pot trigar diverses hores.
ja: {rhel}チャンネルは非常に大きいことがあります。 同期に数時間かかる場合があります。

source: Procedure: OPTIONAL: Creating a Salt State to Deploy Configuration Files
ca: Procediment: OPCIONAL: Creació d'un estat de sal per desplegar fitxers de configuració
ja: プロシージャ: オプション: Salt状態を作成して設定ファイルを展開する
ko: 절차: 옵션: Salt 상태를 생성하여 구성 파일 배포
zh_cn: 过程：可选：创建 Salt 状态以部署配置文件

source: On the {productname} Server {webui}, navigate to menu:Configuration[Channels].
ca: Al servidor {productname} {webui}, navegueu al menú:Configuració[Canals].
ja: {productname}サーバの{webui}で、menu:設定[チャンネル]に移動します。
ko: {productname} 서버 {webui}에서 menu:구성[채널]로 이동합니다.
zh_cn: 在 {productname} 服务器 {webui} 上，导航到menu:配置[通道]。

source: Click btn:[Create State Channel].
ca: Feu clic a btn:[Crea un canal d'estat].
ja: btn:[状態チャンネルの作成]をクリックします。
ko: btn:[상태 채널 생성]을 클릭합니다.
zh_cn: 单击 btn:[创建状态通道]。

source: In the [guimenu]``Name`` field, type [systemitem]``subscription-manager: disable yum plugins``.
ca: Al camp [guimenu].Nom., escriviu [systemitem].subscripció-gestor: inhabiliteu els connectors de yum..
ja: ［[guimenu]``名前``］フィールドに[systemitem]``subscription-manager: disable yum plugins``と入力します。
ko: [guimenu]``이름`` 필드에 [systemitem]``subscription-manager: disable yum plugins``를 입력합니다.
zh_cn: 在[guimenu]``名称``字段中，键入 [systemitem]``subscription-manager: disable yum plugins``。

source: In the [guimenu]``Label`` field, type [systemitem]``subscription-manager-disable-yum-plugins``.
ca: Al camp [guimenu].Etiqueta., escriviu [systemitem].subscription-manager-disable-yum-plugins..
ja: ［[guimenu]``ラベル``］フィールドに[systemitem]``subscription-manager-disable-yum-plugins``と入力します。
ko: [guimenu]``레이블`` 필드에 [systemitem]``subscription-manager-disable-yum-plugins``를 입력합니다.
zh_cn: 在[guimenu]``标签``字段中，键入 [systemitem]``subscription-manager-disable-yum-plugins``。

source: In the [guimenu]``Description`` field, type [systemitem]``subscription-manager: disable yum plugins``.
ca: Al camp [guimenu].Descripció., escriviu [systemitem].subscripció-manager: inhabiliteu els connectors de yum..
ja: ［[guimenu]``説明``］フィールドに[systemitem]``subscription-manager: disable yum plugins``と入力します。
ko: [guimenu]``설명`` 필드에 [systemitem]``subscription-manager: disable yum plugins``를 입력합니다.
zh_cn: 在[guimenu]``说明``字段中，键入 [systemitem]``subscription-manager: disable yum plugins``。

source: In the [guimenu]``SLS Contents`` field, leave it empty.
ca: Al camp [guimenu].Continguts SLS., deixeu-lo buit.
ja: ［[guimenu]``SLSコンテンツ``］フィールドは空白のままにします。
ko: [guimenu]``SLS 컨텐트`` 필드를 빈 상태로 둡니다.
zh_cn: 将 [guimenu]``SLS 内容``字段留空。

source: Click btn:[Create Config Channel]
ca: Feu clic a btn:[Crea el canal de configuració]
ja: btn:[設定チャンネルの作成]をクリックします
ko: btn:[구성 채널 생성]을 클릭합니다.
zh_cn: 单击 btn:[创建配置通道]

source: Click btn:[Create Configuration File]
ca: Feu clic a btn:[Crea el fitxer de configuració]
ja: btn:[設定ファイルの作成]をクリックします
ko: btn:[구성 파일 생성]을 클릭합니다.
zh_cn: 单击 btn:[创建配置文件]

source: In the [guimenu]``Filename/Path`` field type [systemitem]``/etc/yum/pluginconf.d/subscription-manager.conf``.
ca: En el camp [guimenu] InNomFitxer/Path. tipus de camp [systemitem]./etc/yum/pluginconf.d/subscription-manager.conf..
ja: ［[guimenu]``ファイル名/パス``］フィールドに[systemitem]``/etc/yum/pluginconf.d/subscription-manager.conf``と入力します。
ko: [guimenu]``파일 이름/경로`` 필드에 [systemitem]``/etc/yum/pluginconf.d/subscription-manager.conf``를 입력합니다.
zh_cn: 在[guimenu]``文件名/路径``字段中，键入 [systemitem]``/etc/yum/ pluginconf.d/subscription-manager.conf``。

source: In the [guimenu]``File Contents`` field type:
ca: Al camp [guimenu] theContinguts del fitxer type tipus:
ja: ［[guimenu]``ファイルの内容``］フィールドに次のように入力します。
ko: [guimenu]``파일 내용`` 필드에 다음과 같이 입력합니다.
zh_cn: 在[guimenu]``文件内容``字段中，键入：

source: [main] enabled=0
ca: [main] habilitat00

source: Take note of the value of the field [guimenu]``Salt Filesystem Path```.
ca: Pren nota del valor del camp [guimenu].Salt Filesystem Path..
ja: ［[guimenu]``Saltファイルシステムパス``］フィールドの値をメモします。
ko: [guimenu]``Salt 파일 시스템 경로`` 필드의 값을 적어 둡니다.
zh_cn: 记下 [guimenu]``Salt 文件系统路径``字段的值。

source: Click on the name of the Configuration Channel.
ca: Feu clic al nom del canal de configuració.
ja: 設定チャンネルの名前をクリックします。
ko: 구성 채널의 이름을 클릭합니다.
zh_cn: 单击配置通道的名称。

source: Click on [guimenu]``View/Edit 'init.sls' File``
ca: Feu clic a [guimenu]]Visualitza/Edita el fitxer «init.sls»``
ja: ［[guimenu]`` 'init.sls' ファイルの表示/編集``］をクリックします
ko: [guimenu]``'init.sls' 파일 보기/편집``을 클릭합니다.
zh_cn: 单击[guimenu]``查看/编辑 'init.sls' 文件``

source: In the [guimenu]``File Contents`` field, type:
ca: Al camp [guimenu] theContinguts del fitxer the, escriviu:
ja: ［[guimenu]``ファイルの内容``］フィールドに次のように入力します。
ko: [guimenu]``파일 내용`` 필드에 다음과 같이 입력합니다.
zh_cn: 在[guimenu]``文件内容``字段中，键入：

source: configure_subscription-manager-disable-yum-plugins: cmd.run: - name: subscription-manager config --rhsm.auto_enable_yum_plugins=0 - watch: - file: /etc/yum/pluginconf.d/subscription-manager.conf file.managed: - name: /etc/yum/pluginconf.d/subscription-manager.conf - source: salt:///etc/yum/pluginconf.d/subscription-manager.conf
ca: configuresubscription-manager-disable-yum-plugins: cmd.run: - nom: subscription-manager config --rhsm.autoenableyumplugins00 - vigila: - fitxer: /etc/yum/pluginconf.d/subscription-manager.conf fitxer.gestionat: - nom: /etc/yum/pluginconf.d/subscription-manager.conf - font: salt:///etc/yum/pluginconf.d/subscription-manager.conf

source: Click btn:[Update Configuration File].
ca: Feu clic a btn:[Actualitza el fitxer de configuració].
ja: btn:[設定ファイルの更新]をクリックします。
ko: btn:[구성 파일 업데이트]를 클릭합니다.
zh_cn: 单击 btn:[更新配置文件]。

source: The ``Creating a Salt State to Deploy Configuration Files`` procedure is optional.
ca: El procediment .Creating a Salt State to Deploy Configuration Files. és opcional.
ja: ``Salt状態を作成して設定ファイルを展開する``のプロシージャはオプションです。

source: Procedure: Creating a System Group for {rhel} Clients
ca: Procediment: Creació d'un grup de sistema per a {rhel} clients
ja: プロシージャ: {rhel}クライアントのシステムグループの作成
ko: 절차: {rhel} 클라이언트에 대해 시스템 그룹 생성
zh_cn: 过程：为 {rhel} 客户端创建系统组

source: On the {productname} Server {webui}, navigate to menu:Systems[System Groups].
ca: Al servidor {productname} {webui}, navegueu al menú:Systems[Systems Groups].
ja: {productname}サーバの{webui}で、menu:システム[システムグループ]に移動します。
ko: {productname} 서버 {webui}에서 menu:시스템[시스템 그룹]으로 이동합니다.
zh_cn: 在 {productname} 服务器 {webui} 上，导航到menu:系统[系统组]。

source: Click btn:[Create Group].
ca: Feu clic a btn:[Crea un grup].
ja: btn:[グループの作成]をクリックします。
ko: btn:[그룹 생성]을 클릭합니다.
zh_cn: 单击 btn:[创建组]。

source: In the [guimenu]``Name`` field, type [systemitem]``rhel-systems``.
ca: Al camp [guimenu].Nom., escriviu [systemitem].rhel-systems..
ja: ［[guimenu]``名前``］フィールドに[systemitem]``rhel-systems``と入力します。
ko: [guimenu]``이름`` 필드에 [systemitem]``rhel-systems``라고 입력합니다.
zh_cn: 在[guimenu]``名称``字段中，键入 [systemitem]``rhel-systems``。

source: In the [guimenu]``Description`` field, type [systemitem]``All RHEL systems``.
ca: Al camp [guimenu].Descripció., escriviu [systemitem].Tots els sistemes RHEL..
ja: ［[guimenu]``説明``］フィールドに[systemitem]``All RHEL systems``と入力します。
ko: [guimenu]``설명`` 필드에 [systemitem]``모든 RHEL 시스템``이라고 입력합니다.
zh_cn: 在[guimenu]``说明``字段中，键入[systemitem]``所有 RHEL 系统``。

source: Click [guimenu]``States`` tab.
ca: Feu clic a la pestanya [guimenu].Estadístiques..
ja: ［[guimenu]``状態``］タブをクリックします。
ko: [guimenu]``상태`` 탭을 클릭합니다.
zh_cn: 单击[guimenu]``状态``选项卡。

source: Click [guimenu]``Configuration Channels`` tab.
ca: Feu clic a la pestanya [guimenu].Canals de configuració..
ja: ［[guimenu]``設定チャンネル``］タブをクリックします。
ko: [guimenu]``구성 채널`` 탭을 클릭합니다.
zh_cn: 单击[guimenu]``配置通道``选项卡。

source: Type [systemitem]``subscription-manager: disable yum plugins`` at the search box.
ca: Type [systemitem].subscription-manager: disable yum plugins at en el quadre de cerca.
ja: 検索ボックスに[systemitem]``subscription-manager: disable yum plugins``と入力します。
ko: 검색 상자에 [systemitem]``subscription-manager: disable yum plugins``라고 입력합니다.
zh_cn: 在搜索框中键入 [systemitem]``subscription-manager: disable yum plugins``。

source: Click btn:[Search] to see the state.
ca: Feu clic a btn:[Cerca] per veure l'estat.
ja: btn:[検索]をクリックして状態を表示します。
ko: btn:[검색]을 클릭하여 상태를 확인합니다.
zh_cn: 单击 btn:[搜索] 以查看状态。

source: Click the checkbox for the state at the [systemitem]``Assign`` column.
ca: Feu clic a la casella de selecció per a l'estat a la columna [systemitem].Assigna..
ja: [systemitem]``Assign``列で状態のチェックボックスをクリックします。
ko: [systemitem]``할당`` 열에서 상태의 확인란을 클릭합니다.
zh_cn: 单击[systemitem]``指派``列中的状态对应的复选框。

source: Click btn:[Save changes].
ca: Feu clic a btn:[Desa els canvis].
ja: btn:[変更点の保存]をクリックします。
ko: btn:[변경 사항 저장]을 클릭합니다.
zh_cn: 单击 btn:[保存更改]。

source: Click btn:[Confirm].
ca: Feu clic a btn:[Confirma].
ja: btn:[確認]をクリックします。
ko: btn:[확인]을 클릭합니다.
zh_cn: 单击 btn:[确认]。

source: If you already have RHEL systems added to {productname}, assign them to the new system group, and then apply the highstate.
ca: Si ja teniu sistemes RHEL afegits a {productname}, assigneu-los al nou grup de sistema i després apliqueu l'estat alt.
ja: RHELシステムを{productname}に追加済みの場合、これらを新しいシステムグループに割り当て、highstateを適用します。

source: Procedure: Adding the System Group to Activation Keys
ca: Procediment: Afegir el grup del sistema a les claus d'activació
ja: プロシージャ: システムグループをアクティベーションキーに追加する
ko: 절차: 시스템 그룹을 활성화 키에 추가
zh_cn: 过程：将系统组添加到激活密钥

source: You need to modify the activation keys you used for RHEL systems to include the system group created above.
ca: Heu de modificar les claus d'activació que heu utilitzat per als sistemes RHEL per incloure el grup de sistema creat anteriorment.
ja: RHELシステムで使用したアクティベーションキーを変更して、上記で作成したシステムグループに含めます。
ko: 위에서 생성한 시스템 그룹을 포함하려면 RHEL 시스템에 사용한 활성화 키를 수정해야 합니다.
zh_cn: 您需要修改用于 RHEL 系统的激活密钥，以包含之前创建的系统组。

source: On the {productname} Server {webui}, navigate to menu:Systems[Activation Keys].
ca: Al servidor {productname} {webui}, navegueu al menú:Systems[Tecles d'activitat].
ja: {productname}サーバの{webui}で、menu:システム[アクティベーションキー]に移動します。
ko: {productname} 서버 {webui}에서 menu:시스템[활성화 키]로 이동합니다.
zh_cn: 在 {productname} 服务器 {webui} 上，导航到menu:系统[激活密钥]。

source: For each the Activation Keys you used for RHEL systems, click on it and:
ca: Per a cada una de les claus d'activació que vau utilitzar per als sistemes RHEL, feu clic sobre seu i:
ja: RHELシステムで使用されるそれぞれのアクティベーションキーをクリックします。
ko: RHEL 시스템에 사용한 각 활성화 키를 클릭하고 다음과 같이 합니다.
zh_cn: 单击用于 RHEL 系统的每个激活密钥并：

source: Navigate to the [guimenu]``Groups`` tab, and the [guimenu]``Join`` subtab.
ca: Navega a la pestanya [guimenu].Grups., i a la sub pestanya [guimenu].Uneix..
ja: ［[guimenu]``グループ``］タブ、［[guimenu]``参加``］サブタブに移動します。
ko: [guimenu]``그룹`` 탭의 [guimenu]``조인`` 하위 탭으로 이동합니다.
zh_cn: 依次导航到[guimenu]``组``选项卡和[guimenu]``加入``子选项卡。
