Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: When you have selected the clients you want to work with, navigate to menu:Systems[System Set Manager], or click the [guimenu]``systems selected`` icon in the top menu bar.
ca: Quan hàgiu seleccionat els clients amb els quals voleu treballar, navegueu a menu:Systems[Systems Set Manager], o feu clic a la icona [guimenu].systems selected. a la barra de menús superior.
ja: 操作するクライアントを選択したら、menu:システム[システムセットマネージャ]に移動し、上部のメニューバーにある［[guimenu]``システムが選択されました``］アイコンをクリックします。
ko: 작업하려는 클라이언트를 선택했으면 menu:시스템[시스템 세트 관리자]로 이동하거나 상단 메뉴 모음에서 [guimenu]``선택한 시스템`` 아이콘을 클릭합니다.
zh_cn: 选择要使用的客户端后，导航到menu:系统[系统集管理器]，或单击顶部菜单栏中的[guimenu]``个系统已选定``图标。

source: The details in SSM might differ slightly from the details in other parts of the {productname} {webui}. In SSM, all available updates are shown. This allows you to upgrade to packages that might not be the latest version.
ca: Els detalls en SSM poden diferir lleugerament dels detalls en altres parts de {productname} {webui}. A SSM es mostren totes les actualitzacions disponibles. Això permet actualitzar a paquets que podrien no ser la versió més recent.
ja: SSMの詳細は、{productname}の{webui}で別の部分にある詳細と若干異なる場合があります。 SSMでは、使用できるすべての更新が表示されます。 そのため、最新バージョンではないかもしれないパッケージをアップグレードされる場合があります。
ko: SSM의 상세 정보는 {productname} {webui}의 다른 부분에 있는 상세 정보와 약간 다를 수 있습니다. SSM에 사용할 수 있는 모든 업데이트가 표시됩니다. 따라서 최신 버전이 아닐 수 있는 패키지로 업그레이드할 수 있습니다.
zh_cn: SSM 中的细节与 {productname} {webui} 其他部分中的细节略有不同。在 SSM 中，所有可用的更新都会显示。这样您可以升级到可能不是最新版本的软件包。

source: Change Base Channels in SSM
ca: Canvia els canals base a SSM
ko: SSM에서 기본 채널 변경하기
zh_cn: 在 SSM 中更改基础通道

source: You can use SSM to change the base channel of more than one client at the same time.
ca: Podeu utilitzar SSM per a canviar el canal base de més d'un client alhora.
ja: SSMを使用して、複数のクライアントのベースチャンネルを同時に変更できます。
ko: SSM을 사용해 동시에 클라이언트 두 개 이상의 기본 채널을 변경할 수 있습니다.
zh_cn: 您可以使用 SSM 同时更改多个客户端的基础通道。

source: Changing the base channel significantly changes the packages and patches available to the affected clients. Use with caution.
ca: Canviar el canal base canvia significativament els paquets i pedaços disponibles per als clients afectats. Utilitzar amb precaució.
ja: ベースチャンネルを大幅に変更すると、影響を受けるクライアントで使用できるパッケージおよびパッチが変更されます。 注意して使用してください。
ko: 기본 채널을 상당 부분 변경하면 영향을 받는 클라이언트에서 사용할 수 있는 패키지 및 패치가 달라집니다. 주의해서 사용하십시오.
zh_cn: 更改基础通道会大量更改可用于受影响客户端的软件包和补丁。须谨慎使用该功能。

source: Procedure: Using SSM to Change Base Channels for Multiple Clients
ca: Procediment: Usar SSM per a canviar els canals base per a múltiples clients
ja: プロシージャ: SSMを使用して複数のクライアントのベースチャンネルを変更する
ko: 절차: SSM을 사용해 여러 클라이언트의 기본 채널 변경
zh_cn: 过程：使用 SSM 更改多个客户端的基础通道

source: In the {productname} {webui}, navigate to menu:Systems[System List], check the clients you want to work with, and navigate to menu:Systems[System Set Manager].
ca: A {productname} {webui}, navegueu al menú:Systems[Llista de sistemes], comproveu els clients amb els quals voleu treballar i navegueu al menú:Systems[Systems Set Manager].
ja: {productname}の{webui}で、menu:システム[システム一覧]に移動し、操作するクライアントにチェックを付け、menu:システム[システムセットマネージャ]に移動します。
ko: {productname} {webui}에서 menu:시스템[시스템 목록]으로 이동하여 작업하려는 클라이언트의 확인란을 선택하고 menu:시스템[시스템 세트 관리자]로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[系统列表]，选中要使用的客户端，然后导航到menu:系统[系统集管理器]。

source: Navigate to the [guimenu]``Channels`` subtab.
ca: Navega a la subtab [guimenu].Canals..
ja: ［[guimenu]``チャンネル``］サブタブに移動します。
ko: [guimenu]``채널`` 하위 탭으로 이동합니다.
zh_cn: 导航到[guimenu]``通道``子选项卡。

source: Locate the current base channel in the list, and verify that the number shown in the [guimenu]``Systems`` column is correct.
ca: Localitza el canal base actual a la llista i verifica que el nombre que es mostra a la columna [guimenu].Sistemes. sigui correcte.
ja: リストで現在のベースチャンネルを見つけ、［[guimenu]``システム``］列に表示されている数字が正しいことを確認します。
ko: 목록에서 현재 기본 채널을 찾고, [guimenu]``시스템`` 열에 표시된 숫자가 정확한지 확인합니다.
zh_cn: 在列表中找到当前的基础通道，并校验[guimenu]``系统``列中显示的数字是否正确。

source: You can click the number in this column to see more details of the clients you are changing.
ca: Podeu fer clic al número d'aquesta columna per veure més detalls dels clients que esteu canviant.
ja: この列の数字をクリックして、変更するクライアントの詳細を表示できます。
ko: 이 열의 숫자를 클릭하면 변경하려는 클라이언트에 관한 더 자세한 정보를 볼 수 있습니다.
zh_cn: 您可以单击此列中的数字查看要更改的客户端的更多细节。

source: Select the new base channel in the [guimenu]``Desired base Channel`` field, and click btn:[Next].
ca: Seleccioneu el canal base nou al camp [guimenu]].Canal base desitjat]. i feu clic a btn:[Següent].
ja: ［[guimenu]``必要なベースチャンネル``］フィールドで新しいベースチャンネルを選択し、btn:[次へ]をクリックします。
ko: [guimenu]``원하는 기본 채널`` 필드에서 새 기본 채널을 선택하고, btn:[다음]을 클릭합니다.
zh_cn: 在[guimenu]``所需基础通道``字段中选择新基础通道，然后单击 btn:[下一步]。

source: For each child channel, select [guimenu]``No change``, [guimenu]``Subscribe``, or [guimenu]``Unsubscribe``, and click btn:[Next].
ca: Per a cada canal fill, seleccioneu [guimenu]].Sense canvis]., [guimenu]].Subscriu,, o [guimenu]].SubscriureUn, i feu clic a btn:[Següent].
ja: 子チャンネルそれぞれで、［[guimenu]``変更なし``］、［[guimenu]``サブスクライブ``］、または［[guimenu]``サブスクライブの中止``］を選択し、btn:[次へ]をクリックします。
ko: 각 하위 채널에 대해 [guimenu]``변경 사항 없음``, [guimenu]``가입`` 또는 [guimenu]``가입 취소``를 선택하고, btn:[다음]을 클릭합니다.
zh_cn: 对于每个子通道，选择[guimenu]``无更改``、[guimenu]``订阅``或[guimenu]``取消订阅``，然后单击 btn:[下一步]。

source: Check the changes you are making, and choose a time for the action to occur.
ca: Comproveu els canvis que esteu fent i trieu una hora perquè es produeixi l'acció.
ja: 変更内容を確認し、いつ変更するかを選択します。
ko: 변경하려는 사항을 확인하고, 작업이 수행되는 시점을 선택합니다.
zh_cn: 选中要进行的更改，然后选择希望操作执行的时间。

source: Click btn:[Confirm] to schedule the changes.
ca: Feu clic a btn:[Confirm] per a programar els canvis.
ja: btn:[確認]をクリックして、変更をスケジュールします。
ko: btn:[확인]을 클릭하여 변경 사항을 예약합니다.
zh_cn: 单击 btn:[确定] 安排更改。

source: System Types
ca: Tipus de sistema
ja: システムの種類
ko: 시스템 유형
zh_cn: 系统类型

source: Clients are categorized by system type. Every client can have both a base system type, and an add-on system type assigned.
ca: Els clients es classifiquen per tipus de sistema. Cada client pot tenir tant un tipus de sistema base com un tipus de sistema de complements assignats.
ja: クライアントは、システムの種類で分類されます。 各クライアントは、両方のベースシステムの種類を備えることができ、アドオンシステムの種類が割り当てられます。
ko: 클라이언트는 시스템 유형을 기준으로 분류됩니다. 각 클라이언트에는 기본 시스템 유형과 할당된 추가 시스템 유형이 있을 수 있습니다.
zh_cn: 客户端按系统类型分类。每个客户端都可以被指派一个基础系统类型和一个附加系统类型。

source: Base system type is ``Salt`` for all clients.
ca: El tipus de sistema base és .Salt. per a tots els clients.

source: Add-on system types include ``Virtualization Host``, for clients that operate as virtual hosts, and ``Container Build Host`` for clients that operate as a build host.
ca: Els tipus de sistemes addicionals inclouen .Virtualization Host., per als clients que operen com a servidors virtuals, i .Container Build Host. per als clients que operen com a host de construcció.
ja: アドオンシステムの種類には、仮想ホストとして動作するクライアントでは``仮想ホスト``、ビルドホストとして動作するクライアントでは``コンテナビルドホスト``が含まれます。
ko: 추가 시스템 유형에는 가상 호스트로 작동하는 클라이언트의 경우 ``가상화 호스트``, 빌드 호스트로 작동하는 클라이언트의 경우 ``컨테이너 빌드 호스트``를 포함합니다.
zh_cn: 附加系统类型包括``虚拟化主机``（作为虚拟主机运行的客户端）和``容器构建主机``（作为构建主机运行的客户端）。

source: You can adjust the add-on system type by navigating to menu:Systems[System List > System Types]. Check the clients you want to change the add-on system type for, select the [guimenu]``Add-On System Type``, and click either btn:[Add System Type] or btn:[Remove System Type].
ca: Podeu ajustar el tipus de sistema de complements navegant al menú:Systems[Llista de sistemes ]. Tipus de sistema]. Comproveu els clients per als quals voleu canviar el tipus de sistema de complements, seleccioneu el [guimenu]].Afegeix el tipus de sistema]. i feu clic a btn:[Afegeix el tipus de sistema] o btn:[Elimina el tipus de sistema].
ja: アドオンシステムの種類は調整できます。そのためには、menu:システム[システム一覧 > システムの種類]に移動します。 アドオンシステムの種類を変更するクライアントにチェックを付け、［[guimenu]``付属エンタイトルメント``］を選択し、btn:[エンタイトルメントの追加]またはbtn:[エンタイトルメントの削除]をクリックします。
ko: menu:시스템[시스템 목록 > 시스템 유형]으로 이동하여 추가 시스템 유형을 조정할 수 있습니다. 추가 시스템 유형을 변경하려는 클라이언트의 확인란을 선택하고, [guimenu]``추가 시스템 유형``을 선택하고, btn:[시스템 유형 추가] 또는 btn:[시스템 유형 제거]를 클릭합니다.
zh_cn: 您可以导航到menu:系统[系统列表 > 系统类型]调整附加系统类型。选中要更改其附加系统类型的客户端，选择[guimenu]``附加系统类型``，然后单击 btn:[添加系统类型] 或 btn:[去除系统类型]。

source: Client Configuration Guide {productname} {productnumber}
ca: Visió general de la guia de configuració del client

source: Virtual Host Manager and Amazon Web Services
ca: Gestors d'amfitrions virtuals

source: You can use a virtual host manager (VHM) to gather instances from Amazon Web Services (AWS).
ca: Pots utilitzar un gestor d'amfitrió virtual (VHM) per a recollir instàncies d'Amazon Web Services (AWS).
ja: 仮想ホストマネージャ(VHM)を使用して、Amazon Web Services (AWS)からインスタンスを収集できます。
ko: 가상 호스트 관리자(VHM)을 사용하여 Amazon Web Services(AWS)에서 인스턴스를 수집할 수 있습니다.
zh_cn: 您可以使用虚拟主机管理器 (VHM) 收集 Amazon Web Services (AWS) 中的实例。

source: The VHM allows {productname} to obtain and report information about your clusters. For more information on VHMs, see xref:client-configuration:vhm.adoc[].
ca: La VHM permet a {productname} obtenir i informar d'informació sobre els vostres clústers. Per a més informació sobre VHMs, vegeu xref:client-configuration:vhm.adoc[].
ja: VHMを使用すると、{productname}は、クラスタに関する情報を取得して報告できます。 VHMの詳細については、xref:client-configuration:vhm.adoc[]を参照してください。
ko: VHM을 통해 {productname}는 클러스터에 대한 정보를 획득하고 보고할 수 있습니다. VHM에 대한 자세한 내용은 xref:client-configuration:vhm.adoc[]을 참조하십시오.
zh_cn: VHM 允许 {productname} 获取并报告有关您的群集的信息。有关 VHM 的详细信息，请参见 xref:client-configuration:vhm.adoc[]。

source: Create an Amazon EC2 VHM
ca: Crea una VHM EC2 d'Amazon
ko: Amazon EC2 VHM 생성
zh_cn: 创建 Amazon EC2 VHM

source: The Virtual Host Manager (VHM) runs on the {productname} Server.
ca: El gestor d'amfitrió virtual (VHM) s'executa al servidor {productname}.
ja: 仮想ホストマネージャ(VHM)は{productname}サーバ上で動作します。
ko: 가상 호스트 관리자(VHM)는 {productname} 서버에서 실행됩니다.
zh_cn: 虚拟主机管理器 (VHM) 在 {productname} 服务器上运行。

source: Ensure you have installed the [systemitem]``virtual-host-gatherer-libcloud`` package on the {productname} Server.
ca: Assegureu-vos que heu instal·lat el paquet [systemitem].virtual-host-gatherer-libcloud. al servidor {productname}.
ja: [systemitem]``virtual-host-gatherer-libcloud``パッケージを{productname}サーバにインストール済みであることを確認してください。
ko: {productname} 서버에 [systemitem]``virtual-host-gatherer-libcloud`` 패키지를 설치했는지 확인하십시오.
zh_cn: 确保您已在 {productname} 服务器上安装 [systemitem]``virtual-host-gatherer-libcloud`` 软件包。

source: Procedure: Creating an Amazon EC2 VHM
ca: Procediment: Creació d'una VHM d'Amazon EC2
ja: プロシージャ: Amazon EC2 VHMの作成
ko: 절차: Amazon EC2 VHM 생성
zh_cn: 过程：创建 Amazon EC2 VHM

source: In the {productname} {webui}, navigate to menu:Systems[Virtual Host Managers].
ca: A {productname} {webui}, navegueu al menú:Systems[Virtual Host Managers].
ja: {productname}の{webui}で、menu:システム[仮想ホストマネージャ]に移動します。
ko: {productname} {webui}에서 menu:시스템[가상 호스트 관리자]로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[虚拟主机管理器]。

source: Click btn:[Create] and select [guimenu]``Amazon EC2`` from the drop-down menu.
ca: Feu clic a btn:[Crea] i seleccioneu [guimenu].Amazon EC2. des del menú desplegable.
ja: btn:[作成]をクリックし、ドロップダウンメニューから［[guimenu]``Amazon EC2``］を選択します。
ko: btn:[생성]을 클릭하고 드롭다운 메뉴에서 [guimenu]``Amazon EC2``를 선택합니다.
zh_cn: 单击 btn:[创建] 并从下拉菜单中选择 [guimenu]``Amazon EC2``。

source: In the [guimenu]``Add an Amazon EC2 Virtual Host Manager`` section, use these parameters:
ca: A la secció [guimenu] theAfegeix un gestor d'amfitrions virtual EC2 d'Amazon use, utilitzeu aquests paràmetres:
ja: ［[guimenu]``Add an Amazon EC2 Virtual Host Manager``］（Amazon EC2仮想ホストマネージャの追加）セクションで、次のパラメータを使用します。
ko: [guimenu]``Amazon EC2 가상 호스트 관리자 추가`` 섹션에서 다음과 같은 파라미터를 사용합니다.
zh_cn: 在[guimenu]``添加 Amazon EC2 虚拟主机管理器``部分，使用以下参数：

source: In the [guimenu]``Label`` field, type a custom name for your VHM.
ca: Al camp [guimenu].Etiqueta., escriviu un nom personalitzat per a la vostra VHM.
ja: ［[guimenu]``ラベル``］フィールドにVHMのカスタム名を入力します。
ko: [guimenu]``레이블`` 필드에 VHM의 사용자 정의 이름을 입력합니다.
zh_cn: 在[guimenu]``标签``字段中，为 VHM 键入自定义名称。

source: In the [guimenu]``Access Key ID`` field, type the access key ID provided by Amazon.
ca: Al camp [guimenu].ID de clau d'accés., escriviu l'ID de clau d'accés proporcionat per Amazon.
ja: ［[guimenu]``Access Key ID``］（アクセスキーID）フィールドに、Amazonが提供するアクセスキーIDを入力します。
ko: [guimenu]``액세스 키 ID`` 필드에서 Amazon이 제공하는 액세스 키 ID를 입력합니다.
zh_cn: 在[guimenu]``访问密钥 ID`` 字段中，键入 Amazon 提供的访问密钥 ID。

source: In the [guimenu]``Secret Access Key`` field, type the secret access key associated with the Amazon instance.
ca: Al camp [guimenu].Clau secreta d'accés., escriviu la clau secreta d'accés associada a la instància d'Amazon.
ja: ［[guimenu]``Secret Access Key``］（秘密アクセス鍵）フィールドに、Amazonインスタンスに関連付けられた秘密アクセス鍵を入力します。
ko: [guimenu]``비밀 액세스 키`` 필드에 Amazon 인스턴스에 연결된 비밀 액세스 키를 입력합니다.
zh_cn: 在[guimenu]``机密访问密钥``字段中，键入与 Amazon 实例关联的机密访问密钥。

source: In the [guimenu]``Region`` field, type the region to use.
ca: Al camp [guimenu].Regió., escriviu la regió a utilitzar.
ja: ［[guimenu]``Region``］（リージョン）フィールドに、使用するリージョンを入力します。
ko: [guimenu]``지역`` 필드에 사용할 지역을 입력합니다.
zh_cn: 在[guimenu]``地区``字段中，键入要使用的地区。

source: In the [guimenu]``Zone`` field, type the zone your VM is located in. This is required for subscription matching to work. For more information about setting regions and zones, see <<susesupport_and_vm_zones>>.
ca: Al camp [guimenu] Zona, escriviu la zona on es troba la vostra màquina virtual. Això és necessari perquè la coincidència de subscripcions funcioni. Per obtenir més informació sobre com definir regions i zones, consulteu <<susesupport_and_vm_zones>>.

source: Click btn:[Create] to save your changes and create the VHM.
ca: Feu clic a btn:[Crea] per a desar els canvis i crear la VHM.
ja: btn:[作成]をクリックして変更を保存し、VHMを作成します。
ko: btn:[생성]을 클릭하여 변경 사항을 저장하고 VHM을 생성합니다.
zh_cn: 单击 btn:[创建] 保存更改并创建 VHM。

source: On the [guimenu]``Virtual Host Managers`` page, select the new VHM.
ca: A la pàgina [guimenu].Virtual Host Managers., seleccioneu la nova VHM.
ja: ［[guimenu]``仮想ホストマネージャ``］ページで、新しいVHMを選択します。
ko: [guimenu]``가상 호스트 관리자`` 페이지에서 새 VHM을 선택합니다.
zh_cn: 在[guimenu]``虚拟主机管理器``页面中，选择新 VHM。

source: On the [guimenu]``Properties`` page, click btn:[Refresh Data] to inventory the new VHM.
ca: A la pàgina [guimenu].Propietats., feu clic a btn:[Actualitza les dades] per a inventariar la nova VHM.
ja: ［[guimenu]``プロパティ``］ページで、btn:[データの更新]をクリックし、新しいVHMを評価します。
ko: [guimenu]``등록 정보`` 페이지에서 btn:[데이터 새로 고침]을 클릭하여 새 VHM을 목록에 포함합니다.
zh_cn: 在[guimenu]``属性``页面中，单击 btn:[刷新数据] 以清点新 VHM。

source: To see which objects and resources have been inventoried, navigate to menu:Systems[System List > Virtual Systems].
ca: Per veure quins objectes i recursos s'han inventariat, navegueu al menú:Systems[Llista de sistemes ]. Sistemes virtuals].
ja: 評価されたオブジェクトおよびリソースを表示するには、menu:システム[システム一覧 > 仮想システム]に移動します。
ko: 어떤 객체 및 리소스가 목록에 포함되었는지 확인하려면 menu:시스템[시스템 목록 > 가상 시스템]으로 이동하십시오.
zh_cn: 要查看已清点的对象和资源，请导航到menu:系统[系统列表 > 虚拟系统]。

source: Instances running on the Amazon public cloud report a UUID to the {productname} Server in the format of an ``i`` followed by seventeen hexadecimal digits:
ca: Les instàncies que s'executen al núvol públic d'Amazon informen d'un UUID al servidor {productname} en el format d'una "i" seguida de disset dígits hexadecimals:
ja: Amazonパブリッククラウドで動作しているインスタンスは、UUIDを{productname}サーバに報告します。その際のフォーマットは、``i``に17桁の16進数をつなげたものです。
ko: Amazon 공용 클라우드에서 실행되는 인스턴스는 ``i`` 뒤에 17개의 16진 숫자가 나오는 형식으로 {productname} 서버에 UUID를 보고합니다.
zh_cn: 在 Amazon 公有云上运行的实例会向 {productname} 服务器报告 UUID，其格式为一个 ``i`` 后跟 17 个十六进制数字：

source: SUSE Support and VM Zones
ca: Zones SUSE Support i VM
ko: SUSE 지원 및 VM 영역
zh_cn: SUSE 支持和 VM 区域

source: Public cloud providers use regions to define the physical geographic location of the datacenter providing virtual machines. For example, [systemitem]``US-East``, or [systemitem]``Asia``.
ca: Els proveïdors públics de núvols utilitzen regions per definir la ubicació geogràfica física del centre de dades que proporciona màquines virtuals. Per exemple, [systemitem].US-East., o [systemitem].Asia..
ja: パブリッククラウドプロバイダは、リージョンを使用して、仮想マシンを提供しているデータセンターにおける地理上の物理的場所を定義します。 たとえば、[systemitem]``米国東部``や[systemitem]``アジア``です。
ko: 공용 클라우드 공급자는 가상 머신을 제공하는 데이터센터의 물리적, 지리적 위치를 지역을 사용해 정의합니다. [systemitem]``미국 동부`` 또는 [systemitem]``아시아``를 예로 들 수 있습니다.
zh_cn: 公有云提供商使用地区来定义提供虚拟机的数据中心的实际地理位置。例如，[systemitem]``美国东部``或[systemitem]``亚洲``。

source: Regions are then further divided into zones. For example, the [systemitem]``US-East`` region might contain zones called [systemitem]``us-east-2a`` and [systemitem]``us-east-2b``, among others.
ca: Les regions es divideixen en zones. Per exemple, la regió [systemitem].US-East. podria contenir zones anomenades [systemitem].us-east-2a. i [systemitem].us-east-2b., entre d'altres.
ja: リージョンがさらにゾーンに分割されます。 たとえば、[systemitem]``米国東部``リージョンには、[systemitem]``us-east-2a``、[systemitem]``us-east-2b``などが含まれる場合があります。
ko: 이어서 지역은 영역으로 한층 더 구분됩니다. 예를 들어 [systemitem]``미국 동부`` 지역은 특히 [systemitem]``us-east-2a`` 및 [systemitem]``us-east-2b``라고 하는 영역을 포함할 수 있습니다.
zh_cn: 地区又可以划分为多个区域。例如，[systemitem]``美国东部``地区可能包含 [systemitem]``us-east-2a`` 和 [systemitem]``us-east-2b`` 等多个区域。

source: {suse} uses the zone of a virtual machine to determine the appropriate subscription to provide. If all of your VMs are provided by the same zone, you are within the terms and conditions of the ``1-2 Virtual Machines`` subscription.
ca: {suse} utilitza la zona d'una màquina virtual per determinar la subscripció apropiada a proporcionar. Si totes les teves VM són proporcionades per la mateixa zona, estàs dins dels termes i condicions de la subscripció 1-1-2 Virtual Machines..
ja: {suse}は、仮想マシンのゾーンを使用して、提供する適切なサブスクリプションを決定します。 すべてのVMが同じゾーンで提供される場合、``1-2仮想マシン``サブスクリプションの条件になります。
ko: {suse}는 제공할 적절한 구독을 가상 머신 영역을 사용해 결정합니다. 모든 VM을 동일한 영역에서 제공하는 경우 ``1-2 가상 머신`` 구독의 규정 및 조건을 충족합니다.
zh_cn: {suse} 使用虚拟机的区域来确定要提供的适当订阅。如果您的所有 VM 均由同一区域提供，您便符合 ``1-2 虚拟机``订阅的条款和条件。

source: If your VMs are provided by different zones, even if they are within the same region, you might not meet the conditions of the ``1-2 Virtual Machines`` subscription. In this case, check your subscription carefully.
ca: Si les teves VM són proporcionades per diferents zones, encara que estiguin dins de la mateixa regió, és possible que no compleixis les condicions de la subscripció 1-1-2 Virtual Machines.. En aquest cas, comprova la teva subscripció amb cura.
ja: VMが異なるゾーンで提供される場合、それらが同じリージョン内であっても、``1-2仮想マシン``サブスクリプションの条件を満たさない場合があります。 この場合、サブスクリプションを注意深く確認してください。
ko: VM을 여러 영역에서 제공하는 경우 동일한 지역 내에 있는 영역이라 하더라도 ``1-2 가상 머신`` 구독의 조건을 충족하지 못할 수 있습니다. 이 경우 구독을 주의 깊게 확인하십시오.
zh_cn: 如果您的 VM 是由不同区域提供的，那么即使它们在同一地区内，您可能也不符合 ``1-2 虚拟机``订阅的条件。在这种情况下，请仔细检查您的订阅。

source: For {byos} instances ({byoslongform}), all installed products are passed to the subscription matcher. If your public cloud instances are {payg} ({payglongform}), their base products are excluded from the subscription matcher counting.
ca: Per a {byos} instàncies ({byoslongform}), tots els productes instal·lats es passen al coincident de subscripció. Si les vostres instàncies públiques al núvol són {payg} ({payglongform}), els seus productes base s'exclouen del recompte del concordador de subscripció.
ko: {byos} 인스턴스({byoslongform})의 경우 설치된 모든 제품이 구독 선택기로 전달됩니다. 퍼블릭 클라우드 인스턴스가 {payg}({payglongform})인 경우, 해당 기본 제품은 구독 선택기 계산에서 제외됩니다.
zh_cn: 对于 {byos} 实例 ({byoslongform})，所有安装的产品均会传递给订阅匹配器。如果您的公有云实例为 {payg} ({payglongform}) 类型，将会从订阅匹配器计算中排除这些实例的基础产品。

source: The calculation about whether an instance is {payg} or {byos} is done at the time of registration or when a hardware refresh action is executed.
ca: El càlcul sobre si una instància és {payg} o {byos} es fa en el moment del registre o quan s'executa una acció d'actualització de maquinari.
ko: 인스턴스가 {payg} 또는 {byos}인지에 대한 계산은 등록 시점에 또는 하드웨어 새로 고침 작업이 실행될 때 수행됩니다.
zh_cn: 计算实例是 {payg} 还是 {byos} 类型的过程在注册时或执行硬件刷新操作时完成。

source: For more information, see https://www.suse.com/products/terms_and_conditions.pdf or contact {suse}.
ca: Per a més informació, consulteu https://www.suse.com/products/termsandconditions.pdf o contacteu amb {suse}.
ja: 詳細については、link:https://www.suse.com/products/terms_and_conditions.pdf[]を参照するか、{suse}にお問い合わせください。
ko: 자세한 내용은 https://www.suse.com/products/terms_and_conditions.pdf[]를 참조하거나 {suse}에 문의하십시오.
zh_cn: 有关详细信息，请参见 https://www.suse.com/products/terms_and_conditions.pdf 或联系 {suse}。

source: AWS Permissions for Virtual Host Manager
ca: Permisos AWS per al gestor d'amfitrions virtual
ja: 仮想ホストマネージャのAWS許可
ko: 가상 호스트 관리자에 대한 AWS 권한
zh_cn: 虚拟主机管理器的 AWS 权限

source: For security reasons, always grant the least privilege possible for a task to be performed. Using an Access Key with excessive permissions for users connecting to AWS is not advised.
ca: Per raons de seguretat, sempre concediu el mínim privilegi possible per a una tasca a realitzar. No es recomana utilitzar una clau d'accés amb permisos excessius per als usuaris que es connectin a AWS.
ja: セキュリティ上の理由から、タスクを実行するために可能な限り最小限の権限を常に付与してください。 AWSに接続するユーザに過度な許可を持つアクセスキーを使用することはお勧めしません。
ko: 보안상의 이유로 항상 수행할 작업에 가능한 최소 권한을 부여해야 합니다. 사용자에게 과도한 권한이 있는 액세스 키를 사용하여 AWS에 연결하는 것은 권장되지 않습니다.
zh_cn: 出于安全原因，请始终为要执行的任务授予尽可能最小的权限。不建议对连接到 AWS 的用户使用具有过高权限的访问密钥。

source: For {productname} to gather the information required from AWS, the VHM needs permission to describe EC2 instances and addresses. One method to grant this is to create a new IAM user (Identity and Access Management) specific to this task, create a policy as follows and attach to the user:
ca: Per tal que SUSE Manager recopili la informació requerida d'AWS, el VHM necessita permís per descriure instàncies i adreces EC2. Un mètode per concedir-ho és crear un nou usuari IAM (Gestió d'Identitat i Accés) específic per a aquesta tasca, crear una política de la següent manera i adjuntar a l'usuari:

source: { "Version": "2012-10-17", "Statement":[ { "Effect": "Allow", "Action": [ "ec2:DescribeAddresses", "ec2:DescribeInstances" ], "Resource": "*" } ] }
ca: { {{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{ "Version": "2012-10-17", "Declaració":[ { {{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{ "Efecte": "Permet", "Acció": [ "ec2:DescribeAddresses", «ec2:DescribeInstances» ] "Recurs": "*" } ] }
ko: { "버전": "2012-10-17", "설명":[ { "효과": "허용", "동작": [ "ec2:DescribeAddresses", "ec2:DescribeInstances" ], "리소스": "*" } ] }

source: You can limit permissions more by restricting access to specific regions. For more information, see https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ExamplePolicies_EC2.html#iam-example-read-only.
ca: Podeu limitar més els permisos restringint l'accés a regions específiques. Per a més informació, vegeu https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ExamplePoliciesEC2.html.iam-example-read-only.
ja: 特定のリージョンへのアクセスを制限することで、許可をさらに制限できます。 詳細については、link:https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ExamplePolicies_EC2.html#iam-example-read-only[]を参照してください。
ko: 특정 영역에 대한 액세스를 제한하여 권한을 자세하게 제한할 수 있습니다. 자세한 내용은 https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ExamplePolicies_EC2.html#iam-example-read-only[]를 참조하십시오.
zh_cn: 您可以通过限制对特定地区的访问来对权限施加更多限制。有关详细信息，请参见 https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ExamplePolicies_EC2.html#iam-example-read-only[]。

source: Virtual Host Manager and Azure
ca: Gestors d'amfitrions virtuals
