Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: {cobbler} power management uses fence-agent tools to support protocols other than IPMI. Only IPMI and Redfish protocols are supported by {productname}. You can configure your client to use other protocols by adding the fence-agent names as a comma-separated list to the [option]``java.power_management.types`` configuration parameter in the [path]``rhn.conf`` configuration files.
ca: La gestió d'energia de {cobbler} utilitza eines d'agent de tanca per donar suport a protocols diferents de l'IPMI. Només els protocols IPMI i Redfish són compatibles amb {productname}. Podeu configurar el vostre client per utilitzar altres protocols afegint els noms dels agents de tanca com una llista separada per comes al paràmetre de configuració [option].java.powermanagement.types. als fitxers de configuració [path].rhn.conf..
ko: {cobbler} 전원 관리는 펜스 에이전트 도구를 사용해 IPMI가 아닌 프로토콜을 지원합니다. {productname}는 IPMI 및 Redfish 프로토콜만 지원합니다. [path]``rhn.conf`` 구성 파일의 [option]``java.power_management.types`` 구성 파라미터에 펜스 에이전트 이름을 쉼표로 구분된 목록으로 추가하여 클라이언트가 다른 프로토콜을 사용하도록 구성할 수 있습니다.
zh_cn: {cobbler} 电源管理使用 fence-agent 工具来支持 IPMI 以外的协议。{productname} 只支持 IPMI 和 Redfish 协议。您可以将客户端配置为使用其他协议，方法是以逗号分隔列表形式将 fence- agent 名称添加到 [path]``rhn.conf`` 配置文件中的 [option]``java.power_management.types`` 配置参数。

source: Software Products
ca: Productes de programari
ja: ソフトウェア製品
ko: 소프트웨어 제품
zh_cn: 软件产品

source: In {productname}, software is made available in products. Your {suse} subscription allows you to access a range of different products, which you can browse and select in the {productname} {webui} by navigating to menu:Admin[Setup Wizard > Products].
ca: A {productname}, el programari està disponible als productes. La vostra subscripció a {suse} us permet accedir a una sèrie de productes diferents, que podeu navegar i seleccionar a {productname} {webui} navegant al menú:Admin[Auxiliar de configuració ]. Productes].
ja: {productname}では、製品でソフトウェアを使用できます。 {suse}サブスクリプションでは、さまざまな製品にアクセスできます。製品には、{productname}の{webui}でmenu:管理[セットアップウィザード > 製品]に移動してブラウズし、選択できます。
ko: {productname}에서는 소프트웨어를 제품 내에서 제공합니다. {suse} 구독을 통해 다양한 제품에 액세스할 수 있습니다. 이러한 제품은 {productname} {webui}에서 menu:관리[설치 마법사 > 제품]으로 이동하여 검색하고 선택할 수 있습니다.
zh_cn: 在 {productname} 中，软件通过不同的产品提供。利用 {suse} 订阅，您可以访问各种不同的产品，通过在 {productname} {webui} 中导航到menu:管理[安装向导 > 产品]可以浏览和选择这些产品。

source: Products contain any number of software channels. Click the `Show product's channels` icon to see the channels included in the product. When you have added a product and synchronized successfully, you have access to the channels provided by the product, and can use the packages in the product on your {productname} Server and clients.
ca: Els productes contenen qualsevol nombre de canals de programari. Feu clic a la icona .Mostra els canals del producte. per a veure els canals inclosos en el producte. Quan hàgiu afegit un producte i sincronitzat correctament, teniu accés als canals proporcionats pel producte, i podeu utilitzar els paquets del producte al vostre servidor i clients {productname}.
ja: 製品には、任意の数のソフトウェアチャンネルが含まれています。 `製品チャンネルの表示` アイコンをクリックし、製品に含まれているチャンネルを表示します。 製品を追加して正常に同期すると、製品で提供しているチャンネルにアクセスできるようになり、{productname}サーバとクライアントで製品のパッケージを使用できます。
ko: 제품에는 소프트웨어 채널이 포함되어 있는데, 그 개수는 다양합니다. `제품 채널 표시` 아이콘을 클릭하여 제품에 포함된 채널을 확인합니다. 제품을 추가하고 동기화를 완료하고 나면 제품이 제공하는 채널에 액세스할 수 있고 {productname} 서버 및 클라이언트에서 제품에 있는 패키지를 사용할 수 있습니다.
zh_cn: 产品包含任意数量的软件通道。单击 `显示产品的通道` 图标可查看产品中包含的通道。成功添加并同步产品后，您便可以访问产品提供的通道，并可以在 {productname} 服务器和客户端上使用产品中的软件包。

source: Register Clients With a Bootstrap Script
ca: Registreu clients amb un script de Bootstrap

source: Registering clients with a bootstrap script gives you control over parameters, and can help if you have to register a large number of clients at once.
ca: Registrar clients amb un script d'arrencada us dona control sobre els paràmetres, i us pot ajudar si heu de registrar un gran nombre de clients alhora.

source: To register clients using a bootstrap script, we recommend you create a template bootstrap script to begin, which can then be copied and modified. The bootstrap script you create is executed on the client when it is registered, and ensures all the necessary packages are deployed to the client. Some parameters in the bootstrap script ensure the client system can be assigned to its base channel, using activation key and GPG key.
ca: Per registrar clients utilitzant un script d'arrencada, us recomanem crear un script d'arrencada de plantilla per començar, que després es pot copiar i modificar. L'script d'arrencada que creeu s'executa al client quan està registrat, i assegura que tots els paquets necessaris es despleguen al client. Alguns paràmetres de l'script bootstrap asseguren que el sistema client es pot assignar al seu canal base, utilitzant la clau d'activació i la clau GPG.

source: It is important that you check the repository information carefully, to ensure it matches the base channel repository. If the repository information does not match exactly, the bootstrap script cannot download the correct packages.
ca: És important que comproveu la informació del repositori amb cura, per assegurar-vos que coincideix amb el repositori del canal base. Si la informació del repositori no coincideix exactament, l'script bootstrap no pot baixar els paquets correctes.
ja: リポジトリ情報を注意深く確認して、ベースチャンネルリポジトリと一致していることを確認することが重要です。 リポジトリ情報が正確に一致しないと、ブートストラップスクリプトは正しいパッケージをダウンロードできません。
ko: 리포지토리 정보를 주의 깊게 확인하여 기본 채널 리포지토리와 일치하게 하는 것이 중요합니다. 리포지토리 정보가 정확히 일치하지 않으면 부트스트랩 스크립트가 패키지를 정확히 다운로드할 수 없습니다.
zh_cn: 请务必仔细检查储存库信息，以确保其与基础通道储存库匹配。如果储存库信息未完全匹配，引导脚本将无法下载正确的软件包。

source: Additional considerations:
ca: Consideracions addicionals:

source: All clients need a bootstrap repository. It is automatically created and regenerated on the {productname} Server when products are synchronized. A bootstrap repository includes packages for installing {salt} on clients, and for registering clients. For more information about creating a bootstrap repository, see xref:client-configuration:bootstrap-repository.adoc[].
ca: Tots els clients necessiten un repositori d'arrencada. Es crea i regenera automàticament al servidor {productname} quan els productes estan sincronitzats. Un repositori d'arrencada inclou paquets per instal·lar {salt} als clients, i per registrar clients. Per a més informació sobre la creació d'un repositori bootstrap, vegeu xref:client-configuration:bootstrap-repository.adoc[].

source: openSUSE Leap 15 and SLE 15 use Python 3 by default. Bootstrap scripts based on Python 2 must be re-created for openSUSE Leap 15 and SLE 15 systems. If you register openSUSE Leap 15 or SLE 15 systems using Python 2, the bootstrap script fails.
ca: openSUSE Leap 15 i SLE 15 utilitzen Python 3 per defecte. Els scripts Bootstrap basats en Python 2 s'han de tornar a crear per als sistemes openSUSE Leap 15 i SLE 15. Si registreu sistemes openSUSE Leap 15 o SLE 15 utilitzant Python 2, falla l'script bootstrap.
ko: openSUSE Leap 15 및 SLES 15는 기본적으로 Python 3를 사용합니다. Python 2에 기반을 둔 부트스트랩 스크립트는 openSUSE Leap 15 및 SLE 15 시스템에 대해 다시 생성해야 합니다. Python 2를 사용해 openSUSE Leap 15 또는 SLE 15 시스템을 등록하는 경우 부트스트랩 스크립트는 실패합니다.
zh_cn: openSUSE Leap 15 和 SLE 15 默认使用 Python 3。必须为 openSUSE Leap 15 和 SLE 15 系统创建基于 Python 2 的引导脚本。如果您使用 Python 2 注册 Leap 15 或 SLE 15 系统，引导脚本将会失败。

source: GPG keys and Uyuni client tools
ca: Claus GPG i eines de client d'Uyuni

source: The GPG key used by Uyuni Client Tools is not trusted by default. When you create your bootstrap script, add a path to the file containing the public key fingerprint with the [systemitem]``ORG_GPG_KEY`` parameter.
ca: La clau GPG utilitzada per Uyuni Client Tools no és de confiança per defecte. Quan creeu l'script bootstrap, afegiu un camí al fitxer que conté l'empremta digital de la clau pública amb el paràmetre [systemitem].ORGGPGKEY..
ja: Uyuniクライアントツールで使用されるGPGキーは、デフォルトでは信頼されていません。 ブートストラップスクリプトを作成するとき、[systemitem]``ORG_GPG_KEY``パラメータを使用して公開鍵の指紋を含むファイルへのパスを追加します。
ko: Uyuni 클라이언트 도구가 사용하는 GPG 키는 기본적으로 신뢰할 수 없습니다. 부트스트랩 스크립트를 생성할 때 [systemitem]``ORG_GPG_KEY`` 파라미터와 함께 공용 키 지문이 포함된 파일의 경로를 추가하십시오.
zh_cn: Uyuni 客户端工具使用的 GPG 密钥默认不受信任。创建引导脚本时，请使用 [systemitem]``ORG_GPG_KEY`` 参数添加包含公共密钥指纹的文件的路径。

source: After migrating from an older version of {productname} to a newer version, we strongly recommend re-generating the bootstrap scripts before onboarding new systems to prevent any potential issues.
ca: Després de migrar des d'una versió antiga de {productname} a una versió més nova, recomanem que es tornin a generar els scripts d'arrencada abans d'embarcar-se en sistemes nous per evitar possibles problemes.

source: To access a shell inside the server container run [literal]``mgrctl term`` on the container host. From there, one can run the CLI tools as usual.
ca: Per accedir a un intèrpret dins del contenidor del servidor, executeu [literal] ``mgrctl term`` a l'amfitrió del contenidor. Des d'allà, es poden executar les eines de la CLI com sempre.

source: Create a bootstrap script with [command]``mgr-bootstrap``
ca: Crea un script d'arrencada amb [command]``mgr-bootstrap``

source: The [command]``mgr-bootstrap`` command generates custom bootstrap scripts. A bootstrap script is used by {productname} client systems for simplifying their initial registration and configuration.
ca: L'ordre [command].mgr-bootstrap. genera scripts d'arrencada personalitzats. Els sistemes de clients {productname} utilitzen un script d'arrencada per simplificar el seu registre i configuració inicial.
ja: [command]``mgr-bootstrap``コマンドは、カスタムブートストラップスクリプトを生成します。 ブートストラップスクリプトは、{productname}クライアントシステムによって初期登録と設定を簡素化するために使用されます。
ko: [command]``mgr-bootstrap`` 명령은 사용자 정의 부트스트랩 스크립트를 생성합니다. 초기 등록 및 구성을 단순화하기 위해 {productname} 클라이언트 시스템은 부트스트랩 스크립트를 사용합니다.
zh_cn: [command]``mgr-bootstrap`` 命令会生成自定义引导脚本。{productname} 客户端系统可使用引导脚本简化其初始注册和配置流程。

source: The arguments [option]``--activation-keys`` and [option]``--script``, are the only mandatory arguments. On the {productname} Server, as root at the command line execute it with the mandatory arguments. Replace [systemitem]``<ACTIVATION_KEY`` and [systemitem]``<EDITED_NAME>`` with your values:
ca: Els arguments [option].--activation-keys and i [option].--script., són els únics arguments obligatoris. Al servidor {productname}, com a root a la línia d'ordres, executeu-lo amb els arguments obligatoris. Reemplaça [systemitem] {<ACTIVATIONKEY`` and [systemitem]``<EDITEDNAME>: amb els vostres valors:

source: From the command prompt of the {productname} container host, run the following command as the root user to enter the server container:
ca: Des de la línia d'ordres de l'amfitrió del contenidor {productname}, executeu l'ordre següent com a usuari d'arrel per entrar al contenidor del servidor:

source: Execute the following command (adjust the values as needed)
ca: Executeu l'ordre següent (ajusteu els valors segons calgui)

source: mgr-bootstrap --activation-keys=<ACTIVATION_KEY> --script=bootstrap-<EDITED_NAME>.sh
ca: mgr-bootstrap --activation-keyss<ACTIVATIONKEY> --script=bootstrap-<EDITEDNAME>.sh

source: The [command]``mgr-bootstrap`` command offers several other options, including the ability to set a specific hostname, set specific GPG keys, and set the registration method (salt-minion or salt-bundle).
ca: L'ordre [command] Themgr-bootstrap offers ofereix diverses altres opcions, incloent la capacitat d'establir un nom d'amfitrió específic, establir claus GPG específiques, i establir el mètode de registre (salt-minion o salt-bundle).

source: If you wish to create a bootstrap script to register against the Proxy, you can do so by using the following command from the Server container:
ca: Si voleu crear un script d'arrencada per registrar-lo contra l'intermediari podeu fer-ho mitjançant l'ordre següent des del contenidor del servidor:

source: This command will create a new bootstrap script with default name [literal]``bootstrap.sh`` and it will overwrite the existing [literal]``bootstrap.sh`` file which is used for the Server.
ca: Aquesta ordre crearà un nou script de bootstrap amb el nom per defecte [literal]``bootstrap.sh`` i sobreescriurà el fitxer [literal]``bootstrap.sh`` existent que s'usa per al servidor.

source: To specify a different script, use the following comamnd:
ca: Per especificar un script diferent, feu servir l'ordre següent:

source: For more information, see the [literal]``mgr-bootstrap`` man page, or run [command]``mgr-bootstrap --help``.
ca: Per a més informació, vegeu la pàgina del manual al vostre servidor {productname} per a [command]:virtual-host-gatherer::
ja: 詳細については、[literal]``mgr-bootstrap``のマニュアルページを参照するか、[command]``mgr-bootstrap --help``を実行してください。
ko: 자세한 내용은 [literal]``mgr-bootstrap`` 사용자 지정 페이지를 참조하거나 [command]``mgr-bootstrap --help``를 실행하십시오.
zh_cn: 有关详细信息，请参见 [literal]``mgr-bootstrap`` 手册页或运行 [command]``mgr-bootstrap --help``。

source: Create a bootstrap script from {webui}
ca: Creeu un script d'arrencada des de {webui}

source: You can use the {productname} {webui} to create an editable bootstrap script.
ca: Podeu utilitzar el {productname} {webui} per crear un script d'arrencada editable.
ja: {productname}の{webui}を使用して、編集できるブートストラップスクリプトを作成できます。
ko: {productname} {webui}를 사용하면 편집 가능한 부트스트랩 스크립트를 생성할 수 있습니다.
zh_cn: 您可以使用 {productname} {webui} 创建可编辑的引导脚本。

source: Procedure: Creating a bootstrap script
ca: Procediment: creació d'un script de Bootstrap

source: In the {productname} {webui}, navigate to menu:Admin[Manager Configuration > Bootstrap Script].
ca: A la {productname} {webui}, navegueu a menu:Admin[Manager Configuration ]. Bootstrap Script].
ja: {productname}の{webui}で、menu:管理[マネージャ設定 > ブートストラップスクリプト]に移動します。
ko: {productname} {webui}에서 menu:관리[관리자 구성 > 부트스트랩 스크립트]로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:管理[管理器配置 > 引导脚本]。

source: The required fields are pre-populated with values derived from previous installation steps. For details on each setting, see xref:reference:admin/bootstrap-script.adoc[].
ca: Els camps requerits estan pre-poblats amb valors derivats de passos d'instal·lació anteriors. Per als detalls de cada configuració, vegeu xref:reference:admin/bootstrap-script.adoc[].
ja: 必須フィールドには、前のインストール手順から取り出した値が事前に入力されています。 各設定の詳細については、xref:reference:admin/bootstrap-script.adoc[]を参照してください。
ko: 필수 필드는 이전의 설치 단계에서 얻은 값으로 미리 채워져 있습니다. 각 설정에 대한 자세한 내용은 xref:reference:admin/bootstrap-script.adoc[]에서 확인할 수 있습니다.
zh_cn: 必填字段中会预填充从之前的安装步骤获得的值。有关每个设置的细节，请参见 xref:reference:admin/bootstrap-script.adoc[]。

source: Click btn:[Update] to create the script.
ca: Feu clic a btn:[Actualitza] per a crear l'script.
ja: btn:[更新]をクリックしてスクリプトを作成します。
ko: btn:[업데이트]를 클릭하여 스크립트를 생성합니다.
zh_cn: 单击 btn:[更新] 创建脚本。

source: The bootstrap script is generated and stored on the server in the [path]``/srv/www/htdocs/pub/bootstrap`` directory. Alternatively, you can access the bootstrap script over HTTPS. Replace [literal]``<example.com>`` with the host name of your {productname} Server:
ca: L'script bootstrap es genera i s'emmagatzema al servidor al directori [path]./srv/www/htdocs/pub/bootstrap.. Alternativament, podeu accedir a l'script d'arrencada a través d'HTTPS. Reemplaça [literal] the<example.com> the amb el nom de l'amfitrió del vostre servidor {productname}:
ja: ブートストラップスクリプトが生成され、サーバの[path]``/srv/www/htdocs/pub/bootstrap``ディレクトリに保存されます。 または、HTTPS経由でブートストラップスクリプトにアクセスできます。 [literal]``<example.com>``を{productname}サーバのホスト名に置き換えます。
ko: 부트스트랩 스크립트는 생성되어 서버의 [path]``/srv/www/htdocs/pub/bootstrap`` 디렉토리에 저장됩니다. 또는, HTTPS를 통해 부트스트랩 스크립트에 액세스할 수 있습니다. [literal]``<example.com>``을 다음과 같은 {productname} 서버의 호스트 이름으로 바꿉니다.
zh_cn: 服务器上的 [path]``/srv/www/htdocs/pub/bootstrap`` 目录中即会生成并存储引导脚本。或者，您也可以通过 HTTPS 访问引导脚本。请将 [literal]``<example.com>`` 替换为您的 {productname} 服务器的主机名：

source: Do not disable SSL in your bootstrap script. Ensure that [guimenu]``Enable SSL`` is checked in the {webui}, or that the setting `USING_SSL=1` exists in the bootstrap script. If you disable SSL, the registration process requires custom SSL certificates.
ca: No desactiveu SSL en el vostre script d'arrencada. Assegureu-vos que [guimenu].Activa SSL. està marcat a {webui}, o que la configuració theUSINGSSL the1. existeix a l'script bootstrap. Si desactiveu SSL, el procés de registre requereix certificats SSL personalitzats.
ja: ブートストラップスクリプトのSSLを無効にしないでください。 {webui}で［[guimenu]``Enable SSL``］（SSLの有効化）がチェックされていること、または設定 `USING_SSL=1` がブートストラップスクリプトに存在していることを確認してください。 SSLを無効にすると、登録プロセスでカスタムSSL証明書が必要です。
ko: 부트스트랩 스크립트에서 SSL을 비활성화하지 마십시오. {webui}에서 [guimenu]``SSL 활성화`` 확인란이 선택되어 있는지, 또는 ``USING_SSL=1``이라는 설정이 부트스트랩 스크립트에 있는지 확인합니다. SSL을 비활성화하면 등록 프로세스에 사용자 정의 SSL 인증서가 필요합니다.
zh_cn: 请勿在引导脚本中禁用 SSL。请在 {webui} 中确保 [guimenu]``启用 SSL`` 处于选中状态，或者引导脚本中包含 `USING_SSL=1` 设置。如果您禁用 SSL，将需要在注册过程中提供自定义 SSL 证书。

source: For more information about custom certificates, see xref:administration:ssl-certs.adoc[].
ca: Per a més informació sobre els canals personalitzats, vegeu xref:administration:custom-channels.adoc[].

source: Edit a bootstrap script
ca: Editar un script d'arrencada

source: You can copy and modify the template bootstrap script you created to customize it. A minimal requirement when modifying a bootstrap script for use with {productname} is the inclusion of an activation key. Most packages are signed with GPG, so you also need to have trusted GPG keys on your system to install them.
ca: Podeu copiar i modificar l'script d'arrencada de la plantilla que heu creat per personalitzar-lo. Un requisit mínim quan es modifica un script d'arrencada per utilitzar-lo amb {productname} és la inclusió d'una clau d'activació. La majoria dels paquets estan signats amb GPG, de manera que també heu de tenir claus GPG de confiança al vostre sistema per instal·lar-les.
ja: 作成したブートストラップスクリプトのテンプレートをコピーして変更し、カスタマイズできます。 {productname}で使用するためにブートストラップスクリプトを編集するときの最小要件は、アクティベーションキーを含めることです。 ほとんどのパッケージはGPGで署名されているため、信頼できるGPGキーをシステムで用意してインストールすることも必要です。
ko: 생성한 템플릿 부트스트랩 스크립트를 복사 및 수정하여 사용자 정의할 수 있습니다. {productname}에서 사용할 부트스트랩 스크립트를 수정할 때 충족해야 할 최소 요구사항은 활성화 키를 포함해야 한다는 것입니다. 대부분의 패키지는 GPG로 서명되므로 패키지를 설치할 시스템에 신뢰할 수 있는 GPG 키도 있어야 합니다.
zh_cn: 您可以复制和修改所创建的模板引导脚本，以对其进行自定义。要将引导脚本用于 {productname}，对其进行修改时至少需包含激活密钥。大多数软件包都是使用 GPG 签名的，因此系统上还需要有可信的 GPG 密钥才能安装这些软件包。

source: In this procedure, you need to know the exact name of your activation keys. Navigate to menu:Home[Overview] and, in the [guimenu]``Tasks`` box, click [guimenu]``Manage Activation Keys``. All keys created for channels are listed on this page. You must enter the full name of the key you wish to use in the bootstrap script exactly as presented in the key field. For more information about activation keys, see xref:client-configuration:activation-keys.adoc[].
ca: En aquest procediment, heu de conèixer el nom exacte de les vostres claus d'activació. Navega al menú:Inici[Vista general] i, al quadre [guimenu].Tasques., feu clic a [guimenu].Gestioneu les tecles d'activació.. Totes les claus creades per als canals es llisten en aquesta pàgina. Heu d'introduir el nom complet de la clau que voleu utilitzar a l'script bootstrap exactament com es presenta al camp clau. Per obtenir més informació sobre les claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].
ja: このプロシージャでは、アクティベーションキーの正確な名前を知っている必要があります。 menu:ホーム[概要]に移動し、［[guimenu]``タスク``］ボックスで、［[guimenu]``アクティベーションキーの管理``］をクリックします。 チャンネル用に作成したすべてのキーがこのページに一覧表示されます。 ブートストラップスクリプトで使用するキーのフルネームを、キーフィールドに表示されているように正確に入力する必要があります。 アクティベーションキーの詳細については、xref:client-configuration:activation-keys.adoc[]を参照してください。
ko: 이 절차에서 활성화 키의 정확한 이름을 알아야 합니다. menu:홈[개요]로 이동하여 [guimenu]``작업`` 상자에서 [guimenu]``활성화 키 관리``를 클릭합니다. 채널에 대해 생성된 모든 키는 이 페이지에 나열되어 있습니다. 부트스트랩 스크립트에서 사용하려는 키의 전체 이름을 키 필드에 표시된 대로 정확히 입력해야 합니다. 활성화 키에 대한 자세한 내용은 xref:client-configuration:activation-keys.adoc[]를 참조하십시오.
zh_cn: 在执行此过程时，您需要知道激活密钥的确切名称。导航到menu:首页[概览]，然后在[guimenu]``任务``框中，单击[guimenu]``管理激活密钥``。此页面上会列出为通道创建的所有密钥。您在引导脚本中输入的要使用的密钥完整名称必须与密钥字段中显示的名称完全相同。有关激活密钥的详细信息，请参见 xref:client-configuration:activation-keys.adoc[]。

source: Procedure: Modifying a bootstrap script
ca: Procediment: modificació d'un script d'arrencada

source: On your {productname} Server, as root at the command line change to the bootstrap directory with:
ca: Al servidor {productname}, a l'indicador d'ordres, actualitzeu el registre del certificat de la CA:
ja: {productname}サーバのコマンドラインでrootとして、ブートストラップディレクトリを次のように変更します。
ko: {productname} 서버에서 명령줄의 루트 권한으로 다음과 같이 부트스트랩 디렉토리로 변경합니다.
zh_cn: 在 {productname} 服务器上的命令行中，以 root 身份运行以下命令切换到引导目录：

source: Create and rename two copies of the template bootstrap script for use with each of your clients.
ca: Creeu i reanomeneu dues còpies de l'script bootstrap de la plantilla per utilitzar-lo amb cadascun dels vostres clients.
ja: 各クライアントで使用するブートストラップスクリプトのテンプレートのコピーを2つ作成し、名前を変更します。
ko: 각 클라이언트에서 사용할 템플릿 부트스트랩 스크립트 사본 2개를 생성하여 이름을 변경합니다.
zh_cn: 创建并重命名用于每个客户端的两个模板引导脚本副本。

source: Open [path]``bootstrap-sles15.sh`` for modification.
ca: Obriu [path].bootstrap-sles15.sh. per a la modificació.
ja: 変更するために[path]``bootstrap-sles15.sh``を開きます。
ko: 수정을 위해 [path]``bootstrap-sles15.sh``를 엽니다.
zh_cn: 打开 [path]``bootstrap-sles15.sh`` 进行修改。

source: Scroll down until you can see the text shown below. If ``exit 1`` exists in the file, comment it out by typing a hash or pound sign (&#35;) at the beginning of the line. This activates the script. Enter the name of the key for this script in the ``ACTIVATION_KEYS=`` field:
ca: Desplaceu-vos cap avall fins que veieu el text que es mostra a continuació. Si .exit 1. existeix en el fitxer, comenteu-ho escrivint un signe de hash o lliura (3535;) al començament de la línia. Això activa l'script. Introduïu el nom de la clau per a aquest script al camp theACTIVATIONKEYS::
ja: 次のテキストが表示されるまで下方にスクロールします。 ファイルに「``exit 1``」がある場合、その行の先頭にハッシュまたはポンド記号(&#35;)を入力してコメントアウトします。 これによって、スクリプトがアクティブになります。 ``ACTIVATION_KEYS=``フィールドにこのスクリプトのキーの名前を入力します。
ko: 아래와 같은 텍스트가 나올 때까지 아래로 스크롤합니다. ``exit 1``이 파일에 있는 경우 해시 또는 파운드 기호(&#35;)를 줄 첫머리에 입력하여 코멘트 아웃합니다. 이렇게 하면 스크립트가 활성화됩니다. 이 스크립트의 키 이름을 ``ACTIVATION_KEYS=`` 필드에 다음과 같이 입력합니다.
zh_cn: 向下滚动，直到看到如下所示的文本。如果文件中包含 ``exit 1``，请在该行的开头键入井号 (&#35;) 将其注释掉。这样会激活脚本。在 ``ACTIVATION_KEYS=`` 字段中，输入此脚本的密钥的名称：

source: echo "Enable this script: comment (with #'s) this block (or, at least just" echo "the exit below)" echo #exit 1
ca: echo "Enable this script: comment (with )'s) this block (or, almenys just" echo "the exit BELOW) echo exit 1

source: # can be edited, but probably correct (unless created during initial install): # NOTE: ACTIVATION_KEYS *must* be used to bootstrap a client machine. ACTIVATION_KEYS=1-sles15 ORG_GPG_KEY=
ca: ): es pot editar, però probablement corregir (tret que es creï durant la instal·lació inicial): . NOTA: ACTIVATIONKEYS *ha d'usar-se per arrencar una màquina client. ACTIVATIONKEYS1-1-sles15 ORGGPGKEY=
ko: # 수정할 수 있으나 아마 정확할 것입니다(초기 설치 중에 생성하지 않은 경우): # 참고: ACTIVATION_KEYS는 클라이언트 시스템을 부트스트래핑하는 데 *반드시* 사용해야 합니다. ACTIVATION_KEYS=1-sles15 ORG_GPG_KEY=

source: Instead of editing the script manually, user can pass the following environment variables at runtime:
ca: En lloc d'editar l'script manualment, l'usuari pot passar les variables d'entorn següents en temps d'execució:

source: `ACTIVATION_KEYS`: Activation keys to use for registration
ca: ACTIVATION_KEYS: claus d'activació que s'usaran per al registre

source: `ORG_GPG_KEY`: Path or identifier of the GPG key
ca: ORG_GPG_KEY: camí o identificador de la clau GPG

source: `REACTIVATION_KEY`: Reactivation key for previously registered systems
ca: REACTIVATION_KEY: clau de reactivació per a sistemes registrats prèviament

source: `MGR_SERVER_HOSTNAME`: Hostname of the Server or Proxy to register the client against
ca: MGR_SERVER_HOSTNAME: nom d'amfitrió del servidor o intermediari on registrar el client
