Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: Make sure all the channels of the target product are fully synchronized. To check the synchronization status in the {webui}, navigate to the menu:Admin[Setup Wizard > Products] page.
ca: Assegureu-vos que tots els canals del producte de destinació estiguin completament sincronitzats. Per comprovar l'estat de sincronització a la pàgina {webui}, navegueu fins a la pàgina de menú:Admin[Auxiliar de configuració . Productes].
ja: ターゲット製品のすべてのチャンネルが完全に同期されていることを確認してください。 {webui}で同期ステータスを確認するには、menu:管理[セットアップウィザード > 製品]ページに移動します。
ko: 대상 제품의 모든 채널이 완전히 동기화되었는지 확인합니다. {webui}에서 동기화 상태를 확인하려면, menu:관리자[설정 마법사 > 제품] 페이지로 이동합니다.
zh_cn: 确保目标产品的所有通道都已完全同步。要在 {webui} 中检查同步状态，请导航到menu:管理[安装向导 > 产品]页面。

source: Ensure you have a working system backup available, in case of an emergency. Product migration does not have a rollback feature. When the migration procedure has begun, rolling back is not possible.
ca: Assegura't de tenir disponible una còpia de seguretat del sistema de treball, en cas d'emergència. La migració de productes no té una funció de retrocés. Quan s'ha iniciat el procediment de migració, no és possible fer marxa enrere.
ja: 万一に備えて、作業システムのバックアップを用意してください。 製品の移行にはロールバック機能はありません。 移行プロシージャが始まると、ロールバックできません。
ko: 비상 상황에서 사용할 수 있는 시스템 백업이 있는지 확인하십시오. 제품 마이그레이션에는 롤백 기능이 없습니다. 마이그레이션 절차가 시작되면 롤백이 불가능합니다.
zh_cn: 请确保您具有有效的系统备份，以防万一。产品迁移没有回滚功能。迁移过程一旦开始，就无法回滚。

source: Procedure: Performing a Single System Migration
ca: Procediment: Realització d'una migració massiva de productes
ja: プロシージャ: 単一システムの移行の実行
ko: 절차: 단일 시스템 마이그레이션 수행
zh_cn: 过程：执行单系统迁移

source: From the menu:Systems[Overview] page, select a client.
ca: Des de la pàgina menú:Sistemes[Vista general], seleccioneu un client.
ja: menu:システム[概要]ページからクライアントを選択します。
ko: menu:시스템[개요] 페이지에서 클라이언트를 선택합니다.
zh_cn: 从menu:系统[概览]页面中，选择一个客户端。

source: From the system details page of the client, navigate to the menu:Software[Product Migration] tab.
ca: Des de la pàgina de detalls del sistema del client, navegueu a la pestanya menú:Software[Product Migration].
ja: クライアントのシステム詳細ページから、menu:ソフトウェア[製品移行]タブに移動します。
ko: 클라이언트의 시스템 정보 페이지에서 menu:소프트웨어[ 제품 마이그레이션] 탭으로 이동합니다.
zh_cn: 从客户端的系统细节页面，导航到menu:软件[产品迁移]选项卡。

source: Select the target migration path and click btn:[Select Channels].
ca: Seleccioneu el camí de migració de destinació i feu clic a btn:[Selecciona els canals].
ja: ターゲットの移行パスを選択し、btn:[チャンネルの選択]をクリックします。
ko: 대상 마이그레이션 경로를 선택하고 btn:[채널 선택]을 클릭합니다.
zh_cn: 选择目标迁移路径，然后单击 btn:[选择通道]。

source: From the [guimenu]``Product Migration - Channels`` page select the correct base channel, including ``Mandatory Child Channels`` and any additional ``Optional Child Channels``.
ca: Des de la pàgina [guimenu].Produeix la migració - Canals. seleccioneu el canal base correcte, inclosos els .Canals secundaris normals. i qualsevol .Canals secundaris opcionals..
ja: ［[guimenu]``製品移行 - チャンネル``］ページから、正しいベースチャンネルを選択し、``必須の子チャンネル``および追加の``オプション子チャンネル``を含めます。
ko: [guimenu]``제품 마이그레이션 - 채널`` 페이지에서 ``필수 하위 채널``과 추가 `` 옵션 하위 채널``을 포함하여 올바른 기본 채널을 선택합니다.
zh_cn: 从[guimenu]``产品迁移 - 通道``页面选择正确的基础通道，包括``必需的子通道``和任何其他``可选的子通道``。

source: OPTIONAL: Check [guimenu]``Allow Vendor Change`` to allow packages that have changed vendors to be installed. If this occurs, a notification is shown with details before the migration is started.
ca: OPCIONAL: Marqueu [guimenu].Permet el canvi de proveïdor. per a permetre que s'instal·lin els paquets que han canviat els proveïdors. Si això passa, es mostra una notificació amb detalls abans d'iniciar la migració.
ja: オプション: ［[guimenu]``ベンダー変更を許可する``］にチェックを付け、ベンダを変更したパッケージをインストールできるようにします。 チェックを付けると、移行の開始前に詳細を示す通知が表示されます。
ko: 선택 사항: [guimenu]``벤더 변경 허용``을 선택하여 벤더가 변경된 패키지를 설치할 수 있도록 허용합니다. 이 경우 마이그레이션이 시작되기 전에 세부 정보와 함께 알림이 표시됩니다.
zh_cn: 可选：选中[guimenu]``允许供应商更改``，以允许安装供应商发生更改的软件包。如果发生此情况，开始迁移前会显示一条包含相关细节的通知。

source: To migrate openSUSE Leap to {sles}, you must check the [guimenu]``Allow Vendor Change`` option.
ca: Per a migrar openSUSE Leap a {sles}, heu de marcar l'opció [guimenu].Permetre un canvi de proveïdor..
ja: openSUSE Leapを{sles}に移行するには、［[guimenu]``ベンダー変更を許可する``］オプションにチェックを付ける必要があります。
ko: openSUSE Leap을 {sles}로 마이그레이트하려면 [guimenu]``벤더 변경 허용`` 옵션을 선택해야 합니다.
zh_cn: 要将 openSUSE Leap 迁移到 {sles}，必须选中[guimenu]``允许更改供应商``选项。

source: Click btn:[Schedule Migration] when your channels have been configured properly.
ca: Feu clic a btn:[Migració de planificació] quan els canals s'hagin configurat correctament.
ja: チャンネルを正しく設定したらbtn:[移行のスケジュール]をクリックします。
ko: 채널이 적절히 구성되었으면 btn:[마이그레이션 예약]을 클릭합니다.
zh_cn: 正确配置您的通道后，单击 btn:[安排迁移]。

source: Product Mass Migration
ca: Migració massiva de productes
ja: 製品の大量移行
ko: 제품 대량 마이그레이션
zh_cn: 产品大量迁移

source: If you want to migrate a large number of clients to the next SP version, you can use {productname} API calls.
ca: Si voleu migrar un gran nombre de clients a la següent versió de SP, podeu utilitzar {productname} trucades API.
ja: 多数のクライアントを次のSPバージョンに移行する場合、{productname} APIコールを使用できます。
ko: 다수의 클라이언트를 다음 SP 버전으로 마이그레이션하고 싶은 경우 {productname} API 호출을 사용하면 됩니다.
zh_cn: 如果您要将大量客户端迁移到下一 SP 版本，可以使用 {productname} API 调用。

source: The [command]``spacecmd`` commandline tool provides a [systemitem]``system_scheduleproductmigration`` sub command, which can be used to schedule a migration for a large number of clients to the next minor version.
ca: L'eina de línia d'ordres [ordre].spacecmd The proporciona una subordre [systemitem].systemscheduleproductmigration., que es pot utilitzar per programar una migració per a un gran nombre de clients a la següent versió menor.
ja: [command]``spacecmd``コマンドラインツールは、[systemitem]``system_scheduleproductmigration``サブコマンドを提供します。 このコマンドを使用して、多数のクライアントの次のマイナーバージョンへの移行をスケジュールできます。
ko: [command]``spacecmd`` 명령줄 도구는 [systemitem]``system_scheduleproductmigration`` 하위 명령을 제공하며, 이 하위 명령을 사용하여 많은 수의 클라이언트에 대해 다음 부 버전으로의 마이그레이션을 예약할 수 있습니다.
zh_cn: [command]``spacecmd`` 命令行工具提供了 [systemitem]``system_scheduleproductmigration`` 子命令，可用于安排将大量客户端迁移到下一次要版本。

source: Perform a Product Mass Migration
ca: Procediment: Realització d'una migració massiva de productes
ja: 製品の大量移行の実行
ko: 제품 대량 마이그레이션 수행
zh_cn: 执行产品大量迁移

source: The product mass migration operation is dangerous and the process should be tested thoroughly. At least, do a dry-run first.
ca: L'operació de migració massiva de productes és perillosa i el procés ha de ser provat a fons. Com a mínim, primer feu una carrera seca.
ja: 製品の大量移行操作は危険です。 プロセスは徹底的にテストする必要があります。 少なくとも、最初に予行演習を行ってください。
ko: 제품 대량 마이그레이션 작업은 위험하므로 프로세스를 철저히 테스트해야 합니다. 최소한으로 시험 실행을 우선 수행하십시오.
zh_cn: 产品大量迁移操作非常危险，该过程应经过全面测试。至少应先进行试运行。

source: Be careful not to upgrade systems unintentionally.
ca: Aneu amb compte de no actualitzar els sistemes sense voler.
ja: システムを意図せずにアップグレードしないように注意してください。
ko: 실수로 시스템을 업그레이드하지 않도록 주의하십시오.
zh_cn: 请务必小心，不要无意中升级系统。

source: Procedure: Performing a Product Mass Migration
ca: Procediment: Realització d'una migració massiva de productes
ja: 手順: 製品の大量移行の実行
ko: 절차: 제품 대량 마이그레이션 수행
zh_cn: 过程：执行产品大量迁移

source: List available migration targets, and take note of the system IDs you want to migrate:
ca: Llista els objectius de migració disponibles i pren nota dels IDs del sistema que voleu migrar:
ja: 実行可能な移行ターゲットをリストし、移行するシステムIDをメモします。
ko: 다음과 같이 사용 가능한 마이그레이션 대상을 나열하고, 마이그레이션하려는 시스템 ID를 적어 둡니다.
zh_cn: 列出可用的迁移目标，并记下要迁移的系统 ID：

source: For each system ID, call [systemitem]``listMigrationTarget`` and check that the desired target product is available.
ca: Per a cada ID del sistema, crideu [systemitem].listMigrationTarget. i comproveu que el producte desitjat està disponible.
ja: それぞれのシステムIDに対して、[systemitem]``listMigrationTarget``を呼び出し、目的の製品が使用可能であることを確認します。
ko: 각 시스템 ID에 대해 [systemitem]``listMigrationTarget``을 호출하고 원하는 대상 제품이 사용 가능한지 확인합니다.
zh_cn: 针对每个系统 ID 调用 [systemitem]``listMigrationTarget``，并查看所需的目标产品是否可用。

source: If the system ID has an available target, call [systemitem]``system.scheduleProductMigration``.
ca: Si l'ID del sistema té un objectiu disponible, crideu [systemitem].system.scheduleProductMigration..
ja: システムIDに使用可能なターゲットがある場合は、[systemitem]``system.scheduleProductMigration``を呼び出します。
ko: 시스템 ID에 사용 가능한 대상이 있는 경우 [systemitem]``system. scheduleProductMigration``을 호출합니다.
zh_cn: 如果系统 ID 有可用目标，则调用 [systemitem]``system. scheduleProductMigration``。

source: If the desired target is not available, skip the system.
ca: Si l'objectiu desitjat no està disponible, omet el sistema.
ja: 目的のターゲットを使用できない場合、そのシステムをスキップします。
ko: 원하는 대상을 사용할 수 없는 경우 시스템을 건너뛰십시오.
zh_cn: 如果所需目标不可用，则跳过该系统。

source: Adapt this template for your environment:
ca: Adapta aquesta plantilla per al teu entorn:
ja: 次のテンプレートを環境に合わせます。
ko: 다음 템플릿을 환경에 맞게 조정합니다.
zh_cn: 根据您的环境调整以下模板：

source: session = auth.login(user, pass) for system in system_ids if system.listMigrationTargets(session, system).ident == target system.scheduleProductMigration(session, system, target, basechannel, [], False, <now>) else print "Cannot migrate to requested target -- skipping system" endif endfor
ca: sessió ) auth.login(usuari, passada) per al sistema en «systemids» if system.listMigrationTargets(session, system).ident ). target system.scheduleProductMigration(sessió, sistema, destinació, canal base, [], Fals, <now>) altrament imprimeix «No es pot migrar a l'objectiu sol·licitat -- s'omet el sistema» endif endfor
ko: session = auth.login(user, pass) for system in system_ids if system.listMigrationTargets(session, system).ident == target system.scheduleProductMigration(session, system, target, basechannel, [], False, <now>) else print "요청된 대상으로 마이그레이션할 수 없음 -- 시스템 건너뛰기" endif endfor
zh_cn: session = auth.login(user, pass) for system in system_ids if system.listMigrationTargets(session, system).ident == target system.scheduleProductMigration(session, system, target, basechannel, [] , False, <now>) else print "无法迁移到请求的目标 -- 正在跳过系统" endif endfor

source: Example: SLES 15 SP2 to SLES 15 SP3
ca: Exemple: SLES 15 SP2 a SLES 15 SP3
ja: 例: SLES 15 SP2からSLES 15 SP3
ko: 예: SLES 15 SP2에서 SLES 15 SP3로
zh_cn: 示例：从 SLES 15 SP2 迁移到 SLES 15 SP3

source: For this example, a group will be created temporarily to facilitate the mass migration.
ca: Per a aquest exemple, es crearà un grup temporalment per a facilitar la migració massiva.
ja: この例では、大量移行を容易にするためにグループが一時的に作成されます。
ko: 이 예에서는 대량 마이그레이션을 편리하게 수행할 수 있도록 그룹이 임시로 생성됩니다.
zh_cn: 对于此示例，将会创建一个组，以便于进行大量迁移。

source: Procedure: Creating a Mass Product Migration Group
ca: Procediment: Realització d'una migració massiva de productes
ja: プロシージャ: 製品の大量移行グループの作成
ko: 절차: 대량 제품 마이그레이션 그룹 생성
zh_cn: 过程：创建大量产品迁移组

source: In the {productname} {webui}, navigate to menu:Systems[System Groups], and click btn:[Create Group].
ca: A la {productname} {webui}, navegueu al menú:Systems[Informació del sistema personalitzat], i feu clic a btn:[Crea clau].
ja: {productname}の{webui}で、menu:システム[システムグループ]に移動し、btn:[グループの作成]をクリックします。
ko: {productname} {webui}에서 menu:시스템[시스템 그룹]으로 이동하여 btn:[그룹 생성]을 클릭합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[系统组]，然后单击 btn:[创建组]。

source: Name the group [literal]``mpm-target-sles15sp3``.
ca: Anomeneu el grup [literal].mpm-target-sles15sp3..
ja: グループに[literal]``mpm-target-sles15sp3``という名前を付けます。
ko: [literal]``mpm-target-sles15sp3`` 그룹의 이름을 지정하십시오.
zh_cn: 将该组命名为 [literal]``mpm-target-sles15sp3``。

source: Only systems subscribed to the same base channel should be added to the created group. In the example, only systems subscribed to [literal]``SLE-Product-SLES15-SP2-Pool for x86_64`` should be added to the group.
ca: Només els sistemes subscrits al mateix canal base s'han d'afegir al grup creat. En l'exemple, només s'han d'afegir al grup els sistemes subscrits a [literal].SLE-Product-SLES15-SP2-Pool per a x8664..
ja: 同じベースチャンネルにサブスクライブしているシステムのみを、作成したグループに追加する必要があります。 この例では、[literal]``SLE-Product-SLES15-SP2-Pool for x86_64``にサブスクライブされているシステムのみをグループに追加する必要があります。
ko: 동일한 기본 채널에 등록된 시스템만 생성된 그룹에 추가해야 합니다. 이 예에서는 [literal]``SLE-Product-SLES15-SP2-Pool for x86_64``에 등록된 시스템만 그룹에 추가되었습니다.
zh_cn: 您应该仅将订阅了相同基础通道的系统添加到创建的组中。本示例只会将订阅了 [literal]``SLE-Product-SLES15-SP2-Pool for x86_64`` 的系统添加到该组中。

source: For more information about adding clients to groups, see xref:client-configuration:system-groups.adoc[].
ca: Per obtenir més informació sobre el gestor de conjunts de sistemes, vegeu xref:client-configuration:system-set-manager.adoc[].

source: Procedure: Adding Systems to the Group
ca: Procediment: Afegir múltiples clients a un grup
ja: プロシージャ: グループへのシステムの追加
ko: 절차: 시스템을 그룹에 추가
zh_cn: 过程：将系统添加到组

source: Get the targets for all the systems in the group by running:
ca: Aconsegueix els objectius de tots els sistemes del grup executant:
ja: 次のコマンドを実行して、グループ内のすべてのシステムのターゲットを取得します。
ko: 그룹 내의 모든 시스템에 대한 대상을 가져오려면 다음을 실행합니다.
zh_cn: 运行以下命令，以获取该组中所有系统的目标：

source: spacecmd -- system_listmigrationtargets group:mpm-target-sles15sp3
ca: spacecmd api -- system.listMigrationTargets -A 1000010001

source: The command output a string of "IDs."
ca: L'ordre envia una cadena de «IDs».
ja: コマンドは「ID」の文字列を出力します。
ko: 이 명령을 수행하면 "ID" 스트링이 출력됩니다.
zh_cn: 命令的输出为由多个 ID 组成的字符串。

source: Only select a target, which is reported for *all* systems.
ca: Seleccioneu només un objectiu, el qual s'informa per als sistemes *all*.
ja: *すべての* システムについて報告されるターゲットのみを選択してください。
ko: *모든* 시스템에 대해 보고되는 대상만 선택하십시오.
zh_cn: 请只选择一个目标，这样为*所有*系统报告的就是该目标。

source: The string is the identifier for the [literal]``MIGRATIONTARGET`` of the other command.
ca: La cadena és l'identificador per a la [literal].MIGRATIONTARGET. de l'altra ordre.
ja: 文字列は、他のコマンドの[literal]``MIGRATIONTARGET``の識別子です。
ko: 스트링은 다른 명령의 [literal]``MIGRATIONTARGET``에 대한 식별자입니다.
zh_cn: 该字符串是另一个命令的 [literal]``MIGRATIONTARGET`` 的标识符。

source: The [command]``spacecmd`` sub-commands [literal]``system_scheduleproductmigration`` and [command]``system_listmigrationtargets`` are looping over all systems that are part of the group.
ca: Les subordres [literal].spacecmd The [literal].systemscheduleproductmigration. i [command].systemlistmigrationtargets. estan fent bucles sobre tots els sistemes que formen part del grup.
ja: [command]``spacecmd``サブコマンド[literal]``system_scheduleproductmigration``と[command]``system_listmigrationtargets``は、グループの一部であるすべてのシステムをループしています。
ko: [command]``spacecmd`` 하위 명령 [literal]``system_scheduleproductmigration`` 및 [command]``system_listmigrationtargets``는 그룹 일부에 해당하는 모든 시스템을 반복합니다.
zh_cn: [command]``spacecmd`` 的子命令 [literal]``system_scheduleproductmigration`` 和 [command]``system_listmigrationtargets`` 会遍历该组中的所有系统。

source: If there are 100 systems in the group, you will see 100 actions scheduled.
ca: Si hi ha 100 sistemes en el grup, veureu 100 accions programades.

source: All systems in the group must support the same migration target.
ca: Tots els sistemes del grup han de donar suport al mateix objectiu de migració.
ja: グループ内のすべてのシステムは同じ移行ターゲットをサポートする必要があります。
ko: 그룹의 모든 시스템은 동일한 마이그레이션 대상을 지원해야 합니다.
zh_cn: 该组中的所有系统都必须支持相同的迁移目标。

source: Procedure: Running the Mass Migration Command
ca: Procediment: Realització d'una migració massiva de productes
ja: プロシージャ: 大量移行コマンドの実行
ko: 절차: 대량 마이그레이션 명령 실행
zh_cn: 过程：运行大量迁移命令

source: The syntax for the [command]``system_scheduleproductmigration`` command is as follows:
ca: La sintaxi de l'ordre [command] thesystemscheduleproductmigration the és la següent:
ja: [command]``system_scheduleproductmigration``コマンドの構文は次のとおりです。
ko: [command]``system_scheduleproductmigration`` 명령의 구문은 다음과 같습니다.
zh_cn: [command]``system_scheduleproductmigration`` 命令的语法如下：

source: spacecmd -- system_scheduleproductmigration <SYSTEM> <BASE_CHANNEL_LABEL> \ <MIGRATION_TARGET> [options]
ca: spacecmd -- systemscheduleproductmigration <SYSTEM> <BASECHANNELLABEL> \ <MIGRATIONTARGET> [opcions]
ko: spacecmd -- system_scheduleproductmigration <SYSTEM> <BASE_CHANNEL_LABEL> \ <MIGRATION_TARGET> [옵션]
zh_cn: spacecmd -- system_scheduleproductmigration <SYSTEM> <BASE_CHANNEL_LABEL> \ <MIGRATION_TARGET> [选项]

source: For this example to upgrade all systems in the group [literal]``mpm-target-sles15sp3`` from SLES 12 SP2 to SLES 15 SP, enter on the command line:
ca: Per a aquest exemple per actualitzar tots els sistemes del grup [literal] thempm-target-sles15sp3 the de SLES 12 SP2 a SLES 15 SP, introduïu a la línia d'ordres:
ja: この例では、グループ[literal]``mpm-target-sles15sp3``内のすべてのシステムをSLES 12 SP2からSLES 15 SPにアップグレードするには、コマンドラインで次のように入力します。
ko: 이 예에서 [literal]``mpm-target-sles15sp3`` 그룹의 모든 시스템을 SLES 12 SP2에서 SLES 15 SP로 업그레이드하려면 명령줄에 다음을 입력:
zh_cn: 对于此示例，要将 [literal]``mpm-target-sles15sp3`` 组中的所有系统从 SLES 12 SP2 升级到 SLES 15 SP3，请在命令行上输入以下命令：

source: Mandatory Syntax Explained
ca: Sintaxi obligatòria explicada
ja: 必須の構文の説明
ko: 필수 구문 설명
zh_cn: 命令语法说明

source: To see syntax usage and options for [command]``system_scheduleproductmigration``, run:
ca: Per a veure l'ús de la sintaxi i les opcions per a [ordred],systemscheduleproductmigration,, executeu:
ja: [command]``system_scheduleproductmigration``の構文の使用方法とオプションを表示するには、次のコマンドを実行します。
ko: [command]``system_scheduleproductmigration``에 대한 구문 사용 및 옵션을 보려면 다음을 실행하십시오.
zh_cn: 要查看 [command]``system_scheduleproductmigration`` 的语法和选项，请运行以下命令：

source: spacecmd system_scheduleproductmigration help
ca: spacecmd systemscheduleproductmigration ajuda

source: For this example we will use the group we created to select all of the systems from that group:
ca: Per a aquest exemple utilitzarem el grup que hem creat per a seleccionar tots els sistemes d'aquest grup:
ja: この例では、作成したグループを使用して、そのグループからすべてのシステムを選択します。
ko: 이 예에서는 해당 그룹에서 모든 시스템을 선택하기 위해 생성한 그룹을 사용합니다.
zh_cn: 对于此示例，我们将使用我们创建的组选择该组中的所有系统：

source: This is the label for the target base channel. In this case, the system is being upgraded to SLES 15 SP3, and the label is [literal]``sle-product-sles15-sp3-pool-x86_64``.
ca: Aquesta és l'etiqueta del canal base de destinació. En aquest cas, el sistema s'actualitza a SLES 15 SP3, i l'etiqueta és [literal].sle-product-sles15-sp3-pool-x8664..
ja: これは、ターゲットベースチャンネルのラベルです。 この場合、システムはSLES 15 SP3にアップグレードされており、ラベルは[literal]``sle-product-sles15-sp3-pool-x86_64``です。
ko: 대상 기본 채널의 레이블입니다. 이 경우 시스템은 SLES 15 SP3로 업그레이드되고 레이블은 [literal]``sle-product-sles15-sp3-pool-x86_64``입니다.
zh_cn: 这是目标基础通道的标签。在本例中，系统将升级到 SLES 15 SP3，且标签为 [literal]``sle-product-sles15-sp3-pool-x86_64``。

source: To see a list of all base channels currently mirrored, run:
ca: Per a veure una llista de tots els canals base actualment reflectits, executeu:
ja: 現在ミラーリングされているすべてのベースチャンネルのリストを表示するには、次のコマンドを実行します。
ko: 현재 미러링되는 모든 기본 채널 목록을 보려면 다음을 실행:
zh_cn: 要查看当前镜像的所有基础通道的列表，请运行以下命令：

source: Keep in mind you cannot upgrade to a channel unless it is an available target for your current base channel.
ca: Tingueu en compte que no podeu actualitzar a un canal tret que sigui un objectiu disponible per al vostre canal base actual.
ja: 現在のベースチャンネルで使用可能なターゲットでない限り、チャンネルにアップグレードできないことに注意してください。
ko: 현재 기본 채널에 대해 사용할 수 있는 대상이 아닌 경우 채널로 업그레이드할 수 없음에 유의하십시오.
zh_cn: 请注意，除非通道是当前基础通道的可用目标，否则您无法升级到该通道。

source: To identify this value for systems in the group [literal]``group:mpm-target-sles15sp3``, run:
ca: Per a identificar aquest valor per als sistemes del grup [literal] thegroup:mpm-target-sles15sp3 the, executeu:
ja: グループ[literal]``group:mpm-target-sles15sp3``内のシステムのこの値を特定するには、次のコマンドを実行します。
ko: [literal]``group:mpm-target-sles15sp3`` 그룹의 시스템에 대해 이 값을 식별하려면 다음을 실행:
zh_cn: 要为 [literal]``group:mpm-target-sles15sp3`` 组中的系统确定此值，请运行以下命令：

source: The [literal]``MIGRATION_TARGET`` parameter must be passed in the following format; note necessary shell quotation to prevent sideeffects with brackets:
ca: El paràmetre [literal] theMIGRATIONTARGET the s'ha de passar en el següent format; tingueu en compte la cometa necessària per evitar efectes secundaris amb claudàtors:
ja: [literal]``MIGRATION_TARGET``パラメータは、次の形式で渡す必要があります。角括弧の副次作用を防ぐために、シェルの引用符が必要であることに注意してください。
ko: [literal]``MIGRATION_TARGET`` 매개 변수가 전달되어야 하는 형식이며, 괄호 사용으로 인한 부작용을 방지하기 위해 셸 인용구 필요:
zh_cn: 必须采用以下格式传递 [literal]``MIGRATION_TARGET`` 参数；请注意需要使用引号将其括住以防中括号会产生问题：

source: Options
ca: Opcions
ja: オプション
ko: 옵션
zh_cn: 选项

source: [literal]``-s`` START_TIME
ca: [literal]]-s] HORAINICI

source: [literal]``-d`` pass this flag, if you want to do a dry run (it is recommended to run a dry run before the actual migration)
ca: [literal] the-d, passa aquesta bandera, si voleu fer una cursa seca (es recomana executar una cursa seca abans de la migració real)
ja: [literal]``-d`` 予行演習モード(実際には処理を行わない) (実際の移行の前に予行演習を行うことを推奨)
ko: 시험 실행을 원할 경우 [literal]``-d``가 이 플래그를 전달합니다(실제 마이그레이션을 수행하기 전 시험 실행을 실행하는 것이 권장됨).
zh_cn: [literal]``-d`` 如果您要执行试运行，请传递此标志（建议在实际执行迁移前执行试运行）

source: [literal]``-c`` CHILD_CHANNELS (comma-separated child channels labels with no spaces)
ca: [literal])-c) CHILDCHANNELS (etiquetes de canals infantils separades per comes sense espais)
ja: [literal]``-c`` (子チャンネル) (カンマ区切りで子チャンネルのラベルを指定する 。空白は使用しないこと)
ko: [literal]``-c`` CHILD_CHANNELS(공백 없이 쉼표로 구분된 하위 채널 레이블)
zh_cn: [literal]``-c`` CHILD_CHANNELS（逗号分隔的子通道标签（不带空格））

source: In this case we included the [literal]``-d`` option, which can be removed after a successful dry run.
ca: En aquest cas incloem l'opció [literal].-d., que es pot eliminar després d'una exitosa cursa en sec.
ja: この場合、[literal]``-d``オプションが含まれています。このオプションは予行演習が成功した後に削除できます。
ko: 이 경우 성공적인 시험 실행 후 제거할 수 있는 [literal]``-d`` 옵션이 포함되었습니다.
zh_cn: 在本例中，我们包含了 [literal]``-d`` 选项，在成功执行试运行后可以将其去除。

source: If successful, the command output for each scheduled system will look like this:
ca: Si té èxit, la sortida de l'ordre per a cada sistema programat es veurà així:
ja: 成功した場合、スケジュールされたシステムごとのコマンド出力は次のようになります。
ko: 성공하면 예약된 각 시스템의 명령 출력은 다음과 같습니다.
zh_cn: 如果成功，安排的每个系统的命令输出将如下所示：

source: Scheduling Product migration for system mpm-sles152-1 Scheduled action ID: 66
ca: Programació Migració de producte per al sistema mpm-sles152-1 ID d'acció programada: 66
ko: mpm-sles152-1 시스템에 대한 제품 마이그레이션 예약 예약된 작업 ID: 66
zh_cn: 正在为以下系统安排产品迁移 mpm-sles152-1 已安排操作 ID：66

source: You can also track the action, in this case the dry run, in the {webui} for a given system in the group. From the system details page of the client, navigate to menu:Events[History]. If there are any failures during the dry run, the system should be investigated.
ca: També podeu fer un seguiment de l'acció, en aquest cas la cursa en sec, a {webui} per a un sistema determinat del grup. Des de la pàgina de detalls del sistema del client, navegueu al menú:Esdeveniments[Història]. Si hi ha alguna fallada durant la cursa seca, el sistema s'ha d'investigar.

source: If all is well, the [literal]``-d`` option can be removed from the command to run the real migration. After the migration is complete, you can reboot the system from the {productname} {webui}.
ca: Si tot està bé, l'opció [literal].-d, es pot eliminar de l'ordre per executar la migració real. Un cop finalitzada la migració, podeu reiniciar el sistema des del {productname} {webui}.

source: Upgrade Uyuni Clients
ca: Actualitza els clients Uyuni
ja: Uyuniクライアントのアップグレード
ko: Uyuni 클라이언트 업그레이드
zh_cn: 升级 Uyuni 客户端

source: In this section, we use openSUSE Leap as an example.
ca: En aquesta secció, utilitzem openSUSE Leap com a exemple.
ja: このセクションでは、例としてopenSUSE Leapを使用します。
ko: 이 섹션에서는 openSUSE Leap을 예로 사용합니다.
zh_cn: 在本节中，我们以 openSUSE Leap 为例。

source: Procedure: Preparing the Client Upgrade
ca: Procediment: Aprovisionament dels Clients
ja: プロシージャ: クライアントのアップグレードの準備
ko: 절차: 클라이언트 업그레이드 준비
zh_cn: 过程：准备客户端升级
