Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: | OS Version | Base Product | Base Channel | {redhat} 9 | RHEL and Liberty 9 Base | el9-pool-x86_64 | {redhat} 8 | RHEL or SLES ES or CentOS 8 Base | rhel8-pool-x86_64 | {redhat} 7 | RHEL7 Base x86_64 | rhel7-pool-x86_64
ca: Versió del SO Producte base Canal base and {redhat} 9 and RHEL i Liberty 9 Base el9-pool-x8664 {redhat} 8 RHEL o SLES ES o CentOS 8 Base rhel8-pool-x8664 {redhat} 7 Base RHEL7 x8664 rhel7-pool-x8664

source: | OS Version | Base Channel | {redhat} 7 | rhel7-pool-uyuni | {redhat} 8 | rhel8-pool-uyuni | {redhat} 9 | rhel9-pool-uyuni
ca: Versió del SO Canal base {redhat} 7 rel7-pool-uyuni {redhat} 8 rel8-pool-uyuni {redhat} 9 rel9-pool-uyuni

source: Check synchronization status
ca: Comprova l'estat de la sincronització

source: Manage GPG keys
ca: Gestiona els convidats de la MV

source: Register clients
ca: Registra clients
ja: クライアントの登録
ko: 클라이언트 등록
zh_cn: 注册客户端

source: Registering {rocky} Clients
ca: S'estan registrant {rocky} clients
ja: {rocky}クライアントの登録
ko: {rocky} 클라이언트 등록
zh_cn: 注册 {rocky} 客户端

source: This section contains information about registering clients running {rocky} operating systems.
ca: Aquesta secció conté informació sobre el registre de clients que executen sistemes operatius {rocky}.

source: {rocky} repository URLs are available from {scclongform}.
ca: Els URL del repositori {rocky} estan disponibles des de {scclongform}.

source: Packages and metadata are provided by Rocky Enterprise Software Foundation, not by {suse}.
ca: Els paquets i les metadades són proporcionats per la Rocky Enterprise Software Foundation, no per {suse}.

source: For supported products, see the release notes and the support table at xref:client-configuration:supported-features-rocky.adoc[].
ca: Per obtenir una llista completa de clients i característiques compatibles, vegeu xref:client-configuration:supported-features.adoc[].

source: Registering {rocky} clients to {productname} is tested with the default SELinux configuration of ``enforcing`` with a ``targeted`` policy. You do not need to disable SELinux to register {rocky} clients to {productname}.
ca: Registrar {rocky} clients a {productname} es prova amb la configuració predeterminada de SELinux de .enforcing. amb una política .targeted.. No cal que desactiveu SELinux per registrar {rocky} clients a {productname}.
ja: {rocky}クライアントの{productname}への登録は、``ターゲット``ポリシーで``適用``されるデフォルトのSELinux設定でテストされます。 {rocky}クライアントを{productname}に登録するために、SELinuxを無効にする必要はありません。
ko: {rocky} 클라이언트를 {productname}에 등록하는 기능은 ``목표`` 정책으로 ``강제``하는 기본 SELinux 구성으로 테스트됩니다. SELinux를 비활성화해야 {rocky} 클라이언트를 {productname}에 등록할 수 있는 것은 아닙니다.
zh_cn: 我们已使用``针对性``策略并采用默认的 ``enforcing`` SELinux 配置对将 {rocky} 客户端注册到 {productname} 的过程进行了测试。将 {rocky} 客户端注册到 {productname} 时，您无需禁用 SELinux。

source: Before you can register {rocky} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de poder registrar {rocky} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.
ja: {rocky}クライアントを{productname}サーバに登録する前に、必要なソフトウェアチャンネルを追加して同期する必要があります。
ko: {rocky} 클라이언트를 {productname} 서버에 등록하려면 먼저 필요한 소프트웨어 채널을 추가하고 이 채널을 동기화해야 합니다.
zh_cn: 将 {rocky} 客户端注册到您的 {productname} 服务器之前，您需要添加所需的软件通道，并同步这些通道。

source: The architectures currently supported are: `x86_64` and `aarch64`, on version 9 additionally {ppc64le} and {s390x}. For full list of supported products and architectures, see xref:client-configuration:supported-features.adoc[].
ca: Les arquitectures suportades actualment són: xx8664. i .aarch64.. Per obtenir una llista completa de productes i arquitectures compatibles, vegeu xref:client-configuration:supported-features.adoc[].
ko: 현재 지원되는 아키텍처는 ``x86_64`` 및 ``aarch64``이며, 버전 9의 경우 추가적으로 {ppc64le} 및 {s390x}가 지원됩니다. 지원되는 제품 및 아키텍처의 전체 목록은 xref:client-configuration:supported-features.adoc[]에서 확인할 수 있습니다.
zh_cn: 目前支持的系统结构有 `x86_64` 和 `aarch64`，在版本 9 上，另外还支持 {ppc64le} 和 {s390x}。有关支持的产品和体系结构的完整列表，请参见 xref:client-configuration:supported-features.adoc[]。

source: {rocky} Products - WebUI
ca: {rocky} Productes - WebUI
ja: {rocky}製品 - WebUI
ko: {rocky} 제품 - WebUI
zh_cn: {rocky} 产品 - WebUI

source: | OS Version | Product Name | {rocky} 9 | {rocky} 9 x86_64 | {rocky} 8 | {rocky} 8 x86_64
ca: Versió del SO Nom del producte {rocky} 9 {rocky} 9 x8664 {rocky} 8 {rocky} 8 x8664

source: {rocky} Channels - CLI
ca: {rocky} canals - CLI
ja: {rocky}チャンネル - CLI
ko: {rocky} 채널 - CLI
zh_cn: {rocky} 通道 - CLI

source: | OS Version | Base Channel | {rocky} 9 | rockylinux9-x86_64 | {rocky} 8 | rockylinux8-x86_64
ca: | Versió del SO | Canal base | {amazon} 2 | amazonlinux2-core-x86_64
ko: | OS 버전 | 기본 채널 | {rocky} 9 | rockylinux9-x86_64 | {rocky} 8 | rockylinux8-x86_64
zh_cn: | 操作系统版本 | 基础通道 | {rocky} 9 | rockylinux9-x86_64 | {rocky} 8 | rockylinux8-x86_64

source: | OS Version | Base Channel | Client Channel | AppStream Channel | {rocky} 9 | rockylinux9 | rockylinux9-uyuni-client | rockylinux9-appstream | {rocky} 8 | rockylinux8 | rockylinux8-uyuni-client | rockylinux8-appstream
ca: Versió del SO Canal base Canal client Canal AppStream {rocky} 9 rockylinux9 rockylinux9-uyuni-client rockylinux9-appstream {rocky} 8 rockylinux8 rockylinux8-uyuni-client rockylinux8-appstream
ko: | OS 버전 | 기본 채널 | 클라이언트 채널 | AppStream 채널 | {rocky} 9 | rockylinux9 | rockylinux9-uyuni-client | rockylinux9-appstream | {rocky} 8 | rockylinux8 | rockylinux8-uyuni-client | rockylinux8-appstream
zh_cn: | 操作系统版本 | 基础通道 | 客户端通道 | AppStream 通道 | {rocky} 9 | rockylinux9 | rockylinux9-uyuni-client | rockylinux9-appstream | {rocky} 8 | rockylinux8 | rockylinux8-uyuni-client | rockylinux8-appstream

source: For {rocky}{nbsp}9 and {rocky}{nbsp}8 clients, add both the Base and AppStream channels. You require packages from both channels. If you do not add both channels, you cannot create the bootstrap repository, due to missing packages.
ca: Per als clients {rocky}{nbsp}9 i {rocky}{nbsp}8, afegiu els canals Base i AppStream. Necessiteu paquets d'ambdós canals. Si no afegiu els dos canals, no podreu crear el repositori bootstrap, a causa de la manca de paquets.

source: You might notice some disparity in the number of packages available in the AppStream channel between upstream and the {productname} channel. You might also see different numbers if you compare the same channel added at a different point in time. This is due to the way that {rocky} manages their repositories. {rocky} removes older version of packages when a new version is released, while {productname} keeps all of them, regardless of age.
ca: És possible que noteu una certa disparitat en el nombre de paquets disponibles al canal AppStream entre el canal de dalt i el canal {productname}. També podeu veure números diferents si compareu el mateix canal afegit en un moment diferent. Això es deu a la manera en què {rocky} gestiona els seus repositoris. {rocky} elimina la versió més antiga dels paquets quan es llança una versió nova, mentre que {productname} els manté tots, independentment de l'edat.
ja: 上流のチャンネルと{productname}チャンネルの間のAppStreamチャンネルで利用できるパッケージ数に不一致が発生する場合があります。 また、同時に別の場所で追加したチャンネルを比較すると、数値が異なる場合もあります。 {rocky}でリポジトリを管理する方法が原因です。 {rocky}では新しいバージョンがリリースされると古いバージョンのパッケージが削除されますが、{productname}では経過年数に関係なくすべてのバージョンが保持されます。
ko: AppStream 채널에서 사용할 수 있는 패키지의 수가 업스트림과 {productname} 채널 간에 서로 약간 불일치함을 알 수 있습니다. 또한 다른 시점에 추가한 동일 채널을 비교하면 그 수가 다른 것을 알 수 있습니다. 이는 {rocky}가 리포지토리를 관리하는 방식에 원인이 있습니다. {rocky}는 새 버전이 릴리스되면 이전 버전의 패키지를 제거하지만 {productname}는 사용 기간과 관계없이 모두 그대로 유지합니다.
zh_cn: 您可能会发现 AppStream 通道中提供的软件包数量在上游通道和 {productname} 通道之间存在一定的差异。如果您对在不同时间添加的同一通道进行比较，会发现其数量也不相同。这是由 {rocky} 管理其储存库的方式所致。当有新版本发布时，{rocky} 会去除软件包的较旧版本，而 {productname} 则会保留所有版本，无论新旧与否。

source: If you are using modular channels with {rocky} 8, you must enable the Python 3.6 module stream on the client. If you do not provide Python 3.6, the installation of the [package]``spacecmd`` package will fail.
ca: Si esteu utilitzant canals modulars, heu d'habilitar el flux del mòdul Python 3.6 al client. Si no proporcioneu Python 3.6, la instal·lació del paquet [package].spacecmd. fallarà.

source: You need to create an activation key that is associated with your {rocky} channels.
ca: Heu de crear una clau d'activació que estigui associada amb els vostres canals {rocky}.
ja: {rocky}チャンネルと関連付けられているアクティベーションキーを作成する必要があります。
ko: {rocky} 채널에 연결된 활성화 키를 생성해야 합니다.
zh_cn: 您需要创建与您的 {rocky} 通道关联的激活密钥。

source: Trusting a GPG key is important for security on clients. It is the task of the administrator to decide which keys are needed and can be trusted. A software channel cannot be assigned to a client when the GPG key is not trusted.
ca: Confiar en una clau GPG és important per a la seguretat dels clients. És tasca de l'administrador decidir quines claus són necessàries i poden ser de confiança. Un canal de programari no es pot assignar a un client quan no es confia en la clau GPG.
ja: クライアントのセキュリティにとってGPGキーを信頼することは重要です。 必要かつ信頼できるキーを決定するのは管理者のタスクです。 GPGキーが信頼されていない場合、ソフトウェアチャンネルをクライアントに割り当てることはできません。
ko: 클라이언트의 보안을 위해 GPG 키의 신뢰성이 중요합니다. 어떤 키가 필요하고 신뢰할 수 있는지 결정하는 것은 관리자가 수행해야 하는 작업입니다. GPG 키를 신뢰할 수 없으면 클라이언트에 소프트웨어 채널을 할당할 수 없습니다.
zh_cn: 信任 GPG 密钥对于客户端的安全非常重要。由管理员来决定需要哪些密钥，可以信任哪些密钥。如果不信任 GPG 密钥，便无法为客户端指派软件通道。

source: When you update {rocky} clients, the packages include metadata about the updates.
ca: Quan actualitzeu {rocky} clients, els paquets inclouen metadades sobre les actualitzacions.
ja: {rocky}クライアントを更新するとき、パッケージには更新に関するメタデータが含まれています。
ko: {rocky} 클라이언트를 업데이트할 때 패키지에는 업데이트에 대한 메타데이터가 포함됩니다.
zh_cn: 当您更新 {rocky} 客户端时，软件包会包含有关更新的元数据。

source: Registering {sle} Clients
ca: S'estan registrant {sle} clients
ja: {sle}クライアントの登録
ko: {sle} 클라이언트 등록
zh_cn: 注册 {sle} 客户端

source: This section contains information about registering clients running {sle} operating systems.
ca: Aquesta secció conté informació sobre el registre de clients que executen sistemes operatius {sle}.

source: Use the instructions in this chapter for preparing all {sle} products, including:
ca: Utilitzeu les instruccions d'aquest capítol per preparar tots els productes {sle}, incloent:
ja: 以下を含むすべての{sle}製品を準備する際には、この章の手順を使用してください。
ko: 다음을 포함하여 모든 {sle} 제품을 준비하려면 이 장의 지침을 사용하십시오.
zh_cn: 请按照本章中的说明准备所有 {sle} 产品，包括：

source: {sles} for SAP
ca: {sles} per SAP

source: {sle} Desktop
ca: {sle} Escriptori
ko: {sle} 데스크톱

source: {sle} Real Time
ca: {sle} temps real

source: You can also use these instructions for older {sle} versions and service packs.
ca: També podeu utilitzar aquestes instruccions per a versions més antigues de {sle} i paquets de serveis.
ja: これらの手順は、古い{sle}バージョンおよびサービスパックにも使用できます。
ko: 이전 {sle} 버전 및 서비스 팩에서도 이러한 지침을 사용할 수 있습니다.
zh_cn: 您也可以按照这些说明准备较旧的 {sle} 版本和服务包。

source: Before you register {sle} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de registrar {sle} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.
ja: {sle}クライアントを{productname}サーバに登録する前に、必要なソフトウェアチャンネルを追加して同期する必要があります。
ko: {sle} 클라이언트를 {productname} 서버에 등록하기 전에 필요한 소프트웨어 채널을 추가하고 이 채널을 동기화해야 합니다.
zh_cn: 将 {sle} 客户端注册到您的 {productname} 服务器之前，您需要添加所需的软件通道，并同步这些通道。

source: SLE Products - WebUI
ca: Productes SLE - WebUI
ja: SLE製品 - WebUI
ko: SLE 제품 - WebUI
zh_cn: SLE 产品 - WebUI

source: | OS Version | Product Name | {sles} 16.0 | SUSE Linux Enterprise Server 16.0 x86_64 | {sles} 15 SP7 | SUSE Linux Enterprise Server 15 SP7 x86_64 | {sles} 15 SP6 | SUSE Linux Enterprise Server 15 SP6 x86_64 | {sles} 15 SP5 | SUSE Linux Enterprise Server 15 SP5 x86_64 | {sles} 15 SP4 | SUSE Linux Enterprise Server 15 SP4 x86_64 | {sles} 15 SP3 | SUSE Linux Enterprise Server 15 SP3 x86_64 | {sles} 15 SP2 | SUSE Linux Enterprise Server 15 SP2 x86_64 | {sles} 15 SP1 | SUSE Linux Enterprise Server 15 SP1 x86_64 | {sles} 12 SP5 | SUSE Linux Enterprise Server 12 SP5 x86_64
ca: | Versió del sistema operatiu | Nom del producte | {sles} 16.0 | SUSE Linux Enterprise Server 16.0 x86_64 | {sles} 15 SP7 | SUSE Linux Enterprise Server 15 SP7 x86_64 | {sles} 15 SP6 | SUSE Linux Enterprise Server 15 SP6 x86_64 | {sles} 15 SP5 | SUSE Linux Enterprise Server 15 SP5 x86_64 | {sles} 15 SP4 | SUSE Linux Enterprise Server 15 SP4 x86_64 | {sles} 15 SP3 | SUSE Linux Enterprise Server 15 SP3 x86_64 | {sles} 15 SP2 | SUSE Linux Enterprise Server 15 SP2 x86_64 | {sles} 15 SP1 | Servidor SUSE Linux Enterprise 15 SP1 x86_64 | {sles} 12 SP5 | Servidor SUSE Linux Enterprise 12 SP5 x86_64

source: SLE Products - CLI
ca: Productes SLE - CLI
ja: SLE製品 - CLI
ko: SLE 제품 - CLI
zh_cn: SLE 产品 - CLI

source: | OS Version | Base Channel | {sles} 16.0 | sle-product-sles-16.0-x86_64 | {sles} 15 SP7 | sle-product-sles15-sp7-pool-x86_64 | {sles} 15 SP6 | sle-product-sles15-sp6-pool-x86_64 | {sles} 15 SP5 | sle-product-sles15-sp5-pool-x86_64 | {sles} 15 SP4 | sle-product-sles15-sp4-pool-x86_64 | {sles} 15 SP3 | sle-product-sles15-sp3-pool-x86_64 | {sles} 15 SP2 | sle-product-sles15-sp2-pool-x86_64 | {sles} 15 SP1 | sle-product-sles15-sp1-pool-x86_64 | {sles} 12 SP5 | sle-product-sles15-sp5-pool-x86_64
ca: | Versió del sistema operatiu | Canal base | {sles} 16.0 | sle-product-sles-16.0-x86_64 | {sles} 15 SP7 | sle-product-sles15-sp7-pool-x86_64 | {sles} 15 SP6 | sle-product-sles15-sp6-pool-x86_64 | {sles} 15 SP5 | sle-product-sles15-sp5-pool-x86_64 | {sles} 15 SP4 | sle-product-sles15-sp4-pool-x86_64 | {sles} 15 SP3 | sle-product-sles15-sp3-pool-x86_64 | {sles} 15 SP2 | sle-product-sles15-sp2-pool-x86_64 | {sles} 15 SP1 | sle-product-sles15-sp1-pool-x86_64 | {sles} 12 SP5 | sle-product-sles15-sp5-pool-x86_64

source: SUSE Linux Enterprise Channels - CLI
ca: Canals SUSE Linux Enterprise - CLI
ja: SUSE Linux Enterpriseチャンネル - CLI
ko: SUSE Linux Enterprise 채널 - CLI
zh_cn: SUSE Linux Enterprise 通道 - CLI

source: | OS Version | Client Channel | {sles} 16.0 | sles16-0-uyuni-client | {sles} 15 SP7 | sles15-sp7-uyuni-client | {sles} 15 SP6 | sles15-sp6-uyuni-client | {sles} 15 SP5 | sles15-sp5-uyuni-client | {sles} 15 SP4 | sles15-sp4-uyuni-client | {sles} 15 SP3 | sles15-sp3-uyuni-client | {sles} 15 SP2 | sles15-sp2-uyuni-client | {sles} 15 SP1 | sles15-sp1-uyuni-client | {sles} 12 SP5 | sles12-sp5-uyuni-client
ca: | Versió del sistema operatiu | Canal del client | {sles} 16.0 | sles16-0-uyuni-client | {sles} 15 SP7 | sles15-sp7-uyuni-client | {sles} 15 SP6 | sles15-sp6-uyuni-client | {sles} 15 SP5 | sles15-sp5-uyuni-client | {sles} 15 SP4 | sles15-sp4-uyuni-client | {sles} 15 SP3 | sles15-sp3-uyuni-client | {sles} 15 SP2 | sles15-sp2-uyuni-client | {sles} 15 SP1 | sles15-sp1-uyuni-client | {sles} 12 SP5 | sles12-sp5-uyuni-client

source: Use the same GPG key for both {sles}{nbsp}15 and {sles}{nbsp}12 clients. The correct key is called ``sle12-gpg-pubkey-39db7c82.key``.
ca: Utilitzeu la mateixa clau GPG per als clients {sles}{nbsp}15 i {sles}{nbsp}12. La clau correcta s'anomena 39sle12-gpg-pubkey-39db7c82.key..
ja: {sles}{nbsp}15と{sles}{nbsp}12クライアントの両方で同じGPGキーを使用します。 正しいキーは``sle12-gpg-pubkey-39db7c82.key``と呼ばれます。
ko: {sles}{nbsp}15 및 {sles}{nbsp}12 클라이언트에 동일한 GPG 키를 사용합니다. 올바른 키는 ``sle12-gpg-pubkey-39db7c82.key``입니다.
zh_cn: 为 {sles}{nbsp}15 和 {sles}{nbsp}12 客户端使用相同的 GPG 密钥。正确的密钥名为 ``sle12-gpg-pubkey-39db7c82.key``。

source: {sles}{nbsp}16 clients use a different GPG key. The correct key is called ``suse16-gpg-pubkey-09d9ea69.key``.
ca: {sles}{nbsp}16 clients usen una clau GPG diferent. La clau correcta s'anomena «suse16-gpg-pubkey-09d9ea69.key».

source: Registering {sle-micro} Clients
ca: S'estan registrant {sle} clients

source: This section contains information about registering clients running {sle-micro} operating systems 5.1, 5.2, 5.3, 5.4, and 5.5 on {x86_64}, {arm64}, and {zsystems} (s390x) architectures.
ca: Aquesta secció conté informació sobre el registre de clients que executen {sle-micro} sistemes operatius 5.1, 5.2, 5.3, 5.4, i 5.5 a les arquitectures {x8664}, {arm64} i {zsystems} (s390x).

source: The {sle-micro} uses transactional updates. Transactional updates are atomic (all updates are applied only if all updates succeed) and support rollbacks. They do not affect a running system as no changes are activated until after the system is rebooted.
ca: El {sle-micro} utilitza actualitzacions transaccionals. Les actualitzacions transaccionals són atòmiques (totes les actualitzacions només s'apliquen si totes les actualitzacions tenen èxit) i suporten els rollbacks. No afecten a un sistema en execució ja que no s'activen canvis fins després de reiniciar el sistema.

source: The client registration described in this chapter, consists of these steps:
ca: El registre del client descrit en aquest capítol, consta d'aquests passos:

source: Synchronize software channels for the new client's operating system and architecture by using either {webui} or command-line interface.
ca: Sincronitza els canals de programari per al nou sistema operatiu i l'arquitectura del client utilitzant {webui} o la interfície de línia d'ordres.

source: Synchronize the client tool repository for the newly added operating systems by using command-line interface.
ca: Sincronitzeu el repositori d'eines del client per als sistemes operatius nous afegits utilitzant la interfície de línia d'ordres.

source: Register the client with {productname} Server by using the {webui} or the command-line interface.
ca: Creeu una clau d'activació del client al servidor {productname} utilitzant la {webui}.

source: Additional sections describe ways to check and verify the registration procedure.
ca: Els apartats addicionals descriuen maneres de comprovar i verificar el procediment d'inscripció.

source: Before you register {sle-micro} clients to the {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de registrar {sle} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.

source: You can add the software channels with the {webui} or from the command line.
ca: Podeu afegir els canals de programari amb el {webui} o des de la línia d'ordres.

source: For the {webui} procedure, you need the following products:
ca: Per al procediment {webui}, necessiteu els productes següents:

source: SLE Micro Products - WebUI
ca: Micro Productes SLE - WebUI
ja: SLE Micro製品 - WebUI
ko: SLE Micro 제품 - WebUI
zh_cn: SLE Micro 产品 - WebUI

source: | OS Version | Product Name | {sle-micro} 5.5 {x86_64} | SUSE Linux Enterprise Micro 5.5 x86_64 | {sle-micro} 5.5 {arm64} | SUSE Linux Enterprise Micro 5.5 aarch64 | {sle-micro} 5.5 {s390x} | SUSE Linux Enterprise Micro 5.5 s390x | {sle-micro} 5.4 {x86_64} | SUSE Linux Enterprise Micro 5.4 x86_64 | {sle-micro} 5.4 {arm64} | SUSE Linux Enterprise Micro 5.4 aarch64 | {sle-micro} 5.4 {s390x} | SUSE Linux Enterprise Micro 5.4 s390x | {sle-micro} 5.3 {x86_64} | SUSE Linux Enterprise Micro 5.3 x86_64 | {sle-micro} 5.3 {arm64} | SUSE Linux Enterprise Micro 5.3 aarch64 | {sle-micro} 5.3 {s390x} | SUSE Linux Enterprise Micro 5.3 s390x | {sle-micro} 5.2 {x86_64} | SUSE Linux Enterprise Micro 5.2 x86_64 | {sle-micro} 5.2 {arm64} | SUSE Linux Enterprise Micro 5.2 aarch64 | {sle-micro} 5.2 {s390x} | SUSE Linux Enterprise Micro 5.2 s390x | {sle-micro} 5.1 {x86_64} | SUSE Linux Enterprise Micro 5.1 x86_64 | {sle-micro} 5.1 {arm64} | SUSE Linux Enterprise Micro 5.1 aarch64 | {sle-micro} 5.1 {s390x} | SUSE Linux Enterprise Micro 5.1 s390x
ca: Versió del SO Nom del producte {sle-micro} 5,5 {x8664} SUSE Linux Enterprise Micro 5.5 x8664 {sle-micro} 5.5 {arm64} SUSE Linux Enterprise Micro 5.5 aarch64 {sle-micro} 5,5 {s390x} SUSE Linux Enterprise Micro 5.5 s390x {sle-micro} 5,4 {x8664} SUSE Linux Enterprise Micro 5.4 x8664 {sle-micro} 5.4 {arm64} SUSE Linux Enterprise Micro 5.4 aarch64 {sle-micro} 5,4 {s390x} SUSE Linux Enterprise Micro 5.4 s390x . {sle-micro} 5,3 {x8664} SUSE Linux Enterprise Micro 5.3 x8664 {sle-micro} 5.3 {arm64} SUSE Linux Enterprise Micro 5.3 aarch64 {sle-micro} 5,3 {s390x} SUSE Linux Enterprise Micro 5.3 s390x {sle-micro} 5.2 {x8664} SUSE Linux Enterprise Micro 5.2 x8664 {sle-micro} 5.2 {arm64} SUSE Linux Enterprise Micro 5.2 aarch64 {sle-micro} 5,2 {s390x} SUSE Linux Enterprise Micro 5.2 s390x {sle-micro} 5.1 {x8664} SUSE Linux Enterprise Micro 5.1 x8664 {sle-micro} 5.1 {arm64} SUSE Linux Enterprise Micro 5.1 aarch64 {sle-micro} 5.1 {s390x} SUSE Linux Enterprise Micro 5.1 s390x

source: Alternatively, you can add channels from the command prompt. For this procedure, you need the following products:
ca: Alternativament, podeu afegir canals a l'indicador d'ordres. Els canals que necessites per a aquest tràmit són:

source: SLE Micro Products - CLI
ca: Micro Productes SLE - CLI
ja: SLE Micro製品 - CLI
ko: SLE Micro 제품 - CLI
zh_cn: SLE Micro 产品 - CLI

source: | OS Version | Base Channel | Updates Channel | {sle-micro} 5.5 {x86_64} | sle-micro-5.5-pool-x86_64 | sle-micro-5.5-updates-x86_64 | {sle-micro} 5.5 {arm64} | sle-micro-5.5-pool-arm64 | sle-micro-5.5-updates-arm64 | {sle-micro} 5.5 {zsystems} ({s390x}) | sle-micro-5.5-pool-s390x | sle-micro-5.5-updates-s390x | {sle-micro} 5.4 {x86_64} | sle-micro-5.4-pool-x86_64 | sle-micro-5.4-updates-x86_64 | {sle-micro} 5.4 {arm64} | sle-micro-5.4-pool-arm64 | sle-micro-5.4-updates-arm64 | {sle-micro} 5.4 {zsystems} ({s390x}) | sle-micro-5.4-pool-s390x | sle-micro-5.4-updates-s390x | {sle-micro} 5.3 {x86_64} | sle-micro-5.3-pool-x86_64 | sle-micro-5.3-updates-x86_64 | {sle-micro} 5.3 {arm64} | sle-micro-5.3-pool-arm64 | sle-micro-5.3-updates-arm64 | {sle-micro} 5.3 {zsystems} ({s390x}) | sle-micro-5.3-pool-s390x | sle-micro-5.3-updates-s390x | {sle-micro} 5.2 {x86_64} | suse-microos-5.2-pool-x86_64 | suse-microos-5.2-updates-x86_64 | {sle-micro} 5.2 {arm64} | suse-microos-5.2-pool-aarch64 | suse-microos-5.2-updates-aarch64 | {sle-micro} 5.2 {zsystems} ({s390x}) | suse-microos-5.2-pool-s390x | suse-microos-5.2-updates-s390x | {sle-micro} 5.1 {x86_64} | suse-microos-5.1-pool-x86_64 | suse-microos-5.1-updates-x86_64 | {sle-micro} 5.1 {arm64} | suse-microos-5.1-pool-aarch64 | suse-microos-5.1-updates-aarch64 | {sle-micro} 5.1 {zsystems} ({s390x}) | suse-microos-5.1-pool-s390x | suse-microos-5.1-updates-s390x
ca: Versió del SO Canal base s Actualitza el canal {sle-micro} 5,5 {x8664} sle-micro-5.5-pool-x8664 sle-micro-5.5-updates-x8664 {sle-micro} 5.5 {arm64} sle-micro-5.5-pool-arm64 sle-micro-5.5-updates-arm64 ) {sle-micro} 5,5 {zsystems} ({s390x}) sle-micro-5.5-pool-s390x sle-micro-5.5-updates-s390x {sle-micro} 5,4 {x8664} sle-micro-5.4-pool-x8664 sle-micro-5.4-updates-x8664 {sle-micro} 5.4 {arm64} sle-micro-5.4-pool-arm64 sle-micro-5.4-updates-arm64 ) {sle-micro} 5,4 {zsystems} ({s390x}) sle-micro-5.4-pool-s390x sle-micro-5.4-updates-s390x . {sle-micro} 5,3 {x8664} sle-micro-5.3-pool-x8664 sle-micro-5.3-updates-x8664 {sle-micro} 5.3 {arm64} sle-micro-5.3-pool-arm64 sle-micro-5.3-updates-arm64 ) {sle-micro} 5.3 {zsystems} ({s390x}) sle-micro-5.3-pool-s390x sle-micro-5.3-updates-s390x {sle-micro} 5.2 {x8664} suse-microos-5.2-pool-x8664 suse-microos-5.2-updates-x8664 {sle-micro} 5.2 {arm64} suse-microos-5.2-pool-aarch64 suse-microos-5.2-updates-aarch64 ) {sle-micro} 5.2 {zsystems} ({s390x}) suse-microos-5.2-pool-s390x suse-microos-5.2-updates-s390x {sle-micro} 5.1 {x8664} suse-microos-5.1-pool-x8664 suse-microos-5.1-updates-x8664 {sle-micro} 5.1 {arm64} suse-microos-5.1-pool-aarch64 suse-microos-5.1-updates-aarch64 ) {sle-micro} 5.1 {zsystems} ({s390x}) suse-microos-5.1-pool-s390x suse-microos-5.1-updates-s390x

source: Client Tools
ca: Operacions del client

source: Without client tools onboarding clients will fail. Client tools you can only add from the command line.
ca: Sense les eines del client, els clients que s'incorporin fallaran. Eines de client que només podeu afegir des de la línia de comandes.
