Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: In the ``ID`` field, enter the bug number.
ca: Al camp .ID., introduïu el número d'error.
ja: ［``ID``］フィールドにバグ番号を入力します。
ko: ``ID`` 필드에 버그 번호를 입력합니다.
zh_cn: 在 ``ID`` 字段中，输入 Bug 编号。

source: In the ``Summary`` field, type a short description of the bug.
ca: En el camp .Summary., escriviu una breu descripció de l'error.
ja: ［``概要``］フィールドにバグの短い説明を入力します。
ko: ``요약`` 필드에 버그에 대한 짧은 설명을 입력합니다.
zh_cn: 在``摘要``字段中，键入 Bug 的简要说明。

source: In the ``Bugzilla URL`` field, type the address of the bug.
ca: En el camp .URL de Bugzilla., escriviu l'adreça de l'error.
ja: ［``Bugzilla URL``］フィールドにバグのアドレスを入力します。
ko: ``버그질라 URL`` 필드에 버그에 대한 짧은 설명을 입력합니다.
zh_cn: 在 ``Bugzilla URL`` 字段中，键入 Bug 的地址。

source: In the ``Keywords`` field, type any keywords related to the bug.
ca: En el camp .Keywords., escriviu qualsevol paraula clau relacionada amb l'error.
ja: ［``キーワード``］フィールドにバグに関するキーワードを入力します。
ko: ``요약`` 필드에 버그와 관련이 있는 모든 키워드를 입력합니다.
zh_cn: 在``关键字``字段中，键入与该 Bug 有关的任何关键字。

source: Use a comma between each keyword.
ca: Utilitza una coma entre cada paraula clau.
ja: 複数のキーワードの間ではカンマを使用してください。
ko: 각 키워드 사이에는 쉼표를 사용하십시오.
zh_cn: 请在各关键字之间使用逗号。

source: Complete the ``References`` and ``Notes`` fields with further information about the bug.
ca: Completeu els camps .Referències. i .Notes. amb més informació sobre l'error.
ja: ［``リファレンス``］、［``メモ``］の各フィールドにバグに関する追加情報を入力します。
ko: ``참조`` 및 ``메모`` 필드를 버그에 대한 추가 정보로 완성합니다.
zh_cn: 在``参考``和``备注``字段中填写 Bug 的其他相关信息。

source: Select one or more channels to add the new patch to.
ca: Seleccioneu un o més canals per afegir el pedaç nou.
ja: 新しいパッチを追加するチャンネルを1つまたは複数選択します。
ko: 새 패치를 추가할 채널을 한 개 이상 선택합니다.
zh_cn: 选择要向其添加新补丁的一个或多个通道。

source: Click btn:[Create Patch].
ca: Feu clic a btn:[Crea un pedaço].
ja: btn:[パッチの作成]をクリックします。
ko: btn:[패치 생성]을 클릭합니다.
zh_cn: 单击 btn:[创建补丁]。

source: You can also create patches by cloning an existing one. Cloning preserves package associations and simplifies issuing patches.
ca: També podeu crear pedaços clonant un existent. La clonació preserva les associacions de paquets i simplifica l'emissió de pedaços.
ja: 既存のパッチを複製してパッチを作成することもできます。 複製では、パッケージの関連づけが保持され、パッチの発行が簡素化されます。
ko: 기존 패치를 복제하여 패치를 생성할 수도 있습니다. 복제를 통해 패키지 연결이 유지되고 패치 발급이 간소화됩니다.
zh_cn: 您也可以通过克隆现有补丁来创建补丁。克隆方法会保留软件包关联并简化补丁发布过程。

source: Procedure: Cloning Patches
ca: Procediment: Pedaços de clonació
ja: プロシージャ: パッチの複製
ko: 절차: 패치 복제
zh_cn: 过程：克隆补丁

source: In the {productname} {webui}, navigate to menu:Patches[Clone Patches].
ca: A {productname} {webui}, navegueu al menú:Patches[Clone Patches].
ja: {productname}の{webui}で、menu:パッチ[パッチの複製]に移動します。
ko: {productname} {webui}에서 menu:패치[패치 복제]로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:补丁[克隆补丁]。

source: In the ``View patches potentially applicable to:`` field, select the software channel for the patch you want to clone.
ca: Al camp .Veure pedaços potencialment aplicables a:., seleccioneu el canal de programari per al pedaç que voleu clonar.
ja: ［``潜在的に適用できる可能性のあるパッチを表示``］フィールドで、複製するパッチのソフトウェアチャンネルを選択します。
ko: ``적용 가능한 패치 보기:`` 필드에서 복제하려는 패치에 대한 소프트웨어 채널을 선택합니다.
zh_cn: 在``查看可能适用的补丁``字段中，选择要克隆的补丁对应的软件通道。

source: Select the patch or patches you want to clone, and click btn:[Clone Patches].
ca: Seleccioneu el pedaç o els pedaços que voleu clonar i feu clic a btn:[Clone Patches].
ja: 複製する1つまたは複数のパッチを選択し、btn:[パッチの複製]をクリックします。
ko: 복제하려는 패치를 한 개 또는 여러 개 선택하고 btn:[패치 복제]를 클릭합니다.
zh_cn: 选择要克隆的一个或多个补丁，然后单击 btn:[克隆补丁]。

source: Select one or more channels to add the cloned patch to.
ca: Seleccioneu un o més canals per afegir el pedaç clonat.
ja: 複製したパッチを追加するチャンネルを1つまたは複数選択します。
ko: 복제한 패치를 추가할 채널을 한 개 이상 선택합니다.
zh_cn: 选择要向其添加克隆的补丁的一个或多个通道。

source: Confirm the details to begin the clone.
ca: Confirmeu els detalls per començar el clon.
ja: 詳細を確認し、複製を開始します。
ko: 상세 정보를 확인하여 복제를 시작합니다.
zh_cn: 确认细节以开始克隆。

source: When you have created a patch, you can assign packages to it.
ca: Quan hàgiu creat un pedaç, podeu assignar-hi paquets.
ja: パッチを作成したら、そのパッチにパッケージを割り当てることができます。
ko: 패치를 생성하였으면 이 패치에 패키지를 할당할 수 있습니다.
zh_cn: 创建补丁后，您便可以向其指派软件包。

source: Procedure: Assigning Packages to a Patch
ca: Procediment: Assignació de paquets a un pedaço
ja: プロシージャ: パッチにパッケージを割り当てる
ko: 절차: 패키지를 패치에 할당
zh_cn: 过程：向补丁指派软件包

source: In the {productname} {webui}, navigate to menu:Patches[Manage Patches], and click the the advisory name of the patch to see the patch details.
ca: A {productname} {webui}, navegueu al menú:Patches[Manage Patches], i feu clic al nom d'assessorament del pedaç per veure els detalls del pedaç.
ja: {productname}の{webui}で、menu:パッチ[パッチの管理]に移動し、パッチのアドバイザリ名をクリックしてパッチの詳細を表示します。
ko: {productname} {webui}에서 menu:패치[패치 관리]로 이동하여 패치 상세 정보를 확인할 패치의 권고 이름을 클릭합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:补丁[管理补丁]，然后单击补丁的建议名称以查看补丁细节。

source: Navigate to the menu:Packages[Add] tab.
ca: Navega al menú:Packages[Afegeix] pestanya.
ja: menu:パッケージ[追加]タブに移動します。
ko: menu:패키지[추가] 탭으로 이동합니다.
zh_cn: 导航到menu:软件包[添加]选项卡。

source: In the ``Channel`` field, select the software channel that contains the packages you want to assign to the patch, and click btn:[View Packages].
ca: Al camp ].Channel]., seleccioneu el canal de programari que conté els paquets que voleu assignar al pedaç i feu clic a btn:[Veure paquets].
ja: ［``チェンネル``］フィールドで、パッチに割り当てるパッケージが含まれているソフトウェアチャンネルを選択し、btn:[パッケージの表示]をクリックします。
ko: ``채널`` 필드에서 패치에 할당하려는 패키지가 포함된 소프트웨어 채널을 선택하고 btn:[패키지 보기]를 클릭합니다.
zh_cn: 在``通道``字段中，选择包含要指派给补丁的软件包的软件通道，然后单击 btn:[查看软件包]。

source: You can select ``All managed packages`` to see the available packages in all channels.
ca: Podeu seleccionar .Tots els paquets gestionats. per veure els paquets disponibles a tots els canals.
ja: ［``All managed packages``］（管理しているすべてのパッケージ）を選択して、すべてのチャンネルで使用できるパッケージを表示できます。
ko: ``관리되는 모든 패키지``를 선택하여 모든 채널에서 사용 가능한 패키지를 확인할 수 있습니다.
zh_cn: 您可以选择``所有管理的软件包``以查看所有通道中的可用软件包。

source: Check the packages you want to include, and click btn:[Add Packages].
ca: Comproveu els paquets que voleu incloure i feu clic a btn:[Afegeix paquets].
ja: 含めるパッケージを確認し、btn:[パッケージの追加]をクリックします。
ko: 포함하려는 패키지의 확인란을 선택하고 btn:[패키지 추가]를 클릭합니다.
zh_cn: 选择要包含的软件包，然后单击 btn:[添加软件包]。

source: Confirm the details of the packages, and click btn:[Confirm] to assign them to the patch.
ca: Confirmeu els detalls dels paquets i feu clic a btn:[Confirm] per a assignar-los al pedaç.
ja: パッケージの詳細を確認し、btn:[確認]をクリックしてパッチに適用します。
ko: 패키지의 상세 정보를 확인하고, btn:[확인]을 클릭하여 패키지를 패치에 할당합니다.
zh_cn: 确认软件包的细节，然后单击 btn:[确认] 将其指派给补丁。

source: Navigate to the menu:Packages[List/Remove] tab to check that the packages have been assigned correctly.
ca: Navega a la pestanya menú:Packages[Llista/Elimina] per a comprovar que els paquets s'han assignat correctament.
ja: menu:パッケージ[一覧表示/削除]タブに移動し、パッケージが正しく割り当てられていることを確認します。
ko: menu:패키지[나열/제거] 탭으로 이동하여 패키지가 올바르게 할당되었는지 확인합니다.
zh_cn: 导航到menu:软件包[列出/去除]选项卡，检查是否已正确指派软件包。

source: When packages are assigned to a patch, the patch cache is updated to reflect the changes. The cache update might take a couple of minutes.
ca: Quan els paquets s'assignen a un pedaç, la memòria cau del pedaç s'actualitza per reflectir els canvis. L'actualització de la memòria cau pot trigar un parell de minuts.
ja: パッケージをパッチに割り当てると、パッチキャッシュが更新され、変更が反映されます。 キャッシュの更新には数分かかる場合があります。
ko: 패키지가 패치에 할당되면 패치 캐시가 업데이트되어 변경 사항을 반영합니다. 캐시 업데이트에 몇 분 정도 걸릴 수 있습니다.
zh_cn: 将软件包指派给补丁后，补丁缓存即会更新以反映更改。更新缓存可能需要几分钟时间。

source: If you need to change the details of an existing patch, you can do so from the [guimenu]``Patches Management`` page.
ca: Si necessiteu canviar els detalls d'un pedaç existent, podeu fer-ho des de la pàgina [guimenu].Gestió de mapes..
ja: 既存のパッチの詳細を変更する必要がある場合、［[guimenu]``パッチ管理``］ページから実行できます。
ko: 기존 패치의 상세 정보를 변경해야 하는 경우 [guimenu]``패치 관리`` 페이지에서 변경할 수 있습니다.
zh_cn: 如果您需要更改现有补丁的细节，可以通过[guimenu]``补丁管理``页面来更改。

source: Procedure: Editing and Deleting Existing Patch Alerts
ca: Procediment: Edició i supressió de les alertes de pedaços existents
ja: プロシージャ: 既存のパッチ警告の編集および削除
ko: 절차: 기존 패치 경고 편집 및 삭제
zh_cn: 过程：编辑和删除现有补丁警报

source: In the {productname} {webui}, navigate to menu:Patches[Manage Patches].
ca: A {productname} {webui}, navegueu al menú:Patches[Gestionar els pedaços].
ja: {productname}の{webui}で、menu:パッチ[パッチの管理]に移動します。
ko: {productname} {webui}에서 menu:패치[패치 관리]로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:补丁[管理补丁]。

source: Click the advisory name of the patch to see the patch details.
ca: Feu clic al nom de l'avís del pedaç per veure els detalls del pedaç.
ja: パッチのアドバイザリ名をクリックし、パッチの詳細を表示します。
ko: 패치의 권고 이름을 클릭하여 패치 상세 정보를 확인합니다.
zh_cn: 单击补丁的建议名称以查看补丁细节。

source: Make the changes as required, and click btn:[Update Patch].
ca: Feu els canvis segons sigui necessari, i feu clic a btn:[Actualitza Pedaç].
ja: 必要に応じて変更し、btn:[パッチの更新]をクリックします。
ko: 필요에 따라 변경하고 btn:[패치 업데이트]를 클릭합니다.
zh_cn: 根据需要进行更改，然后单击 btn:[更新补丁]。

source: To delete a patch, select the patch in the [guimenu]``Patches Management`` page, and click btn:[Delete Patches].
ca: Per a suprimir un pedaç, seleccioneu el pedaç a la pàgina [guimenu]].Gestió de les pestanyes]. i feu clic a btn:[Elimina les pedaços].
ja: パッチを削除するには、［[guimenu]``パッチ管理``］ページでパッチを選択し、btn:[パッチの削除]をクリックします。
ko: 패치를 삭제하려면 [guimenu]``패치 관리`` 페이지에서 패치를 선택하고 btn:[패치 삭제]를 클릭합니다.
zh_cn: 要删除补丁，请在[guimenu]``补丁管理``页面中选择补丁，然后单击 btn:[删除补丁]。

source: Deleting patches might take a few minutes.
ca: Eliminar pedaços pot trigar uns minuts.
ja: パッチの削除には、数分かかる場合があります。
ko: 패치를 삭제하는 데 몇 분이 걸릴 수 있습니다.
zh_cn: 删除补丁可能需要几分钟时间。

source: Apply Patches to Clients
ca: Aplica pedaços als clients
ja: クライアントへのパッチの適用
ko: 패치를 클라이언트에 적용
zh_cn: 将补丁应用到客户端

source: When a patch is ready, you can apply it to clients either singly, or with other patches.
ca: Quan un pedaç està a punt, pots aplicar-lo als clients individualment o amb altres pedaços.
ja: パッチの用意ができたら、クライアントに適用できます。その際、単独または他のパッチと一緒に適用できます。
ko: 패치가 준비되면 이 패치만 클라이언트에 적용하거나 다른 패치와 함께 적용할 수 있습니다.
zh_cn: 某个补丁就绪后，您可以将其单独应用到客户端，也可以与其他补丁一起应用到客户端。

source: Each package within a patch is part of one or more channels. If the client is not subscribed to the channel, the update is not installed.
ca: Cada paquet d'un pedaç forma part d'un o més canals. Si el client no està subscrit al canal, l'actualització no està instal·lada.
ja: パッチ内の各パッケージは、1つまたは複数のチャンネルの一部です。 クライアントがチャンネルにサブスクライブされていない場合、更新はインストールされません。
ko: 패치 내 각 패키지는 한 개 이상의 채널에 속해 있습니다. 클라이언트가 해당 채널에 가입되어 있지 않으면 업데이트가 설치되지 않습니다.
zh_cn: 补丁内的每个软件包都来自一个或多个通道。如果客户端未订阅相应通道，将不会安装更新。

source: If the client has a more recent version of a package already installed, the update is not installed. If the client has an older version of the package installed, the package is upgraded.
ca: Si el client té una versió més recent d'un paquet ja instal·lat, l'actualització no està instal·lada. Si el client té instal·lada una versió antiga del paquet, el paquet s'actualitza.
ja: 対象の更新より新しいバージョンのパッケージがクライアントにすでにインストールされている場合、その更新はインストールされません。 古いバージョンのパッケージがクライアントにインストールされている場合、そのパッケージはアップグレードされます。
ko: 이미 설치된 패키지보다 더 최근에 나온 버전이 클라이언트에 있는 경우 업데이트가 설치되지 않습니다. 설치된 패키지 이전에 나온 버전이 클라이언트에 있는 경우 패키지가 업그레이드됩니다.
zh_cn: 如果客户端已安装更新版本的软件包，将不会安装更新。如果客户端安装的是较旧版本的软件包，将会升级该软件包。

source: Procedure: Applying All Applicable Patches
ca: Procediment: Aplicar tots els pedaços aplicables
ja: プロシージャ: 適用可能なすべてのパッチを適用する
ko: 절차: 해당하는 모든 패치 적용
zh_cn: 过程：应用所有适用的补丁

source: In the {productname} {webui}, navigate to menu:Systems[Overview] and select the client you want to update.
ca: A {productname} {webui}, navegueu al menú:Sistemes[Vista general] i seleccioneu el client que voleu actualitzar.
ja: {productname}の{webui}で、menu:システム[概要]に移動し、更新するクライアントを選択します。
ko: {productname} {webui}에서 menu:시스템[개요]로 이동하여 업데이트하려는 클라이언트를 선택합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[概览]，然后选择要更新的客户端。

source: Navigate to the menu:Software[Patches] tab.
ca: Navega a la pestanya menú:Software[Patches].
ja: menu:ソフトウェア[パッチ]タブに移動します。
ko: menu:소프트웨어[패치] 탭으로 이동합니다.
zh_cn: 导航到menu:软件[补丁]选项卡。

source: Click btn:[Select All] to select all applicable patches.
ca: Feu clic a btn:[Selecciona-ho tot] per a seleccionar tots els pedaços aplicables.
ja: btn:[すべてを選択]をクリックして適用可能なすべてのパッチを選択します。
ko: btn:[모두 선택]을 클릭하여 해당하는 모든 패치를 선택합니다.
zh_cn: 单击 btn:[全选] 选择所有适用的补丁。

source: Click btn:[Apply Patches] to update the client.
ca: Feu clic a btn:[Aplica els pedaços] per actualitzar el client.
ja: btn:[パッチの適用]をクリックしてクライアントを更新します。
ko: btn:[패치 적용]을 클릭하여 클라이언트를 업데이트합니다.
zh_cn: 单击 btn:[应用补丁] 更新客户端。

source: If you are signed in with Administrator privileges, you can also perform larger batch upgrades for clients.
ca: Si heu iniciat sessió amb privilegis d'administrador, també podeu realitzar actualitzacions per lots més grans per als clients.
ja: 管理者特権でサインインしている場合、クライアントに対してより大規模なバッチアップグレードも実行できます。
ko: 관리자 권한으로 로그인한 경우 클라이언트에 대해 더 큰 규모의 배치 업그레이드를 수행할 수도 있습니다.
zh_cn: 如果您是以管理员特权登录的，还可以批量进行更大规模的客户端升级。

source: Procedure: Applying a Single Patch to Multiple Clients
ca: Procediment: Aplicació d'un únic pedaço a múltiples clients
ja: プロシージャ: 1つのパッチを複数のクライアントに適用する
ko: 절차: 하나의 패치를 여러 클라이언트에 적용
zh_cn: 过程：将单个补丁应用到多个客户端

source: In the {productname} {webui}, navigate to menu:Patches[Patch List].
ca: A {productname} {webui}, navegueu al menú:Patches[Patch List].
ja: {productname}の{webui}で、menu:パッチ[パッチリスト]に移動します。
ko: {productname} {webui}에서 menu:패치[패치 목록]으로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:补丁[补丁列表]。

source: Locate the patch you want to apply, and click the number under the ``Systems`` column for that patch.
ca: Localitzeu el pedaç que voleu aplicar i feu clic al número que hi ha a la columna .Sistemes. per a aquest pedaç.
ja: 適用するパッチを見つけ、そのパッチの``システム``列で番号をクリックします。
ko: 적용하려는 패치를 찾은 다음, 이 패치에 대한 ``시스템`` 열 아래의 숫자를 클릭합니다.
zh_cn: 找到要应用的补丁，然后单击该补丁对应的``系统``列下面的数字。

source: Select the clients you want to apply the patch to, and click btn:[Apply Patches].
ca: Seleccioneu els clients als quals voleu aplicar el pedaç i feu clic a btn:[Aplica els pedaços].
ja: パッチの適用先にするクライアントを選択し、btn:[パッチの適用]をクリックします。
ko: 패치를 적용하려는 클라이언트를 선택하고 btn:[패치 적용]을 클릭합니다.
zh_cn: 选择要应用补丁的客户端，然后单击 btn:[应用补丁]。

source: Confirm the list of clients to perform the update.
ca: Confirmeu els detalls per començar el clon.
ja: クライアントの一覧を確認し、更新を実行します。
ko: 업데이트를 수행할 클라이언트의 목록을 확인합니다.
zh_cn: 确认要执行更新的客户端列表。

source: Procedure: Applying Multiple Patches to Multiple Clients
ca: Procediment: Aplicació de múltiples pedaços a múltiples clients
ja: プロシージャ: 複数のパッチを複数のクライアントに適用する
ko: 절차: 여러 패치를 여러 클라이언트에 적용
zh_cn: 过程：将多个补丁应用到多个客户端

source: In the {productname} {webui}, navigate to menu:Systems[Overview] and check the clients you want to update to add them to the system set manager.
ca: A {productname} {webui}, navegueu al menú:Systems[Overview] i comproveu els clients que voleu actualitzar per afegir-los al gestor de conjunts del sistema.
ja: {productname}の{webui}で、menu:システム[概要]に移動し、更新するクライアントにチェックを付け、システムセットマネージャに追加します。
ko: {productname} {webui}에서 menu:시스템[개요]로 이동하여 업데이트하려는 클라이언트를 확인하고 이 클라이언트를 시스템 세트 관리자에 추가합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[概览]，然后选中要更新的客户端，以将其添加到系统集管理器。

source: Navigate to menu:Systems[System Set Manager] and naviagte to the [guimenu]``Patches`` tab.
ca: Navega al menú:Systems[System Set Manager] i naviagte a la pestanya [guimenu].Patches..
ja: menu:システム[システムセットマネージャ]に移動し、［[guimenu]``パッチ``］タブに移動します。
ko: menu:시스템[시스템 세트 관리자]로 이동한 후 [guimenu]``패치`` 탭으로 이동합니다.
zh_cn: 导航到menu:系统[系统集管理器]，然后导航到[guimenu]``补丁``选项卡。

source: Select the patches you want to apply to the clients and click btn:[Apply Patches].
ca: Seleccioneu els pedaços que voleu aplicar als clients i feu clic a btn:[Aplica els pedaços].
ja: クライアントに適用するパッチを選択し、btn:[パッチの適用]をクリックします。
ko: 클라이언트에 적용하려는 패치를 선택하고 btn:[패치 적용]을 클릭합니다.
zh_cn: 选择要应用到客户端的补丁，然后单击 btn:[应用补丁]。

source: Schedule a date and time for the update to occur, and click btn:[Confirm].
ca: Planifiqueu una data i hora perquè es produeixi l'actualització i feu clic a btn:[Confirm].
ja: 更新する日時をスケジュールし、btn:[確認]をクリックします。
ko: 업데이트 실행 날짜 및 시간을 예약하고 btn:[확인]을 클릭합니다.
zh_cn: 安排更新的日期和时间，然后单击 btn:[确认]。

source: To check the progress of the update, navigate to menu:Schedule[Pending Actions].
ca: Per a comprovar el progrés de l'actualització, navegueu al menú:Schedule[Accions pendents].
ja: 更新の進捗を確認するには、menu:スケジュール[待機中の動作]に移動します。
ko: 업데이트의 진도를 확인하려면 menu:일정[보류 중인 작업]으로 이동합니다.
zh_cn: 要查看更新进度，请导航到menu:日程安排[待执行的操作]。

source: Scheduled package updates are installed using the contact method configured for each client. For more information, see xref:client-configuration:contact-methods-intro.adoc[].
ca: Les actualitzacions de paquets planificades s'instal·len utilitzant el mètode de contacte configurat per a cada client. Per a més informació, vegeu xref:client-configuration:contact-methods-intro.adoc[].
ja: スケジュールされたパッケージ更新は、各クライアントで設定された接続メソッドを使用してインストールされます。 詳細については、xref:client-configuration:contact-methods-intro.adoc[]を参照してください。
ko: 예약된 패키지 업데이트는 각 클라이언트에 구성한 연결 방법을 사용해 설치됩니다. 자세한 내용은 xref:client-configuration:contact-methods-intro.adoc[]를 참조하십시오.
zh_cn: 使用为每个客户端配置的联系方法安装安排的软件包更新。有关详细信息，请参见 xref:client-configuration:contact-methods-intro.adoc[]。

source: Power Management
ca: Gestió d'energia
ja: 電源管理
ko: 전원 관리
zh_cn: 电源管理

source: You can power on, power off, and reboot clients using the {productname} {webui}.
ca: Podeu activar, apagar i reiniciar clients utilitzant {productname} {webui}.
ja: {productname}の{webui}を使用して、電源オン、電源オフ、およびクライアントの再起動を実行できます。
ko: {productname} {webui}를 사용해 클라이언트를 켜고, 끄고, 다시 부팅할 수 있습니다.
zh_cn: 您可以使用 {productname} {webui} 打开、关闭和重引导客户端。

source: This feature uses either the IPMI or Redfish protocol and is managed using a {cobbler} profile. The selected client must have a power management controller supporting one of these protocols.
ca: Aquesta característica utilitza el protocol IPMI o Redfish i es gestiona utilitzant un perfil {cobbler}. El client seleccionat ha de tenir un controlador de gestió d'energia que suporti un d'aquests protocols.
ja: この機能は、IPMIまたはRedfishプロトコルを使用し、{cobbler}プロファイルを使用して管理されます。 選択したクライアントには、これらのプロトコルのいずれかをサポートしている電源管理コントローラがある必要があります。
ko: 이 기능은 IPMI 또는 Redfish 프로토콜을 사용하며 {cobbler} 프로파일을 사용해 관리됩니다. 선택한 클라이언트에는 이러한 프로토콜 중 하나를 지원하는 전원 관리 컨트롤러가 있어야 합니다.
zh_cn: 此功能使用 IPMI 或 Redfish 协议，通过 {cobbler} 配置文件管理。所选客户端的电源管理控制器必须支持以上其中一个协议。

source: For Redfish, ensure you can establish a valid SSL connection between the client and the {productname} Server. You must have trusted the certificate authority used to sign the SSL Server Certificate of the Redfish management controller. The CA certificate must be in [literal]``.pem`` format, and stored on the {productname} Server at [path]``/etc/pki/trust/anchors/``. When you have saved the certificate, run [command]``update-ca-certificate``.
ca: Per a Redfish, assegureu-vos que podeu establir una connexió SSL vàlida entre el client i el servidor {productname}. Heu d'haver confiat en l'autoritat certificadora utilitzada per signar el Certificat de Servidor SSL del controlador de gestió Redfish. El certificat de la CA ha d'estar en format ..pem. i s'ha d'emmagatzemar al servidor {productname} a [path]./etc/pki/trust/anchors/.. Quan hàgiu desat el certificat, executeu [command].update-ca-certificate..

source: Procedure: Enabling Power Management
ca: Procediment: Activació de la gestió d'energia
ja: プロシージャ: 電源管理を有効にする
ko: 절차: 전원 관리 활성화
zh_cn: 过程：启用电源管理

source: In the {productname} {webui}, navigate to menu:Systems[Systems List], select the client you want to manage, and navigate to the menu:Provisioning[Power Management] tab.
ca: A la {productname} {webui}, navegueu a menu:Systems[Systems List], seleccioneu el client que voleu gestionar i navegueu a la pestanya menu:Provisioning[Power Management].
ko: {productname} {webui}에서 menu:시스템[시스템 목록]으로 이동하여 관리하려는 클라이언트를 선택하고 menu:조달[전원 관리] 탭으로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[系统列表]，选择要管理的客户端，然后导航到menu:置备[电源管理]选项卡。

source: In the [guimenu]``Type`` field, select the power management protocol to use.
ca: Al camp [guimenu].Tipus., seleccioneu el protocol de gestió d'energia a utilitzar.
ja: ［[guimenu]``タイプ``］フィールドで、使用する電源管理プロトコルを選択します。
ko: [guimenu]``유형`` 필드에서 사용할 전원 관리 프로토콜을 선택합니다.
zh_cn: 在[guimenu]``类型``字段中，选择要使用的电源管理协议。

source: Complete the details for the power management server, and click the appropriate button for the action to take, or click btn:[Save only] to save the details without taking any action.
ca: Completeu els detalls del servidor de gestió d'energia i feu clic al botó apropiat per a l'acció a realitzar, o feu clic a btn:[Desa només] per a desar els detalls sense prendre cap acció.
ja: 電源管理サーバの詳細を入力し、適切なボタンをクリックしてアクションを実行し、btn:[保存のみ]をクリックし、アクションを実行せずに詳細を保存します。
ko: 전원 관리 서버의 상세 정보를 모두 입력하고, 취할 조치에 해당하는 적절한 버튼을 클릭하거나 btn:[저장만]을 클릭하여 아무 조치도 취하지 않고 상세 정보를 저장합니다.
zh_cn: 填写电源管理服务器的细节，然后单击要执行的操作的相应按钮，或者单击 btn:[仅保存] 以保存细节而不执行任何操作。

source: You can apply power management actions to multiple clients at the same time by adding them to the system set manager. For more information about using the system set manager, see xref:client-configuration:system-set-manager.adoc[].
ca: Podeu aplicar accions de gestió d'energia a múltiples clients al mateix temps, afegint-les al gestor de conjunts de sistemes. Per obtenir més informació sobre l'ús del gestor de conjunts de sistemes, vegeu xref:client-configuration:system-set-manager.adoc[].
ja: 電源管理アクションを複数のクライアントに同時に適用できます。そのためには、クライアントをシステムセットマネージャに追加します。 システムセットマネージャの使用法の詳細については、xref:client-configuration:system-set-manager.adoc[]を参照してください。
ko: 여러 클라이언트를 시스템 세트 관리자에 추가함으로써 전원 관리 조치를 여러 클라이언트에 동시에 적용할 수 있습니다. 시스템 세트 관리자에 대한 자세한 내용은 xref:client-configuration:system-set-manager.adoc[]를 참조하십시오.
zh_cn: 您可以将电源管理操作添加到系统集管理器，以将这些操作同时应用到多个客户端。有关使用系统集管理器的详细信息，请参见 xref:client-configuration:system-set-manager.adoc[]。

source: Power Management and {cobbler}
ca: Gestió d'energia
ko: 전원 관리 및 {cobbler}
zh_cn: 电源管理和 {cobbler}

source: The first time you use a power management feature, a {cobbler} system record is automatically created, if one does not yet exist for the client. These automatically created system records are not bootable from the network, and include a reference to a dummy system image. This is needed because {cobbler} does not currently support system records without profiles or images.
ca: La primera vegada que utilitzeu una funció de gestió d'energia, es crea automàticament un registre del sistema {cobbler}, si encara no existeix per al client. Aquests registres de sistema creats automàticament no es poden arrencar des de la xarxa, i inclouen una referència a una imatge de sistema simulada. Això és necessari perquè {cobbler} actualment no admet registres del sistema sense perfils o imatges.
ko: 전원 관리 기능을 처음 사용할 때 {cobbler} 시스템 레코드가 자동으로 생성됩니다(클라이언트에 아직 없는 경우). 이렇게 자동으로 생성된 시스템 레코드는 네트워크에서 부팅할 수 없고 더미 시스템 이미지에 대한 참조를 포함합니다. 이 참조가 필요한 이유는 현재 {cobbler}가 프로파일 또는 이미지 없는 시스템 레코드를 지원하지 않기 때문입니다.
zh_cn: 首次使用电源管理功能时，如果客户端没有相应的 {cobbler} 系统记录，将会自动创建该记录。这些自动创建的系统记录无法从网络上引导，其内包含虚设系统映像的引用。之所以需要该引用，是因为 {cobbler} 目前不支持没有配置文件或映像的系统记录。
