Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: Procedure: Reinstall an Already Registered Client
ca: Procediment: Reinstal·lar un client ja registrat
ja: 手順: 登録済みのクライアントを再インストールする
ko: 절차: 이미 등록된 클라이언트 다시 설치
zh_cn: 过程：重新安装已注册客户端

source: In the {productname} {webui}, navigate to menu:Systems[Systems List], select the client to reinstall, and go to the menu:Provisioning[Autoinstallation > Schedule] subtab.
ca: A la {productname} {webui}, navegueu a menu:Systems[Systems List], seleccioneu el client a reinstal·lar i aneu a la sub pestanya menu:Provisioning[Autoinstallation . Schedule].
ja: {productname} {webui}で、menu:システム[システム一覧]に移動し、再インストールするクライアントを選択し、menu:プロビジョニング[自動インストール > スケジュール]サブタブに移動します。
ko: {productname} {webui}에서 menu:시스템[시스템 목록]으로 이동하여 다시 설치할 클라이언트를 선택한 후 menu:프로비저닝[자동 설치 > 일정] 하위 탭으로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[系统列表]，选择要重新安装的客户端，然后转到menu:置备[自动重新安装 > 日程安排]子选项卡。

source: Select the autoinstallation profile that you prepared, select a proxy if needed, and click btn:[Schedule Autoinstallation and Finish].
ca: Seleccioneu el perfil d'autoinstal·lació que heu preparat, seleccioneu un servidor intermediari si cal i feu clic a btn:[Iniciació automàtica de planificació i finalització].
ja: 作成した自動インストールプロファイルを選択し、必要に応じてプロキシを選択して、btn:[自動インストールをスケジュールしてから終了する]をクリックします。
ko: 준비한 자동 설치 프로파일을 선택하고 필요한 경우 프록시를 선택한 후 btn:[자동 설치 스케줄링 후 완료]를 클릭합니다.
zh_cn: 选择您准备的自动安装配置文件，根据需要选择代理，然后单击 btn:[安排自动安装并完成]。

source: You can monitor progress of the installation by navigating to menu:Provisioning[Autoinstallation > Session Status], or on the client directly. The client reboots, and in the boot menu selects a new choice called [guimenu]``reinstall-system``.
ca: Podeu monitoritzar el progrés de la instal·lació navegant al menú:Provisioning[Autoinstallation . Session Status], o directament al client. El client reinicia, i al menú d'arrencada selecciona una nova opció anomenada [guimenu].reinstall-system..
ja: menu:プロビジョニング[自動インストール>セッションの状態]に移動するか、クライアント上で直接、インストールの進行状況を監視できます。 クライアントが再起動したら、［ブート］メニューで［[guimenu]``システムの再インストール``］という新しいオプションを選択します。
ko: menu:프로비저닝[자동 설치 > 세션 상태]로 이동하거나 클라이언트에서 직접 설치 진행 상황을 모니터링할 수 있습니다. 클라이언트가 다시 부팅되고 부팅 메뉴에서 이름이 [guimenu]``reinstall-system``인 새 항목을 선택합니다.
zh_cn: 您可以导航到menu:置备[自动安装 > 会话状态]来监视安装进度，也可以直接在客户端上监视。客户端将重引导，并在引导菜单中选择名为 [guimenu]``reinstall-system`` 的新选项。

source: The installation then proceeds over HTTP protocol.
ca: La instal·lació es realitza a través del protocol HTTP.
ja: その後、インストールはHTTPプロトコルを通じて進められます。
ko: 그러면 HTTP 프로토콜을 통해 설치가 진행됩니다.
zh_cn: 安装随即会通过 HTTP 协议进行。

source: Unattended Provisioning
ca: Provisionament desatès
ja: 無人プロビジョニング
ko: 무인 프로비저닝
zh_cn: 无人照管的置备

source: You can use an API call to declare an association between a client identified by its MAC address and an autoinstallation profile. Next time the system reboots, it starts the installation based on the specified profile.
ca: Podeu utilitzar una crida de l'API per declarar una associació entre un client identificat per la seva adreça MAC i un perfil d'autoinstal·lació. La propera vegada que el sistema es reinicia, s'inicia la instal·lació basada en el perfil especificat.
ja: APIコールを使用して、MACアドレスによって識別されるクライアントと自動インストールプロファイル間の関連付けを宣言できます。 次にシステムを再起動したときに、指定したプロファイルに基づいてインストールが開始されます。
ko: API 호출을 사용하여 MAC 주소에 의해 식별되는 클라이언트와 자동 설치 프로파일 사이의 관계를 선언할 수 있습니다. 다음에 시스템이 재부팅되면 지정된 프로파일에 따라 설치가 시작됩니다.
zh_cn: 您可以使用 API 调用来声明通过 MAC 地址标识的客户端与自动安装配置文件之间的关联。系统下次重引导时，会根据指定的配置文件开始安装。

source: Procedure: Reinstallation From a Manually Declared Profile
ca: Procediment: Reinstal·lació a partir d'un perfil declarat manualment
ja: 手順: 手動で宣言したプロファイルからの再インインストール
ko: 절차: 수동으로 선언된 프로파일에서 다시 설치
zh_cn: 过程：通过手动声明的配置文件重新安装

source: On the {productname} Server, at the command prompt, use the [systemitem]``system.createSystemRecord`` API call. In this example, replace [literal]``name`` with the name of your client, [literal]``<profile>`` with the profile label, [literal]``<iface>`` with the name of the interface on the client such as [literal]``eth0``, and [literal]``<hw_addr>`` with its hardware address such as [literal]``00:25:22:71:e7:c6``:
ca: Al servidor {productname}, a l'indicador d'ordres, utilitzeu la crida de l'API [systemitem].system.createSystemRecord.. En aquest exemple, substituïu [literal]namenom with pel nom del vostre client, [literal] {<profile> the amb l'etiqueta del perfil, [literal] {<iface> with amb el nom de la interfície del client com [literal] witheth0,, i [literal] {<hwaddr> the amb la seva adreça de maquinari com [literal]0000:25:22:71:e7:c6::
ja: {productname}サーバのコマンドプロンプトで、[systemitem]``system.createSystemRecord`` APIコールを使用します。 この例では、[literal]``name``をクライアントの名前に、[literal]``<profile>``をプロファイルラベルに、[literal]``<iface>``を[literal]``eth0``などのクライアント上のインタフース名に、[literal]``<hw_addr>``を[literal]``00:25:22:71:e7:c6``などのクライアントのハードウェアアドレスに置き換えます。
ko: {productname} 서버의 명령 프롬프트에서 [systemitem]``system.createSystemRecord`` API를 호출합니다. 이 예에서 [literal]``name``을 클라이언트의 이름으로 바꾸고, [literal]``<profile>``을 프로파일 레이블로 바꾸며, [literal]``<iface>``를 [literal]``eth0``과 같이 클라이언트의 인터페이스 이름으로 바꾸고, [literal]``<hw_addr>``을 [literal]``00:25:22:71:e7:c6``과 같은 하드웨어 주소로 바꿉니다.
zh_cn: 在 {productname} 服务器上的命令提示符处，使用 [systemitem]``system.createSystemRecord`` API 调用。在此示例中，请将 [literal]``name`` 替换为您的客户端名称，将 [literal]``<profile>`` 替换为配置文件标签，将 [literal]``<iface>`` 替换为客户端上的接口名称（例如 [literal]``eth0``），将 [literal]``<hw_addr>`` 替换为其硬件地址（例如 [literal]``00:25:22:71:e7:c6``）：

source: Power on the client. It boots from the network, and the correct profile is selected for installation.
ca: Potència en el client. S'arrenca des de la xarxa i se selecciona el perfil correcte per a la instal·lació.
ja: クライアントの電源をオンにします。 ネットワークからブートすると、インストール用の正しいプロファイルが選択されます。
ko: 클라이언트의 전원을 켭니다. 네트워크에서 부팅되며 설치에 맞는 올바른 프로파일이 선택됩니다.
zh_cn: 打开客户端。它会从网络进行引导，并且系统会选择正确的配置文件以执行安装。

source: This command creates a system record at {cobbler}. You may also specify additional parameters, like kernel options, the IP address of the client, and its domain name. For more information, see the API documentation for [systemitem]``createSystemRecord call``.
ca: Aquesta ordre crea un registre del sistema a {cobbler}. També podeu especificar paràmetres addicionals, com ara les opcions del nucli, l'adreça IP del client i el seu nom de domini. Per a més informació, vegeu la documentació de l'API per a [systemitem].createSystemRecord call..
ko: 이 명령을 통해 {cobbler}에서 시스템 레코드가 생성됩니다. 커널 옵션, 클라이언트의 IP 주소, 도메인 이름과 같은 추가 파라미터도 지정할 수 있습니다. 자세한 설명은 API 설명서에서 [systemitem]``createSystemRecord 호출``을 참조하십시오.
zh_cn: 此命令会在 {cobbler} 中创建一个系统记录。您也可以指定其他参数，例如内核选项、客户端的 IP 地址及其域名。有关详细信息，请参见 [systemitem]``createSystemRecord 调用``的 API 文档。

source: Automatic Registration of Clients Created by Terraform
ca: Registre automàtic de clients creat per Terraform
ja: Terraformによって作成されたクライアントの自動登録
ko: Terraform에서 생성한 클라이언트의 자동 등록
zh_cn: 自动注册 Terraform 创建的客户端

source: New clients created by Terraform can be automatically registered to {productname}. Registration can be achieved in two ways:
ca: Els nous clients creats per Terraform es poden registrar automàticament a {productname}. El registre es pot aconseguir de dues maneres:
ja: Terraformによって作成された新しいクライアントは{productname}に自動的に登録できます。 次の2つの登録方法があります。
ko: Terraform에서 생성한 새 클라이언트는 {productname}에 자동으로 등록될 수 있습니다. 등록은 다음의 두 가지 방법으로 수행할 수 있습니다.
zh_cn: Terraform 创建的新客户端可以自动注册到 {productname} 中。可以通过以下两种方式来完成注册：

source: [literal]``cloud-init`` based registration
ca: Registre basat en el [literal]]cloud-init``
ja: [literal]``cloud-init``ベースの登録
ko: [literal]``cloud-init`` 기반 등록
zh_cn: 基于 [literal]``cloud-init`` 的注册

source: remote execution provisioner based registration
ca: registre basat en l'aprovisionador d'execució remota
ja: リモート実行プロビジョナーベースの登録
ko: 원격 실행 제공자 기반 등록
zh_cn: 基于 remote-exec 置备器的注册

source: [literal]``cloud-init`` Based Client Registration
ca: Registre del client Oracle

source: Registering by leveraging [literal]``cloud-init`` is the preferred way of automatic registering of the newly created virtual machines. This solution avoids configuring an SSH connection to the host. It can also be used regardless of the tool used for client creation.
ca: Registrar aprofitant [literal].cloud-init. és la forma preferida de registrar automàticament les màquines virtuals de nova creació. Aquesta solució evita configurar una connexió SSH a l'amfitrió. També es pot utilitzar independentment de l'eina utilitzada per a la creació de clients.
ja: 新しく作成された仮想マシンを自動的に登録するには、[literal]``cloud-init``を活用して登録することをお勧めします。 このソリューションでは、ホストへのSSH接続を設定する必要がありません。 また、クライアントの作成に使用するツールに関係なく使用することができます。
ko: [literal]``cloud-init``를 활용하여 등록하는 방법은 새로 생성된 가상 머신을 자동으로 등록하는 기본 방법입니다. 이 솔루션은 호스트에 대한 SSH 연결 구성을 방지합니다. 클라이언트 생성에 사용된 도구와 상관없이 사용할 수도 있습니다.
zh_cn: 自动注册新创建的虚拟机的首选方式是利用 [literal]``cloud-init`` 进行注册。采用这种方法无需配置与主机的 SSH 连接。此外，无论使用哪种工具创建客户端，都可以采用这种方法。

source: User can pass the set of user data when deploying the image with Terraform, to automatically register the machine to {productname}. [path]``user_data`` is run only once at bootstrap, and only the first time the machine is started.
ca: L'usuari pot passar el conjunt de dades d'usuari quan es desplega la imatge amb Terraform, per registrar automàticament la màquina a {productname}. [path].userdata. només s'executa una vegada a bootstrap, i només la primera vegada que s'inicia la màquina.
ja: ユーザは、マシンを{productname}に自動的に登録するために、Terraformを使用してイメージを展開するときにユーザデータのセットを渡すことができます。 [path]``user_data``はブートストラップ時にマシンを初めて起動したときのみ1回だけ実行されます。
ko: 사용자는 {productname}에 머신을 자동으로 등록하기 위해 Terraform으로 이미지를 배포할 때 사용자 데이터 세트를 전달할 수 있습니다. [path]``user_data``는 부트스트랩에서 한 번만 실행되며 시스템이 처음 시작될 때만 실행됩니다.
zh_cn: 用户可以在使用 Terraform 部署映像时传递用户数据集，以便将虚拟机自动注册到 {productname} 中。[path]``user_data`` 只会在虚拟机首次启动时的引导期间运行一次。

source: Before using [literal]``cloud-init`` to register clients, the user must configure:
ca: Abans d'utilitzar [literal],cloud-init, per registrar clients, l'usuari ha de configurar:
ja: [literal]``cloud-init``を使用してクライアントを登録する前にユーザは以下を設定する必要があります。
ko: [literal]``cloud-init``를 사용하여 클라이언트를 등록하기 전 사용자는 다음을 구성해야 합니다.
zh_cn: 使用 [literal]``cloud-init`` 注册客户端之前，用户必须配置：

source: Bootstrap script. For more information, see xref:client-configuration:registration-bootstrap.adoc[].
ca: Per a més informació, vegeu xref:client-configuration:registration-bootstrap.adoc[].
ja: ブートストラップスクリプト: 詳細については、xref:client-configuration:registration-bootstrap.adoc[]を参照してください。
ko: 부트스트랩 스크립트입니다. 자세한 내용은 xref:client-configuration:registration-bootstrap.adoc[]에서 확인할 수 있습니다.
zh_cn: 引导脚本。有关详细信息，请参见 xref:client-configuration:registration-bootstrap.adoc[]。

source: Activation keys. For more information, see xref:client-configuration:activation-keys.adoc[].
ca: Per a més informació, vegeu xref:client-configuration:activation-keys.adoc[].
ja: アクティベーションキー: 詳細については、xref:client-configuration:activation-keys.adoc[]を参照してください。
ko: 활성화 키입니다. 자세한 내용은 xref:client-configuration:activation-keys.adoc[]에서 확인할 수 있습니다.
zh_cn: 激活密钥。有关详细信息，请参见 xref:client-configuration:activation-keys.adoc[]。

source: The following command will download the bootstrap script and register the new machine when it is created. It should be added to the [literal]``cloud-init`` configuration:
ca: La següent ordre descarregarà l'script d'arrencada i registrarà la màquina nova quan es creï. S'ha d'afegir a la configuració [literal] thecloud-init the:
ja: 次のコマンドを実行すると、ブートストラップスクリプトがダウンロードされ、新しいマシン作成時にそのマシンが登録されます。 これを[literal]``cloud-init``設定に追加する必要があります。
ko: 다음 명령은 부트스트랩 스크립트를 다운로드하고 새 머신이 생성될 때 등록하며, [literal]``cloud-init`` 구성에 추가해야 합니다.
zh_cn: 下面的命令会下载引导脚本并在新虚拟机创建后注册该虚拟机。应将此命令添加到 [literal]``cloud-init`` 配置中：

source: Any time [path]``user_data`` is updated to change the provisioning, Terraform will destroy and then recreate the machines with a new IP, etc.
ca: En qualsevol moment [camí].userdata. s'actualitza per canviar l'aprovisionament, Terraform destruirà i després recrearà les màquines amb una nova IP, etc.

source: For more information about [literal]``cloud-init`` on AWS, see https://registry.terraform.io/providers/hashicorp/template/latest/docs/data-sources/cloudinit_config.
ca: Per a més informació sobre [literal].cloud-init. a AWS, vegeu https://registry.terraform.io/providers/hashicorp/template/latest/docs/data-sources/cloudinitconfig.
ja: AWSでの[literal]``cloud-init``に関する詳細については、link:https://registry.terraform.io/providers/hashicorp/template/latest/docs/data-sources/cloudinit_config[]を参照してください。
ko: AWS 기반 [literal]``cloud-init``에 대한 자세한 내용은 https://registry.terraform.io/providers/hashicorp/template/latest/docs/data-sources/cloudinit_config[]에서 확인할 수 있습니다.
zh_cn: 有关 AWS 上的 [literal]``cloud-init`` 的详细信息，请参见 https://registry.terraform.io/providers/hashicorp/template/latest/docs/data-sources/cloudinit_config[]。

source: For a [literal]``cloud-init`` example, see https://registry.terraform.io/providers/hashicorp/cloudinit/latest/docs/data-sources/cloudinit_config#example-usage.
ca: Per a un exemple [literal].cloud-init,, vegeu https://registry.terraform.io/providers/hashicorp/cloudinit/latest/docs/data-sources/cloudinitconfig.example-usage.
ja: [literal]``cloud-init``の例については、link:https://registry.terraform.io/providers/hashicorp/cloudinit/latest/docs/data-sources/cloudinit_config#example-usage[]を参照してください。
ko: [literal]``cloud-init`` 예제는 https://registry.terraform.io/providers/hashicorp/cloudinit/latest/docs/data-sources/cloudinit_config#example-usage[]에서 확인할 수 있습니다.
zh_cn: 有关 [literal]``cloud-init`` 示例，请参见 https://registry.terraform.io/providers/hashicorp/cloudinit/latest/docs/data-sources/cloudinit_config#example-usage[]。

source: [literal]``remote-exec`` Provisioner Based Registration
ca: registre basat en l'aprovisionador d'execució remota

source: The second solution for automatic registering of the newly created virtual machines uses Terraform's [literal]``remote-exec`` provisioner.
ca: La segona solució per al registre automàtic de les màquines virtuals de nova creació utilitza el proveïdor de Terraform [literal].remote-exec..
ja: 新しく作成した仮想マシンの自動登録の2番目のソリューションではTerraformの[literal]``remote-exec``プロビジョナーを使用します。
ko: Terraform의 [literal]``remote-exec`` 프로비저너를 사용하여 새로 생성된 가상 머신을 자동으로 등록하기 위한 두 번째 솔루션입니다.
zh_cn: 第二种自动注册新创建的虚拟机的方法是使用 Terraform 的 [literal]``remote-exec`` 置备器。

source: [literal]``remote-exec`` provisioner interacts with the newly created machines. It opens an SSH connection and can run commands on that machine.
ca: [literal].remote-exec. provisioner interactua amb les màquines de nova creació. Obre una connexió SSH i pot executar ordres en aquesta màquina.
ja: [literal]``remote-exec``プロビジョナーは新しく作成されたマシンとやり取りします。 これは、SSH接続を開き、そのマシンでコマンドを実行できます。
ko: [literal]``remote-exec`` 프로비저너는 새로 생성된 시스템과 상호 작용하며, SSH 연결을 열고 해당 시스템에서 명령을 실행할 수 있습니다.
zh_cn: [literal]``remote-exec`` 置备器会与新创建的虚拟机进行交互。它会建立 SSH 连接，然后便可在该虚拟机上运行命令。

source: When using [literal]``remote-exec`` provisioner to register clients, the user must ensure that the machine running Terraform will have access to the new virtual machine after its creation.
ca: En utilitzar el proveïdor [literal].remote-exec. per registrar clients, l'usuari ha d'assegurar-se que la màquina que executa Terraform tindrà accés a la nova màquina virtual després de la seva creació.
ja: リモート実行プロビジョナーを使用してクライアントを登録するとき、ユーザは、Terraformを実行しているマシンが、新しい仮想マシン作成後にそのマシンにアクセスできることを確認する必要があります。
ko: [literal]``remote-exec`` 구축 프로그램을 사용하여 클라이언트를 등록할 때 사용자는 Terraform을 실행하는 시스템이 생성 후 새 가상 시스템에 액세스할 수 있는지 확인해야 합니다.
zh_cn: 使用 [literal]``remote-exec`` 置备器注册客户端时，用户必须确保运行 Terraform 的虚拟机在新虚拟机创建后可以访问该虚拟机。

source: The remaining requirements are the same as when using <<cloud-init-based-client-registration>>:
ca: Els requisits restants són els mateixos que quan s'utilitza <<cloud-init-based-client-registration>::
ja: その他の要件は、<<cloud-initベースのクライアントの登録>>と同じです。
ko: 나머지 요구 사항은 <<cloud-init-based-client-registration>>을 사용할 때와 동일합니다.
zh_cn: 其他要求与使用<<cloud-init-based-client-registration>>时相同：

source: The following command will download the bootstrap script and register the new machine when it is created. It should be defined as the remote command to run:
ca: La següent ordre descarregarà l'script d'arrencada i registrarà la màquina nova quan es creï. S'ha de definir com l'ordre remota a executar:
ja: 次のコマンドを実行すると、ブートストラップスクリプトがダウンロードされ、新しいマシン作成時にそのマシンが登録されます。 これは、実行するリモートコマンドとして定義する必要があります。
ko: 다음 명령은 부트스트랩 스크립트를 다운로드하고 새 머신이 생성될 때 등록하며, 실행할 원격 명령으로 정의해야 합니다.
zh_cn: 下面的命令会下载引导脚本并在新虚拟机创建后注册该虚拟机。应将此命令定义为要运行的远程命令：

source: For more information about [literal]``remote-exec`` provisioner, see https://www.terraform.io/docs/provisioners/remote-exec.html.
ca: Per a més informació sobre el proveïdor [literal].remote-exec,, vegeu https://www.terraform.io/docs/provisioners/remote-exec.html.
ja: [literal]``remote-exec``プロビジョナーの詳細については、link:https://www.terraform.io/docs/provisioners/remote-exec.html[]を参照してください。
ko: [literal]``remote-exec`` 프로비저너에 대한 자세한 내용은 https://www.terraform.io/docs/provisioners/remote-exec.html[]에서 확인할 수 있습니다.
zh_cn: 有关 [literal]``remote-exec`` 置备器的详细信息，请参见 https://www.terraform.io/docs/provisioners/remote-exec.html[]。

source: Bootstrap repository
ca: Repositori de Bootstrap

source: A bootstrap repository contains required packages for registering clients during bootstrapping. When products are synchronized, bootstrap repositories are automatically created and regenerated on the {productname} Server.
ca: Un repositori d'arrencada conté paquets necessaris per registrar clients durant l'arrencada. Quan els productes estan sincronitzats, els repositoris d'arrencada es creen i es regeneren automàticament al servidor {productname}.

source: Prepare to create a bootstrap repository
ca: Preparació per crear un repositori de Bootstrap

source: When you select a product for synchronization, the bootstrap repository is automatically created as soon as all mandatory channels are fully mirrored.
ca: Quan seleccioneu un producte per a la sincronització, el repositori bootstrap es crearà automàticament tan aviat com tots els canals obligatoris estiguin completament reflectits.
ja: 同期する製品を選択するとき、ブートストラップリポジトリは、必須のチャンネルすべてが完全にミラーリングされるとすぐに自動的に作成されます。
ko: 동기화를 위해 제품을 선택하면 모든 필수 채널이 완전히 미러링되자마자 부트스트랩 리포지토리가 자동으로 생성됩니다.
zh_cn: 如果您选择某个产品以进行同步，当所有必需的通道都完全镜像后，会立即自动创建引导储存库。

source: Options for automatic mode
ca: Opcions per al mode automàtic

source: You can change how the automated bootstrap repository creation works. This section details the various settings.
ca: Podeu canviar com funciona la creació automàtica del repositori bootstrap. Aquesta secció detalla els diferents paràmetres.
ja: ブートストラップリポジトリの自動作成動作を変更できます。 このセクションでは、さまざまな設定を説明します。
ko: 자동 부트스트랩 리포지토리가 생성되는 방식을 변경할 수 있습니다. 이 섹션에서는 다양한 설정에 대해 자세히 설명합니다.
zh_cn: 您可以更改自动引导储存库的创建方式。本节介绍了各种相应设置。

source: Flush mode
ca: Mode d'eliminació

source: By default, existing repositories are updated only with the latest packages. You can configure it to always start with an empty repository instead. To enable this behavior, add or edit this value in [path]``/etc/rhn/rhn.conf``:
ca: Per defecte, els repositoris existents només s'actualitzen amb els paquets més recents. Podeu configurar-lo per a començar sempre amb un repositori buit. Per a habilitar aquest comportament, afegiu o editeu aquest valor a [path]:/etc/rhn/rhn.conf::
ja: デフォルトでは、既存のリポジトリは、最新パッケージでのみ更新されます。 代わりに、必ず空のリポジトリで始まるように設定できます。 この動作を有効にするには、[path]``/etc/rhn/rhn.conf``で次の値を追加または編集します。
ko: 기본적으로 기존 리포지토리는 최신 패키지로만 업데이트됩니다. 대신, 빈 리포지토리로 항상 시작하도록 구성할 수 있습니다. 이 동작을 활성화하려면 다음과 같이 [path]``/etc/rhn/rhn.conf``에서 이 값을 추가하거나 편집합니다.
zh_cn: 默认只会使用最新软件包更新现有储存库，而您可以将其配置为始终从空储存库开始。要启用此行为，请在 [path]``/etc/rhn/rhn.conf`` 中添加或编辑此值：

source: server.susemanager.bootstrap_repo_flush = 1
ca: server.susemanager.bootstraprepoflush 1 1

source: Automatic mode
ca: Mode automàtic

source: By default, automated regeneration of the bootstrap repositories is enabled. To disable it, add or edit this value in [path]``/etc/rhn/rhn.conf``:
ca: Per defecte, s'habilita la regeneració automàtica dels repositoris bootstrap. Per a desactivar-lo, afegiu o editeu aquest valor a [path]:/etc/rhn/rhn.conf::
ja: デフォルトでは、ブートストラップリポジトリの自動再生成は有効になっています。 無効にするには、[path]``/etc/rhn/rhn.conf``で次の値を追加または編集します。
ko: 기본적으로 부트스트랩 리포지토리 자동 재생성은 활성화되어 있습니다. 이 작업을 비활성화하려면 다음과 같이 [path]``/etc/rhn/rhn.conf``에서 이 값을 추가하거나 편집합니다.
zh_cn: 默认会启用引导储存库的自动重新生成功能。要禁用此功能，请在 [path]``/etc/rhn/rhn.conf`` 中添加或编辑此值：

source: Configure bootstrap data file
ca: Configura el fitxer de dades de Bootstrap

source: The tool uses a data file with information about which packages are required for each distribution. The data file is stored at [path]``/usr/share/susemanager/mgr_bootstrap_data.py``. {suse} updates this file regularly. If you want to makes changes to this file, do not edit it directly. Instead, create a copy in persistent directory and edit your copy:
ca: L'eina utilitza un fitxer de dades amb informació sobre quins paquets són necessaris per a cada distribució. El fitxer de dades s'emmagatzema a [path]./usr/share/susemanager/mgrbootstrapdata.py.. {suse} actualitza aquest fitxer regularment. Si voleu fer canvis en aquest fitxer, no l'editeu directament. En canvi, creeu una còpia al directori persistent i editeu la vostra còpia:

source: When you have made your changes, configure {productname} to use the new file. Add or edit this value in [path]``/etc/rhn/rhn.conf``:
ca: Quan hàgiu fet els canvis, configureu {productname} per utilitzar el fitxer nou. Afegeix o edita aquest valor a [path]:/etc/rhn/rhn.conf::
ja: 変更したら、{productname}を設定して新しいファイルを使用します。 [path]``/etc/rhn/rhn.conf``でこの値を追加または編集します。
ko: 변경을 완료했으면 새 파일을 사용하도록 {productname}를 구성합니다. 다음과 같이 [path]``/etc/rhn/rhn.conf``에서 이 값을 추가하거나 편집합니다.
zh_cn: 更改后，将 {productname} 配置为使用这个新文件。在 [path]``/etc/rhn/rhn.conf`` 中添加或编辑此值：

source: On the next update, the new data from {suse} overwrites the original data file, not the new one. You need to keep the new file up to date with changes provided by {suse}.
ca: En la propera actualització, les dades noves de {suse} sobreescriuen el fitxer de dades original, no el nou. Heu de mantenir el nou fitxer actualitzat amb els canvis proporcionats per {suse}.
ja: 次の更新時、{suse}の新しいデータによって、新しいデータファイルではなく元のデータファイルが上書きされます。 {suse}によって行われた変更を使用して新しいファイルを最新に保つ必要があります。
ko: 다음 업데이트에서 {suse}의 새 데이터는 새 데이터 파일이 아닌 원본 데이터 파일을 덮어씁니다. {suse}에서 제공하는 변경 사항으로 새 파일을 최신 상태로 유지해야 합니다.
zh_cn: 下次更新时，{suse} 提供的新数据将重写原来的数据文件，而不是这个新文件。您需要在新文件中使用 {suse} 提供的更改覆盖相应内容，以使其保持最新。

source: Manually generate a bootstrap repository
ca: Genera manualment un repositori de Bootstrap

source: By default, bootstrap repositories are regenerated daily. You can manually create the bootstrap repository from the command prompt.
ca: Per defecte, els repositoris bootstrap es regeneren diàriament. Podeu crear manualment el repositori bootstrap des de l'indicador d'ordres.
ja: デフォルトでは、ブートストラップリポジトリは毎日再生成されます。 コマンドプロンプトからブートストラップリポジトリを手動で作成できます。
ko: 기본적으로 부트스트랩 리포지토리는 매일 다시 생성됩니다. 명령 프롬프트에서 부트스트랩 리포지토리를 수동으로 생성할 수 있습니다.
zh_cn: 默认情况下，每天都会重新生成引导储存库。您可以在命令提示符处手动创建引导储存库。

source: Procedure: Generating the bootstrap repository for {sle}
ca: Procediment: generació del repositori de Bootstrap per a {sle}

source: At the command prompt on the {productname} Server, as root, list the available distributions to create bootstrap repositories for:
ca: A l'indicador d'ordres del servidor {productname}, com a root, llista les distribucions disponibles per a crear repositoris bootstrap per a:
ja: {productname}サーバのコマンドプロンプトで、rootとして、次のコマンド用のブートストラップリポジトリを作成するために使用できるディストリビューションをリストします。
ko: {productname} 서버의 명령 프롬프트에서 루트 권한으로 다음과 같이 부트스트랩 리포지토리를 생성하는 데 사용 가능한 배포를 나열합니다.
zh_cn: 在 {productname} 服务器上的命令提示符处，以 root 身份列出要为其创建引导储存库的可用发行套件：
