Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: | Feature | {amazon}{nbsp}2 | {amazon}{nbsp}2023 | Client | {check} | {check} | Operating system packages | {check} | {check} | Registration | {check} | {check} | Install packages | {check} | {check} | Apply patches (requires CVE ID) | {check} | {check} | Remote commands | {check} | {check} | System package states | {check} | {check} | System custom states | {check} | {check} | Group custom states | {check} | {check} | Organization custom states | {check} | {check} | System set manager (SSM) | {check} | {check} | Product migration | N/A | N/A | Basic Virtual Guest Management {star} | {question} | {question} | Advanced Virtual Guest Management {star} | {question} | {question} | Virtual Guest Installation (Kickstart), as Host OS | {cross} | {cross} | Virtual Guest Installation (image template), as Host OS | {question} | {question} | System deployment (PXE/Kickstart) | {question} | {question} | System redeployment (Kickstart) | {question} | {question} | Contact methods | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | Works with {productname} Proxy | {check} | {check} | Action chains | {check} | {check} | Staging (pre-download of packages) | {check} | {check} | Duplicate package reporting | {check} | {check} | CVE auditing (requires CVE ID) | {check} | {check} | SCAP auditing | {check} | {check} | Package verification | {cross} | {cross} | Package locking | {cross} | {cross} | System locking | {cross} | {cross} | Maintenance Windows | {check} | {check} | System snapshot | {cross} | {cross} | Configuration file management | {check} | {check} | Snapshots and profiles | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | Power management | {question} | {question} | Monitoring server | {cross} | {cross} ` | Monitored clients | {check} | {check} | Docker buildhost | {check} | {check} | Build Docker image with OS | {check} | {check} | Kiwi buildhost | {check} | {check} | Build Kiwi image with OS | {check} | {check} | Recurring Actions | {check} | {check} | AppStreams | N/A | N/A | Yomi | N/A | N/A
ca: | Característica | {amazon}{nbsp}2 | {amazon}{nbsp}2023 | Client | {check} | {check} | Paquets del sistema operatiu | {check} | {check} | Registre | {check} | {check} | Instal·la paquets | {check} | {check} | Aplica pegats (requereix un ID CVE) | {check} | {check} | Comandes remotes | {check} | {check} | Estats dels paquets del sistema | {check} | {check} | Estats personalitzats del sistema | {check} | {check} | Estats personalitzats del grup | {check} | {check} | Estats personalitzats de l'organització | {check} | {check} | Gestor de conjunts de sistemes (SSM) | {check} | {check} | Migració de productes | N/A | N/A | Gestió bàsica de convidats virtuals {star} | {question} | {question} | Gestió avançada de convidats virtuals {star} | {question} | {question} | Instal·lació de convidats virtuals (Kickstart), com a sistema operatiu amfitrió | {cross} | {cross} | Instal·lació de convidats virtuals (plantilla d'imatge), com a sistema operatiu amfitrió | {question} | {question} | Implementació del sistema (PXE/Kickstart) | {question} | {question} | Redistribució del sistema (Kickstart) | {question} | {question} | Mètodes de contacte | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | Funciona amb el proxy {productname} | {check} | Cadenes d'accions | {check} | {check} | Staging (predescàrrega de paquets) | {check} | {check} | Informes de paquets duplicats | {check} | {check} | Auditoria CVE (requereix l'ID de CVE) | {check} | {check} | Auditoria SCAP | {check} | {check} | Verificació de paquets | {cross} | {cross} | Bloqueig de paquets | {cross} | {cross} | Bloqueig del sistema | {cross} | {cross} | Finestres de manteniment | {check} | {check} | Instantànies del sistema | {cross} | {cross} | Gestió de fitxers de configuració | {check} | {check} | Instantànies i perfils | {check} Perfils compatibles, sincronització no compatible | {check} Perfils compatibles, sincronització no compatible | Gestió d'energia | {question} | {question} | Servidor de monitorització | {cross} | {cross} ` | Clients monitoritzats | {check} | {check} | Amfitrió de compilació de Docker | {check} | {check} | Crea una imatge de Docker amb el sistema operatiu | {check} | {check} | Amfitrió de compilació de Kiwi | {check} | {check} | Crea una imatge de Kiwi amb el sistema operatiu | {check} | {check} | Accions recurrents | {check} | {check} | AppStreams | N/A | N/A | Yomi | N/A | N/A

source: | Feature | {amazon}{nbsp}2 | {amazon}{nbsp}2023 | Client | {check} | {check} | Operating system packages | {check} | {check} | Registration | {check} | {check} | Install packages | {check} | {check} | Apply patches (requires CVE ID) | {check} | {check} | Remote commands | {check} | {check} | System package states | {check} | {check} | System custom states | {check} | {check} | Group custom states | {check} | {check} | Organization custom states | {check} | {check} | System set manager (SSM) | {check} | {check} | Product migration | N/A | N/A | Basic Virtual Guest Management {star} | {question} | {question} | Advanced Virtual Guest Management {star} | {question} | {question} | Virtual Guest Installation (Kickstart), as Host OS | {cross} | {cross} | Virtual Guest Installation (image template), as Host OS | {question} | {question} | System deployment (PXE/Kickstart) | {question} | {question} | System redeployment (Kickstart) | {question} | {question} | Contact methods | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | Works with {productname} Proxy | {check} | {check} | Action chains | {check} | {check} | Staging (pre-download of packages) | {check} | {check} | Duplicate package reporting | {check} | {check} | CVE auditing (requires CVE ID) | {check} | {check} | SCAP auditing | {check} | {check} | Package verification | {cross} | {cross} | Package locking | {cross} | {cross} | System locking | {cross} | {cross} | Maintenance Windows | {check} | {check} | System snapshot | {cross} | {cross} | Configuration file management | {check} | {check} | Snapshots and profiles | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | Power management | {question} | {question} | Monitoring server | {cross} | {cross} | Monitored clients | {check} | {check} | Docker buildhost | {check} | {check} | Build Docker image with OS | {check} | {check} | Kiwi buildhost | {check} | {check} | Build Kiwi image with OS | {check} | {check} | Recurring Actions | {check} | {check} | AppStreams | N/A | N/A | Yomi | N/A | N/A
ca: Fe Característica {amazon}{nbsp}2 {amazon}{nbsp}2023 Client {check} {check} Paquets de sistema operatiu {check} {check} Inscripció {check} {check} Instal·la paquets {check} {check} ) Aplica els pedaços (requereix l'ID CVE) {check} {check} s Ordres remotes {check} {check} Estats del paquet del sistema {check} {check} Estats personalitzats del sistema {check} {check} Agrupa estats personalitzats {check} {check} Organització d'estats personalitzats {check} {check} ) Gestor de conjunts de sistemes (SSM) {check} {check} Migració de producte N/A N/A Gestió bàsica de convidats virtual {star} {question} {question} Gestió de convidats virtual avançada {star} {question} {question} ), Instal·lació de convidat virtual (Kickstart), com a servidor {cross} {cross} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {question} {question} ) Desplegament del sistema (PXE/Kickstart) {question} {question} ) Redesplegament del sistema (Kickstart) {question} {question} Mètodes de contacte , {check} ZeroMQ, Salt-SSH , {check} ZeroMQ, Salt-SSH with Funciona amb el servidor intermediari {productname} {check} {check} Cadenes d'acció {check} {check} ) Estadificació (pre-descàrrega de paquets) {check} {check} Informe de paquets duplicat {check} {check} audit auditoria CVE (requereix l'ID CVE) {check} {check} ing Auditoria SCAP {check} {check} Verificació de paquets {cross} {cross} ing Bloqueig de paquets {cross} {cross} ing Bloqueig del sistema {cross} {cross} Finestres de manteniment {check} {check} Instantània del sistema {cross} {cross} Gestió de fitxers de configuració {check} {check} and Instantànies i perfils , {check} Perfils admesos, la sincronització no és compatible , {check} Perfils admesos, la sincronització no és compatible Gestió d'energia {question} {question} Servidor de seguiment {cross} {cross} Clients monitoritzats {check} {check} Constructor Docker {check} {check} Construeix la imatge Docker amb el SO {check} {check} Constructor de Kiwi {check} {check} Construeix la imatge de Kiwi amb el SO {check} {check} s Accions recurrents {check} {check} s AppStreams N/A N/A Yomi N/A N/A

source: Supported CentOS Features
ca: Característiques compatibles amb CentOS
ja: サポートされているCentOSの機能
ko: 지원하는 CentOS 기능
zh_cn: 支持的 CentOS 功能

source: This table lists the availability of various features on {CentOS} clients.
ca: Aquesta taula llista la disponibilitat de diverses característiques en {CentOS} clients.
ja: この表には、{CentOS}クライアントのさまざまな機能の使用可否がリストされています。
ko: 아래 표는 {CentOS} 클라이언트에서 다양한 기능의 사용 가능 여부를 정리한 것입니다.
zh_cn: 下表列出了 {CentOS} 客户端上各种功能的可用性。

source: The operating system you run on a client is supported by the organization that supplies the operating system. {centos} is supported by the {centos} community.
ca: El sistema operatiu que executeu en un client és compatible amb l'organització que subministra el sistema operatiu. {centos} és compatible amb la comunitat {centos}.
ja: クライアントで実行しているオペレーティングシステムは、オペレーティングシステムを提供している組織によってサポートされています。 {centos}は{centos}コミュニティでサポートされています。
ko: 클라이언트에서 실행하는 운영 체제는 운영 체제를 제공하는 조직이 지원합니다. {centos}는 {centos} 커뮤니티가 지원합니다.
zh_cn: 客户端上运行的操作系统由提供操作系统的组织支持。{centos} 由 {centos} 社区支持。

source: Supported Features on {centos} Operating Systems
ca: Característiques suportades en {centos} Sistemes operatius
ja: {centos}オペレーティングシステムでサポートされている機能
ko: {centos} 운영 체제에서 지원하는 기능
zh_cn: {centos} 操作系统上支持的功能

source: | Feature | {centos}{nbsp}7 | Client | {check} (plain CentOS) | System packages | {centos} Community | Registration | {check} | Install packages | {check} | Apply patches (requires CVE ID) | {check} (third-party service required for errata) | Remote commands | {check} | System package states | {check} | System custom states | {check} | Group custom states | {check} | Organization custom states | {check} | System set manager (SSM) | {check} | Product migration {star} | {check} | Basic Virtual Guest Management {star}{star} | {check} | Advanced Virtual Guest Management {star}{star} | {check} | Virtual Guest Installation (Kickstart), as Host OS | {cross} | Virtual Guest Installation (image template), as Host OS | {check} | System deployment (PXE/Kickstart) | {check} | System redeployment (Kickstart) | {check} | Contact methods | {check} ZeroMQ, Salt-SSH | Works with {productname} Proxy | {check} | Action chains | {check} | Staging (pre-download of packages) | {check} | Duplicate package reporting | {check} | CVE auditing (requires CVE ID) | {check} | SCAP auditing | {check} | Package verification | {cross} | Package locking | {check} | System locking | {cross} | Maintenance Windows | {check} | System snapshot | {cross} | Configuration file management | {check} | Snapshots and profiles | {check} Profiles supported, Sync not supported | Power management | {check} | Monitoring server | {cross} | Monitored clients | {check} | Docker buildhost | {cross} | Build Docker image with OS | {cross} | Kiwi buildhost | {cross} | Build Kiwi image with OS | {cross} | Recurring Actions | {check} | AppStreams | N/A | Yomi | N/A
ca: Fe Característica {centos}{nbsp}7 Client ) {check} (Segles simples) Paquets del sistema {centos} Comunitat Inscripció {check} Instal·la paquets {check} ) Aplica els pedaços (requereix l'ID CVE) ) {check} (servei de tercers requerit per a errata) s Ordres remotes {check} Estats del paquet del sistema {check} Estats personalitzats del sistema {check} Agrupa estats personalitzats {check} Organització d'estats personalitzats {check} ) Gestor de conjunts de sistemes (SSM) {check} Migració de producte {star} {check} Gestió bàsica de convidats virtual {star}{star} {check} Gestió de convidats virtual avançada {star}{star} {check} ), Instal·lació de convidat virtual (Kickstart), com a servidor {cross} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {check} ) Desplegament del sistema (PXE/Kickstart) {check} ) Redesplegament del sistema (Kickstart) {check} Mètodes de contacte , {check} ZeroMQ, Salt-SSH with Funciona amb el servidor intermediari {productname} {check} Cadenes d'acció {check} ) Estadificació (pre-descàrrega de paquets) {check} Informe de paquets duplicat {check} audit auditoria CVE (requereix l'ID CVE) {check} ing Auditoria SCAP {check} Verificació de paquets {cross} ing Bloqueig de paquets {check} ing Bloqueig del sistema {cross} Finestres de manteniment {check} Instantània del sistema {cross} Gestió de fitxers de configuració {check} and Instantànies i perfils , {check} Perfils admesos, la sincronització no és compatible Gestió d'energia {check} Servidor de seguiment {cross} Clients monitoritzats {check} Constructor Docker {cross} Construeix la imatge Docker amb el SO {cross} Constructor de Kiwi {cross} Construeix la imatge de Kiwi amb el SO {cross} s Accions recurrents {check} s AppStreams N/A Yomi N/A

source: Supported {debian} Features
ca: Característiques de {debian} suportades
ja: サポートされている{debian}の機能
ko: 지원하는 {debian} 기능
zh_cn: 支持的 {debian} 功能

source: This table lists the availability of various features on {debian} clients.
ca: Aquesta taula llista la disponibilitat de diverses característiques als clients {debian}.
ja: この表には、{debian}クライアントのさまざまな機能の使用可否がリストされています。
ko: 아래 표는 {debian} 클라이언트에서 다양한 기능의 사용 가능 여부를 정리한 것입니다.
zh_cn: 下表列出了 {debian} 客户端上各种功能的可用性。

source: The operating system you run on a client is supported by the organization that supplies the operating system. {debian} is supported by the {debian} community.
ca: El sistema operatiu que executeu en un client és compatible amb l'organització que subministra el sistema operatiu. {debian} és compatible amb la comunitat {debian}.
ja: クライアントで実行しているオペレーティングシステムは、オペレーティングシステムを提供している組織によってサポートされています。 {debian}は{debian}コミュニティでサポートされています。
ko: 클라이언트에서 실행하는 운영 체제는 운영 체제를 제공하는 조직이 지원합니다. {debian}은 {debian} 커뮤니티가 지원합니다.
zh_cn: 客户端上运行的操作系统由提供操作系统的组织支持。{debian} 由 {debian} 社区支持。

source: Supported Features on {debian} Operating Systems
ca: Funcionalitats suportades a {debian} Sistemes operatius
ja: {debian}オペレーティングシステムでサポートされている機能
ko: {debian} 운영 체제에서 지원하는 기능
zh_cn: {debian} 操作系统上支持的功能

source: | Feature | {debian}{nbsp}12 | Client | {check} | System packages | {debian} Community | Registration | {check} | Install packages | {check} | Apply patches | {question} | Remote commands | {check} | System package states | {check} | System custom states | {check} | Group custom states | {check} | Organization custom states | {check} | System set manager (SSM) | {check} | Product migration | N/A | Basic Virtual Guest Management {star} | {check} | Advanced Virtual Guest Management {star} | {check} | Virtual Guest Installation (Kickstart), as Host OS | {check} | Virtual Guest Installation (image template), as Host OS | {check} | System deployment (PXE/Kickstart) | {check} | System redeployment (Kickstart) | {cross} | Contact methods | {check} ZeroMQ, Salt-SSH | Works with {productname} Proxy | {check} | Action chains | {check} | Staging (pre-download of packages) | {check} | Duplicate package reporting | {check} | CVE auditing | {question} | SCAP auditing | {question} | Package verification | {cross} | Package locking | {check} | System locking | {cross} | Maintenance Windows | {check} | System snapshot | {cross} | Configuration file management | {check} | Package profiles | {check} Profiles supported, Sync not supported | Power management | {check} | Monitoring server | {cross} | Monitoring clients | {check} | Docker buildhost | {question} | Build Docker image with OS | {salt} | Kiwi buildhost | {cross} | Build Kiwi image with OS | {cross} | Recurring Actions | {check} | AppStreams | N/A | Yomi | N/A
ca: Fe Característica {debian}{nbsp}12 Client {check} Paquets del sistema {debian} Comunitat Inscripció {check} Instal·la paquets {check} es Aplica els pedaços {question} s Ordres remotes {check} Estats del paquet del sistema {check} Estats personalitzats del sistema {check} Agrupa estats personalitzats {check} Organització d'estats personalitzats {check} ) Gestor de conjunts de sistemes (SSM) {check} Migració de producte N/A Gestió bàsica de convidats virtual {star} {check} Gestió de convidats virtual avançada {star} {check} ), Instal·lació de convidat virtual (Kickstart), com a servidor {check} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {check} ) Desplegament del sistema (PXE/Kickstart) {check} ) Redesplegament del sistema (Kickstart) {cross} Mètodes de contacte , {check} ZeroMQ, Salt-SSH with Funciona amb el servidor intermediari {productname} {check} Cadenes d'acció {check} ) Estadificació (pre-descàrrega de paquets) {check} Informe de paquets duplicat {check} ing Auditoria CVE {question} ing Auditoria SCAP {question} Verificació de paquets {cross} ing Bloqueig de paquets {check} ing Bloqueig del sistema {cross} Finestres de manteniment {check} Instantània del sistema {cross} Gestió de fitxers de configuració {check} Perfils del paquet , {check} Perfils admesos, la sincronització no és compatible Gestió d'energia {check} Servidor de seguiment {cross} Seguiment de clients {check} Constructor Docker {question} Construeix la imatge Docker amb el SO {salt} Constructor de Kiwi {cross} Construeix la imatge de Kiwi amb el SO {cross} s Accions recurrents {check} s AppStreams N/A Yomi N/A

source: Supported {oes} Features
ca: Funcionalitats de {rhel} suportades

source: This table lists the availability of various features on {oes} clients.
ca: Aquesta taula llista la disponibilitat de diverses característiques en {oracle} clients.

source: The operating system you run on a client is supported by the organization that supplies the operating system. {oes} is supported by Micro Focus or OpenText.
ca: El sistema operatiu que executeu en un client és compatible amb l'organització que subministra el sistema operatiu. Oracle és compatible amb {oracle}.

source: Supported Features on {oes} Operating Systems
ca: Característiques suportades en {centos} Sistemes operatius

source: | Feature | {oes}{nbsp}24.4 | {oes}{nbsp}23.4 | Client | {check} | {check} | System packages | {suse} | {suse} | Registration | {check} | {check} | Install packages | {check} | {check} | Apply patches | {check} | {check} | Remote commands | {check} | {check} | System package states | {check} | {check} | System custom states | {check} | {check} | Group custom states | {check} | {check} | Organization custom states | {check} | {check} | System set manager (SSM) | {check} | {check} | Product migration | {check} | {check} | Basic Virtual Guest Management {star} | {check} | {check} | Advanced Virtual Guest Management {star} | {check} | {check} | Virtual Guest Installation ({ay}), as Host OS | {cross} | {cross} | Virtual Guest Installation (image template), as Host OS | {check} | {check} | Virtual Guest Management | {check} | {check} | System deployment (PXE/{ay}) | {check} | {check} | System redeployment ({ay}) | {check} | {check} | Contact methods | {cross} | {cross} | Works with {productname} Proxy | {check} | {check} | Action chains | {check} | {check} | Staging (pre-download of packages) | {check} | {check} | Duplicate package reporting | {check} | {check} | CVE auditing | {check} | {check} | SCAP auditing | {check} | {check} | Package verification | {cross} | {cross} | Package locking | {check} | {check} | System locking | {cross} | {cross} | Maintenance Windows | {check} | {check} | System snapshot | {cross} | {cross} | Configuration file management | {check} | {check} | Package profiles | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | Power management | {check} | {check} | Monitoring server | {check} | {check} | Monitored clients | {check} | {check} | Docker buildhost | {check} | {check} | Build Docker image with OS | {check} | {check} | Kiwi buildhost | {question} | {question} | Build Kiwi image with OS | {question} | {question} | Recurring Actions | {check} | {check} | AppStreams | N/A | N/A | Yomi | {check} | {check}
ca: Fe Característica {oes}{nbsp}24.4 {oes}{nbsp}23.4 Client {check} {check} Paquets del sistema {suse} {suse} Inscripció {check} {check} Instal·la paquets {check} {check} es Aplica els pedaços {check} {check} s Ordres remotes {check} {check} Estats del paquet del sistema {check} {check} Estats personalitzats del sistema {check} {check} Agrupa estats personalitzats {check} {check} Organització d'estats personalitzats {check} {check} ) Gestor de conjunts de sistemes (SSM) {check} {check} Migració de producte {check} {check} Gestió bàsica de convidats virtual {star} {check} {check} Gestió de convidats virtual avançada {star} {check} {check} ), Instal·lació de convidat virtual ({ay}), com a host OS {cross} {cross} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {check} {check} Gestió de convidats virtual {check} {check} ) Desplegament del sistema (PXE/{ay}) {check} {check} ) Redesplegament del sistema ({ay}) {check} {check} Mètodes de contacte {cross} {cross} with Funciona amb el servidor intermediari {productname} {check} {check} Cadenes d'acció {check} {check} ) Estadificació (pre-descàrrega de paquets) {check} {check} Informe de paquets duplicat {check} {check} ing Auditoria CVE {check} {check} ing Auditoria SCAP {check} {check} Verificació de paquets {cross} {cross} ing Bloqueig de paquets {check} {check} ing Bloqueig del sistema {cross} {cross} Finestres de manteniment {check} {check} Instantània del sistema {cross} {cross} Gestió de fitxers de configuració {check} {check} Perfils del paquet , {check} Perfils admesos, la sincronització no és compatible , {check} Perfils admesos, la sincronització no és compatible Gestió d'energia {check} {check} Servidor de seguiment {check} {check} Clients monitoritzats {check} {check} Constructor Docker {check} {check} Construeix la imatge Docker amb el SO {check} {check} Constructor de Kiwi {question} {question} Construeix la imatge de Kiwi amb el SO {question} {question} s Accions recurrents {check} {check} s AppStreams N/A N/A Yomi {check} {check}

source: Supported {openeuler} Features
ca: Funcionalitats de {rhel} suportades

source: This table lists the availability of various features on {openeuler} clients.
ca: Aquesta taula llista la disponibilitat de diverses característiques en {oracle} clients.

source: The operating system you run on a client is supported by the organization that supplies the operating system. {openeuler} is supported by the {openeuler} community.
ca: El sistema operatiu que executeu en un client és compatible amb l'organització que subministra el sistema operatiu. {centos} és compatible amb la comunitat {centos}.

source: Supported Features on {openeuler} Operating Systems
ca: Característiques suportades en sistemes operatius {oracle}
