Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: In the [guimenu]``Distribution Label`` field, enter a name to identify your autoinstallable distribution.
ca: Al camp [guimenu].Etiqueta de distribució., introduïu un nom per a identificar la vostra distribució autoinstal·lable.
ja: ［[guimenu]``ディストリビューションラベル``］フィールドに、自動インストール可能なディストリビューションを識別するための名前を入力します。
ko: [guimenu]``배포 레이블`` 필드에서 자동 설치 가능한 배포를 식별할 수 있는 이름을 입력합니다.
zh_cn: 在[guimenu]``发行套件标签``字段中，输入用于识别可自动安装的发行套件的名称。

source: In the [guimenu]``Tree Path`` field, enter the path to the installation media saved on your {productname} Server.
ca: Al camp [guimenu].Treu el camí., introduïu el camí al mitjà d'instal·lació desat al vostre servidor {productname}.
ja: ［[guimenu]``ツリーパス``］フィールドに、{productname}サーバに保存されているインストールメディアへのパスを入力します。
ko: [guimenu]``트리 경로`` 필드에서 {productname} 서버에 저장된 설치 미디어의 경로를 입력합니다.
zh_cn: 在[guimenu]``树路径``字段中，输入保存在 {productname} 服务器上的安装媒体的路径。

source: Select the matching [guimenu]``Base Channel``. This must match the installation media.
ca: Al camp [guimenu].Canal base., seleccioneu el canal que coincideixi amb l'origen de la instal·lació.
ja: 対応する［[guimenu]``ベースチャンネル``］を選択します。 このチャンネルはインストールメディアと一致する必要があります。
ko: 일치하는 [guimenu]``기본 채널``을 선택합니다. 설치 미디어와 일치해야 합니다.
zh_cn: 选择匹配的[guimenu]``基础通道``。所选值必须与安装媒体相匹配。

source: Select the [guimenu]``Installer Generation``. This must match the installation media.
ca: Al camp [guimenu].Generació d'instal·ladors., seleccioneu la versió del sistema operatiu que coincideixi amb la font d'instal·lació.
ja: ［[guimenu]``インストーラ生成``］を選択します。 これはインストールメディアと一致する必要があります。
ko: [guimenu]``설치 프로그램 생성``을 선택합니다. 설치 미디어와 일치해야 합니다.
zh_cn: 选择[guimenu]``安装程序代系``。所选值必须与安装媒体相匹配。

source: OPTIONAL: Specify kernel options to use when booting this distribution. There are multiple ways to provide kernel options. Only add options here that are generic for the distribution.
ca: OPCIONAL: Especifiqueu les opcions del nucli a usar en arrencar aquesta distribució. Hi ha múltiples maneres de proporcionar opcions del nucli. Afegiu aquí només opcions que siguin genèriques per a la distribució.
ja: オプション: このディストリビューションをブートするときに使用するカーネルオプションを指定します。 カーネルオプションを指定する方法は複数あります。 ここにはディストリビューションに当てはまるオプションのみを追加します。
ko: 선택 사항: 이 배포를 부팅할 때 사용할 커널 옵션을 지정하십시오. 여러 가지 방식으로 커널 옵션을 제공할 수 있습니다. 배포에 일반적으로 사용되는 옵션만 여기에 추가하십시오.
zh_cn: 可选：指定引导此发行套件时要使用的内核选项。您可以通过多种方式来提供内核选项。此处仅添加了发行套件通用的选项。

source: Click btn:[Create Autoinstallable Distribution].
ca: Feu clic a btn:[Crea la distribució autoinstal·lable].
ja: btn:[自動インストール可能なディストリビューションの作成]をクリックします。
ko: btn:[자동 설치 가능한 배포 생성]을 클릭합니다.
zh_cn: 单击 btn:[创建可自动安装的发行套件]。

source: The installation files that you prepared might not contain the packages you need to install. If they are not included, add [option]``useonlinerepo=1`` to the [guimenu]``Kernel Options`` field.
ca: És possible que els fitxers d'instal·lació que heu preparat no continguin els paquets que necessiteu instal·lar. Si no s'inclouen, afegiu [option].useonlinerepo11. al camp [guimenu].Opcions del nucli..
ja: 準備したインストールファイルには、インストールする必要があるパッケージが含まれていない可能性があります。 必要なパッケージが含まれていない場合は、［[guimenu]``カーネルオプション``］フィールドに[option]``useonlinerepo=1``を追加します。
ko: 준비한 설치 파일에는 설치에 필요한 패키지가 포함되지 않을 수 있습니다. 포함되지 않은 경우, [option]``useonlinerepo=1``을 [guimenu]``커널 옵션`` 필드에 추가합니다.
zh_cn: 您准备的安装文件可能不包含需要安装的软件包。如果这些软件包未包含在内，请将 [option]``useonlinerepo=1`` 添加到[guimenu]``内核选项``字段。

source: The package repositories contain metadata that can be unsigned. If the metadata is unsigned, add [option]``insecure=1`` to the [guimenu]``Kernel Options`` field, or use your own GPG key as explained in xref:client-configuration:autoinst-owngpgkey.adoc[Use Your Own GPG Key].
ca: Els repositoris de paquets contenen metadades que es poden no signar. Si les metadades no estan signades, afegiu [option]].insecure11]. al camp [guimenu]].Opcions del nucli]., o utilitzeu la vostra pròpia clau GPG com s'explica a xref:client-configuration:autoinst-owngpgkey.adoc[Usa la vostra pròpia clau GPG].
ja: パッケージリポジトリには、署名されていないことがあるメタデータが含まれています。 メタデータが署名されていない場合は、［[guimenu]``カーネルオプション``］フィードに[option]``insecure=1``を追加するか、xref:client-configuration:autoinst-owngpgkey.adoc[独自のGPGキーを使用する]の説明に従って独自のGPGキーを使用します。
ko: 패키지 리포지토리에는 서명되지 않을 수 있는 메타데이터가 포함되어 있습니다. 메타데이터가 서명되지 않은 경우 [option]``insecure=1``을 [guimenu]``커널 옵션`` 필드에 추가하거나 xref:client-configuration:autoinst-owngpgkey.adoc[자체 GPG 키 사용]에서의 설명과 같이 자체 GPG 키를 사용합니다.
zh_cn: 软件包储存库包含的元数据有可能未签名。如果元数据未签名，请将 [option]``insecure=1`` 添加到[guimenu]``内核选项``字段，或者使用您自己的 GPG 密钥（如 xref:client-configuration:autoinst-owngpgkey.adoc[使用您自己的 GPG 密钥] 中所述）。

source: These kernel options are needed for example when you use the "online installer" ISO images instead of the full DVD, or when you use the [package]``tpboot-installation`` package.
ca: Aquestes opcions del nucli són necessàries, per exemple, quan utilitzeu les imatges ISO de l'«instal·lador en línia» en comptes del DVD complet, o quan utilitzeu el paquet [package].tpboot-installation..
ja: これらの関連のオプションは、フルDVDの代わりに「オンラインインストーラ」ISOイメージを使用する場合や、[package ]``tpboot-installation``パッケージを使用する場合などに必要です。
ko: 이러한 커널 옵션은 예를 들어 전체 DVD가 아닌 "online installer" ISO 이미지를 사용하거나 [package ]``tpboot-installation`` 패키지를 사용할 때 필요합니다.
zh_cn: 有些情况下需要这些内核选项，例如，当您使用“联机安装程序”ISO 映像而非完整的 DVD 时，或者当您使用 [package ]``tpboot-installation`` 软件包时。

source: Navigate to menu:Systems[Autoinstallation > Distributions] to manage your autoinstallable distributions.
ca: Navega al menú:Sistemes[Autoinstal·lació . Distribucions] per gestionar les distribucions autoinstal·lables.
ja: 自動インストールのディストリビューションを管理するには、menu:システム[自動インストール > ディストリビューション]に移動します。
ko: menu:시스템[자동 설치 > 배포판]으로 이동하여 자동 설치 가능한 배포판을 관리합니다.
zh_cn: 导航到menu:系统[自动安装 > 发行套件]可管理您的可自动安装的发行套件。

source: You can autoinstall {productname} Proxy 4.3 in the same way as {sle} clients. Make sure you use the {sle} installation media, and choose the [guimenu]``SLE-Product-SUSE-Manager-Proxy-4.3-Pool for x86_64`` base channel.
ca: Podeu autoinstal·lar {productname} Proxy 4.3 de la mateixa manera que {sle} clients. Assegureu-vos d'utilitzar el mitjà d'instal·lació {sle} i trieu el [guimenu].SLE-Product-SUSE-Manager-Proxy-4.3-Pool per al canal base x8664..

source: Handling Kernel Options for Distributions and Profiles
ca: Es combinen les opcions del nucli de la distribució i el perfil.

source: {productname} is able to combine the kernel options that you assign. This is done using a special inheritance logic. There are three object types that are relevant for this:
ca: {productname} és capaç de combinar les opcions del nucli que assigneu. Això es fa utilitzant una lògica d'herència especial. Hi ha tres tipus d'objectes que són rellevants per a això:

source: Distributions (or short "Distros")
ca: Distribucions (o breus "Distros")

source: Profiles
ca: Perfils del Kickstart

source: Systems
ca: Tipus de sistema

source: As a fourth special point of influence on the final kernel options is the Cobbler settings file [path]``/etc/cobbler/settings.yaml``. The Cobbler settings file defines default kernel options for all distributions. This is not supported in the context of {productname}.
ca: Com a quart punt especial d'influència en les opcions finals del nucli, es troba el fitxer de configuració del Cobbler [camí]./etc/cobbler/settings.yaml.. El fitxer de configuració del Cobbler defineix les opcions predeterminades del nucli per a totes les distribucions. Això no és compatible amb el context de {productname}.

source: Understanding raw and resolved values is crucial for managing kernel options effectively.
ca: La comprensió dels valors crus i resolts és crucial per gestionar les opcions del nucli de manera efectiva.

source: **Raw values**: These refer to values attached directly to a specific Cobbler item and stored as-is in Cobbler's internal database.
ca: **Valors RAW**: Es refereixen a valors adjuntats directament a un element Cobbler específic i emmagatzemats tal com està a la base de dades interna de Cobbler.

source: **Resolved values**: These values are dynamically generated at runtime, respecting the inheritance hierarchy of Cobbler items.
ca: **Valors resolts**: Aquests valors es generen dinàmicament en temps d'execució, respectant la jerarquia d'herències dels elements de Cobbler.

source: If you prefix an option with [literal]``!`` then the option will be removed from the final kernel command line.
ca: Si prefixeu una opció amb [literal].!., l'opció s'eliminarà de la línia d'ordres del nucli final.

source: {productname} will manage the kernel options for both Profiles and Systems for you. As such you may only edit the kernel options for Distros.
ca: {productname} gestionarà les opcions del nucli tant per a Perfils com per a Sistemes. Com a tal, només podeu editar les opcions del nucli per a Distros.

source: Examples
ca: Exemples

source: Basic Inheritance Example
ca: Exemple bàsic d'herència

source: Distribution raw value
ca: Distribució basada en una imatge ISO

source: Profile raw value
ca: Valor del perfil en brut

source: console=tty1
ca: consola1tty1

source: System raw value
ca: Grups del sistema

source: console=ttyS0
ca: consola=ttyS0

source: *Resolved* value for a system inheriting this profile
ca: *Valor resolt* per a un sistema que hereta aquest perfil

source: Option Removal Example
ca: Exemple d'eliminació d'opcions

source: Operating System Installation
ca: Instal·lació del sistema operatiu
ja: オペレーティングシステムのインストール
ko: 운영 체제 설치
zh_cn: 操作系统安装

source: Generally, you register clients that are already running. You might have installed these machines manually just before registering them to {productname}, or they might be pre-existing systems that were installed before you added {productname} to your environment.
ca: Generalment, registreu clients que ja s'estan executant. És possible que hàgiu instal·lat aquestes màquines manualment just abans de registrar-les a {productname}, o que siguin sistemes preexistents que s'hagin instal·lat abans d'afegir {productname} al vostre entorn.
ja: 一般に、すでに動作しているクライアントを登録します。 {productname}に登録する直前にコンピュータに手動でインストールするか、環境に{productname}を追加する前にインストールされた既存のシステムを使用できます。
ko: 일반적으로 이미 실행 중인 클라이언트를 등록합니다. 이러한 시스템을 수동으로 설치한 직후 {productname}를 등록하거나 이미 설치된 기존 시스템의 환경에 {productname}를 추가할 수 있습니다.
zh_cn: 通常，您注册的是已经在运行的客户端。您可能是在将这些计算机注册到 {productname} 之前手动安装了它们，也可能它们是在您将 {productname} 添加到您的环境之前就已安装的现有系统。

source: Alternatively, you can use {productname} to help you install an operating system and register it to {productname} in one go. This method is partially or totally automated, so you can save time answering installer questions, and is especially useful if you have many clients you want to install and register.
ca: Alternativament, podeu utilitzar {productname} per ajudar-vos a instal·lar un sistema operatiu i registrar-lo a {productname} d'una sola vegada. Aquest mètode està parcialment o totalment automatitzat, de manera que podeu estalviar temps responent preguntes de l'instal·lador, i és especialment útil si teniu molts clients que voleu instal·lar i registrar.
ja: または、{productname}を使用して、1回の手順でオペレーティングシステムをインストールして{productname}に登録することもできます。 この方法では一部または全部が自動化されているため、インストーラの質問に答える時間を節約することができます。これは、特にインストールと登録が必要な多くのクライアントがある場合に役立ちます。
ko: 또는 {productname}를 사용하여 운영 체제를 설치한 후 한 번에 {productname}에 등록할 수 있습니다. 이 방법은 부분적으로 또는 전체적으로 자동화되어 있으므로, 설치 프로그램 질문에 답하는 시간을 절약할 수 있으며 설치 및 등록하려는 클라이언트가 많은 경우 특히 유용합니다.
zh_cn: 您也可以使用 {productname} 一次性完成安装操作系统和将其注册到 {productname} 的操作。此方法部分或完全自动化，因此可为您节省回答安装程序问题的时间，特别适合您有许多客户端需要安装和注册的情况。

source: There are several ways to install an operating system from {productname}:
ca: Hi ha diverses maneres d'instal·lar un sistema operatiu des de {productname}:
ja: {productname}からオペレーティングシステムをインストールするには次のような複数の方法があります。
ko: {productname}에서는 다음과 같이 여러 방법으로 운영 체제를 설치할 수 있습니다.
zh_cn: 可通过多种方法从 {productname} 安装操作系统：

source: in-place, on clients that are already registered;
ca: in-place, sobre clients que ja estan registrats;
ja: 登録済みのクライアントでインプレースインストールを行う
ko: 클라이언트가 이미 등록된 현재 위치에서 설치
zh_cn: 在已注册的客户端上就地安装；

source: over the network, using PXE boot;
ca: a través de la xarxa, utilitzant PXE boot;
ja: PXEブートを使用してネットワークを通じてインストールする
ko: PXE 부팅을 사용하여 네트워크에서 설치
zh_cn: 使用 PXE 引导通过网络安装；

source: preparing an installation CD-ROM or an USB key, and then going to the machine to boot on that medium;
ca: preparar un CD-ROM d'instal·lació o una clau USB, i després anar a la màquina a arrencar en aquest mitjà;
ja: インストール用CD-ROMまたはUSBメモリを作成し、そのメディアでコンピュータをブートする
ko: 설치 CD-ROM 또는 USB 키를 준비한 후 시스템으로 이동하여 해당 미디어를 부팅하여 설치
zh_cn: 准备安装 CD-ROM 或 USB 密钥，然后转到计算机在该媒体上进行引导；

source: as part of the {productname} {smr} solution.
ca: com a part de la solució {productname} {smr}.
ja: {productname} {smr}ソリューションの一部としてインストールする
ko: {productname} {smr} 솔루션의 일부로 설치.
zh_cn: 作为 {productname} {smr} 解决方案的一部分安装。

source: The in-place reinstallation method assumes that a previous operating system has already been installed on the client, and that the client has already been registered to {productname}.
ca: El mètode de reinstal·lació in-place assumeix que ja s'ha instal·lat un sistema operatiu anterior al client, i que el client ja s'ha registrat a {productname}.
ja: インプレースでの再インストール方法は、以前のオペレーティングシステムがクライアントにすでにインストールされており、クライアントが{productname}にすでに登録されていることを前提としています。
ko: 현재 위치 재설치 방법에서는 이전 운영 체제가 클라이언트에 이미 설치되어 있고 클라이언트가 이미 {productname}에 등록된 경우를 가정합니다.
zh_cn: 就地安装方法假设客户端上已经安装了以前的操作系统，并且客户端已注册到 {productname}。

source: For information about the in-place installation method, see xref:client-configuration:autoinst-reinstall.adoc[Reinstall Registered Systems].
ca: Per obtenir informació sobre el mètode d'instal·lació en el lloc, vegeu xref:client-configuration:autoinst-reinstall.adoc[Reinstall Registered Systems].
ja: インプレースインストール方法については、xref:client-configuration:autoinst-reinstall.adoc[登録済みシステムを再インストールする]を参照してください。
ko: 현재 위치 설치 방법은 xref:client-configuration:autoinst-reinstall.adoc[등록된 시스템 재설치]를 참조하십시오.
zh_cn: 有关就地安装方法的信息，请参见 xref:client-configuration:autoinst-reinstall.adoc[重新安装已注册系统]。

source: The network boot installation method works on unformatted machines. However, it can only be performed in certain network configurations:
ca: El mètode d'instal·lació d'arrencada de xarxa funciona en màquines sense format. No obstant això, només es pot realitzar en determinades configuracions de xarxa:
ja: ネットワークブートによるインストール方法は、フォーマットされていないコンピュータで動作します。 ただし、これは次のような特定のネットワーク構成のみで実行できます。
ko: 네트워크 부팅 설치 방법은 포맷되지 않은 시스템에서 작동합니다. 그러나 다음과 같은 특정 네트워크 구성에서만 수행될 수 있습니다.
zh_cn: 网络引导安装方法适用于未格式化的计算机。不过，该方法只能在特定网络配置中执行：

source: the {productname} Server, or one of its proxies, are on the same local network as the machine you want to install, or you have a DHCP relay that allows you to cross all routers in between;
ca: el servidor {productname}, o un dels seus servidors intermediaris, es troben a la mateixa xarxa local que la màquina que voleu instal·lar, o teniu un relé DHCP que us permet creuar tots els encaminadors entre;
ja: {productname}サーバまたはそのプロキシのいずれかが、インストール対象のコンピュータと同じローカルネットワーク上にあるか、経路にあるすべてのルータを中継できるDHCPリレーに対応している。
ko: {productname} 서버 또는 프록시 중 하나가 설치하는 시스템과 동일한 로컬 네트워크에 있거나 그 사이의 모든 라우터를 통과하는 DHCP 릴레이가 있는 경우
zh_cn: {productname} 服务器（或其代理之一）与您要安装的计算机位于同一本地网络中，或者您具有可用于跨越两者之间的所有路由器的 DHCP 中继；

source: you are able to set up a new DHCP server or to configure an existing one;
ca: podeu configurar un servidor DHCP nou o configurar-ne un d'existent;
ja: 新しいDHCPサーバをセットアップするか、既存のDHCPサーバを設定することができる。
ko: 새 DHCP 서버를 설정할 수 있거나 기존 DHCP 서버를 구성할 수 있는 경우
zh_cn: 您能够设置新的 DHCP 服务器或配置现有的 DHCP 服务器；

source: the client to install is able to boot with PXE, and you can configure it to do so.
ca: el client a instal·lar és capaç d'arrencar amb PXE, i podeu configurar-lo per fer-ho.
ja: インストール対象のクライアントがPXEブートに対応しており、PXEブートを実行するように設定することができる。
ko: 설치할 클라이언트가 PXE를 사용하여 부팅할 수 있거나 그렇게 구성할 수 있는 경우.
zh_cn: 要安装的客户端能够使用 PXE 引导，并且您可以如此配置它们。

source: The removable medium method allows you to bypass these network constraints. However, it assumes the machine is able to read CD-ROMs or USB keys, and boot from them. It also requires physical access to the client machine.
ca: El mètode de suport extraïble permet evitar aquestes restriccions de xarxa. Tanmateix, assumeix que la màquina és capaç de llegir CD-ROM o claus USB, i arrencar des d'elles. També requereix accés físic a la màquina client.
ja: リムーバブルメディアを使用する方法では、このようなネットワーク上の制約を受けません。 しかし、この方法はコンピュータがCD-ROMまたはUSBメモリを読み取ることができ、各メディアからブートできることを前提としています。 また、クライアントコンピュータに対する物理的なアクセスも必要です。
ko: 이동식 미디어 방법을 사용하면 이러한 네트워크 제약을 우회할 수 있습니다. 그러나 이 경우에는 시스템이 CD-ROM 또는 USB 키를 읽어 부팅할 수 있는 것으로 가정합니다. 또한 클라이언트 시스템에 물리적으로도 액세스할 수 있어야 합니다.
zh_cn: 可移动媒体方法可让您绕过这些网络约束。但是，该方法假设计算机能够读取 CD-ROM 或 USB 密钥，并从它们引导。它还需要对客户端计算机进行物理访问。

source: For information about the removable media method, see xref:client-configuration:autoinst-cdrom.adoc[Install via a CD-ROM or a USB key].
ca: Per obtenir informació sobre el mètode de suport extraïble, vegeu xref:client-configuration:autoinst-cdrom.adoc[Instal·lació mitjançant un CD-ROM o una clau USB].
ja: リムーバブルメディアを使用する方法については、xref:client-configuration:autoinst-cdrom.adoc[CD-ROMまたはUSBメモリを使用してインストールする]を参照してください。
ko: 이동식 미디어 방법은 xref:client-configuration:autoinst-cdrom.adoc[CD-ROM 또는 USB 키를 사용한 설치]를 참조하십시오.
zh_cn: 有关可移动媒体方法的信息，请参见 xref:client-configuration:autoinst-cdrom.adoc[通过 CD-ROM 或 USB 密钥安装]。

source: For information about the {productname} {smr} approach, see xref:retail:retail-overview.adoc[Retail Guide].
ca: Per obtenir informació sobre l'enfocament {productname} {smr}, vegeu xref:retail:retail-overview.adoc[Retail Guide].
ja: {productname} {smr}アプローチについては、xref:retail:retail-overview.adoc[リテールガイド]を参照してください。
ko: {productname} {smr} 방법은 xref:retail:retail-overview.adoc[리테일 가이드]를 참조하십시오.
zh_cn: 有关 {productname} {smr} 方法的信息，请参见 xref:retail :retail-overview.adoc[Retail 指南]。

source: For information about the {productname} {smr} approach, see xref:retail:uyuni-retail-overview.adoc[Retail Guide].
ca: Per obtenir informació sobre l'enfocament de {productname} {smr}, consulteu xref:retail:uyuni-retail-overview.adoc[Guia de venda].

source: Autoinstallation of {ubuntu} and {debian} clients is not supported. These operating systems must be installed manually.
ca: No s'admet l'autoinstal·lació dels clients {ubuntu} i {debian}. Aquests sistemes operatius s'han d'instal·lar manualment.
ja: {ubuntu}クライアントと{debian}クライアントの自動インストールはサポートされていません。 これらのオペレーティングシステムは、手動でインストールする必要があります。
ko: {ubuntu} 및 {debian} 클라이언트의 자동 설치는 지원되지 않습니다. 이러한 운영 체제는 수동으로 설치해야 합니다.
zh_cn: 不支持自动安装 {ubuntu} 和 {debian} 客户端。必须手动安装这些操作系统。

source: The autoinstallation features of {productname} are based on a software named {cobbler}. For more information about {cobbler}, see https://cobbler.readthedocs.io.
ca: Les funcions d'instal·lació automàtica de {productname} es basen en un programari anomenat {cobbler}. Per a més informació sobre {cobbler}, vegeu https://cobbler.readthedocs.io.
ko: {productname}의 자동 설치 기능은 {cobbler} 소프트웨어를 기반으로 합니다. {cobbler}에 대한 자세한 설명은 https://cobbler.readthedocs.io[]에서 확인할 수 있습니다.
zh_cn: {productname} 的自动安装功能基于名为 {cobbler} 的软件运行。有关 {cobbler} 的详细信息，请访问 https://cobbler.readthedocs.io[]。

source: {suse} only supports {cobbler} functions that are available in the {productname} {webui}, or through the {productname} API. The sole command-line command supported by Cobbler is [command]``buildiso``. Only supported features are documented here.
ca: {suse} només admet {cobbler} funcions que estan disponibles a {productname} {webui}, o a través de l'API {productname}. L'única ordre de línia d'ordres suportada per Cobbler és [command].buildiso.. Aquí només es documenten les característiques admeses.
ja: {suse}は、{productname} {webui}または{productname} APIで使用できる{cobbler}の機能のみをサポートしています。 Cobblerがサポートする唯一のコマンドラインコマンドは[command]``buildiso``です。 ここにはサポートされている機能のみが記載されています。
ko: {suse}는 {productname} {webui}에서 또는 {productname} API를 통해 사용할 수 있는 {cobbler} 함수만 지원합니다. Cobbler에서 지원하는 유일한 명령줄 명령은 [command]``buildiso``입니다. 여기에서는 지원되는 기능만 설명합니다.
zh_cn: {suse} 仅支持 {productname} {webui} 中或通过 {productname} API 提供的 {cobbler} 功能。Cobbler 支持的唯一一个命令行命令为 [command]``buildiso``。本文中所述的仅为支持的功能。

source: Use Your Own GPG Key
ca: Usa la vostra pròpia clau GPG
ja: 独自のGPGキーを使用する
ko: 자체 GPG 키 사용
zh_cn: 使用您自己的 GPG 密钥

source: If the repositories you are using for autoinstallation have unsigned metadata, you usually have to use the [option]``insecure=1`` kernel parameter as an option of the autoinstallable distribution, and use a [path]``spacewalk/sles_no_signature_checks`` code snippet in the {ay} installation file.
ca: Si els repositoris que esteu utilitzant per a l'autoinstal·lació tenen metadades sense signar, normalment haureu d'utilitzar el paràmetre [option].insecure11. del nucli com a opció de la distribució autoinstal·lable, i utilitzar un fragment de codi [path].spacewalk/slesnosignaturechecks. al fitxer d'instal·lació {ay}.
ja: 自動インストールのために使用しているリポジトリに署名されていないメタデータがある場合は、通常、自動インストールのディストリビューションのオプションとして[option]``insecure=1``カーネルパラメータを使用し、{ay}インストールファイルで[path]``spacewalk/sles_no_signature_checks``コードスニペットを使用する必要があります。
ko: 자동 설치에서 사용할 리포지토리에 서명되지 않은 메타데이터가 있는 경우 일반적으로 [option]``insecure=1`` 커널 파라미터를 자동 설치 가능한 배포판 옵션으로 사용하고 {ay} 설치 파일에서 [path]``spacewalk/sles_no_signature_checks`` 코드 조각을 사용해야 합니다.
zh_cn: 如果用于自动安装的储存库包含未签名的元数据，则您通常必须使用 [option]``insecure=1`` 内核参数作为可自动安装的发行套件的选项，并在 {ay} 安装文件中使用 [path]``spacewalk/sles_no_signature_checks`` 代码段。

source: A safer alternative is to provide your own GPG key.
ca: Una alternativa més segura és proporcionar la vostra pròpia clau GPG.
ja: より安全な代替方法は、独自のGPGキーを提供することです。
ko: 더 안전한 방법은 자체 GPG 키를 제공하는 것입니다.
zh_cn: 更为安全的替代方案是提供您自己的 GPG 密钥。

source: This technique applies to {suse} clients only.
ca: Aquesta tècnica s'aplica només a clients {suse}.
ja: この操作は、{suse}クライアントにのみ適用されます。
ko: 이 방법은 {suse} 클라이언트에만 해당합니다.
zh_cn: 此方法仅适用于 {suse} 客户端。

source: Procedure: Include Your Own GPG Key
ca: Usa la vostra pròpia clau GPG

source: Create a GPG key.
ca: Crea una clau GPG.
ja: GPGキーを作成します。
ko: GPG 키를 생성합니다.
zh_cn: 创建 GPG 密钥。

source: Use it to sign the package's metadata.
ca: Utilitzeu-lo per a signar les metadades del paquet.
ja: このキーを使用して、パッケージのメタデータに署名します。
ko: 이 키를 사용하여 패키지의 메타데이터에 서명합니다.
zh_cn: 使用它对软件包的元数据签名。

source: Add it to the initial RAM disk of your installation media.
ca: Afegiu-lo al disc RAM inicial del vostre mitjà d'instal·lació.
ja: インストールメディアの初期RAMディスクにこのキーを追加します。
ko: 설치 미디어의 초기 RAM 디스크에 추가합니다.
zh_cn: 将其添加到安装媒体的初始 RAM 磁盘中。

source: To copy GPG keys to the container use [command]``mgradm gpg add``. This command copies the GPG key and adds it to the customer keyring.
ca: Per a copiar les claus GPG al contenidor utilitzeu [ordre].mgradm gpg add.. Aquesta ordre copia la clau GPG i l'afegeix a l'anell de claus del client.

source: Run command [command]``mgradm restart``. This command creates a unique keyring using the SUSE and the customer keyring.
ca: Executeu l'ordre [ordre].mgradm reinicia.. Aquesta ordre crea un anell de claus únic utilitzant el SUSE i l'anell de claus del client.

source: When you signed the metadata with your new GPG key, any already onboarded client will not know about the new key. Ideally, you should sign the metadata before you register any client.
ca: Quan signeu les metadades amb la vostra nova clau GPG, qualsevol client que ja estigui a bord no sabrà res sobre la nova clau. L'ideal és que signis les metadades abans de registrar qualsevol client.
ja: 新しいGPGキーを使用してメタデータに署名した場合、オンボード済みのクライアントはこの新しいキーを認識しません。 クライアントを登録する前に、メタデータに署名することが理想的です。
ko: 새 GPG 키를 사용하여 메타데이터에 서명한 후에는 이미 온보딩된 클라이언트는 새 키에 대해 알 수 없습니다. 이상적으로는 메타데이터에 서명한 후 클라이언트를 등록해야 합니다.
zh_cn: 在您使用新 GPG 密钥对元数据签名时，任何已进行初始配置的客户端都不会知道这个新密钥。理想情况下，您应当在注册任何客户端之前对元数据签名。
