Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: For more information about migrating {centos} to {sll}, see xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[].
ca: Per obtenir més informació sobre les claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].
ja: {centos}から{sll}への移行の詳細については、xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[]を参照してください。
ko: {centos}에서 {sll}로 마이그레이션에 대한 자세한 내용은 xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[]에서 확인할 수 있습니다.
zh_cn: 有关将 {centos} 迁移到 {sll} 的详细信息，请参见 xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[]。

source: Debian Client Registration
ca: Registre del client de Debian
ja: Debianクライアントの登録
ko: Debian 클라이언트 등록
zh_cn: Debian 客户端注册

source: You can register {debian} clients to your {productname} Server. The method and details varies depending on the operating system of the client.
ca: Podeu registrar {debian} clients al vostre servidor {productname}. El mètode i els detalls varien en funció del sistema operatiu del client.
ja: {debian}クライアントを{productname}サーバに登録できます。 そのメソッドおよび詳細は、クライアントのオペレーティングシステムによって異なります。
ko: {debian} 클라이언트를 {productname} 서버에 등록할 수 있습니다. 방법과 상세 정보는 클라이언트의 운영 체제에 따라 달라집니다.
zh_cn: 您可以将 {debian} 客户端注册到 {productname} 服务器。方法和细节视客户端的操作系统而异。

source: Oracle Client Registration
ca: Registre del client Oracle
ja: Oracleクライアントの登録
ko: Oracle 클라이언트 등록
zh_cn: Oracle 客户端注册

source: You can register {oes} clients to your {productname} Server. The method and details varies depending on the operating system of the client.
ca: Podeu registrar {opensuse} clients al vostre servidor {productname}. El mètode i els detalls varien en funció del sistema operatiu del client.

source: {openeuler} Client Registration
ca: Registre de clients {openeuler}

source: In {productname}, the support for {openeuler} is available as Tech Preview.
ca: A {productname}, la compatibilitat amb {openeuler} està disponible com a vista prèvia tècnica.

source: You can register {openeuler} clients to your {productname} Server. The method and details varies depending on the operating system of the client.
ca: Podeu registrar {oracle} clients al vostre servidor {productname}. El mètode i els detalls varien en funció del sistema operatiu del client.

source: openSUSE Client Registration
ca: registre del client openSUSE
ja: openSUSEクライアントの登録
ko: openSUSE 클라이언트 등록
zh_cn: openSUSE 客户端注册

source: You can register {opensuse} and {leapmicro} clients to your {productname} Server. The method and details varies depending on the operating system of the client.
ca: Podeu registrar {oracle} clients al vostre servidor {productname}. El mètode i els detalls varien en funció del sistema operatiu del client.

source: Do not register a {productname} Server to itself. The {productname} Server must be managed individually or by using another separate {productname} Server. For more information about using multiple servers, see xref:specialized-guides:large-deployments/hub-multi-server.adoc[].
ca: No registris un servidor {productname}. El servidor {productname} s'ha de gestionar individualment o utilitzant un altre servidor {productname}. Per a més informació sobre l'ús de diversos servidors, vegeu xref:specialized-guides:large-deployments/hub-multi-server.adoc[].

source: You can register {oracle} clients to your {productname} Server. The method and details varies depending on the operating system of the client.
ca: Podeu registrar {oracle} clients al vostre servidor {productname}. El mètode i els detalls varien en funció del sistema operatiu del client.
ja: {oracle}クライアントを{productname}サーバに登録できます。 そのメソッドおよび詳細は、クライアントのオペレーティングシステムによって異なります。
ko: {oracle} 클라이언트를 {productname} 서버에 등록할 수 있습니다. 방법과 상세 정보는 클라이언트의 운영 체제에 따라 달라집니다.
zh_cn: 您可以将 {oracle} 客户端注册到 {productname} 服务器。方法和细节视客户端的操作系统而异。

source: For more information about migrating {oracle} to {sll}, see xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[].
ca: Per obtenir més informació sobre les claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].
ja: {oracle}から{sll}への移行の詳細については、xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[]を参照してください。
ko: {oracle}에서 {sll}로 마이그레이션에 대한 자세한 내용은 xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[]에서 확인할 수 있습니다.
zh_cn: 有关将 {oracle} 迁移到 {sll} 的详细信息，请参见 xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[]。

source: Raspberry Pi OS Client Registration
ca: Registre del client de CentOS

source: In {productname}, the support for {raspberrypios} is available as Tech Preview.
ca: A {productname}, la compatibilitat amb {raspberrypios} està disponible com a vista prèvia tècnica.

source: You can register {raspberrypios} clients to your {productname} Server. The method and details depend on the operating system of the client.
ca: Podeu registrar {rocky} clients al vostre servidor {productname}. El mètode i els detalls varien en funció del sistema operatiu del client.

source: Red Hat Client Registration
ca: Registre del client de Red Hat
ja: Red Hatクライアントの登録
ko: Red Hat 클라이언트 등록
zh_cn: Red Hat 客户端注册

source: You can register {rhel} clients to your {productname} Server using either the {redhat} content delivery network (CDN), or {redhat} update infrastructure (RHUI). The method and details varies depending on the operating system of the client.
ca: Podeu registrar {rhel} clients al vostre servidor {productname} utilitzant la xarxa de lliurament de continguts {redhat} (CDN), o la infraestructura d'actualització {redhat} (RHUI). El mètode i els detalls varien en funció del sistema operatiu del client.
ja: {redhat}コンテンツデリバリネットワーク(CDN)または{redhat}更新インフラストラクチャ(RHUI)を使用して{rhel}クライアントを{productname}サーバに登録できます。 そのメソッドおよび詳細は、クライアントのオペレーティングシステムによって異なります。
ko: {redhat} 컨텐트 제공 네트워크(CDN) 또는 {redhat} 업데이트 인프라(RHUI)를 사용해 {productname} 서버에 {rhel} 클라이언트를 등록할 수 있습니다. 방법과 상세 정보는 클라이언트의 운영 체제에 따라 달라집니다.
zh_cn: 您可以使用 {redhat} 内容分发网络 (CDN) 或 {redhat} 更新基础结构 (RHUI) 将 {rhel} 客户端注册到 {productname} 服务器。方法和细节视客户端的操作系统而异。

source: For more information about migrating {rhel} to {sll}, see xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[].
ca: Per obtenir més informació sobre les claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].
ja: {rhel}から{sll}への移行の詳細については、xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[]を参照してください。
ko: {rhel}에서 {sll}로 마이그레이션에 대한 자세한 내용은 xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[]에서 확인할 수 있습니다.
zh_cn: 有关将 {rhel} 迁移到 {sll} 的详细信息，请参见 xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[]。

source: {rocky} Client Registration
ca: Registre del client {rocky}
ja: {rocky}クライアントの登録
ko: {rocky} 클라이언트 등록
zh_cn: {rocky} 客户端注册

source: You can register {rocky} clients to your {productname} Server. The method and details vary depending on the operating system of the client.
ca: Podeu registrar {rocky} clients al vostre servidor {productname}. El mètode i els detalls varien en funció del sistema operatiu del client.
ja: {rocky}クライアントを{productname}サーバに登録できます。 そのメソッドおよび詳細は、クライアントのオペレーティングシステムによって異なります。
ko: {rocky} 클라이언트를 {productname} 서버에 등록할 수 있습니다. 방법과 상세 정보는 클라이언트의 운영 체제에 따라 다릅니다.
zh_cn: 您可以将 {rocky}} 客户端注册到 {productname} 服务器。方法和细节视客户端的操作系统而异。

source: For more information about migrating {rocky} to {sll}, see xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[].
ca: Per obtenir més informació sobre les claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].
ja: {rocky}から{sll}への移行の詳細については、xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[]を参照してください。
ko: {rocky}에서 {sll}로 마이그레이션에 대한 자세한 내용은 xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[]에서 확인할 수 있습니다.
zh_cn: 有关将 {rocky} 迁移到 {sll} 的详细信息，请参见 xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[]。

source: SUSE Client Registration
ca: Registre de client SUSE
ja: SUSEクライアントの登録
ko: SUSE 클라이언트 등록
zh_cn: SUSE 客户端注册

source: You can register {sle} and {sleses} clients to {productname} Server.
ca: Hi ha diverses maneres de registrar clients al vostre servidor {productname}.

source: You can register {sle} clients to {productname} Server.
ca: Hi ha diverses maneres de registrar clients al vostre servidor {productname}.

source: To register a new client to {productname} Server, first synchronize software channels for the new client's operating system and architecture by using either the {webui} or command line tools.
ca: Per registrar un client nou al servidor {productname}, primer sincronitzeu els canals de programari per al sistema operatiu i l'arquitectura del client nou utilitzant les eines {webui} o la línia d'ordres.

source: Then, synchronize the client tool repository for the newly added operating system by using command line tools.
ca: A continuació, sincronitzeu el repositori d'eines client per al sistema operatiu recentment afegit utilitzant eines de línia d'ordres.

source: The method and details varies depending on the client's operating system. This is described in the following sections.
ca: El mètode i els detalls varien en funció del sistema operatiu del client. Això es descriu en les següents seccions.

source: Preliminary Steps or Checks
ca: Passos o comprovacions preliminars

source: Check Previous Registration Status
ca: Comprova l'estat de la sincronització

source: If the client was registered to SCC, SMT, or RMT previously, remove such a registration with [command]``SUSEConnect`` before migrating the client to {productname} Server. Do not forget to remove the old registration first. Otherwise repositories that are no longer needed, will be added to the client after the client has been migrated to a newer version of a {suse} operating system with {productname}.
ca: Si el client s'ha registrat prèviament a SCC, SMT o RMT, suprimiu aquest registre amb [ordre].SUSEConnect. abans de migrar el client a {productname} Server. No us oblideu d'eliminar primer l'antic registre. En cas contrari, els repositoris que ja no siguin necessaris, s'afegiran al client després que el client hagi estat migrat a una versió més nova d'un sistema operatiu {suse} amb {productname}.

source: To de-register a {sle} 12 or 15 client, on the client, as root, execute:
ca: Per a cancel·lar la inscripció d'un client {sle} 12 o 15, al client, com a root, executeu:

source: For more information about detailed cleanup commands and verification steps, see https://www.suse.com/de-de/support/kb/doc/?id=000019054.
ca: Per a més informació sobre les ordres de neteja detallades i els passos de verificació, vegeu https://www.suse.com/de-de/support/kb/doc/?id,000019054.

source: Ubuntu Client Registration
ca: Registre de client d'Ubuntu
ja: Ubuntuクライアントの登録
ko: Ubuntu 클라이언트 등록
zh_cn: Ubuntu 客户端注册

source: You can register {ubuntu} clients to your {productname} Server. The method and details varies depending on the operating system of the client.
ca: Podeu registrar {ubuntu} clients al vostre servidor {productname}. El mètode i els detalls varien en funció del sistema operatiu del client.
ja: {ubuntu}クライアントを{productname}サーバに登録できます。 そのメソッドおよび詳細は、クライアントのオペレーティングシステムによって異なります。
ko: {ubuntu} 클라이언트를 {productname} 서버에 등록할 수 있습니다. 방법과 상세 정보는 클라이언트의 운영 체제에 따라 달라집니다.
zh_cn: 您可以将 {ubuntu} 客户端注册到 {productname} 服务器。方法和细节视客户端的操作系统而异。

source: Client Registration
ca: Registre del client
ja: クライアントの登録
ko: 클라이언트 등록
zh_cn: 客户端注册

source: There are several ways to register clients to your {productname} Server. This section covers the various available methods. It also contains information specific to the operating system you intend to run on the client.
ca: Hi ha diverses maneres de registrar clients al vostre servidor {productname}. Aquesta secció cobreix els diferents mètodes disponibles. També conté informació específica del sistema operatiu que es pretén executar al client.
ja: クライアントを{productname}サーバに登録する方法は複数あります。 このセクションでは、使用できるさまざまなメソッドについて説明します。 クライアントで実行するオペレーティングシステム固有の情報も含まれています。
ko: 클라이언트를 {productname} 서버에 등록하는 방법이 몇 가지 있습니다. 이 섹션에서는 사용할 수 있는 다양한 방법에 대해 설명합니다. 또한 클라이언트에서 실행하려는 운영 체제에 대한 정보도 포함되어 있습니다.
zh_cn: 有多种方法可将客户端注册到 {productname} 服务器。本章介绍了各种可用的方法。此外，还提供了特定于您要在客户端上运行的操作系统的信息。

source: Before you begin, check that:
ca: Abans de començar, comproveu que:
ja: 始める前に次の項目を確認してください。
ko: 시작하기 전에 다음 사항을 확인하십시오.
zh_cn: 开始前，请进行以下检查：

source: The client has the date and time synchronized correctly with the {productname} Server before registration.
ca: El client té la data i l'hora sincronitzades correctament amb el servidor {productname} abans del registre.
ja: クライアントで登録前に{productname}サーバと日時が正しく同期されている。
ko: 클라이언트는 등록 전에 날짜 및 시간을 {productname} 서버와 정확하게 동기화한 상태이어야 합니다.
zh_cn: 注册前客户端的日期和时间已与 {productname} 服务器正确同步。

source: You have created an activation key. For more information about creating activation keys, see xref:client-configuration:activation-keys.adoc[].
ca: Heu creat una clau d'activació. Per obtenir més informació sobre la creació de claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].
ja: アクティベーションキーを作成済みである。 アクティベーションキーの作成の詳細については、xref:client-configuration:activation-keys.adoc[]を参照してください。
ko: 활성화 키 생성을 완료한 상태이어야 합니다. 활성화 키 생성에 대한 자세한 내용은 xref:client-configuration:activation-keys.adoc[]를 참조하십시오.
zh_cn: 您已创建好激活密钥。有关创建激活密钥的详细信息，请参见 xref:client-configuration:activation-keys.adoc[]。

source: Once a client system has been bootstrapped, the **Installer Updates** channel should be removed. The standard update channel already includes the necessary updates, making this channel redundant.
ca: Un cop s'ha arrencat un sistema client, s'hauria d'eliminar el canal **Actualitzacions de l'Installer**. El canal d'actualització estàndard ja inclou les actualitzacions necessàries, fent que aquest canal sigui redundant.

source: Do not register the {productname} Server base OS to {productname} itself. The {productname} Server base OS must be managed individually or by using another separate {productname} Server.
ca: No registris el SO base del servidor {productname} a {productname}. El SO base del servidor {productname} s'ha de gestionar individualment o utilitzant un altre servidor {productname}.

source: To manage {productname} Server Containers, use the [literal]``mgradm`` tool.
ca: Per gestionar els contenidors de servidors {productname}, utilitzeu l'eina [literal].mgradm..

source: Register Clients With the {webui}
ca: Registra clients amb {webui}

source: Bootstrapping clients with the {webui} is using xref:specialized-guides:salt/salt-ssh.adoc[Salt SSH] to execute the bootstrap process on the client. Salt SSH uses the Salt Bundle with the Python interpreter included. Therefore, no other Python interpreter needs to be installed on the client.
ca: L'arrencada dels clients amb el {webui} està utilitzant xref:specialized-guides:salt/salt-ssh.adoc[Salt SSH] per executar el procés d'arrencada al client. Salt SSH utilitza el Salt Bundle amb l'intèrpret de Python inclòs. Per tant, no cal instal·lar cap altre intèrpret de Python al client.

source: Salt Bundle is made available together with the bootstrap repository. Therefore the bootstrap repository must be created before starting the bootstrap process for the client. A shell script detects the operating system on the client and deploys the Salt Bundle from the appropriate bootstrap repository, using the same logic as the bootstrap script.
ca: Com que Salt Bundle s'envia amb el repositori bootstrap, el repositori s'ha de crear abans d'iniciar el procés bootstrap per al client. Un shell script detecta el sistema operatiu en el client i desplega el Salt Bundle des del repositori bootstrap apropiat, utilitzant la mateixa lògica que el bootstrap script. Per a més informació, vegeu xref:client-configuration:bootstrap-repository.adoc].preparetocreateabootstraprepository[Prepare to Create a Bootstrap Repository].

source: For more information, see xref:client-configuration:bootstrap-repository.adoc#_prepare_to_create_a_bootstrap_repository[Prepare to Create a Bootstrap Repository].
ca: Per a més informació, vegeu xref:client-configuration:bootstrap-repository.adoc,preparetocreateabootstraprepository[Prepare to Create a Bootstrap Repository].

source: Procedure: Registering Clients With the {webui}
ca: Procediment: Registre de clients amb la {webui}

source: Select an [guimenu]``Authentication`` method:
ca: Seleccioneu un mètode [guimenu] anAutenticació an:

source: To bootstrap the client with an SSH key, in the [guimenu]``Authentication`` field, check [guimenu]``SSH Private Key``, and upload the SSH private key to use to log in to the client.
ca: Per arrencar el client amb SSH, al camp [guimenu].Autenticació., marqueu [guimenu].Clau privada SSH. i carregueu la clau privada SSH a utilitzar per iniciar sessió amb el client.

source: If your SSH private key requires a passphrase, type it into the [guimenu]``SSH Private Key Passphrase`` field, or leave it blank for no passphrase.
ca: Si la vostra clau privada SSH requereix una contrasenya, escriviu-la al camp [guimenu].SSH Contrasenya de clau privada Key, o deixeu-la en blanc per a no tenir contrasenya.
ko: SSH 개인 키에 암호문이 필요한 경우 [guimenu]``SSH 개인 키 암호문`` 필드에 입력하십시오. 또는 어떤 암호문에 대해서도 이 필드를 공백 상태로 두지 마십시오.
zh_cn: 如果您的 SSH 私用密钥需要通行口令，请在 [guimenu]``SSH 私用密钥通行口令``字段中键入通行口令。如果不需要，则将该字段留空。

source: To bootstrap the client with a password, in the [guimenu]``Authentication`` field, check [guimenu]``Password``, and type the password to log in to the client.
ca: Per arrencar el client amb una contrasenya, al camp [guimenu].Autenticació., marqueu [guimenu].Contrasenya`` i escriviu la contrasenya per iniciar sessió amb el client.
ja: パスワードでクライアントをブートストラップするには、［[guimenu]``認証``］フィールドで、［[guimenu]``パスワード``］にチェックを付け、クライアントへのログインに使用するパスワードを入力します。
ko: 비밀번호로 클라이언트를 부트스트래핑하려면 [guimenu]``인증`` 필드에서 [guimenu]``비밀번호``를 확인하고 비밀번호를 입력하여 클라이언트에 로그인하십시오.
zh_cn: 要使用口令引导客户端，请在[guimenu]``身份验证``字段中选中[guimenu]``口令``，并键入用于登录客户端的口令。

source: OPTIONAL: In the [guimenu]``Proxy`` field, select the proxy to register the client to.
ca: OPCIONAL: Al camp [guimenu].Proxy., seleccioneu el servidor intermediari on registrar el client.
ja: オプション: ［[guimenu]``プロキシ``］フィールドで、クライアントの登録先にするプロキシを選択します。
ko: 옵션: [guimenu]``프록시`` 필드에서 클라이언트를 등록할 프록시를 선택합니다.
zh_cn: 可选：在[guimenu]``代理``字段中，选择要将客户端注册到的代理。

source: If you check this option, the client is configured to use SSH for its connection to the server, and no other contact method is configured.
ca: Si marqueu aquesta opció, el client està configurat per utilitzar SSH per a la seva connexió al servidor, i no hi ha cap altre mètode de connexió configurat.

source: For more information about contact methods, see xref:client-configuration:contact-methods-intro.adoc[].
ca: Per a més informació sobre el fibrat de sal, vegeu xref:client-configuration:contact-methods-saltbundle.adoc[Salt Bundle].

source: SSH private keys are stored only for the duration of the bootstrapping process. They are deleted from the {productname} Server as soon as bootstrapping is complete.
ca: Les claus privades SSH només s'emmagatzemen durant la durada del procés d'arrencada. S'eliminen del servidor {productname} tan aviat com s'hagi completat l'arrencada.
ja: SSH秘密鍵は、ブートストラッププロセス中のみ保存されます。 秘密鍵は、ブートストラップが完了するとすぐに{productname}サーバから削除されます。
ko: SSH 개인 키는 부트스트래핑 프로세스가 진행되는 중에만 저장되며, 부트스트래핑이 완료되자마자 {productname} 서버에서 삭제됩니다.
zh_cn: SSH 私用密钥仅在引导过程期间存储，引导完成后，将会立即从 {productname} 服务器删除。

source: When new packages or updates are installed on the client using {productname}, any end user license agreements (EULAs) are automatically accepted. To review a package EULA, open the package details page in the {webui}.
ca: Quan s'instal·len nous paquets o actualitzacions al client utilitzant {productname}, s'accepten automàticament qualsevol acord de llicència d'usuari final (EULAs). Per revisar un paquet EULA, obriu la pàgina de detalls del paquet a la {webui}.
ja: {productname}を使用してクライアントに新しいパッケージまたは更新がインストールされると、エンドユーザライセンスアグリーメント(EULA)が自動的に受け入れられます。 パッケージのEULAを確認するには、{webui}でパッケージ詳細ページを開きます。
ko: {productname}를 사용해 클라이언트에 새 패키지 또는 업데이트를 설치하면 최종 사용자 라이선스 계약(EULA)이 자동으로 수락됩니다. 패키지 EULA를 검토하려면 {webui}에서 패키지 상세 정보 페이지를 여십시오.
zh_cn: 使用 {productname} 在客户端上安装新的软件包或更新时，会自动接受所有最终用户许可协议 (EULA)。 要查看软件包 EULA，请打开 {webui} 中的软件包细节页面。

source: Handling of Locally Assigned Repositories
ca: Gestió de repositoris assignats localment

source: Having repositories assigned directly to clients not served by {productname} is not a common use case. It can cause trouble. Therfore bootstrapping via Salt disables all local repositories at the beginning of the bootstrap process.
ca: Tenir repositoris assignats directament a clients no servits per {productname} no és un cas d'ús comú. Pot causar problemes. El bootstrapping via Salt desactiva tots els dipòsits locals al començament del procés d'arrencada.
ja: {productname}がサービスを提供しないクライアントにリポジトリを直接割り当てることは、一般的なユースケースではありません。 問題の原因になる可能性があります。 したがって、Saltを介してブートストラップすることで、ブートストラッププロセスの開始時にすべてのローカルリポジトリを無効にします。
ko: {productname}에서 제공하지 않는 클라이언트에 리포지토리를 직접 할당하는 것은 일반적인 사용 사례가 아닙니다. 이로 인해 문제가 발생할 수 있습니다. 그러므로 Salt를 통한 부트스트래핑은 부트스트랩 프로세스를 시작할 때 모든 로컬 리포지토리를 비활성화합니다.
zh_cn: 直接将储存库指派给客户端而不通过 {productname} 提供这种使用情形不常见。这样可能会导致出现问题。因此通过 Salt 引导会在引导过程开始时禁用所有本地储存库。

source: Later, during every use of the channel state, for example when executing a Highstate or a package installation, all locally assigned repositories are disabled again.
ca: Més tard, durant cada ús de l'estat del canal, per exemple quan s'executa una instal·lació d'alt estat o d'un paquet, tots els repositoris assignats localment es desactiven de nou.
ja: その後、Highstateやパッケージのインストールを実行するなど、チャンネルの状態を使用するたびに、ローカルに割り当てられたすべてのリポジトリが再び無効になります。
ko: 나중에 Highstate 또는 패키지 설치를 실행할 때처럼 채널 상태를 사용할 때마다 로컬에 할당된 모든 리포지토리가 다시 비활성화됩니다.
zh_cn: 以后在每次使用通道状态时（例如执行 Highstate 或软件包安装时），所有本地指派的储存库会再次禁用。

source: All software packages which are used on the clients should come from channels served by {productname}. For more information about creating a custom channel, see ``Custom Channels`` at xref:administration:custom-channels.adoc[].
ca: Tots els paquets de programari que s'utilitzen en els clients haurien de provenir de canals servits per {productname}. Per a més informació sobre la creació d'un canal personalitzat, vegeu ,Canals personalitzats, a xref:administration:custom-channels.adoc[].
ja: クライアントで使用されるすべてのソフトウェアパッケージは、{productname}がサービスを提供するチャンネルから取得される必要があります。 カスタムチャンネルの作成の詳細については、xref:administration:custom-channels.adoc[]の``カスタムチャンネル``を参照してください。
ko: 클라이언트에서 사용되는 모든 소프트웨어 패키지는 {productname}에서 제공하는 채널에서 가져와야 합니다. 사용자 정의 채널을 생성하는 방법에 대한 자세한 내용은 xref:administration:custom-channels.adoc[]에서 ``사용자 정의 채널``을 참조하십시오.
zh_cn: 客户端上使用的所有软件包均应来自 {productname} 提供的通道。有关如何创建自定义通道的详细信息，请参见 xref:administration:custom-channels.adoc[] 中的``自定义通道``。

source: Software Repositories
ca: Dipòsits de programari
ja: ソフトウェアリポジトリ
ko: 소프트웨어 리포지토리
zh_cn: 软件储存库
