Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: Repositories are used to collect software packages. When you have access to a software repository, you can install any of the software that the repository provides. You must have at least one repository associated with your software channels in {productname} to assign clients to the channel and install and update packages on the client.
ca: Els repositoris s'utilitzen per recollir paquets de programari. Quan teniu accés a un repositori de programari, podeu instal·lar qualsevol del programari que proporciona el repositori. Heu de tenir almenys un repositori associat als vostres canals de programari a {productname} per assignar clients al canal i instal·lar i actualitzar paquets al client.
ja: リポジトリはソフトウェアパッケージを収集するために使用されます。 ソフトウェアリポジトリにアクセスできる場合、リポジトリが提供するソフトウェアをインストールできます。 1つ以上のリポジトリを{productname}のソフトウェアチャンネルに関連付け、クライアントをそのチャンネルに割り当て、クライアントのパッケージにインストールして更新する必要があります。
ko: 리포지토리는 소프트웨어 패키지를 수집하는 데 사용됩니다. 소프트웨어 리포지토리에 액세스할 수 있으면 리포지토리가 제공하는 모든 소프트웨어를 설치할 수 있습니다. 클라이언트를 채널에 할당하고 클라이언트에서 패키지를 설치하고 업데이트하려면 {productname}에 소프트웨어 채널과 연결된 리포지토리가 최소 한 개 있어야 합니다.
zh_cn: 储存库用于收集软件包。如果您有权访问软件储存库，便可以安装储存库提供的任何软件。在 {productname} 中，必须至少有一个储存库与您的软件通道相关联，才能向该通道指派客户端并在客户端上安装和更新软件包。

source: Most default channels in {productname} are already associated with the correct repositories. If you are creating custom channels, you need to associate a repository that you have access to, or that you have created yourself.
ca: La majoria dels canals per defecte a {productname} ja estan associats amb els repositoris correctes. Si esteu creant canals personalitzats, heu d'associar un repositori al qual teniu accés o al qual heu creat vosaltres mateixos.
ja: {productname}のほとんどのデフォルトチャンネルは、正しいリポジトリに関連付けられています。 カスタムチャンネルを作成している場合、アクセスできるリポジトリまたは自分で作成したリポジトリを関連付ける必要があります。
ko: {productname}의 기본 채널은 대부분 이미 올바른 리포지토리에 연결되어 있습니다. 사용자 정의 채널을 생성하려면 액세스할 수 있는 또는 사용자가 직접 생성한 리포지토리를 연결해야 합니다.
zh_cn: {productname} 中的大多数默认通道都已与正确的储存库关联。如果您要创建自定义通道，则需要关联您有权访问的或您自己创建的储存库。

source: For more information about custom repositories and channels, see xref:administration:custom-channels.adoc[].
ca: Per obtenir més informació sobre els repositoris i canals personalitzats, vegeu xref:administration:custom-channels.adoc[].
ja: カスタムリポジトリおよびチャンネルの詳細については、xref:administration:custom-channels.adoc[]を参照してください。
ko: 사용자 정의 리포지토리에 대한 자세한 내용은 xref:administration:custom-channels.adoc[]에서 참조하십시오.
zh_cn: 有关自定义储存库和通道的详细信息，请参见 xref:administration:custom-channels.adoc[]。

source: Local Repository Locations
ca: Ubicacions del repositori local
ja: ローカルリポジトリの場所
ko: 로컬 리포지토리 위치
zh_cn: 本地储存库位置

source: You can configure local repositories on clients, to provide packages that are not supplied by {productname} channels.
ca: Podeu configurar els repositoris locals als clients, per proporcionar paquets que no siguin subministrats pels canals {productname}.

source: In most cases, client systems do not require local repositories. Local repositories can lead to problems knowing which packages are available on the client. This can lead to installing unexpected packages.
ca: En la majoria dels casos, els sistemes de clients no requereixen repositoris locals. Els repositoris locals poden provocar problemes per saber quins paquets estan disponibles al client. Això pot portar a la instal·lació de paquets inesperats.
ja: ほとんどの場合、クライアントシステムはローカルリポジトリを必要としません。 ローカルリポジトリを使用すると、クライアントで使用できるパッケージがどれかという問題が発生する可能性があります。 この問題が発生すると、予期しないパッケージがインストールされる場合があります。
ko: 대부분의 경우 클라이언트 시스템에는 로컬 리포지토리가 필요 없습니다. 로컬 리포지토리로 인해 클라이언트에서 어떤 패키지를 사용할 수 있는지 파악하는 데 문제가 생길 수 있습니다. 그러면 결국 예상치 않은 패키지를 설치하게 될 수 있습니다.
zh_cn: 大多数情况下，客户端系统不需要本地储存库。本地储存库可能会导致无法确定客户端上哪些软件包可用， 而这可能会导致安装非预期的软件包。

source: Local repositories are disabled during onboarding.
ca: Els repositoris locals estan desactivats durant l'onboarding.
ja: ローカルリポジトリは、オンボーディング中に無効になります。
ko: 온보딩 중에는 로컬 리포지토리가 비활성화됩니다.
zh_cn: 初始配置期间会禁用本地储存库。

source: Local repositories will be disabled each time a channel state is executed. For example, when applying the highstate or performing a package action.
ca: Els repositoris locals es desactivaran cada vegada que s'executi un estat del canal. Per exemple, quan s'aplica l'estat alt o es realitza una acció de paquet.

source: If local repositories should stay enabled after onboarding, the following pillar must be set for the affected client:
ca: Si els repositoris locals han de romandre habilitats després de l'onboarding, s'ha d'establir el següent pilar per al client afectat:

source: Edit the ``/srv/pillar/top.sls`` file:
ca: Edita el fitxer the/srv/pillar/top.sls the:
ja: ``/srv/pillar/top.sls``ファイルを編集します。
ko: ``/srv/pillar/top.sls`` 파일 편집:
zh_cn: 编辑 ``/srv/pillar/top.sls`` 文件：

source: Edit the ``/srv/pillar/localrepos.sls`` file:
ca: Edita el fitxer the/srv/pillar/localrepos.sls the:
ja: ``/srv/pillar/localrepos.sls``ファイルを編集します。
ko: ``/srv/pillar/localrepos.sls`` 파일 편집:
zh_cn: 编辑 ``/srv/pillar/localrepos.sls`` 文件：

source: mgr_disable_local_repos: False
ca: mgrdisablelocalrepos: Fals

source: After a client has completed onboarding, you can add local repositories to these locations:
ca: Després que un client hagi completat l'onboarding, podeu afegir repositoris locals a aquestes ubicacions:
ja: クライアントがオンボードを完了した後、ローカルリポジトリを次の場所に追加できます。
ko: 클라이언트가 온보딩을 완료하고 나면 다음 위치에 로컬 리포지토리를 추가할 수 있습니다.
zh_cn: 客户端完成初始配置后，您可以在以下位置添加本地储存库：

source: | Client Operating System | Local Repository Directory | {sles} | [path]``/etc/zypp/repos.d`` | {opensuse} | [path]``/etc/zypp/repos.d`` | {sles} {es} | [path]``/etc/yum.repos.d/`` | {rhel} and similar derivatives | [path]``/etc/yum.repos.d/`` | {ubuntu} | [path]``/etc/apt/sources.list.d/`` | {debian} | [path]``/etc/apt/sources.list.d/``
ca: | Sistema operatiu del client | Directori de dipòsits locals | {sles} | [path]``/etc/zypp/repos.d`` | {opensuse} | [path]``/etc/zypp/repos.d`` | {sles} {es} | [path]``/etc/yum.repos.d/`` | {rhel} and similar derivatives | [path]``/etc/yum.repos.d/`` | {ubuntu} | [path]``/etc/apt/sources.list.d/`` | {debian} | [path]``/etc/apt/sources.list.d/``

source: | {sles} | [path]``/etc/zypp/repos.d`` | {opensuse} | [path]``/etc/zypp/repos.d`` | {rhel} and similar derivatives | [path]``/etc/yum.repos.d/`` | {ubuntu} | [path]``/etc/apt/sources.list.d/`` | {debian} | [path]``/etc/apt/sources.list.d/``
ca: | {sles} | [camí]``/etc/zypp/repos.d`` | {opensuse} | [camí]``/etc/zypp/repos.d`` | {rhel} i derivats similars | [camí]``/etc/yum.repos.d/`` | {ubuntu} | [camí]``/etc/apt/sources.list.d/`` | {debian} | [camí]``/etc/apt/sources.list.d/``

source: Supported {alibabaclo} Features
ca: Funcionalitats de {alibabaclo} suportades
ja: サポートされている{alibabaclo}の機能
ko: 지원하는 {alibabaclo} 기능
zh_cn: 支持的 {alibabaclo} 功能

source: This table lists the availability of various features on {alibabaclo} clients.
ca: Aquesta taula llista la disponibilitat de diverses característiques en {alibabaclo} clients.
ja: この表には、{alibabaclo}クライアントのさまざまな機能の使用可否がリストされています。
ko: 아래 표는 {alibabaclo} 클라이언트에서 다양한 기능의 사용 가능 여부를 정리한 것입니다.
zh_cn: 下表列出了 {alibabaclo} 客户端上各种功能的可用性。

source: The operating system you run on a client is supported by the organization that supplies the operating system. {alibabaclo} is supported by Alibaba Cloud.
ca: El sistema operatiu que executeu en un client és compatible amb l'organització que subministra el sistema operatiu. {alibabaclo} és compatible amb Alibaba Cloud.
ja: クライアントで実行しているオペレーティングシステムは、オペレーティングシステムを提供している組織によってサポートされています。 {alibabaclo}はAlibaba Cloudでサポートされています。
ko: 클라이언트에서 실행하는 운영 체제는 운영 체제를 제공하는 조직이 지원합니다. {alibabaclo}는 Alibaba Cloud에서 지원됩니다.
zh_cn: 客户端上运行的操作系统由提供操作系统的组织支持。{alibabaclo} 由 Alibaba Cloud 支持。

source: The icons in this table indicate:
ca: Les icones d'aquesta taula indiquen:
ja: この表のアイコンの意味は次のとおりです。
ko: 이 표의 아이콘에는 다음과 같은 의미가 있습니다.
zh_cn: 此表中图标的含意如下：

source: {check} the feature is available
ca: {cross} la característica no està disponible

source: {cross} the feature is not available
ca: {cross} la característica no està disponible
ja: {cross}: 機能は使用できません
ko: {cross} 이 기능을 사용할 수 없습니다.
zh_cn: {cross} 该功能不可用

source: {question} the feature is under consideration, and may or may not be made available at a later date
ca: {question} la característica està en consideració i pot estar disponible o no en una data posterior
ja: {question}: 機能は検討中であり、後日使用できる場合と、使用できない場合があります
ko: {question} 이 기능은 현재 고려 중이며, 이후에 사용할 수도 있고 사용하지 못할 수도 있습니다.
zh_cn: {question} 该功能正在考虑之中，日后可能提供，也可能不提供

source: Supported Features on {alibabaclo} Operating Systems
ca: Característiques suportades en {alibabaclo} Sistemes operatius
ja: {alibabaclo}オペレーティングシステムでサポートされている機能
ko: {alibabaclo} 운영 체제에서 지원하는 기능
zh_cn: {alibabaclo} 操作系统上支持的功能

source: | Feature | {alibabaclo}{nbsp}2 | Client | {check} | Operating system packages | {check} | Registration | {check} | Install packages | {check} | Apply patches (requires CVE ID) | {check} | Remote commands | {check} | System package states | {check} | System custom states | {check} | Group custom states | {check} | Organization custom states | {check} | System set manager (SSM) | {check} | Product migration | N/A | Basic Virtual Guest Management {star} | {question} | Advanced Virtual Guest Management {star} | {question} | Virtual Guest Installation (Kickstart), as Host OS | {cross} | Virtual Guest Installation (image template), as Host OS | {question} | System deployment (PXE/Kickstart) | {question} | System redeployment (Kickstart) | {question} | Contact methods | {check} ZeroMQ, Salt-SSH | Works with {productname} Proxy | {check} | Action chains | {check} | Staging (pre-download of packages) | {check} | Duplicate package reporting | {check} | CVE auditing (requires CVE ID) | {check} | SCAP auditing | {check} | Package verification | {cross} | Package locking | {cross} | System locking | {cross} | Maintenance Windows | {check} | System snapshot | {cross} | Configuration file management | {check} | Snapshots and profiles | {check} Profiles supported, Sync not supported | Power management | {question} | Monitoring server | {cross} | Monitored clients | {check} | Docker buildhost | {check} | Build Docker image with OS | {check} | Kiwi buildhost | {check} | Build Kiwi image with OS | {check} | Recurring Actions | {check} | AppStreams | N/A | Yomi | N/A
ca: Fe Característica {alibabaclo}{nbsp}2 Client {check} Paquets de sistema operatiu {check} Inscripció {check} Instal·la paquets {check} ) Aplica els pedaços (requereix l'ID CVE) {check} s Ordres remotes {check} Estats del paquet del sistema {check} Estats personalitzats del sistema {check} Agrupa estats personalitzats {check} Organització d'estats personalitzats {check} ) Gestor de conjunts de sistemes (SSM) {check} Migració de producte N/A Gestió bàsica de convidats virtual {star} {question} Gestió de convidats virtual avançada {star} {question} ), Instal·lació de convidat virtual (Kickstart), com a servidor {cross} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {question} ) Desplegament del sistema (PXE/Kickstart) {question} ) Redesplegament del sistema (Kickstart) {question} Mètodes de contacte , {check} ZeroMQ, Salt-SSH with Funciona amb el servidor intermediari {productname} {check} Cadenes d'acció {check} ) Estadificació (pre-descàrrega de paquets) {check} Informe de paquets duplicat {check} audit auditoria CVE (requereix l'ID CVE) {check} ing Auditoria SCAP {check} Verificació de paquets {cross} ing Bloqueig de paquets {cross} ing Bloqueig del sistema {cross} Finestres de manteniment {check} Instantània del sistema {cross} Gestió de fitxers de configuració {check} and Instantànies i perfils , {check} Perfils admesos, la sincronització no és compatible Gestió d'energia {question} Servidor de seguiment {cross} Clients monitoritzats {check} Constructor Docker {check} Construeix la imatge Docker amb el SO {check} Constructor de Kiwi {check} Construeix la imatge de Kiwi amb el SO {check} s Accions recurrents {check} s AppStreams N/A Yomi N/A

source: {star} Virtual Guest Management:
ca: {star} Gestió virtual de convidats:
ja: {star}仮想ゲスト管理:
ko: {star} 가상 게스트 관리:
zh_cn: {star} 虚拟 Guest 管理：

source: In this table, virtual guest management is split into basic and advanced.
ca: En aquesta taula, la gestió virtual de convidats es divideix en bàsica i avançada.
ja: この表では、仮想ゲスト管理は基本と高度に分割されています。
ko: 이 표에서 가상 게스트 관리는 기본과 고급으로 구분되어 있습니다.
zh_cn: 在此表格中，虚拟 Guest 管理分为基本管理和高级管理。

source: Basic virtual guest management includes listing VMs, slow refresh, VM lifecycle actions (start, stop, resume, pause), and modifying VM vCPU and Memory.
ca: La gestió bàsica de convidats virtuals inclou la llista de VM, l'actualització lenta, les accions de cicle de vida de VM (inici, parada, represa, pausa), i la modificació de VM vCPU i Memòria.
ja: 基本的な仮想ゲスト管理には、VMのリスト化、低速更新、VMのライフサイクルアクション(起動、停止、再開、一時停止)、およびVM vCPUとメモリの変更が含まれています。
ko: 기본 가상 게스트 관리에는 VM, 느린 새로 고침, VM 라이프싸이클 작업(시작, 중지, 다시 시작, 일시 중지) 나열과 VM vCPU 및 메모리 수정이 포함됩니다.
zh_cn: 基本虚拟 Guest 管理包括列出 VM、慢速刷新、VM 生命周期操作（开始、停止、继续、暂停）以及修改 VM vCPU 和内存。

source: Advanced virtual guest management includes all features of Basic virtual guest management plus fast refresh, VM lifecycle actions (delete, reset, power off), modifying VM disk, network, graphical display, and graphical display configuration.
ca: La gestió avançada de convidats virtuals inclou totes les característiques de la gestió bàsica de convidats virtuals més actualització ràpida, accions de cicle de vida VM (suprimir, reiniciar, apagar), modificació del disc VM, xarxa, visualització gràfica i configuració de visualització gràfica.
ja: 高度な仮想ゲスト管理には、基本的な仮想ゲスト管理のすべての機能に加えて、高速更新、VMライフサイクルアクション(削除、リセット、電源オフ)、VMディスクの変更、ネットワークグラフィカル表示の変更、およびグラフィカル表示の設定が含まれています。
ko: 고급 가상 게스트 관리에는 기본 가상 게스트 관리의 모든 기능과 함께 빠른 새로 고침, VM 라이프싸이클 작업(삭제, 재설정, 전원 끄기), VM 디스크, 네트워크, 그래픽 표시 및 그래픽 표시 구성 수정이 포함됩니다.
zh_cn: 高级虚拟 Guest 管理包括基本虚拟 Guest 管理的所有功能以及快速刷新、VM 生命周期操作（删除、重置、关机）、修改 VM 磁盘、网络、图形显示和图形显示配置。

source: Supported {almalinux} Features
ca: Funcionalitats de {almalinux} suportades
ja: サポートされている{almalinux}の機能
ko: 지원하는 {almalinux} 기능
zh_cn: 支持的 {almalinux} 功能

source: This table lists the availability of various features on {almalinux} clients.
ca: Aquesta taula llista la disponibilitat de diverses característiques en {almalinux} clients.
ja: この表には、{almalinux}クライアントのさまざまな機能の使用可否がリストされています。
ko: 아래 표는 {almalinux} 클라이언트에서 다양한 기능의 사용 가능 여부를 정리한 것입니다.
zh_cn: 下表列出了 {almalinux} 客户端上各种功能的可用性。

source: The operating system you run on a client is supported by the organization that supplies the operating system. {almalinux} is supported by the {almalinux} community.
ca: El sistema operatiu que executeu en un client és compatible amb l'organització que subministra el sistema operatiu. {almalinux} és compatible amb la comunitat {almalinux}.
ja: クライアントで実行しているオペレーティングシステムは、オペレーティングシステムを提供している組織によってサポートされています。 {almalinux}は{almalinux}コミュニティでサポートされています。
ko: 클라이언트에서 실행하는 운영 체제는 운영 체제를 제공하는 조직이 지원합니다. {almalinux}는 {almalinux} 커뮤니티에서 지원됩니다.
zh_cn: 客户端上运行的操作系统由提供操作系统的组织支持。{almalinux} 由 {almalinux} 社区支持。

source: Supported Features on {almalinux} Operating Systems
ca: Característiques suportades en {almalinux} Sistemes operatius
ja: {almalinux}オペレーティングシステムでサポートされている機能
ko: {almalinux} 운영 체제에서 지원하는 기능
zh_cn: {almalinux} 操作系统上支持的功能

source: | Feature | {almalinux}{nbsp}9 | {almalinux}{nbsp}8 | Client | {check} (plain {almalinux}) | {check} (plain {almalinux}) | System packages | {almalinux} Community | {almalinux} Community | Registration | {check} | {check} | Install packages | {check} | {check} | Apply patches | {check} | {check} | Remote commands | {check} | {check} | System package states | {check} | {check} | System custom states | {check} | {check} | Group custom states | {check} | {check} | Organization custom states | {check} | {check} | System set manager (SSM) | {check} | {check} | Product migration {star} | {check} | {check} | Basic Virtual Guest Management {star}{star} | {check} | {check} | Advanced Virtual Guest Management {star}{star} | {check} | {check} | Virtual Guest Installation (Kickstart), as Host OS | {cross} | {cross} | Virtual Guest Installation (image template), as Host OS | {check} | {check} | System deployment (PXE/Kickstart) | {check} | {check} | System redeployment (Kickstart) | {check} | {check} | Contact methods | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | Works with {productname} Proxy | {check} | {check} | Action chains | {check} | {check} | Staging (pre-download of packages) | {check} | {check} | Duplicate package reporting | {check} | {check} | CVE auditing | {check} | {check} | SCAP auditing | {check} | {check} | Package verification | {cross} | {cross} | Package locking | {cross} | {cross} | System locking | {cross} | {cross} | Maintenance Windows | {check} | {check} | System snapshot | {cross} | {cross} | Configuration file management | {check} | {check} | Snapshots and profiles | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | Power management | {check} | {check} | Monitoring server | {cross} | {cross} | Monitored clients | {check} | {check} | Docker buildhost | {cross} | {cross} | Build Docker image with OS | {cross} | {cross} | Kiwi buildhost | {cross} | {cross} | Build Kiwi image with OS | {cross} | {cross} | Recurring Actions | {check} | {check} | AppStreams | {check} | {check} | Yomi | N/A | N/A
ca: Fe Característica {almalinux}{nbsp}9 {almalinux}{nbsp}8 Client ) {check} (pla {almalinux}) ) {check} (pla {almalinux}) Paquets del sistema {almalinux} Comunitat {almalinux} Comunitat Inscripció {check} {check} Instal·la paquets {check} {check} es Aplica els pedaços {check} {check} s Ordres remotes {check} {check} Estats del paquet del sistema {check} {check} Estats personalitzats del sistema {check} {check} Agrupa estats personalitzats {check} {check} Organització d'estats personalitzats {check} {check} ) Gestor de conjunts de sistemes (SSM) {check} {check} Migració de producte {star} {check} {check} Gestió bàsica de convidats virtual {star}{star} {check} {check} Gestió de convidats virtual avançada {star}{star} {check} {check} ), Instal·lació de convidat virtual (Kickstart), com a servidor {cross} {cross} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {check} {check} ) Desplegament del sistema (PXE/Kickstart) {check} {check} ) Redesplegament del sistema (Kickstart) {check} {check} Mètodes de contacte , {check} ZeroMQ, Salt-SSH , {check} ZeroMQ, Salt-SSH with Funciona amb el servidor intermediari {productname} {check} {check} Cadenes d'acció {check} {check} ) Estadificació (pre-descàrrega de paquets) {check} {check} Informe de paquets duplicat {check} {check} ing Auditoria CVE {check} {check} ing Auditoria SCAP {check} {check} Verificació de paquets {cross} {cross} ing Bloqueig de paquets {cross} {cross} ing Bloqueig del sistema {cross} {cross} Finestres de manteniment {check} {check} Instantània del sistema {cross} {cross} Gestió de fitxers de configuració {check} {check} and Instantànies i perfils , {check} Perfils admesos, la sincronització no és compatible , {check} Perfils admesos, la sincronització no és compatible Gestió d'energia {check} {check} Servidor de seguiment {cross} {cross} Clients monitoritzats {check} {check} Constructor Docker {cross} {cross} Construeix la imatge Docker amb el SO {cross} {cross} Constructor de Kiwi {cross} {cross} Construeix la imatge de Kiwi amb el SO {cross} {cross} s Accions recurrents {check} {check} s AppStreams {check} {check} Yomi N/A N/A

source: {star} to matching {sll}
ca: {star} per coincidir amb {sll}

source: {star}{star} Virtual Guest Management:
ca: {star} Gestió virtual de convidats:

source: Supported {amazon} Features
ca: Característiques de {amazon} suportades
ja: サポートされている{amazon}の機能
ko: 지원되는 {amazon} 기능
zh_cn: 支持的 {amazon} 功能

source: This table lists the availability of various features on {amazon} clients.
ca: Aquesta taula llista la disponibilitat de diverses característiques en {amazon} clients.
ja: この表には、{amazon}クライアントのさまざまな機能の使用可否がリストされています。
ko: 아래 표는 {amazon} 클라이언트에서 다양한 기능의 사용 가능 여부를 정리한 것입니다.
zh_cn: 下表列出了 {amazon} 客户端上各种功能的可用性。

source: The operating system you run on a client is supported by the organization that supplies the operating system. {amazon} is supported by Amazon.
ca: El sistema operatiu que executeu en un client és compatible amb l'organització que subministra el sistema operatiu. L'Amazon admet {amazon}.
ja: クライアントで実行しているオペレーティングシステムは、オペレーティングシステムを提供している組織によってサポートされています。 {amazon}はAmazonでサポートされています。
ko: 클라이언트에서 실행하는 운영 체제는 운영 체제를 제공하는 조직이 지원합니다. {amazon}은 Amazon에서 지원됩니다.
zh_cn: 客户端上运行的操作系统由提供操作系统的组织支持。{amazon} 由 Amazon 支持。

source: Supported Features on {amazon} Operating Systems
ca: Funcionalitats suportades en sistemes operatius {amazon}
ja: {amazon}オペレーティングシステムでサポートされている機能
ko: {amazon} 운영 체제에서 지원하는 기능
zh_cn: {amazon} 操作系统上支持的功能
