Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: In the {productname} {webui}, navigate to menu:Systems[System List] and check each client to add, this adds the clients to the system set manager.
ca: A {productname} {webui}, navegueu al menú:Systems[Llista de sistemes] i comproveu cada client per afegir, això afegeix els clients al gestor de conjunts del sistema.
ja: {productname}の{webui}で、menu:システム[システム一覧]に移動し、追加するそれぞれのクライアントを確認します。クライアントがシステムセットマネージャに追加されます。
ko: {productname} {webui}에서 menu:시스템[시스템 목록]으로 이동하여 추가할 각 클라이언트의 확인란을 선택하면 클라이언트가 시스템 세트 관리자에 추가됩니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[系统列表]，然后选中要添加的每个客户端，这会将这些客户端添加到系统集管理器中。

source: Navigate to menu:Systems[System Set Manager], and go to the [guimenu]``Groups`` tab.
ca: Navega al menú:Sistemes[Gestor de conjunts del sistema], i ves a la pestanya [guimenu].Grups..
ja: menu:システム[システムセットマネージャ]に移動し、［[guimenu]``グループ``］タブに移動します。
ko: menu:시스템[시스템 세트 관리자]로 이동한 후 [guimenu]``그룹`` 탭으로 이동합니다.
zh_cn: 导航到menu:系统[系统集管理器]，然后转到[guimenu]``组``选项卡。

source: Locate the group to join and check [guimenu]``Add``.
ca: Localitzeu el grup per a unir-vos i marqueu [guimenu].Afegeix..
ja: 参加するグループを見つけ、［[guimenu]``追加``］にチェックを付けます。
ko: 조인할 그룹을 찾아 [guimenu]``추가``의 확인란을 선택합니다.
zh_cn: 找到要加入的组并选中[guimenu]``添加``。

source: Click btn:[Alter Membership].
ca: Feu clic a btn:[Alterar la pertinença].
ja: btn:[メンバーの変更]をクリックします。
ko: btn:[멤버쉽 변경]을 클릭합니다.
zh_cn: 单击 btn:[更改成员资格]。

source: Click btn:[Confirm] to join the clients to the selected group.
ca: Feu clic a btn:[Confirm] per unir-vos als clients al grup seleccionat.
ja: btn:[確認]をクリックして、選択したグループにクライアントを追加します。
ko: btn:[확인]을 클릭하여 선택한 그룹에 클라이언트를 조인합니다.
zh_cn: 单击 btn:[确认] 将客户端加入所选的组。

source: For more information about the system set manager, see xref:client-configuration:system-set-manager.adoc[].
ca: Per obtenir més informació sobre el gestor de conjunts de sistemes, vegeu xref:client-configuration:system-set-manager.adoc[].
ja: システムセットマネージャの詳細については、xref:client-configuration:system-set-manager.adoc[]を参照してください。
ko: 시스템 세트 관리자에 대한 자세한 내용은 xref:client-configuration:system-set-manager.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关系统集管理器的详细信息，请参见 xref:client-configuration:system-set-manager.adoc[]。

source: You can see which clients are in a group by navigating to menu:Systems[System Groups], clicking the name of the group, and navigating to the [guimenu]``Systems`` tab.
ca: A {productname} {webui}, navegueu al menú:Systems[Llista de sistemes], feu clic al nom de l'amfitrió de virtualització i navegueu a la pestanya [guimenu].Virtualització..

source: Work with Groups
ca: Treballa amb grups
ja: グループの操作
ko: 그룹 작업
zh_cn: 使用组

source: When you have your clients arranged into groups, you can use your groups to manage updates.
ca: Quan tinguis els teus clients disposats en grups, pots utilitzar els teus grups per gestionar les actualitzacions.

source: In the {productname} {webui}, navigate to menu:Systems[System Groups]. The list shows an icon if there are updates available for any of the clients in the group. The list shows a question mark icon if checking the update status is disabled for any of the clients in the group. Click the icon to see more information about the updates available and to apply them to the clients.
ca: En el {productname} {webui}, navegueu al menú:Systems[Grups de sistemes]. La llista mostra una icona si hi ha actualitzacions disponibles per a qualsevol dels clients del grup. La llista mostra una icona de signe d'interrogació si la comprovació de l'estat d'actualització està desactivada per a qualsevol dels clients del grup. Feu clic a la icona per veure més informació sobre les actualitzacions disponibles i per aplicar-les als clients.
ja: {productname}の{webui}で、menu:システム[システムグループ]に移動します。 グループ内のいずれかのクライアントに適用できる更新がある場合、リストにアイコンが表示されます。 グループ内のいずれかのクライアントで更新ステータスの確認が無効になっている場合、リストには疑問符アイコンが表示されます。 アイコンをクリックすると、適用できる更新に関する詳細情報が表示され、クライアントに適用されます。
ko: {productname} {webui}에서 menu:시스템[시스템 그룹]으로 이동합니다. 그룹 내 클라이언트 중 어느 하나에 대해서라도 사용할 수 있는 업데이트가 있는 경우 목록에 아이콘이 표시됩니다. 사용 가능한 업데이트에 대한 자세한 정보를 확인하고 업데이트를 클라이언트에 적용하려면 아이콘을 클릭합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[系统组]。如果组中的任何客户端有可用更新，列表会显示相应图标。如果组中有任何客户端的检查更新状态功能被禁用，列表会显示问号。单击图标可查看有关可用更新的详细信息，并向客户端应用更新。

source: You can also work with more than one group at a time. Select the groups you want to work with, and click btn:[Work with union] to select every client in every selected group.
ca: També es pot treballar amb més d'un grup a la vegada. Seleccioneu els grups amb els quals voleu treballar i feu clic a btn:[Treballa amb la unió] per a seleccionar cada client de cada grup seleccionat.
ja: 同時に複数のグループを操作することも可能です。 操作するグループを選択し、btn:[ユニオンで作業する]をクリックし、すべての選択グループですべてのクライアントを選択します。
ko: 한 번에 두 개 이상의 그룹으로 작업할 수도 있습니다. 작업할 그룹을 선택하고 btn:[합집합 작업]을 클릭하여 선택한 각 그룹에서 각 클라이언트를 선택합니다.
zh_cn: 您也可以同时使用多个组。选择要使用的多个组，然后单击 btn:[使用并集] 以选择每个选定组中的每个客户端。

source: Alternatively, you can work on intersections of groups. Select two or more groups, and click btn:[Work with intersection] to select only those clients that exist in all the selected groups. For example, you might have one group for all clients with web server software, and another group for all SLES clients. The intersection of these groups would be all SLES clients with web server software.
ca: Alternativament, es pot treballar en interseccions de grups. Seleccioneu dos o més grups, i feu clic a btn:[Treballa amb la intersecció] per seleccionar només aquells clients que existeixen en tots els grups seleccionats. Per exemple, és possible que tingueu un grup per a tots els clients amb programari de servidor web, i un altre grup per a tots els clients SLES. La intersecció d'aquests grups serien tots els clients de SLES amb programari de servidor web.

source: System Locking
ca: Bloqueig del sistema
ja: システムのロック
ko: 시스템 잠금
zh_cn: 系统锁定

source: System locks are used to prevent actions from occurring on a client. For example, a system lock prevents a client from being updated or restarted. This is useful for clients running production software, or to prevent accidental changes. You can disable the system lock when you are ready to perform actions.
ca: Els bloqueigs del sistema s'utilitzen per evitar que es produeixin accions en un client. Per exemple, un bloqueig del sistema impedeix que un client s'actualitzi o es reiniciï. Això és útil per als clients que executen programari de producció, o per evitar canvis accidentals. Podeu desactivar el bloqueig del sistema quan estigueu preparat per a realitzar accions.
ja: システムのロックは、クライアントでアクションが発生しないようにするために使用されます。 たとえば、システムのロックは、クライアントの更新または再起動が行われないようにします。 これは、運用ソフトウェアを実行しているクライアントに対して、または不注意による変更が行われないようにするために役に立ちます。 アクションを実行する準備ができたときにシステムのロックを無効にできます。
ko: 시스템 잠금은 클라이언트에서 작업이 이루어지지 못하게 하는 데 사용됩니다. 예를 들어 시스템 잠금은 클라이언트가 업데이트되거나 다시 시작되지 못하게 합니다. 이 기능은 프로덕션 소프트웨어를 실행하는 클라이언트나 실수로 인한 변경 방지에 유용합니다. 작업을 수행할 준비가 되었으면 시스템 잠금을 비활성화할 수 있습니다.
zh_cn: 系统锁用于防止对客户端执行某些操作。例如，系统锁可防止更新或重启动客户端。此功能对于运行生产软件的客户端或想要阻止意外更改时很有用。您可以在准备好执行操作时禁用系统锁。

source: System Locks on Clients
ca: Bloqueig del sistema

source: When a client is locked, or put into blackout mode, no actions can be scheduled, execution commands are disabled, and a yellow banner is displayed on the [guimenu]``System Details`` page. In this mode, actions can be scheduled for the locked client using the {webui} or the API, but the actions fail.
ca: Quan un client està bloquejat, o es posa en mode d'apagada, no es poden programar accions, les ordres d'execució estan desactivades i es mostra un bàner groc a la pàgina [guimenu].Detalls del sistema.. En aquest mode, les accions es poden programar per al client bloquejat utilitzant el {webui} o l'API, però les accions fallen.

source: The locking mechanism is not available for {salt} SSH clients.
ca: El mecanisme de bloqueig no està disponible per a clients SSH {salt}.

source: Procedure: System Locking a Client
ca: Procediment: Suprimir un client

source: In the {productname} {webui}, navigate to the [guimenu]``System Details`` page for the client you want to lock.
ca: A {productname} {webui}, navegueu a la pàgina [guimenu].Detalls del sistema. per al client que voleu bloquejar.
ja: {productname}の{webui}で、ロックするクライアントの［[guimenu]``システムの詳細``］ページに移動します。
ko: {productname} {webui}에서 잠그려는 클라이언트의 [guimenu]``시스템 정보`` 페이지로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到要锁定的客户端的[guimenu]``系统细节``页面。

source: Navigate to the [guimenu]``Formulas`` tab, check the system lock formula, and click btn:[Save].
ca: Navegueu a la pestanya [guimenu]].Formulas]., marqueu la fórmula de bloqueig del sistema i feu clic a btn:[Desa].
ja: ［[guimenu]``式``］タブに移動し、システムのロックの式にチェックを付け、btn:[保存]をクリックします。
ko: [guimenu]``수식`` 탭으로 이동하여 시스템 잠금 수식의 확인란을 선택한 후 btn:[저장]을 클릭합니다.
zh_cn: 导航到[guimenu]``公式``选项卡，选中系统锁公式，然后单击 btn:[保存]。

source: Navigate to the menu:Formulas[System Lock] tab, check [guimenu]``Lock system``, and click btn:[Save].
ca: Navega a la pestanya menú:Formulas[Bloqueig del sistema], marca [guimenu]].Bloqueja el sistema]. i fes clic a btn:[Desa].
ja: menu:式[System Lock]（システムのロック）タブに移動し、［[guimenu]``Lock system``］（システムのロック）にチェックを付け、btn:[保存]をクリックします。
ko: menu:수식[시스템 잠금] 탭으로 이동하여 [guimenu]``시스템 잠금``의 확인란을 선택한 후 btn:[저장]을 클릭합니다.
zh_cn: 导航到menu:公式[系统锁]选项卡，选中[guimenu]``锁定系统``，然后单击 btn:[保存]。

source: On this page, you can also enable specific Salt modules while the client is locked.
ca: En aquesta pàgina, també podeu habilitar mòduls específics de Salt mentre el client està bloquejat.
ja: このページでは、クライアントがロックされているときに特定のSaltモジュールを有効にすることもできます。
ko: 이 페이지에서는 클라이언트가 잠겨 있는 동안 특정 Salt 모듈을 활성화할 수도 있습니다.
zh_cn: 在此页面上，您也可以在客户端处于锁定状态时启用特定的 Salt 模块。

source: When you have made your changes, you might need to apply the highstate.
ca: Quan hàgiu fet els canvis, és possible que hàgiu d'aplicar l'estat alt.
ja: 変更した場合、highstateを適用する必要がある場合があります。
ko: 변경한 후 highstate를 적용해야 할 수 있습니다.
zh_cn: 进行更改后，您可能需要应用 highstate。

source: In this case, a banner in the {webui} notifies you. The client remains locked until you remove the system lock formula.
ca: En aquest cas, un bàner de la {webui} us notifica. El client roman bloquejat fins que elimineu la fórmula de bloqueig del sistema.
ja: この場合、{webui}のバナーで通知されます。 システムのロック式を削除するまで、クライアントはロックされたままです。
ko: 이 경우 {webui}의 배너가 이를 알려줍니다. 시스템 잠금 수식을 제거할 때까지 클라이언트는 잠긴 상태를 유지합니다.
zh_cn: 在此情况下，{webui} 中会显示一个标题通知您。客户端会保持锁定状态，直到您去除系统锁公式。

source: For more information about blackout mode in {salt}, see https://docs.saltproject.io/en/latest/topics/blackout.
ca: Per a més informació sobre {ay}, vegeu https://doc.opensuse.org/projects/autoyast/.

source: Package Locks
ca: Bloquejos de paquets
ja: パッケージのロック
ko: 패키지 잠금
zh_cn: 软件包锁

source: Package locking can be used on several clients, but different feature sets are available. You must differentiate between {sle} and {opensuse} (zypp-based) versus {rhel} or {debian} clients.
ca: El bloqueig de paquets es pot utilitzar en diversos clients, però hi ha diferents conjunts de característiques disponibles. Heu de diferenciar entre {sle} i {opensuse} (basats en zip) versus {rhel} o {debian} clients.

source: Package Locks on Zypp-based Systems
ca: Bloquejos de paquets en sistemes basats en Zypp
ja: Zyppベースのシステムでのパッケージのロック
ko: Zypp 기반 시스템의 패키지 잠금
zh_cn: 基于 Zypp 的系统上的软件包锁

source: Package locks are used to prevent unauthorized installation or upgrades to software packages. When a package has been locked, it shows a padlock icon, indicating that it cannot be installed. Any attempt to install a locked package is reported as an error in the event log.
ca: Els bloquejos de paquets s'utilitzen per evitar la instal·lació no autoritzada o les actualitzacions als paquets de programari. Quan un paquet ha estat bloquejat, mostra una icona de cadenat, indicant que no es pot instal·lar. Qualsevol intent d'instal·lar un paquet bloquejat s'informa com un error en el registre d'esdeveniments.
ja: パッケージのロックを使用して、ソフトウェアパッケージの未認可インストールや未認可アップグレードを防止します。 パッケージがロックされている場合、インストールできないことを示す南京錠のアイコンが表示されます。 ロックされているパッケージをインストールしようとすると、イベントログにエラーとしてレポートされます。
ko: 패키지 잠금은 무단 설치나 소프트웨어 패키지로 업그레이드하는 것을 방지하는 데 사용됩니다. 패키지가 잠겨 있으면 자물쇠 아이콘이 표시되어 설치할 수 없음을 나타냅니다. 잠긴 패키지를 설치하려는 모든 시도는 이벤트 로그에 오류로 보고됩니다.
zh_cn: 软件包锁用于防止在未经授权的情况下安装或升级软件包。当软件包被锁定后，会显示一个挂锁图标，表示无法安装该软件包。任何尝试安装锁定软件包的操作均会在事件日志中报告为错误。

source: Locked packages cannot be installed, upgraded, or removed, neither through the {productname} {webui}, nor directly on the client machine using a package manager. Locked packages also indirectly lock any dependent packages.
ca: Els paquets bloquejats no es poden instal·lar, actualitzar o eliminar, ni a través de {productname} {webui}, ni directament a la màquina client que utilitza un gestor de paquets. Els paquets bloquejats també bloquegen indirectament qualsevol paquet dependent.
ja: ロックされているパッケージは、インストール、アップグレード、または削除できません。{productname}の{webui}を使用しても、パッケージマネージャを使用してクライアントマシンで直接操作しても同様です。 ロックされているパッケージは、依存関係のあるパッケージも間接的にロックします。
ko: 잠긴 패키지는 {productname} {webui}를 통해 또는 패키지 관리자를 사용하는 클라이언트 시스템에서 직접 설치, 업그레이드 또는 제거할 수 없습니다. 잠긴 패키지는 모든 종속 패키지도 간접적으로 잠급니다.
zh_cn: 您无法安装、升级或去除锁定的软件包，无论是通过 {productname} {webui} 还是使用软件包管理器在客户端计算机上直接执行均是如此。锁定的软件包还会间接锁定任何依赖的软件包。

source: Procedure: Using Package Locks
ca: Procediment: Ús de blocatges de paquets
ja: プロシージャ: パッケージのロックの使用
ko: 절차: 패키지 잠금 사용하기
zh_cn: 过程：使用软件包锁

source: Navigate to the menu:Software[Packages > Lock] tab on the managed system to see a list of all available packages.
ca: Navega a la pestanya menu:Software[Packages . Lock] del sistema gestionat per a veure una llista de tots els paquets disponibles.
ja: 管理対象システムでmenu:ソフトウェア[パッケージ > ロック]タブに移動し、使用できるパッケージの一覧を表示します。
ko: 관리되는 시스템에서 menu:소프트웨어[패키지 > 잠금] 탭으로 이동하여 사용 가능한 모든 패키지의 목록을 확인합니다.
zh_cn: 在受管系统上导航到menu:软件[软件包 > 锁定]选项卡查看所有可用软件包的列表。

source: Select the packages to lock, and click btn:[Request Lock]. Pick date and time for the lock to activate. By default, the lock is activated as soon as possible. Note that the lock might not activate immediately.
ca: Seleccioneu els paquets a bloquejar i feu clic a btn:[Sol·licitud de bloqueig]. Trieu la data i l'hora per activar el bloqueig. Per defecte, el bloqueig s'activa tan aviat com sigui possible. Tingueu en compte que el bloqueig pot no activar-se immediatament.
ja: ロックするパッケージを選択し、btn:[Request Lock]（ロックのリクエスト）をクリックします。 ロックをアクティブ化する日時を選択します。 デフォルトでは、できるだけ早くロックをアクティブ化します。 ロックはすぐにはアクティブにできないことに注意してください。
ko: 잠글 패키지를 선택하고 btn:[잠금 요청]을 클릭합니다. 잠금을 활성화할 날짜와 시간을 선택합니다. 기본적으로 잠금은 가능한 한 빨리 활성화됩니다. 잠금이 즉시 활성화되지 않을 수 있습니다. 잠금이 즉시 활성화되지 않을 수 있다는 점에 유의하십시오.
zh_cn: 选择要锁定的软件包，然后单击 btn:[请求锁定]。选择要激活软件包锁的日期和时间。默认情况下，软件包锁会尽快激活。请注意，软件包锁可能不会立即激活。

source: To remove a package lock, select the packages to unlock and click btn:[Request Unlock]. Pick date and time as with activating the lock.
ca: Per a eliminar un blocatge de paquets, seleccioneu els paquets a desbloquejar i feu clic a btn:[Desbloquejar la sol·licitud]. Trieu la data i l'hora com amb l'activació del bloqueig.
ja: パッケージのロックを外すには、ロック解除するパッケージを選択し、btn:[Request Unlock]（ロック解除のリクエスト）をクリックします。 ロックをアクティブ化する場合と同様に、日時を選択します。
ko: 패키지 잠금을 제거하려면 잠금을 해제할 패키지를 선택하고 btn:[잠금 해제 요청]을 클릭하십시오. 잠금을 활성화할 때와 같이 날짜와 시간을 선택합니다.
zh_cn: 要去除软件包锁，请选择要解锁的软件包，然后单击 btn:[请求解锁]。就像激活软件包锁一样选择日期和时间。

source: Package Locks on {rhel}- and {debian}-like Systems
ca: Paquets bloquejats en sistemes {rhel}- i {debian}-like
ja: {rhel}や{debian}のようなシステムでのパッケージのロック
ko: {rhel} 및 {debian} 유사 시스템의 패키지 잠금
zh_cn: 类似 {rhel} 和 {debian} 的系统上的软件包锁

source: Some {rhel}- and {debian}-like systems have package locking available on clients.
ca: Alguns sistemes similars a {rhel}- i {debian} tenen el bloqueig de paquets disponible als clients.

source: On {rhel}- and {debian}-like systems, package locks are only used to prevent unauthorized upgrades or removals to software packages. When a package has been locked, it shows a padlock icon, indicating that it cannot be changed. Any attempt to change a locked package is reported as an error in the event log.
ca: En sistemes semblants a {rhel}- i {debian}, els blocatges de paquets només s'utilitzen per evitar actualitzacions o eliminacions no autoritzades a paquets de programari. Quan un paquet ha estat bloquejat, mostra una icona de cadenat, indicant que no es pot canviar. Qualsevol intent de canviar un paquet bloquejat s'informa com un error en el registre d'esdeveniments.
ja: {rhel}や{debian}のようなシステムでは、パッケージのロックは、ソフトウェアパッケージの未認可アップグレードや削除を防止するためにのみ使用されます。 パッケージがロックされている場合、変更できないことを示す南京錠のアイコンが表示されます。 ロックされているパッケージを変更しようとすると、イベントログにエラーとしてレポートされます。
ko: {rhel} 및 {debian}과 같은 시스템에서 패키지 잠금은 소프트웨어 패키지에 대한 무단 업그레이드 또는 제거하는 것을 방지하는 데만 사용됩니다. 패키지가 잠겨 있으면 자물쇠 아이콘이 표시되어 변경할 수 없음을 나타냅니다. 잠긴 패키지를 설치하려는 모든 시도는 이벤트 로그에 오류로 보고됩니다.
zh_cn: 在类似 {rhel} 和 {debian} 的系统上，软件包锁仅用于防止在未经授权的情况下升级或去除软件包。当软件包被锁定后，会显示一个挂锁图标，表示无法更改该软件包。任何尝试更改锁定软件包的操作均会在事件日志中报告为错误。

source: Locked packages cannot be upgraded or removed, neither through the {productname} {webui}, nor directly on the client machine using a package manager. Locked packages also indirectly lock any dependent packages.
ca: Els paquets bloquejats no es poden actualitzar ni eliminar, ni a través del {productname} {webui}, ni directament a la màquina client que utilitza un gestor de paquets. Els paquets bloquejats també bloquegen indirectament qualsevol paquet dependent.
ja: ロックされているパッケージは、アップグレードまたは削除できません。{productname}の{webui}を使用しても、パッケージマネージャを使用してクライアントマシンで直接操作しても同様です。 ロックされているパッケージは、依存関係のあるパッケージも間接的にロックします。
ko: 잠긴 패키지는 {productname} {webui}를 통해 또는 패키지 관리자를 사용하는 클라이언트 시스템에서 직접 업그레이드 또는 제거할 수 없습니다. 잠긴 패키지는 모든 종속 패키지도 간접적으로 잠급니다.
zh_cn: 您无法升级或去除锁定的软件包，无论是通过 {productname} {webui} 还是使用软件包管理器在客户端计算机上直接执行均是如此。锁定的软件包还会间接锁定任何依赖的软件包。

source: On {rhel} 7 systems, install [package]``yum-plugin-versionlock``, and on {rhel} 8 or 9 systems, install [package]``python3-dnf-plugin-versionlock`` as [systemitem]``root``. On {debian} systems, the ``apt`` tool has the locking feature included.
ca: A {rhel} 7 sistemes, instal·leu [package].yum-plugin-versionlock,, i a {rhel} 8 o 9 sistemes, instal·leu [package].python3-dnf-plugin-versionlock. com a [systemitem].root.. En els sistemes {debian}, l'eina theapt. té inclosa la característica de bloqueig.

source: System Set Manager
ca: Gestor de conjunts de sistema
ja: システムセットマネージャ
ko: 시스템 세트 관리자
zh_cn: 系统集管理器

source: The system set manager (SSM) is used to perform actions on more than one client at a time. SSM creates ephemeral sets of clients, making it useful for one-off actions that you need to apply to a number of clients. If you want more permanent sets, consider using system groups instead. For more information about system groups, see xref:client-configuration:system-groups.adoc[].
ca: El gestor de conjunts de sistema (SSM) s'utilitza per realitzar accions en més d'un client alhora. L'SSM crea conjunts efímers de clients, fent-lo útil per a accions puntuals que necessiteu aplicar a diversos clients. Si voleu conjunts més permanents, considereu utilitzar grups de sistema en el seu lloc. Per a més informació sobre els grups de sistema, vegeu xref:client-configuration:system-groups.adoc[].
ja: システムセットマネージャ(SSM)は、同時に複数のクライアントでアクションを実行するために使用します。 SSMで一時的なクライアントセットが作成されます。これは、多数のクライアントに適用する必要がある1回限定アクションに便利です。 より永続的なセットが必要な場合、代わりにシステムグループの使用を検討してください。 システムグループの詳細については、xref:client-configuration:system-groups.adoc[]を参照してください。
ko: 시스템 세트 관리자(SSM)는 한 번에 두 개 이상의 클라이언트에서 작업을 수행하는 데 사용됩니다. SSM은 수명이 짧은 클라이언트 세트를 생성하므로 다수의 클라이언트에 적용해야 하는 켜기-끄기 작업에 유용합니다. 더 오래 지속되는 세트를 원하는 대신에 시스템 그룹을 사용하는 것을 고려하십시오. 시스템 그룹에 대한 자세한 내용은 xref:client-configuration:system-groups.adoc[]를 참조하십시오.
zh_cn: 系统集管理器 (SSM) 可用于同时对多个客户端执行操作。SSM 会创建多组临时客户端，将它们变为可用状态，以执行您需要应用到多个客户端的一次性操作。如果您需要存留时间更长的客户端组，请考虑使用系统组。有关系统组的详细信息，请参见 xref:client-configuration:system-groups.adoc[]。

source: The actions available for use in SSM are listed in table. The icons in this table indicate:
ca: Les accions disponibles per al seu ús en SSM es llisten en aquesta taula. Les icones d'aquesta taula indiquen:

source: {check} this action is available in SSM for this client type
ca: {check} aquesta acció està disponible a SSM per a aquest tipus de client
ja: {check}: このアクションはこのクライアントタイプ用にSSMで使用できます。
ko: {check} 이 작업은 이 클라이언트 유형의 SSM에서 사용할 수 있습니다.
zh_cn: {check} 在 SSM 中，此操作可用于此客户端类型

source: {cross} this action is not available in SSM for this client type
ca: {cross} aquesta acció no està disponible a SSM per a aquest tipus de client
ja: {cross}: このアクションはこのクライアントタイプ用にSSMで使用できません。
ko: {cross} 이 작업은 이 클라이언트 유형의 SSM에서 사용할 수 없습니다.
zh_cn: {cross} 在 SSM 中，此操作不可用于此客户端类型

source: {question} this action is under consideration for this client type, and may or may not be supported at a later date.
ca: {question} aquesta acció està en consideració per a aquest tipus de client, i pot o no ser admesa en una data posterior.
ja: {question}: このアクションはこのクライアントタイプ用に検討中であり、後日サポートされる場合と、サポートされない場合があります。
ko: {question} 이 작업은 이 클라이언트 유형에 대해 고려 중이며, 이후에 지원될 수도 있고 지원되지 않을 수도 있습니다.
zh_cn: {question} 正在考虑将此操作用于此客户端类型，日后可能支持此操作，也可能不支持此操作。

source: Available SSM Actions
ca: Accions SSM disponibles
ja: 使用可能なSSMアクション
ko: 사용할 수 있는 SSM 작업
zh_cn: 可用的 SSM 操作

source: | List systems | {check} | Install patches | {check} | Schedule patch updates | {check} | Upgrade packages | {check} | Install packages | {check} | Remove packages | {check} | Verify packages | {cross} | Create groups | {check} | Manage groups | {check} | Channel memberships | {check} | Channel subscriptions | {cross} | Deploy/diff channels | {cross} | Autoinstall clients | {cross} | Tag for snapshot | {cross} | Remote commands | {cross} | Power management | {cross} | Update system preferences | {check} | Update hardware profiles | {check} | Update package profiles | {check} | Set/remove custom values | {check} | Reboot clients | {check} | Migrate clients to another organization | {check} | Delete clients | {check}
ca: Sistemes de llista {check} Instal·la els pedaços {check} Planifica les actualitzacions dels pedaços {check} Actualitza els paquets {check} Instal·la paquets {check} Elimina els paquets {check} Verifica els paquets {cross} Crea grups {check} Gestiona els grups {check} s Pertinences al canal s {check} s Subscripcions al canal s {cross} Desplega/difereix canals {cross} Clients d'instal·lació automàtica {cross} Etiqueta per a la instantània {cross} s Comandes remotes s {cross} Gestió d'energia {cross} Actualitza les preferències del sistema {check} Actualitza els perfils de maquinari {check} Actualitza els perfils dels paquets {check} Estableix/elimina valors personalitzats {check} Reinicia clients {check} Migra clients a una altra organització {check} Suprimeix clients {check}

source: You can select clients for the SSM in several ways:
ca: Podeu seleccionar clients per a l'SSM de diverses maneres:
ja: SSMのクライアントの選択は複数の方法で実行できます。
ko: SSM에 대한 클라이언트를 다음 몇 가지 방식으로 선택할 수 있습니다.
zh_cn: 您可以通过多种方式选择 SSM 的客户端：

source: Navigate to menu:Systems[System List] and check the clients you want to work with.
ca: Navega al menú:Sistemes[Llista de sistemes] i comprova els clients amb els quals vols treballar.
ja: menu:システム[システム一覧]に移動し、操作するクライアントにチェックを付けます。
ko: menu:시스템[시스템 목록]으로 이동하여 작업하려는 클라이언트의 확인란을 선택합니다.
zh_cn: 导航到menu:系统[系统列表]，然后选中要使用的客户端。

source: Navigate to menu:Systems[System Groups], and click btn:[Use in SSM] for the system group you want to work with.
ca: Navega al menú:Sistemes[Grups de sistema], i fes clic a btn:[Usa a SSM] per al grup de sistema amb el qual vulguis treballar.
ja: menu:システム[システムグループ]に移動し、操作するシステムグループでbtn:[SSMで使用]をクリックします。
ko: menu:시스템[시스템 그룹]으로 이동하여 작업하려는 시스템 그룹에 대해 btn:[SSM에서 사용]을 클릭합니다.
zh_cn: 导航到menu:系统[系统组]，然后针对要使用的系统组单击 btn:[在 SSM 中使用]。

source: Navigate to menu:Systems[System Groups], check the group you want to work with, and click btn:[Work with Group].
ca: Navega al menú:Sistemes[Grups del sistema], comprova el grup amb el qual vols treballar i fes clic a btn:[Treballa amb el grup].
ja: menu:システム[システムグループ]に移動し、操作するグループにチェックを付け、btn:[グループでの作業]をクリックします。
ko: menu:시스템[시스템 그룹]으로 이동하여 작업하려는 그룹의 확인란을 선택하고, btn:[그룹 작업]을 클릭합니다.
zh_cn: 导航到menu:系统[系统组]，选中要使用的组，然后单击 btn:[使用组]。
