Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: Using environment variables allows dynamic input at runtime and makes it easier to reuse the same bootstrap script across different systems or environments.
ca: L'ús de variables d'entorn permet l'entrada dinàmica en temps d'execució i facilita la reutilització del mateix script d'arrencada en diferents sistemes o entorns.

source: When you have finished, save the file, and repeat this procedure for the second bootstrap script.
ca: Quan hàgiu acabat, deseu el fitxer i repetiu aquest procediment per al segon script d'arrencada.
ja: 完了したら、ファイルを保存し、2つ目のブートストラップスクリプトでこの手順を繰り返します。
ko: 완료한 후 파일을 저장하고 두 번째 부트스트랩 스크립트에 대해 이 절차를 반복하십시오.
zh_cn: 完成后，保存该文件，然后对第二个引导脚本重复此过程。

source: By default, bootstrap script will try to install [package]``venv-salt-minion`` if it is available in the bootstrap repository and [package]``salt-minion`` if there is no {salt} bundle in the bootstrap repository. It is possible to avoid installing {salt} bundle and keep using [package]``salt-minion`` if you need it for some reason.
ca: Per defecte, l'script bootstrap intentarà instal·lar [package].venv-salt-minion. si està disponible al repositori bootstrap i [package],salt-minion. si no hi ha cap paquet {salt} al repositori bootstrap. És possible evitar instal·lar el paquet {salt} i seguir utilitzant [paquet].salt-minion. si el necessiteu per alguna raó.

source: For more information, see xref:client-configuration:contact-methods-saltbundle.adoc[Salt Bundle].
ca: Per a més informació sobre el fibrat de sal, vegeu xref:client-configuration:contact-methods-saltbundle.adoc[Salt Bundle].
ja: 詳細については、xref:client-configuration:contact-methods-saltbundle.adoc[Salt Bundle]を参照してください。
ko: 자세한 내용은 xref:client-configuration:contact-methods-saltbundle.adoc[Salt Bundle]에서 확인할 수 있습니다.
zh_cn: 有关详细信息，请参见 xref:client-configuration:contact-methods-saltbundle.adoc[Salt 捆绑包]。

source: Register clients running the bootstrap script
ca: Registre de clients amb un script de Bootstrap

source: When you have finished creating your script, you can use it to register clients.
ca: Quan hàgiu acabat de crear el vostre script, el podreu utilitzar per registrar clients.
ja: スクリプトの作成を完了したら、このスクリプトを使用してクライアントを登録できます。
ko: 스크립트 생성을 완료했으면 이 스크립트를 사용해 클라이언트를 등록할 수 있습니다.
zh_cn: 创建好脚本后，您便可以使用它来注册客户端。

source: Procedure: Running the bootstrap script
ca: Procediment: executar l'script de Bootstrap

source: On the {productname} Server, change to the bootstrap directory:
ca: Al servidor {productname}, canvieu al directori de bootstrap:

source: Run this command to execute the bootstrap script on the client; replace [systemitem]``EXAMPLE.COM`` with the host name of your client:
ca: Al servidor {productname}, accepteu la clau de client nova; substituïu [systemitem] {<client> the amb el nom del vostre client:
ja: 次のコマンドを実行して、クライアントでブートストラップスクリプトを実行します。[systemitem]`` EXAMPLE.COM``をクライアントのホスト名に置き換えます。
ko: 다음 명령을 실행하여 클라이언트에서 부트스트랩 스크립트를 실행하고, [systemitem]``EXAMPLE.COM``을 클라이언트의 호스트 이름으로 교체합니다.
zh_cn: 运行以下命令在客户端上执行引导脚本（将 [systemitem]``EXAMPLE.COM`` 替换为客户端的主机名）：

source: Alternatively, on the client, run this command:
ca: Alternativament, en el client, executeu aquesta ordre:
ja: または、クライアントで次のコマンドを実行します。
ko: 또는 클라이언트에서 다음 명령을 실행합니다.
zh_cn: 或者，在客户端上运行以下命令：

source: ACTIVATION_KEYS="17-someactivationkey" \ MGR_SERVER_HOSTNAME="proxy.example.com" \ ORG_GPG_KEY="mykey" \ REACTIVATION_KEY=my-reactivation-key \ curl -Sks https://server_hostname/pub/bootstrap/bootstrap.sh | /bin/bash
ca: ACTIVATION_KEYS="17-algunesclausd'activació" \ MGR_SERVER_HOSTNAME="proxy.exemple.com" \ ORG_GPG_KEY="la-meva-clau" \ REACTIVATION_KEY=la-meva-clau-de-reactivació \ curl -Sks https://nom_de_l'amfitrió_del_servidor/pub/bootstrap/bootstrap.sh | /bin/bash

source: If you do not need to override any values, you can omit the environment variables entirely:
ca: Si no cal sobreescriure cap valor, podeu ometre completament les variables d'entorn:

source: curl -Sks https://server_hostname/pub/bootstrap/bootstrap.sh | /bin/bash
ca: curl -Sks https://nom d'amfitrió del servidor/pub/bootstrap/bootstrap.sh | /bin/bash

source: To avoid problems, make sure the bootstrap script is executed using [command]``bash``.
ca: Per evitar problemes, assegureu-vos que l'script bootstrap s'executa utilitzant [command].bash..
ja: 問題を回避するには、ブートストラップスクリプトが [command]``bash``を使用して実行されていることを確認してください。
ko: 문제를 해결하려면 [command]``bash`` 명령을 사용하여 부트스트랩 스크립트를 실행해 확인하십시오.
zh_cn: 为避免出现问题，请确保引导脚本是使用 [command]``bash`` 执行的。

source: This script downloads the required dependencies located in the repositories directory you created earlier.
ca: Aquest script baixa les dependències necessàries ubicades al directori de repositoris que heu creat anteriorment.
ja: このスクリプトは、前に作成したリポジトリディレクトリにある必要な依存関係をダウンロードします。
ko: 이 스크립트는 앞서 생성한 리포지토리 디렉토리에 있는 필수 종속성을 다운로드합니다.
zh_cn: 此脚本会下载位于您先前创建的储存库目录下的所需依赖项。

source: When the script has finished running, you can check that the client is registered correctly. Open the {productname} {webui} and navigate to menu:Systems[Overview] to ensure the new client is listed. If the client is not listed, in the {productname} {webui} navigate to menu:Salt[Keys] and check whether the client key is accepted.
ca: Quan el script hagi acabat d'executar, podeu comprovar que el client està registrat correctament. Obriu el {productname} {webui} i navegueu al menú:Systems[Vista prèvia] per assegurar que el client nou estigui llistat. Si el client no és a la llista, a {productname} {webui} navegueu al menú:Salt[Claus] i comproveu si la clau del client és acceptada.

source: When new packages or updates are installed on the client using {productname}, any end user license agreements (EULAs) are automatically accepted. To review a package EULA, open the package detail page in the {webui}.
ca: Quan s'instal·len nous paquets o actualitzacions al client utilitzant {productname}, s'accepten automàticament qualsevol acord de llicència d'usuari final (EULAs). Per revisar un paquet EULA, obriu la pàgina de detalls del paquet a la {webui}.
ja: {productname}を使用してクライアントに新しいパッケージまたは更新がインストールされると、エンドユーザライセンスアグリーメント(EULA)が自動的に受け入れられます。 パッケージのEULAを確認するには、{webui}でパッケージ詳細ページを開きます。
ko: {productname}를 사용해 클라이언트에 새 패키지 또는 업데이트를 설치하면 최종 사용자 라이선스 계약(EULA)이 자동으로 수락됩니다. 패키지 EULA를 검토하려면 {webui}에서 패키지 상세 정보 페이지를 여십시오.
zh_cn: 使用 {productname} 在客户端上安装新的软件包或更新时，会自动接受所有最终用户许可协议 (EULA)。要查看软件包 EULA，请打开 {webui} 中的软件包细节页面。

source: Register Clients on the Command Line
ca: Procediment: Registre de clients a un servidor intermediari utilitzant la línia d'ordres

source: {salt} clients are registered accurately with the default bootstrap methods in most cases.
ca: {salt} clients estan registrats amb precisió amb els mètodes d'arrencada per defecte en la majoria dels casos.

source: However, you can use {salt} to register the client to the {productname} Server manually by editing the {salt} minion file on the client, and providing the fully qualified domain name (FQDN) of the server.
ca: No obstant això, podeu utilitzar {salt} per registrar el client al servidor {productname} manualment editant el fitxer minion {salt} al client, i proporcionant el nom de domini totalment qualificat (FQDN) del servidor.

source: This method:
ca: Aquest mètode:

source: uses ports 4505 and 4506 inbound to the server.
ca: utilitza els ports 4505 i 4506 d'entrada al servidor.

source: requires no configuration on the {productname} Server aside from ensuring that these ports are open.
ca: no requereix cap configuració al servidor {productname} a part d'assegurar que aquests ports estan oberts.

source: requires that you have installed the [package]``venv-salt-minion`` (Salt bundle) or the [package]``salt-minion`` package on the Salt client before registration. Both use configuration files in different locations and filenames remain the same. The [literal]``systemd`` service filename is different.
ca: Aquest procediment requereix que hàgiu instal·lat el paquet [package].venv-salt-minion. (paquet de sal) o el paquet [package].salt-minion. al client de Salt abans de registrar-vos. Tots dos utilitzen fitxers de configuració en diferents ubicacions i els noms de fitxer continuen sent els mateixos. El nom de fitxer del servei «systemd» és diferent.

source: Bootstrapping this way will only work if you use the [package]``salt-minion`` being part of the client tools channels or of an official {suse} distributions.
ca: Bootstrapping d'aquesta manera només funcionarà si utilitzeu el [package].salt-minion. formant part dels canals d'eines del client o d'una distribució oficial {suse}.
ja: この方法でブートストラップを実行できるのは、クライアントツールチャンネルまたは公式の{suse}ディストリビューションの一部として[package]``salt-minion``を使用する場合のみです。
ko: 이 방법으로 부트스트랩하면 클라이언트 도구 채널 또는 공식 {suse} 배포판의 일부인 [패키지]``salt-minion``을 사용하는 경우에만 작동합니다.
zh_cn: 只有在您使用属于客户端工具通道或正式 {suse} 发行套件一部分的 [package]``salt-minion`` 时，才能以这种方式引导。

source: {salt} Bundle Configuration
ca: Crea canals de configuració

source: {salt} Bundle ([package]``venv-salt-minion``)::
ca: [camí]//etc/venv-salt-minion//

source: [path]``/etc/venv-salt-minion/``
ca: [camí]//etc/venv-salt-minion//

source: [path]``/etc/venv-salt-minion/minion``
ca: [camí]``/etc/venv-salt-minion/minion``

source: [path]``/etc/venv-salt-minion/minion.d/NAME.conf``
ca: [camí]//etc/venv-salt-minion/minion.d/NAME.conf.

source: systemd service file: [path]``venv-salt-minion.service``
ca: fitxer de servei systemd: [path]:venv-salt-minion.service``
ja: systemdサービスファイル: [path]``venv-salt-minion.service``
ko: systemd 서비스 파일: [path]``venv-salt-minion.service``
zh_cn: systemd 服务文件：[path]``venv-salt-minion.service``

source: For more information about the Salt bundle, see xref:client-configuration:contact-methods-saltbundle.adoc[Salt Bundle].
ca: Per a més informació sobre el fibrat de sal, vegeu xref:client-configuration:contact-methods-saltbundle.adoc[Salt Bundle].
ja: Salt bundleの詳細については、xref:client-configuration:contact-methods-saltbundle.adoc[Salt Bundle]を参照してください。
ko: Salt 번들에 대한 자세한 내용은 xref:client-configuration:contact-methods-saltbundle.adoc[Salt Bundle]에서 참조하십시오.
zh_cn: 有关 Salt 捆绑包的详细信息，请参见 xref:client-configuration:contact-methods-saltbundle.adoc[Salt 捆绑包]。

source: Procedure: Registering Clients with Salt Bundle Configuration File
ca: Procediment: Registre de clients amb el fitxer de configuració Salt Bundle
ja: プロシージャ: Salt Bundle設定ファイルでクライアントを登録する
ko: 절차: Salt Bundle 구성 파일로 클라이언트 등록
zh_cn: 过程：使用 Salt 捆绑包配置文件注册客户端

source: On the Salt client, open the [literal]``minion`` configuration file. The configuration file is either located at:
ca: Al client Salt, obriu el fitxer de configuració [literal].minion.. El fitxer de configuració es troba a:
ja: Saltクライアントで[literal]``minion``設定ファイルを開きます。 設定ファイルは次の場所にあります。
ko: Salt 클라이언트에서 [literal]``minion`` 구성 파일을 엽니다. 구성 파일의 위치는 다음 중 하나입니다.
zh_cn: 在 Salt 客户端上，打开 [literal]``minion`` 配置文件。配置文件位于以下位置：

source: Configuration File
ca: Fitxers de configuració

source: In the file add or edit the FQDN of the {productname} Server or Proxy, and the activation key if any. Also add the other configuration parameters listed below.
ca: Al fitxer afegiu o editeu la FQDN del servidor o servidor intermediari {productname} i la clau d'activació si n'hi ha. Afegiu també els altres paràmetres de configuració llistats a continuació.
ja: ファイルで、{productname}サーバまたはプロキシのFQDNと、アクティベーションキー(存在する場合)を追加または編集します。以下にリストされている他の設定パラメータも追加します。
ko: 파일에서 {productname} 서버 또는 프록시의 FQDN과 활성화 키(있는 경우)를 추가하거나 편집합니다. 또한 아래 나열된 다른 구성 파라미터를 추가합니다.
zh_cn: 在文件中添加或编辑 {productname} 服务器或代理的 FQDN 以及激活密钥（如果有）。另外请添加以下其他配置参数。

source: Configuration Parameters
ca: Gestió de la configuració

source: grains: susemanager: activation_key: "<Activation_Key_Name>"
ca: grans: gestor de sus: activationkey: "<ActivationKeyName>"
ko: 세분화: susemanager: activation_key: "<Activation_Key_Name>"

source: server_id_use_crc: adler32 enable_legacy_startup_events: False enable_fqdns_grains: False
ca: serveridusecrc: adler32 enablelegacystartupevents: Fals enablefqdnsgrains: Fals

source: Restart the [systemitem]``venv-salt-minion`` service:
ca: Reinicia el servei [systemitem]:venv-salt-minion::
ja: [systemitem]``venv-salt-minion``サービスを再起動します。
ko: 다음과 같이 [systemitem]``venv-salt-minion`` 서비스를 재시작합니다.
zh_cn: 重启动 [systemitem]``venv-salt-minion`` 服务：

source: systemctl restart venv-salt-minion
ca: systemctl reinicia venv-salt-minion

source: On the {productname} Server, accept the new client key; replace [systemitem]``<client>`` with the name of your client:
ca: Al servidor {productname}, accepteu la clau de client nova; substituïu [systemitem] {<client> the amb el nom del vostre client:
ja: {productname}サーバで、新しいクライアントキーを受け入れます。[systemitem]``<client>``をクライアントの名前に置き換えます。
ko: {productname} 서버에서 새로운 클라이언트 키를 수락하고, 다음과 같이 [systemitem]``<client>``를 클라이언트의 이름으로 교체합니다.
zh_cn: 在 {productname} 服务器上，接受新客户端密钥（将 [systemitem]``<client>`` 替换为您客户端的名称）：

source: Client Configuration
ca: Visió general de la guia de configuració del client

source: Client ([package]``salt-minion``)
ca: [camí]``/etc/salt/minion``

source: [path]``/etc/salt/``
ca: [camí]]/etc/salt/``

source: [path]``/etc/salt/minion``
ca: [camí]``/etc/salt/minion``

source: [path]``/etc/salt/minion.d/NAME.conf``
ca: [camí]//etc/salt/minion.d/NAME.conf.

source: systemd service file: [path]``salt-minion.service``
ca: fitxer de servei systemd: [path]:salt-minion.service``
ja: systemdサービスファイル: [path]``salt-minion.service``
ko: systemd 서비스 파일: [path]``salt-minion.service``
zh_cn: systemd 服务文件：[path]``salt-minion.service``

source: Procedure: Registering Clients with Salt Minion Configuration File
ca: Procediment: Registre de clients amb el fitxer de configuració de Salt Minion
ja: プロシージャ: Salt Minion設定ファイルでクライアントを登録する
ko: 절차: Salt Minion 구성 파일로 클라이언트 등록
zh_cn: 过程：使用 Salt 受控端配置文件注册客户端

source: In the file add or edit the FQDN of the {productname} Server or Proxy, and the activation key if any. Also add the other configuration parameters listed below.
ca: Al fitxer afegiu o editeu la FQDN del servidor o servidor intermediari {productname} i la clau d'activació si n'hi ha. Afegiu també els altres paràmetres de configuració llistats a continuació.

source: For more information about the {salt} minion configuration file, see https://docs.saltproject.io/en/latest/ref/configuration/minion.html[Configuring the Salt Minion].
ca: Per a més informació sobre el fitxer de configuració de Salt minion, vegeu https://docs.saltstack.com/ca/latest/ref/configuration/minion.html.

source: Registration Methods
ca: Registre del client

source: There are several ways to register clients to your {productname} Server.
ca: Hi ha diverses maneres de registrar clients al vostre servidor {productname}.
ja: クライアントを{productname}サーバに登録する方法は複数あります。
ko: 클라이언트를 {productname} 서버에 등록하는 방법이 몇 가지 있습니다.
zh_cn: 有多种方法可将客户端注册到 {productname} 服务器。

source: For only a few clients, we recommend that you register clients using the {productname} {webui}.
ca: Podeu activar, apagar i reiniciar clients utilitzant {productname} {webui}.

source: For more information, see xref:client-configuration:registration-webui.adoc[].
ca: Per a més informació, vegeu xref:client-configuration:registration-webui.adoc[].
ja: 詳細については、xref:client-configuration:registration-webui.adoc[]を参照してください。
ko: 자세한 내용은 xref:client-configuration:registration-webui.adoc[]를 참조하십시오.
zh_cn: 有关详细信息，请参见 xref:client-configuration:registration-webui.adoc[]。

source: If you want more control over the process, or have to register many clients, we recommend that you create a bootstrap script.
ca: Si voleu més control sobre el procés, o heu de registrar molts clients, us recomanem que creeu un script d'arrencada.

source: For more information, see xref:client-configuration:registration-bootstrap.adoc[].
ca: Per a més informació, vegeu xref:client-configuration:registration-bootstrap.adoc[].
ja: 詳細については、xref:client-configuration:registration-bootstrap.adoc[]を参照してください。
ko: 자세한 내용은 xref:client-configuration:registration-bootstrap.adoc[]에서 참조하십시오.
zh_cn: 有关详细信息，请参见 xref:client-configuration:registration-bootstrap.adoc[]。

source: For even more control over the process, executing a single commands on the command line can be useful.
ca: Per als clients de Salt i encara més control sobre el procés, l'execució d'ordres individuals a la línia de comandes pot ser útil. Per a més informació, vegeu xref:client-configuration:registration-cli.adoc[].

source: For more information, see xref:client-configuration:registration-cli.adoc[].
ca: Per a més informació, vegeu xref:client-configuration:registration-cli.adoc[].
ja: 詳細については、xref:client-configuration:registration-cli.adoc[]を参照してください。
ko: 자세한 내용은 xref:client-configuration:registration-cli.adoc[]를 참조하십시오.
zh_cn: 有关详细信息，请参见 xref:client-configuration:registration-cli.adoc[]。

source: The client must have the date and time synchronized correctly with the {productname} Server before registration.
ca: El client ha de tenir la data i l'hora sincronitzades correctament amb el servidor {productname} abans del registre.
ja: クライアントは、登録する前に{productname}サーバと日時が正しく同期されている必要があります。
ko: 클라이언트는 등록 전에 날짜 및 시간을 {productname} 서버와 정확하게 동기화한 상태이어야 합니다.
zh_cn: 注册前，客户端的日期和时间必须已与 {productname} 服务器正确同步。

source: You must create an activation key first, to use bootstrap script or command line method. For more information about creating activation keys, see xref:client-configuration:activation-keys.adoc[].
ca: Primer heu de crear una clau d'activació, per utilitzar l'script bootstrap o el mètode de la línia d'ordres. Per obtenir més informació sobre la creació de claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].
ja: まず、アクティベーションキーを作成してから、ブートストラップスクリプトまたはコマンドラインメソッドを使用する必要があります。 アクティベーションキーの作成の詳細については、xref:client-configuration:activation-keys.adoc[]を参照してください。
ko: 부트스트랩 스크립트 또는 명령줄 방법을 사용하려면 먼저 활성화 키를 생성해야 합니다. 활성화 키 생성에 대한 자세한 내용은 xref:client-configuration:activation-keys.adoc[]를 참조하십시오.
zh_cn: 您必须先创建激活密钥，然后才能使用引导脚本或命令行方法。有关创建激活密钥的详细信息，请参见 xref:client-configuration:activation-keys.adoc[]。

source: Do not register the {productname} Server to itself. The {productname} Server must be managed individually or by using another separate {productname} Server. For more information about using multiple servers, see xref:specialized-guides:large-deployments/hub-multi-server.adoc[].
ca: No registris el servidor {productname}. El servidor {productname} s'ha de gestionar individualment o utilitzant un altre servidor {productname}. Per a més informació sobre l'ús de diversos servidors, vegeu xref:specialized-guides:large-deployments/hub-multi-server.adoc[].

source: {alibabaclo} Client Registration
ca: Registre del client {alibabaclo}
ja: {alibabaclo}クライアントの登録
ko: {alibabaclo} 클라이언트 등록
zh_cn: {alibabaclo} 客户端注册

source: You can register {alibabaclo} clients to your {productname} Server. The method and details vary depending on the operating system of the client.
ca: Podeu registrar {alibabaclo} clients al vostre servidor {productname}. El mètode i els detalls varien en funció del sistema operatiu del client.
ja: {alibabaclo}クライアントを{productname}サーバに登録できます。 そのメソッドおよび詳細は、クライアントのオペレーティングシステムによって異なります。
ko: {alibabaclo} 클라이언트를 {productname} 서버에 등록할 수 있습니다. 방법과 상세 정보는 클라이언트의 운영 체제에 따라 다릅니다.
zh_cn: 您可以将 {alibabaclo} 客户端注册到 {productname} 服务器。方法和细节视客户端的操作系统而异。

source: Before you start, ensure that the client has the date and time synchronized correctly with the {productname} Server.
ca: Abans de començar, assegureu-vos que el client té la data i l'hora sincronitzades correctament amb el servidor {productname}.
ja: 始める前に、クライアントで{productname}サーバと日時が正しく同期していることを確認してください。
ko: 시작하기 전에 클라이언트의 날짜 및 시간이 {productname} 서버와 정확히 동기화되었는지 확인하십시오.
zh_cn: 开始前，请确保客户端的日期和时间已与 {productname} 服务器正确同步。

source: You must also have created an activation key. For more information about creating activation keys, see xref:client-configuration:activation-keys.adoc[].
ca: També heu d'haver creat una clau d'activació. Per obtenir més informació sobre la creació de claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].
ja: アクティベーションキーを作成済みである必要もあります。 アクティベーションキーの作成の詳細については、xref:client-configuration:activation-keys.adoc[]を参照してください。
ko: 또한 활성화 키 생성을 완료한 상태이어야 합니다. 활성화 키 생성에 대한 자세한 내용은 xref:client-configuration:activation-keys.adoc[]를 참조하십시오.
zh_cn: 您还必须已创建好激活密钥。有关创建激活密钥的详细信息，请参见 xref:client-configuration:activation-keys.adoc[]。

source: {almalinux} Client Registration
ca: Registre del client {almalinux}
ja: {almalinux}クライアントの登録
ko: {almalinux} 클라이언트 등록
zh_cn: {almalinux} 客户端注册

source: You can register {almalinux} clients to your {productname} Server. The method and details vary depending on the operating system of the client.
ca: Podeu registrar {almalinux} clients al vostre servidor {productname}. El mètode i els detalls varien en funció del sistema operatiu del client.
ja: {almalinux}クライアントを{productname}サーバに登録できます。 そのメソッドおよび詳細は、クライアントのオペレーティングシステムによって異なります。
ko: {almalinux} 클라이언트를 {productname} 서버에 등록할 수 있습니다. 방법과 상세 정보는 클라이언트의 운영 체제에 따라 다릅니다.
zh_cn: 您可以将 {almalinux} 客户端注册到 {productname} 服务器。方法和细节视客户端的操作系统而异。

source: You must also have created an activation key.
ca: Crea una clau d'activació
ja: アクティベーションキーも作成しておく必要があります。
ko: 활성화 키도 생성해야 합니다.
zh_cn: 您必须已创建激活密钥。

source: For more information about creating activation keys, see xref:client-configuration:activation-keys.adoc[].
ca: Per obtenir més informació sobre les claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].
ja: アクティベーションキーの作成の詳細については、xref:client-configuration:activation-keys.adoc[]を参照してください。
ko: 활성화 키 만들기에 대한 자세한 내용은 xref:client-configuration:activation-keys.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关创建激活密钥的详细信息，请参见 xref:client-configuration:activation-keys.adoc[]。

source: For more information about migrating {almalinux} to {sll}, see xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[].
ca: Per obtenir més informació sobre les claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].
ja: {almalinux}から{sll}への移行の詳細については、xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[]を参照してください。
ko: {almalinux}에서 {sll}로 마이그레이션에 대한 자세한 내용은 xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[]에서 확인할 수 있습니다.
zh_cn: 有关将 {almalinux} 迁移到 {sll} 的详细信息，请参见 xref:client-configuration:clients-sleses.adoc#clients-sleses-el-migration[]。

source: {amazon} Client Registration
ca: Registre del client {amazon}
ja: {amazon}クライアントの登録
ko: {amazon} 클라이언트 등록
zh_cn: {amazon} 客户端注册

source: You can register {amazon} clients to your {productname} Server. The method and details vary depending on the operating system of the client.
ca: Podeu registrar {amazon} clients al vostre servidor {productname}. El mètode i els detalls varien en funció del sistema operatiu del client.
ja: {amazon}クライアントを{productname}サーバに登録できます。 そのメソッドおよび詳細は、クライアントのオペレーティングシステムによって異なります。
ko: {amazon} 클라이언트를 {productname} 서버에 등록할 수 있습니다. 방법과 상세 정보는 클라이언트의 운영 체제에 따라 다릅니다.
zh_cn: 您可以将 {amazon} 客户端注册到 {productname} 服务器。方法和细节视客户端的操作系统而异。

source: CentOS Client Registration
ca: Registre del client de CentOS
ja: CentOSクライアントの登録
ko: CentOS 클라이언트 등록
zh_cn: CentOS 客户端注册

source: You can register {centos} clients to your {productname} Server. The method and details varies depending on the operating system of the client.
ca: Podeu registrar {centos} clients al vostre servidor {productname}. El mètode i els detalls varien en funció del sistema operatiu del client.
ja: {centos}クライアントを{productname}サーバに登録できます。 そのメソッドおよび詳細は、クライアントのオペレーティングシステムによって異なります。
ko: {centos} 클라이언트를 {productname} 서버에 등록할 수 있습니다. 방법과 상세 정보는 클라이언트의 운영 체제에 따라 달라집니다.
zh_cn: 您可以将 {centos} 客户端注册到 {productname} 服务器。方法和细节视客户端的操作系统而异。
