Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: | Feature | {ubuntu}{nbsp}20.04 | {ubuntu}{nbsp}22.04 | {ubuntu}{nbsp}24.04 | Client | {check} | {check} | {check} | System packages | Canonical | Canonical | Canonical | Registration | {check} | {check} | {check} | Install packages | {check} | {check} | {check} | Apply patches | {check} | {check} | {check} | Remote commands | {check} | {check} | {check} | System package states | {check} | {check} | {check} | System custom states | {check} | {check} | {check} | Group custom states | {check} | {check} | {check} | Organization custom states | {check} | {check} | {check} | System set manager (SSM) | {check} | {check} | {check} | Product migration | N/A | N/A | N/A | Basic Virtual Guest Management {star} | {check} | {check} | {check} | Advanced Virtual Guest Management {star} | {check} | {check} | {check} | Virtual Guest Installation (Kickstart), as Host OS | {cross} | {cross} | {cross} | Virtual Guest Installation (image template), as Host OS | {check} | {check} | {check} | System deployment (PXE/Kickstart) | {cross} | {cross} | {cross} | System redeployment (Kickstart) | {cross} | {cross} | {cross} | Contact methods | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | Works with {productname} Proxy | {check} | {check} | {check} | Action chains | {check} | {check} | {check} | Staging (pre-download of packages) | {check} | {check} | {check} | Duplicate package reporting | {check} | {check} | {check} | CVE auditing | {question} | {question} | {question} | SCAP auditing | {question} | {question} | {question} | Package verification | {cross} | {cross} | {cross} | Package locking | {check} | {check} | {check} | System locking | {cross} | {cross} | {cross} | System snapshot | {cross} | {cross} | {cross} | Configuration file management | {check} | {check} | {check} | Package profiles | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | Power management | {check} | {check} | {check} | Monitoring | {check} | {check} | {check} | Docker buildhost | {question} | {question} | {question} | Build Docker image with OS | {check} | {check} | {check} | Kiwi buildhost | {cross} | {cross} | {cross} | Build Kiwi image with OS | {cross} | {cross} | {cross} | Recurring Actions | {check} | {check} | {check} | AppStreams | N/A | N/A | N/A | Yomi | N/A | N/A | N/A
ca: Fe Característica {ubuntu}{nbsp}20.04 {ubuntu}{nbsp}22.04 {ubuntu}{nbsp}24.04 Client {check} {check} {check} Paquets del sistema Canonical Canonical Canonical Inscripció {check} {check} {check} Instal·la paquets {check} {check} {check} es Aplica els pedaços {check} {check} {check} s Ordres remotes {check} {check} {check} Estats del paquet del sistema {check} {check} {check} Estats personalitzats del sistema {check} {check} {check} Agrupa estats personalitzats {check} {check} {check} Organització d'estats personalitzats {check} {check} {check} ) Gestor de conjunts de sistemes (SSM) {check} {check} {check} Migració de producte N/A N/A N/A Gestió bàsica de convidats virtual {star} {check} {check} {check} Gestió de convidats virtual avançada {star} {check} {check} {check} ), Instal·lació de convidat virtual (Kickstart), com a servidor {cross} {cross} {cross} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {check} {check} {check} ) Desplegament del sistema (PXE/Kickstart) {cross} {cross} {cross} ) Redesplegament del sistema (Kickstart) {cross} {cross} {cross} Mètodes de contacte , {check} ZeroMQ, Salt-SSH , {check} ZeroMQ, Salt-SSH , {check} ZeroMQ, Salt-SSH with Funciona amb el servidor intermediari {productname} {check} {check} {check} Cadenes d'acció {check} {check} {check} ) Estadificació (pre-descàrrega de paquets) {check} {check} {check} Informe de paquets duplicat {check} {check} {check} ing Auditoria CVE {question} {question} {question} ing Auditoria SCAP {question} {question} {question} Verificació de paquets {cross} {cross} {cross} ing Bloqueig de paquets {check} {check} {check} ing Bloqueig del sistema {cross} {cross} {cross} Instantània del sistema {cross} {cross} {cross} Gestió de fitxers de configuració {check} {check} {check} Perfils del paquet , {check} Perfils admesos, la sincronització no és compatible , {check} Perfils admesos, la sincronització no és compatible , {check} Perfils admesos, la sincronització no és compatible Gestió d'energia {check} {check} {check} Seguiment {check} {check} {check} Constructor Docker {question} {question} {question} Construeix la imatge Docker amb el SO {check} {check} {check} Constructor de Kiwi {cross} {cross} {cross} Construeix la imatge de Kiwi amb el SO {cross} {cross} {cross} s Accions recurrents {check} {check} {check} s AppStreams N/A N/A N/A Yomi N/A N/A N/A

source: Supported Clients and Features
ca: Clients i característiques compatibles
ja: サポートされているクライアントと機能
ko: 지원되는 클라이언트 및 기능
zh_cn: 支持的客户端和功能

source: {productname} is compatible with a range of client technologies. You can install Salt clients running {sle} or another Linux operating system, with a range of hardware options.
ca: {productname} és compatible amb una sèrie de tecnologies de clients. Podeu instal·lar clients Salt executant {sle} o un altre sistema operatiu Linux, amb una sèrie d'opcions de maquinari.

source: This section contains summary of supported client systems. For a detailed list of features available on each client, see the following pages.
ca: Aquesta secció conté un resum dels sistemes de clients compatibles. Per obtenir una llista detallada de les característiques disponibles a cada client, consulteu les pàgines següents.
ja: このセクションには、サポートされているクライアントシステムのまとめが含まれています。それぞれのクライアントで使用できる機能の詳細な一覧については、次のページを参照してください。
ko: 이 섹션에는 지원되는 클라이언트 시스템에 관한 요약이 포함되어 있습니다. 각 클라이언트에서 사용할 수 있는 기능의 상세 목록은 다음 페이지를 참조하십시오.
zh_cn: 本章提供了支持的客户端系统摘要。有关每个客户端上可用功能的详细列表，请参见后面的页面。

source: Supported Client Systems
ca: Sistemes de client compatibles
ja: サポートされているクライアントシステム
ko: 지원되는 클라이언트 시스템
zh_cn: 支持的客户端系统

source: Client operating system is supported by the organization that supplies the operating system. The versions and SP levels must be under general support (normal or LTSS) to be supported with {productname}. For details on supported product versions, see https://www.suse.com/lifecycle.
ca: Les versions del sistema operatiu del client i els nivells SP han d'estar sota suport general (normal o LTSS) per ser compatible amb {productname}. Per obtenir més informació sobre les versions de productes compatibles, vegeu https://www.suse.com/lifecycle.

source: Supported client operating systems are listed in this table. The icons in the table indicate:
ca: Les accions disponibles per al seu ús en SSM es llisten en aquesta taula. Les icones d'aquesta taula indiquen:

source: {check} clients running this operating system are supported by {suse}
ca: {check} clients que executen aquest sistema operatiu són compatibles amb {suse}
ja: {check}このオペレーティングシステムを実行しているクライアントは{suse}でサポートされています。
ko: {check} 이 운영 체제를 실행하는 클라이언트를 {suse}에서 지원합니다.
zh_cn: {check} 运行此操作系统的客户端受 {suse} 支持

source: {cross} clients running this operating system are not supported by {suse}
ca: {cross} clients que executen aquest sistema operatiu no són compatibles amb {suse}
ja: {cross}このオペレーティングシステムを実行しているクライアントは{suse}ではサポートされていません。
ko: {cross} 이 운영 체제를 실행하는 클라이언트를 {suse}에서 지원하지 않습니다.
zh_cn: {cross} 运行此操作系统的客户端不受 {suse} 支持

source: {question} clients are under consideration, and may or may not be supported at a later date.
ca: {question} clients estan sota consideració i poden o no ser admesos més tard.
ja: {question}クライアントは検討中であり、後日使用できる場合と、使用できない場合があります。
ko: {question} 이 클라이언트는 현재 지원 고려 중이며, 이후에 지원될 수도 있고 지원되지 않을 수도 있습니다.
zh_cn: {question} 客户端正在考虑之中，日后可能受支持，也可能不受支持。

source: The operating system running on a client is supported by the organization that supplies the operating system.
ca: El sistema operatiu que s'executa en un client és recolzat per l'organització que subministra el sistema operatiu.
ja: クライアントで実行されているオペレーティングシステムは、オペレーティングシステムを提供している組織によってサポートされています。
ko: 클라이언트에서 실행되는 운영 체제는 운영 체제를 제공하는 조직이 지원합니다.
zh_cn: 客户端上运行的操作系统由提供操作系统的组织支持。

source: Supported Client Systems and Architectures
ca: Clients i característiques compatibles

source: | Operating System | {x86_64} | {ppc64le} | {ibmz} | {aarch64} | {sle} 16, 15, 12 | {check} | {check} | {check} | {check} | {sles} for SAP 16, 15, 12 | {check} | {check} | {cross} | {cross} | {sle-micro} | {check} | {cross} | {cross} | {check} | {sl-micro} 6.1, 6.0 | {check} | {cross} | {cross} | {check} | {leap} 15 | {check} | {check} | {cross} | {check} | {leap} 16 | {check} | {check} | {check} | {check} | {sll} 9, 8, 7 | {check} | {cross} | {cross} | {cross} | {sles} ES 8, 7 | {check} | {cross} | {cross} | {cross} | {almalinux} 9, 8 | {check} | {cross} | {cross} | {check} | {amazon} 2023, 2 | {check} | {cross} | {cross} | {check} | {centos} 7 | {check} | {cross} | {cross} | {check} | {debian} 12 (*) | {check} | {cross} | {cross} | {cross} | {oes} 24.4, 23.4 | {check} | {cross} | {cross} | {cross} | {oracle} 9, 8, 7 | {check} | {cross} | {cross} | {check} | {rhel} 9, 8, 7 | {check} | {cross} | {cross} | {cross} | {rocky} 9, 8 | {check} | {cross} | {cross} | {check} | {ubuntu} 24.04, 22.04 (*) | {check} | {cross} | {cross} | {cross}
ca: | Sistema operatiu | {x86_64} | {ppc64le} | {ibmz} | {aarch64} | {sle} 16, 15, 12 | {check} | {check} | {check} | {check} | {sles} for SAP 16, 15, 12 | {check} | {check} | {cross} | {cross} | {sle-micro} | {check} | {cross} | {cross} | {check} | {sl-micro} 6.1, 6.0 | {check} | {cross} | {cross} | {check} | {leap} 15 | {check} | {check} | {cross} | {check} | {leap} 16 | {check} | {check} | {check} | {check} | {sll} 9, 8, 7 | {check} | {cross} | {cross} | {cross} | {sles} ES 8, 7 | {check} | {cross} | {cross} | {cross} | {almalinux} 9, 8 | {check} | {cross} | {cross} | {check} | {amazon} 2023, 2 | {check} | {cross} | {cross} | {check} | {centos} 7 | {check} | {cross} | {cross} | {check} | {debian} 12 (*) | {check} | {cross} | {cross} | {cross} | {oes} 24.4, 23.4 | {check} | {cross} | {cross} | {cross} | {oracle} 9, 8, 7 | {check} | {cross} | {cross} | {check} | {rhel} 9, 8, 7 | {check} | {cross} | {cross} | {cross} | {rocky} 9, 8 | {check} | {cross} | {cross} | {check} | {ubuntu} 24.04, 22.04 (*) | {check} | {cross} | {cross} | {cross}

source: | Operating System | {x86_64} | {ppc64le} | {ibmz} | {aarch64} | {arm64} / {armhf} | {sle} 16, 15, 12 | {check} | {check} | {check} | {check} | {cross} | {sles} for SAP 16, 15, 12 | {check} | {check} | {cross} | {cross} | {cross} | {sle-micro} | {check} | {cross} | {cross} | {check} | {cross} | {sl-micro} | {check} | {cross} | {cross} | {check} | {cross} | {leap} Micro | {check} | {cross} | {cross} | {check} | {cross} | {opensuse} {tumbleweed} | {check} | {cross} | {cross} | {check} | {cross} | {leap} 15 | {check} | {cross} | {cross} | {check} | {cross} | {leap} 16 | {check} | {check} | {check} | {check} | {cross} | {alibabaclo} 2 | {check} | {cross} | {cross} | {check} | {cross} | {almalinux} 9, 8 | {check} | {cross} | {cross} | {check} | {cross} | {amazon} 2003, 2 | {check} | {cross} | {cross} | {check} | {cross} | {centos} 7 | {check} | {check} | {cross} | {check} | {cross} | {debian} 12 (*) | {check} | {cross} | {cross} | {cross} | {cross} | {openeuler} 22.03 | {check} | {cross} | {cross} | {cross} | {cross} | {oes} 24.4, 23.4 | {check} | {cross} | {cross} | {cross} | {cross} | {oracle} 9, 8, 7 | {check} | {cross} | {cross} | {check} | {cross} | {raspberrypios} 12 | {cross} | {cross} | {cross} | {cross} | {check} | {rhel} 9, 8, 7 | {check} | {cross} | {cross} | {cross} | {cross} | {rocky} 9, 8 | {check} | {cross} | {cross} | {check} | {cross} | {ubuntu} 24.04, 22.04, 20.04 (*) | {check} | {cross} | {cross} | {cross} | {cross}
ca: | Sistema operatiu | {x86_64} | {ppc64le} | {ibmz} | {aarch64} | {arm64} / {armhf} | {sle} 16, 15, 12 | {check} | {check} | {check} | {check} | {cross} | {sles} for SAP 16, 15, 12 | {check} | {check} | {cross} | {cross} | {cross} | {sle-micro} | {check} | {cross} | {cross} | {check} | {cross} | {sl-micro} | {check} | {cross} | {cross} | {check} | {cross} | {leap} Micro | {check} | {cross} | {cross} | {check} | {cross} | {opensuse} {tumbleweed} | {check} | {cross} | {cross} | {check} | {cross} | {leap} 15 | {check} | {cross} | {cross} | {check} | {cross} | {leap} 16 | {check} | {check} | {check} | {check} | {cross} | {alibabaclo} 2 | {check} | {cross} | {cross} | {check} | {cross} | {almalinux} 9, 8 | {check} | {cross} | {cross} | {check} | {cross} | {amazon} 2003, 2 | {check} | {cross} | {cross} | {check} | {cross} | {centos} 7 | {check} | {check} | {cross} | {check} | {cross} | {debian} 12 (*) | {check} | {cross} | {cross} | {cross} | {cross} | {openeuler} 22.03 | {check} | {cross} | {cross} | {cross} | {cross} | {oes} 24.4, 23.4 | {check} | {cross} | {cross} | {cross} | {cross} | {oracle} 9, 8, 7 | {check} | {cross} | {cross} | {check} | {cross} | {raspberrypios} 12 | {cross} | {cross} | {cross} | {cross} | {check} | {rhel} 9, 8, 7 | {check} | {cross} | {cross} | {cross} | {cross} | {rocky} 9, 8 | {check} | {cross} | {cross} | {check} | {cross} | {ubuntu} 24.04, 22.04, 20.04 (*) | {check} | {cross} | {cross} | {cross} | {cross}

source: (*) {debian} and {ubuntu} list the {x86_64} architecture as {amd64}.
ca: (*) {debian} i {ubuntu} llisten l'arquitectura {x8664} com a {amd64}.

source: Additional Tools Packages
ca: Paquets d'eines addicionals

source: The ``spacewalk-utils`` and ``spacewalk-utils-extras`` packages can provide additional services and features. Users are advised to stop using the deprecated tools and switch to the alternatives recommended in the documentation.
ca: Els paquets spacewalk-utils i spacewalk-utils-extras poden proporcionar serveis i funcions addicionals. Es recomana als usuaris que deixin d'usar les eines obsoletes i canviïn a les alternatives recomanades a la documentació.

source: The ``spacewalk-utils`` package in {productname} is fully supported by {suse}, and contains these tools:
ca: El paquet spacewalk-utils-extras a {productname} té un suport limitat per part de {suse}.
ja: {productname}``spacewalk-utils``パッケージは{suse}では完全にサポートされていて、次のツールが含まれています。
ko: {productname} ``spacewalk-utils`` 패키지는 {suse}가 완전히 지원하며 다음과 같은 도구를 포함합니다.
zh_cn: {suse} 完全支持 {productname}``spacewalk-utils`` 软件包，该软件包中包含以下工具：

source: Spacewalk Utilities
ca: Utilitats de passeig espacial
ja: Spacewalkのユーティリティ
ko: Spacewalk 유틸리티
zh_cn: Spacewalk 实用程序

source: | Tool Name | Description | Deprecated? | ``spacewalk-common-channels`` | Add channels not provided by {scclongform} | | ``spacewalk-hostname-rename`` | Change the hostname of the {productname} Server | | ``spacewalk-clone-by-date`` | Clone channels by a specific date. This is deprecated tool and user should switch to CLM API. | {check} | ``spacewalk-sync-setup`` | Set up ISS master and slave organization mappings | {check} | ``spacewalk-manage-channel-lifecycle`` | Manage channel lifecycles. This is deprecated tool and user should switch to CLM API. | {check}
ca: | Nom de l'eina | Descripció | Obsoleta? | ``spacewalk-common-channels`` | Afegeix canals no proporcionats per {scclongform} | | ``spacewalk-hostname-rename`` | Canvia el nom d'amfitrió del servidor {productname} | | ``spacewalk-clone-by-date`` | Clona canals per una data específica. Aquesta és una eina obsoleta i l'usuari ha de canviar a l'API CLM. | {check} | ``spacewalk-sync-setup`` | Configura els mapes d'organització mestre i esclau de l'ISS | {check} | ``spacewalk-manage-channel-lifecycle`` | Gestiona els cicles de vida dels canals. Aquesta és una eina obsoleta i l'usuari ha de canviar a l'API CLM. | {check}

source: The ``spacewalk-utils-extras`` package in {productname} has limited support by {suse}.
ca: El paquet spacewalk-utils-extras a {productname} té un suport limitat per part de {suse}.
ja: {productname} ``spacewalk-utils-extras``パッケージは{suse}では限定的にサポートされています。
ko: {productname} ``spacewalk-utils-extras`` 패키지는 {suse}가 제한적으로 지원합니다.
zh_cn: {suse} 在 {productname}{nbsp}4.1 及更高版本中对 ``spacewalk-utils-extras`` 软件包提供的支持有限。

source: System Groups
ca: Grups del sistema
ja: システムグループ
ko: 시스템 그룹
zh_cn: 系统组

source: You can use system groups to make it easier to manage a large number of clients. Groups can be used to perform bulk actions on clients such as applying updates, configuration channels, salt states, or formulas.
ca: Podeu utilitzar grups del sistema per facilitar la gestió d'un gran nombre de clients. Els grups es poden utilitzar per realitzar accions massives en clients com ara aplicar actualitzacions, canals de configuració, estats de sal o fórmules.
ja: システムグループを使用して、多数のクライアントの管理を簡単にできます。 グループは、更新、設定チャンネル、Saltの状態、または方式の適用など、一括アクションをクライアントで実行するために使用できます。
ko: 시스템 그룹을 사용해 다수의 클라이언트를 더 쉽게 관리할 수 있습니다. 그룹을 사용해 업데이트, 구성 채널, salt 상태 또는 수식의 적용과 같은 대량 작업을 클라이언트에서 수행할 수 있습니다.
zh_cn: 通过系统组，您可以更轻松地管理大量客户端。组可用于对客户端执行批量操作，例如应用更新、配置通道、Salt 状态或公式。

source: You can organize clients into groups in any way that works for your environment. For example, you could organize clients on which operating system is installed, which physical location they are in, or the type of workload they are handling. Clients can be in any number of groups, so you can define your groups in different ways.
ca: Pots organitzar clients en grups de qualsevol manera que funcioni per al teu entorn. Per exemple, es podrien organitzar clients en quin sistema operatiu està instal·lat, en quina ubicació física es troben o el tipus de càrrega de treball que estan manejant. Els clients poden estar en qualsevol nombre de grups, de manera que podeu definir els vostres grups de diferents maneres.
ja: 使用している環境で動作する方法でクライアントをグループに編成できます。 たとえば、オペレーティングシステムがインストールされているクライアント、クライアントがある物理的な場所、または処理しているワークロードの種類を編成できます。 クライアントは、任意の数のグループに属することができるため、さまざまな方法でグループを定義できます。
ko: 환경에 적합한 방식으로 클라이언트를 그룹으로 편성할 수 있습니다. 예를 들어 클라이언트를 설치되는 운영 체제, 있어야 할 물리적 위치 또는 처리하는 워크로드 유형에 따라 체계적으로 편성할 수 있습니다. 클라이언트가 속할 수 있는 그룹의 수에는 제한이 없으므로 그룹을 다양한 방식으로 정의할 수 있습니다.
zh_cn: 您可以采用任何适合环境的方式来对客户端分组。例如，可以按客户端上安装的操作系统、所在的实际位置或所处理的工作负载类型来组织客户端。客户端可以划分到任意数量的组中，因此您可以采用不同的方式来定义组。

source: When you have clients organized into groups, you can perform updates on all clients in one or more groups, or on intersections between groups. For example, you can define one group for all clients with web server software, and another group for all SLES clients. You can then perform updates on all clients with web server software, or use the intersection between the groups, and update all SLES clients with web server software.
ca: Quan tingueu clients organitzats en grups, podeu realitzar actualitzacions de tots els clients en un o més grups, o en interseccions entre grups. Per exemple, podeu definir un grup per a tots els clients amb programari de servidor web, i un altre grup per a tots els clients SLES. A continuació, podeu realitzar actualitzacions en tots els clients amb programari de servidor web, o utilitzar la intersecció entre els grups, i actualitzar tots els clients SLES amb programari de servidor web.

source: Create Groups
ca: Crea grups
ja: グループの作成
ko: 그룹 생성
zh_cn: 创建组

source: You need to create some groups before you can use them to organize your clients.
ca: Heu de crear alguns grups abans de poder utilitzar-los per organitzar els vostres clients.
ja: グループを使用してクライアントを編成する前にグループを作成する必要があります。
ko: 몇 개의 그룹을 먼저 생성해야 이 그룹을 사용해 클라이언트를 편성할 수 있습니다.
zh_cn: 在使用组对客户端分组之前，需要先创建一些组。

source: Procedure: Creating a New System Group
ca: Procediment: Creació d'un nou grup de sistema
ko: 절차: 새 시스템 그룹 생성
zh_cn: 过程：创建新系统组

source: In the {productname} {webui}, navigate to menu:Systems[System Groups].
ca: A {productname} {webui}, navegueu al menú:Systems[Systems Groups].
ja: {productname}の{webui}で、menu:システム[システムグループ]に移動します。
ko: {productname} {webui}에서 menu:시스템[시스템 그룹]으로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[系统组]。

source: Give your new group a name and a description.
ca: Doneu al vostre nou grup un nom i una descripció.
ja: 新しいグループの名前と説明を指定します。
ko: 새 그룹에 이름 및 설명을 부여합니다.
zh_cn: 指定新组的名称和说明。

source: Click btn:[Create Group] to save your group.
ca: Feu clic a btn:[Crea un grup] per a desar el grup.
ja: btn:[グループの作成]をクリックしてグループを保存します。
ko: btn:[그룹 생성]을 클릭하여 그룹을 저장합니다.
zh_cn: 单击 btn:[创建组] 以保存组。

source: Repeat for each group you require.
ca: Repeteix per a cada grup que necessitis.
ja: 必要な各グループで操作を繰り返します。
ko: 필요한 각 그룹에 이 작업을 반복합니다.
zh_cn: 对需要创建的每个组重复以上步骤。

source: Add Clients to Groups
ca: Afegeix clients a grups
ja: グループにクライアントを追加する
ko: 클라이언트를 그룹에 추가
zh_cn: 将客户端添加到组

source: You can add individual clients to your groups, or add multiple clients at the same time.
ca: Podeu afegir clients individuals als vostres grups, o afegir diversos clients al mateix temps.
ja: 個々のクライアントをグループに追加したり、複数のクライアントを同時に追加できます。
ko: 개별 클라이언트를 그룹에 추가하거나 여러 클라이언트를 동시에 추가할 수 있습니다.
zh_cn: 您可以向组中添加单个客户端，也可以同时添加多个客户端。

source: Procedure: Adding A Single Client to a Group
ca: Procediment: Afegir un client únic a un grup
ja: プロシージャ: 1つのクライアントのグループへの追加
ko: 절차: 단일 클라이언트를 그룹에 추가
zh_cn: 过程：将单个客户端添加到组

source: In the {productname} {webui}, navigate to menu:Systems[System List] and click the name of the client to add.
ca: A {productname} {webui}, navegueu al menú:Systems[Llista de sistemes] i feu clic al nom del client per afegir-lo.
ja: {productname}の{webui}で、menu:システム[システム一覧]に移動し、追加するクライアントの名前をクリックします。
ko: {productname} {webui}에서 menu:시스템[시스템 목록]으로 이동하여 추가할 클라이언트의 이름을 클릭합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[系统列表]，然后单击要添加的客户端的名称。

source: Navigate to the menu:Groups[Join] tab.
ca: Navega a la pestanya menú:Grups[Uneix].
ja: menu:グループ[参加]タブに移動します。
ko: menu:그룹[조인] 탭으로 이동합니다.
zh_cn: 导航到menu:组[加入]选项卡。

source: Check the group to join and click btn:[Join Selected Groups].
ca: Marqueu el grup per unir-vos i feu clic a btn:[Uneix els grups seleccionats].
ja: 参加するグループを確認し、btn:[選択したグループに参加]をクリックします。
ko: 조인할 그룹의 확인란을 선택하고 btn:[선택한 그룹 조인]을 클릭합니다.
zh_cn: 选中要加入的组，然后单击 btn:[加入所选的组]。

source: Procedure: Adding Multiple Clients to a Group
ca: Procediment: Afegir múltiples clients a un grup
ja: プロシージャ: 複数のクライアントのグループへの追加
ko: 절차: 여러 클라이언트를 그룹에 추가
zh_cn: 过程：将多个客户端添加到组

source: In the {productname} {webui}, navigate to menu:Systems[System Groups] and click the name of the group to add clients to.
ca: A {productname} {webui}, navegueu al menú:Systems[System Groups] i feu clic al nom del grup per afegir clients.
ja: {productname}の{webui}で、menu:システム[システム一覧]に移動し、クライアントを追加するグループの名前をクリックします。
ko: {productname} {webui}에서 menu:시스템[시스템 그룹]으로 이동하여 클라이언트를 추가할 그룹의 이름을 클릭합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[系统列表]，然后单击要向其添加客户端的组的名称。

source: Navigate to the [guimenu]``Target systems`` tab.
ca: Navega a la pestanya [guimenu].Target systems..
ja: ［[guimenu]``ターゲットシステム``］タブに移動します。
ko: [guimenu]``대상 시스템`` 탭으로 이동합니다.
zh_cn: 导航到[guimenu]``目标系统``选项卡。

source: Check the clients to add and click btn:[Add Systems].
ca: Consulta els clients per afegir i fer clic a btn:[Afegeix sistemes].
ja: 追加するクライアントを確認して、btn:[システムの追加]をクリックします。
ko: 추가할 클라이언트의 확인란을 선택하고 btn:[시스템 추가]를 클릭합니다.
zh_cn: 选中要添加的客户端，然后单击 btn:[添加系统]。

source: Procedure: Adding Multiple Clients to a Group with SSM
ca: Procediment: Afegir múltiples clients a un grup amb SSM
ja: プロシージャ: SSMで複数のクライアントをグループに追加する
ko: 절차: SSM으로 여러 클라이언트를 그룹에 추가
zh_cn: 过程：使用 SSM 将多个客户端添加到组
