Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: Build the ISO file with your chosen profile and distribution:
ca: Construeix el fitxer ISO amb el perfil i la distribució triats:
ja: 選択したプロファイルおよびディストリビューションでISOファイルを構築します。
ko: 다음과 같이 선택한 프로파일 및 배포로 ISO 파일을 빌드합니다.
zh_cn: 使用您选择的配置文件和发行套件构建 ISO 文件：

source: cobbler buildiso --iso=/tmp/SLE_15-sp1.iso --profiles=SLE_15-sp1:1:Example --distro=SLE_15-sp1
ca: cobbler buildiso --iso//tmp/SLE15-sp1.iso --profilessSLE15-sp1:1:Exemple --distro-SLE15-sp1

source: For more information about using CD-ROMs to provision clients, see xref:client-configuration:autoinst-cdrom.adoc[].
ca: Per obtenir més informació sobre l'ús de CD-ROM per proveir clients, vegeu xref:client-configuration:autoinst-cdrom.adoc[].
ja: CD-ROMを使用したクライアントのプロビジョニングの詳細については、xref:client-configuration:autoinst-cdrom.adoc[]を参照してください。
ko: CD-ROM을 사용하여 클라이언트를 프로비저닝하는 방법은 xref:client-configuration:autoinst-cdrom.adoc[]를 참조하십시오.
zh_cn: 有关使用 CD-ROM 置备客户端的详细信息，请参见 xref:client-configuration:autoinst-cdrom.adoc[]。

source: Major Version Upgrade
ca: Prepara't per actualitzar

source: The clients must have the latest available service pack (SP) for the installed operating system, with all the latest updates applied. Before you start, ensure that the system is up to date and all updates have been installed successfully.
ca: Els clients han de disposar de l'últim paquet de serveis disponible (SP) per al sistema operatiu instal·lat, amb totes les últimes actualitzacions aplicades. Abans de començar, assegureu-vos que el sistema estigui actualitzat i que totes les actualitzacions s'hagin instal·lat correctament.

source: The upgrade is controlled by {yast} and {ay}, it does not use Zypper.
ca: L'actualització està controlada per {yast} i {ay}, no utilitza Zypper.
ja: アップグレードは、{yast}および{ay}によって制御されます。Zypperは使用しません。
ko: 업그레이드는 {yast} 및 {ay}에서 제어하며 Zypper는 사용하지 않습니다.
zh_cn: 升级由 {yast} 和 {ay} 控制，该过程不使用 Zypper。

source: Prepare to Migrate
ca: Prepara per a migrar

source: Before you can migrate your client from SLE{nbsp}12 to SLE{nbsp}15, you need to:
ca: Abans de poder actualitzar els teus clients, has de fer aquests preparatius:

source: Prepare installation media
ca: Prepara el mitjà d'instal·lació
ja: インストールメディアの準備
ko: 설치 미디어 준비
zh_cn: 准备安装媒体

source: Declare an autoinstallation distribution
ca: Declara una distribució autoinstal·lable

source: Prepare Installation Media
ca: Prepara el mitjà d'instal·lació

source: Procedure: Preparing Installation Media
ca: Procediment: Preparació dels mitjans d'instal·lació
ko: 프로시저: 설치 미디어 준비

source: On the container host, download an ISO image with the installation sources.
ca: A l'amfitrió del contenidor, descarregueu una imatge ISO amb les fonts d'instal·lació.

source: Use [command]``mgradm`` to import the installation data from the ISO image:
ca: Utilitzeu [ordre] themgradm the per a importar les dades d'instal·lació des de la imatge ISO:

source: mgradm distribution copy <image_name>.iso <image_name>
ca: còpia de distribució de mgradm <imagename>.iso <imagename>

source: This image can be used for multiple autoinstallation distributions.
ca: Aquesta imatge es pot utilitzar per a múltiples distribucions d'autoinstal·lació.

source: Declare an Autoinstallation Distribution
ca: Declara una distribució autoinstal·lable

source: Procedure: Declaring an Autoinstallation Distribution
ca: Procediment: Declaració d'una distribució autoinstal·lable

source: Click [guimenu]``Create Distribution`` , and complete these fields:
ca: Feu clic a [guimenu]:Crea la distribució`` i completeu aquests camps:

source: In the [guimenu]``Distribution Label`` field, enter a name to identify your autoinstallation distribution. For example, ``sles15sp6-x86_64``.
ca: Al camp [guimenu].Etiqueta de distribució., introduïu un nom per a identificar la vostra distribució autoinstal·lable.

source: In the [guimenu]``Tree Path`` field, enter the path to the installation media you already saved.
ca: Al camp [guimenu].Treu el camí., introduïu el camí al mitjà d'instal·lació desat al vostre servidor {productname}.

source: Select the matching [guimenu]``Base Channel``. This must match the installation media.
ca: Al camp [guimenu].Canal base., seleccioneu el canal que coincideixi amb l'origen de la instal·lació.

source: Select the [guimenu]``Installer Generation``. This must match the installation media.
ca: Al camp [guimenu].Generació d'instal·ladors., seleccioneu la versió del sistema operatiu que coincideixi amb la font d'instal·lació.

source: OPTIONAL: Specify kernel options to use when booting this distribution. There are multiple ways to provide kernel options. Only add options here that are generic for the distribution.
ca: OPCIONAL: Especifiqueu les opcions del nucli a usar en arrencar aquesta distribució. Hi ha múltiples maneres de proporcionar opcions del nucli. Afegiu aquí només opcions que siguin genèriques per a la distribució.

source: Click btn:[Create Autoinstallable Distribution].
ca: Feu clic a btn:[Crea la distribució autoinstal·lable].

source: Create an Activation Key
ca: Crea una clau d'activació
ja: アクティベーションキーの作成
ko: 활성화 키 생성
zh_cn: 创建激活密钥

source: For example, to switch from the old SLE{nbsp}12 base channel to the new SLE{nbsp}15 channel, you need an activation key.
ca: Per exemple, per canviar del canal base SLE{nbsp}12 antic al canal SLE{nbsp}15 nou, necessiteu una clau d'activació.

source: In the {productname} Server {webui}, navigate to menu:Systems[Activation Keys] and click [guimenu]``Create Key``.
ca: Al {productname} Servidor {webui}, navegueu al menú:Sistemes[Tecles d'activitat] i feu clic a [guimenu].Crea clau..
ja: {productname}サーバの{webui}で、menu:システム[アクティベーションキー]に移動し、［[guimenu]``キーの作成``］をクリックします。
ko: {productname} 서버 {webui}에서 menu:시스템[활성화 키]로 이동하여 [guimenu]``키 생성``을 클릭합니다.
zh_cn: 在 {productname} 服务器 {webui} 中，导航到menu:系统[激活密钥]，然后单击[guimenu]``创建密钥``。

source: Enter a description for your key.
ca: Introduïu una descripció per a la vostra clau.
ja: キーの説明を入力します。
ko: 키에 대한 설명을 입력합니다.
zh_cn: 输入密钥说明。

source: Enter a key or leave it blank to generate an automatic key.
ca: Introduïu una clau o deixeu-la en blanc per a generar una clau automàtica.
ja: キーを入力するか空白のままにし、自動キーを生成します。
ko: 키를 입력하거나 공백으로 두어 자동 키를 생성합니다.
zh_cn: 输入密钥或将其留空以生成自动密钥。

source: OPTIONAL: If you want to limit the usage, enter your value in the [guimenu]``Usage`` text field.
ca: OPCIONAL: Si voleu limitar l'ús, introduïu el vostre valor al camp de text [guimenu].Ús..
ja: オプション: 使用量を制限する場合、［[guimenu]``使用量``］テキストフィールドに値を入力します。
ko: 옵션: 사용을 제한하려면 [guimenu]``사용`` 텍스트 필드에 값을 입력합니다.
zh_cn: 可选：如果您要限制使用次数，请在[guimenu]``使用``文本字段中输入值。

source: Select the [systemitem]``SLE-Product-SLES15-SP6-Pool for x86_64`` base channel.
ca: Seleccioneu el [systemitem].SLE-Product-SLES15-SP6-Pool per al canal base x8664..

source: OPTIONAL: Select any [guimenu]``Add-On System Types``.
ca: OPCIONAL: Seleccioneu qualsevol [guimenu].Afegeix tipus de sistema..
ja: オプション: ［[guimenu]``付属エンタイトルメント``］を選択します。
ko: 옵션: [guimenu]``추가 시스템 유형``을 선택합니다.
zh_cn: 可选：选择任何[guimenu]``附加系统类型``。

source: For more information, see {sles-base-os-documentation}/article-modules.html.
ca: Per a més informació, vegeu xref:client-configuration:autoinst-profiles.adoc[].

source: Click btn:[Create Activation Key].
ca: Feu clic a btn:[Crea la clau d'activació].
ja: btn:[アクティベーションキーの作成]をクリックします。
ko: btn:[활성화 키 생성]을 클릭합니다.
zh_cn: 单击 btn:[创建激活密钥]。

source: Click the [guimenu]``Child Channels`` tab and select the required channels.
ca: Feu clic a la pestanya [guimenu].Canals infantils. i seleccioneu els canals requerits.
ja: ［[guimenu]``子チャンネル``］タブをクリックし、必要なチャンネルを選択します。
ko: [guimenu]``하위 채널`` 탭을 클릭하고 필요한 채널을 선택합니다.
zh_cn: 单击[guimenu]``子通道``选项卡，然后选择所需通道。

source: Click btn:[Update Key].
ca: Feu clic a btn:[Clau d'actualització].
ja: btn:[キーの更新]をクリックします。
ko: btn:[키 업데이트]를 클릭합니다.
zh_cn: 单击 btn:[更新密钥]。

source: Create an Autoinstallation Profile
ca: Crea un perfil d'instal·lació automàtica
ja: 自動インストールプロファイルの作成
ko: 자동 설치 프로파일 생성
zh_cn: 创建自动安装配置文件

source: Autoinstallation profiles contain all the installation and configuration data needed to install a system. They can also contain scripts to be executed after the installation is complete. For example scripts that you can use as a starting point, see https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST.
ca: Els perfils d'autoinstal·lació contenen totes les dades d'instal·lació i configuració necessàries per instal·lar un sistema. També poden contenir scripts que s'executaran després de completar la instal·lació. Per exemple scripts que podeu utilitzar com a punt de partida, vegeu https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST.
ja: 自動インストールプロファイルには、システムをインストールするために必要なインストールデータおよび設定データがすべて含まれています。 インストール完了後に実行するスクリプトを含めることもできます。 手始めに使用できるスクリプトのサンプルは、link:https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST[]を参照してください。
ko: 자동 설치 프로파일에는 시스템을 설치하는 데 필요한 모든 설치 및 구성 데이터가 포함되어 있습니다. 설치 완료 후 실행될 스크립트도 포함할 수 있습니다. 시작 지점으로 사용할 수 있는 예제 스크립트는 https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST[]를 참조하십시오.
zh_cn: 自动安装配置文件包含安装系统所需的所有安装和配置数据，还包含在完成安装后需要执行的脚本。例如，可用作着手点的脚本，请参见 link:https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST[]。

source: For valid {ay} upgrade settings, see https://doc.opensuse.org/projects/autoyast/#CreateProfile-upgrade.
ca: Per a més informació sobre {ay}, vegeu https://doc.opensuse.org/projects/autoyast/.

source: In the {productname} {webui}, navigate to menu:Systems[Autoinstallation > Profiles] and upload your autoinstallation profile script.
ca: A {productname} {webui}, navegueu al menú:Systems[Autoinstallation . Profiles] i carregueu el vostre script de perfil d'autoinstal·lació.
ja: {productname}の{webui}で、menu:システム[自動インストール > プロファイル]に移動し、自動インストールプロファイルのスクリプトをアップロードします。
ko: {productname} {webui}에서 menu:시스템[자동 설치 > 프로파일]로 이동하여 자동 설치 프로파일 스크립트를 업로드합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[自动安装 > 配置文件]，然后上载自动安装配置文件脚本。

source: For example scripts that you can use as a starting point, see:
ca: Per exemple scripts que podeu utilitzar com a punt de partida, vegeu:

source: In the ``Kernel Options`` field, type ``autoupgrade=1``.
ca: Al camp .Opcions del nucli., escriviu .autoupgrade11..
ja: ［``カーネルオプション``］フィールドに``autoupgrade=1``と入力します。
ko: ``커널 옵션`` 필드에 ``autoupgrade=1``을 입력합니다.
zh_cn: 在``内核选项``字段中，键入 ``autoupgrade=1``。

source: Optionally, you can also include the ``Y2DEBUG=1`` option. The debug setting is not required but can help with investigating any future problems you might encounter.
ca: Opcionalment, també podeu incloure l'opció .Y2DEBUG11.. La configuració de depuració no és necessària, però pot ajudar a investigar qualsevol problema futur que pugueu trobar.
ja: ``Y2DEBUG=1``オプションを含めることもできます。 デバッグ設定は不要ですが、問題が発生したときの調査に役立ちます。
ko: 선택 사항으로 ``Y2DEBUG=1`` 옵션을 포함해도 됩니다. 디버그 설정은 필수까지는 아니지만, 향후 발생 가능한 문제를 조사하는 데 유용하게 사용될 수 있습니다.
zh_cn: （可选）您也可以包含 ``Y2DEBUG=1`` 选项。调试设置不是必需的设置，不过此设置有助于对您未来可能遇到的任何问题进行查错。

source: Clients running in Azure cloud must add ``textmode=1 console=ttyS0`` to ``Kernel Options``.
ca: Els clients que s'executen al núvol d'Azure han d'afegir .textmode11 console tottyS0. a .Kernel Options..
ja: Azureクラウドで実行されているクライアントは、［``カーネルオプション``］に``textmode=1 console=ttyS0``を追加する必要があります。
ko: Azure 클라우드에서 실행 중인 클라이언트는 ``커널 옵션``에 ``textmode=1 console=ttyS0``을 추가해야 합니다.
zh_cn: 在 Azure 云中运行的客户端必须将 ``textmode=1 console=ttyS0`` 添加到``内核选项``中。

source: Paste the autoinstallation profile or use the file upload field.
ca: Enganxa el perfil d'autoinstal·lació o utilitza el camp de càrrega de fitxers.
ja: 自動インストールプロファイルを貼り付けるか、またはファイルアップロードフィールドを使用します。
ko: 자동 설치 프로파일을 붙여 넣거나 파일 업로드 필드를 사용합니다.
zh_cn: 粘贴自动安装配置文件或使用文件上载字段。

source: Click btn:[Create] to save.
ca: Feu clic a btn:[Crea] per a desar.
ja: btn:[作成]をクリックして保存します。
ko: btn:[생성]을 클릭하여 저장합니다.
zh_cn: 单击 btn:[创建] 保存设置。

source: When the uploaded profile requires variables to be set, navigate to menu:Systems[Autoinstallation > Profiles], select the profile to edit, and navigate to the [guimenu]``Variables`` tab.
ca: Quan el perfil pujat requereix que s'estableixin variables, navegueu al menú:Sistemes[Autoinstal·lació . Perfils], seleccioneu el perfil a editar i navegueu a la pestanya [guimenu].Variables..
ja: アップロードしたプロファイルで変数を設定する必要がある場合、menu:システム[自動インストール > プロファイル]に移動し、編集するプロファイルを選択し、［[guimenu]``変数``］タブに移動します。
ko: 업로드한 프로파일에 변수를 설정해야 하는 경우 menu:시스템[자동 설치 > 프로파일]로 이동하여 편집할 프로파일을 선택하고 [guimenu]``변수`` 탭으로 이동합니다.
zh_cn: 如果需要为上载的配置文件设置变量，请导航到menu:系统[自动安装 > 配置文件]，选择要编辑的配置文件，然后导航到[guimenu]``变量``选项卡。

source: Specify the required variables, using this format:
ca: Especifiqueu les variables requerides, utilitzant aquest format:
ja: 次のフォーマットを使用して必要な変数を指定します。
ko: 다음 형식을 사용하여 필수 변수를 지정합니다.
zh_cn: 使用以下格式指定所需的变量：

source: Migration
ca: Migració
ja: 移行
ko: 마이그레이션
zh_cn: 迁移

source: Before you begin, check that all the channels referenced in the autoinstallation profile are available and fully synchronized.
ca: Abans de començar, comprova que tots els canals referenciats en el perfil d'autoinstal·lació estan disponibles i totalment sincronitzats.
ja: 自動インストールプロファイルで参照するチャンネルがすべて使用可能で完全に同期していることを開始前に確認してください。
ko: 시작하기 전, 자동 설치 프로파일에서 참조된 모든 채널을 사용할 수 있고 완전히 동기화되었는지 확인합니다.
zh_cn: 在开始前，需检查自动安装配置文件中引用的所有通道是否可用并已完全同步。

source: You can monitor the mirroring progress in [path]``/var/log/rhn/reposync/<channel-label>.log``.
ca: Podeu monitoritzar el progrés de la rèplica a [path]./var/log/rhn/reposync/<channel-label>.log..
ja: [path]``/var/log/rhn/reposync/<channel-label>.log``でミラーリングの進捗状況を監視できます。
ko: [path]``/var/log/rhn/reposync/<channel-label>.log``에서 미러링 프로세스를 모니터링할 수 있습니다.
zh_cn: 您可以在 [path]``/var/log/rhn/reposync/<channel-label>.log`` 中监控镜像进度。

source: Procedure: Migrating
ca: Procediment: Migració
ja: プロシージャ: 移行
ko: 절차: 마이그레이션
zh_cn: 过程：迁移

source: In the {productname} Server {webui}, navigate to [guimenu]``Systems`` and select the client to be upgraded.
ca: Al {productname} Servidor {webui}, navegueu a [guimenu].Sistemes. i seleccioneu el client a actualitzar.
ja: {productname}サーバの{webui}で、［[guimenu]``システム``］に移動し、アップグレードするクライアントを選択します。
ko: {productname} 서버 {webui}에서 [guimenu]``시스템``으로 이동하여 업그레이드할 클라이언트를 선택합니다.
zh_cn: 在 {productname} 服务器 {webui} 中，导航到[guimenu]``系统``，然后选择要升级的客户端。

source: Navigate to the [guimenu]``Provisioning`` tab, and select the autoinstallation profile you uploaded.
ca: Navegueu a la pestanya [guimenu].Provisioning. i seleccioneu el perfil d'autoinstal·lació que heu pujat.
ja: ［[guimenu]``プロビジョニング``］タブに移動し、アップロードした自動インストールプロファイルを選択します。
ko: [guimenu]``조달`` 탭으로 이동하여 업로드한 자동 설치 프로파일을 선택합니다.
zh_cn: 导航到[guimenu]``置备``选项卡，然后选择上载的自动安装配置文件。

source: Click btn:[Schedule Autoinstallation and Finish]. The system downloads the required files, change the bootloader entries, reboot, and start the upgrade.
ca: Feu clic a btn:[Autoinstal·lació de la planificació i Finalitza]. El sistema baixa els fitxers necessaris, canvia les entrades del carregador d'arrencada, reinicia i inicia l'actualització.
ja: btn:[自動インストールをスケジュールしてから終了する]をクリックします。 システムによって、必要なファイルがダウンロードされ、ブートローダのエントリが変更され、再起動され、アップグレードが開始されます。
ko: btn:[자동 설치 일정 잡기 후 완료]를 클릭합니다. 시스템이 필요한 파일을 다운로드하고, 부트로더 항목을 변경하고, 재부팅한 후 업그레이드를 시작합니다.
zh_cn: 单击 btn:[安排自动安装并完成]。系统会下载所需的文件，更改引导加载程序项，重引导并开始升级。

source: Next time the client synchronizes with the {productname} Server, it receives a re-installation job. The re-installation job fetches the new kernel and initrd packages. It also writes a new [path]``/boot/grub/menu.lst`` (GRUB Legacy) or [path]``/boot/grub2/grub.cfg`` (GRUB 2), containing pointers to the new kernel and initrd packages.
ca: La pròxima vegada que el client sincronitzi amb el servidor {productname}, rebrà un treball de reinstal·lació. La tasca de reinstal·lació recupera els paquets nou del nucli i initrd. També escriu un nou [path]./boot/grub/menu.lst. (GRUB Legacy) o [path]./boot/grub2/grub.cfg. (GRUB 2), que conté punters per als nous paquets kernel i initrd.
ja: クライアントは、{productname}サーバと次に同期するときに、再インストールジョブを受け取ります。 再インストールジョブは、新しいカーネルパッケージおよびinitrdパッケージをフェッチします。 また、新しいカーネルパッケージおよびinitrdパッケージへのポインタを含む新しい[path]``/boot/grub/menu.lst`` (GRUB Legacy)または[path]``/boot/grub2/grub.cfg`` (GRUB 2)を書き込みます。
ko: 클라이언트는 다음번에 {productname} 서버와 동기화될 때 재설치 작업을 수신합니다. 재설치 작업은 새로운 커널 및 initrd 패키지를 가져옵니다. 또한 새 커널 및 initrd 패키지에 대한 포인터가 포함된 새로운 [path]``/boot/grub/menu.lst`` (GRUB Legacy) or [path]``/boot/grub2/grub.cfg`` (GRUB 2)를 작성합니다.
zh_cn: 客户端下次与 {productname} 服务器同步时，会收到重新安装作业。重新安装作业会提取新内核和 initrd 软件包，还会写入新的 [path]``/boot/grub/menu.lst`` (GRUB Legacy) 或 [path]``/boot/grub2/grub.cfg`` (GRUB 2)，包含指向新内核和 initrd 软件包的指针。

source: When the client next boots, it uses grub to boot the new kernel with its initrd. PXE booting is not used during this process.
ca: Quan el client arrencarà a continuació, utilitzarà grub per arrencar el nou nucli amb el seu initrd. L'arrencada amb PXE no s'utilitza durant aquest procés.
ja: クライアントが次にブートするとき、grubを使用して、新しいカーネルとそのinitrdをブートします。 PXEブートはこのプロセス中に使用されません。
ko: 클라이언트는 다음번 부팅 시 grub을 사용해 initrd로 새 커널을 부팅합니다. 이 프로세스 중에는 PXE 부팅이 사용되지 않습니다.
zh_cn: 客户端下次引导时，会使用 grub 来引导新内核及其 initrd。此过程中不会使用 PXE 引导。

source: Approximately three minutes after the job was fetched, the client goes down for reboot.
ca: Aproximadament tres minuts després d'obtenir la feina, el client baixa per reiniciar.
ja: ジョブがフェッチされた約3分後に、クライアントは再起動するためにシャットダウンします。
ko: 작업을 가져온 후 약 3분이 지나면 클라이언트는 재부팅을 시작합니다.
zh_cn: 提取作业约 3 分钟后，客户端会关闭以重引导。

source: For clients, use the ``spacewalk/minion_script`` snippet to register the client again after migration has completed.
ca: Per als clients, utilitzeu el fragment thespacewalk/minionscript. per a registrar el client de nou un cop finalitzada la migració.

source: Product Migration
ca: Migració de productes
ja: 製品移行
ko: 제품 마이그레이션
zh_cn: 产品迁移

source: Introduction
ca: Migració de productes

source: Product migration allows you to upgrade SLE-based client systems from an Service Pack (SP) level to a later one. For example, you can migrate {sles}{nbsp}15{nbsp}SP5 to {sles}{nbsp}15{nbsp}SP6. You can also upgrade clients such as {rhel} or {centos} to {sll}.
ca: La migració de productes li permet actualitzar els sistemes de clients basats en SLE des d'un nivell de Service Pack (SP) a un de posterior. Per exemple, podeu migrar {sles}{nbsp}15{nbsp}SP5 a {sles}{nbsp}15{nbsp}SP6. També podeu actualitzar clients com {rhel} o {centos} a {sll}.

source: Product migration requires that all repositories which are enabled on the client and which should be migrated must be valid, otherwise the migration will abort.
ca: La migració de productes requereix que tots els repositoris que estiguin habilitats al client i que s'hagin de migrar siguin vàlids, en cas contrari la migració s'interromprà.

source: {productname} supports the following migration paths:
ca: {productname} admet els següents camins de migració:

source: Migration within the same major version
ca: Migració dins de la mateixa versió principal

source: Product migration is for upgrading within the same major version. You cannot use product migration to migrate from {sles}{nbsp}12 to {sles}{nbsp}15. For more information about major upgrades, see xref:client-configuration:client-upgrades-major.adoc[].
ca: Per actualitzar els clients executant SLE{nbsp}12 a SLE{nbsp}15, l'actualització està automatitzada, però heu de fer alguns passos de preparació abans de començar. Per a més informació, vegeu xref:client-configuration:client-upgrades-major.adoc[].
ja: 製品の移行は、同じメジャーバージョン内でアップグレードするためのものです。 {sles}{nbsp}12から{sles}{nbsp}15への移行には、製品の移行は使用できません。 メジャーアップグレードの詳細については、xref:client-configuration:client-upgrades-major.adoc[]を参照してください。
ko: 제품 마이그레이션은 동일한 주 버전 내에서 업그레이드하기 위한 것입니다. 제품 마이그레이션을 사용하여 {sles}{nbsp}12에서 {sles}{nbsp}15으로 마이그레이트할 수는 없습니다. 주 업그레이드에 대한 자세한 설명은 xref:client-configuration:client-upgrades-major.adoc[]를 참조하십시오.
zh_cn: 产品迁移用于在同一主要版本内升级。您无法通过产品迁移从 {sles}{nbsp}12 迁移到 {sles}{nbsp} 15。有关主要升级的详细信息，请参见 xref:client-configuration :client-upgrades-major.adoc[]。

source: Migration of {leap} to a later minor version or to the corresponding {sles} SP
ca: Migració de {leap} a una versió menor posterior o al corresponent {sles} SP

source: You can also migrate {leap} to a later minor version or to the corresponding {sles} SP level, for example:
ca: També podeu migrar {leap} a una versió menor posterior o al nivell corresponent {sles} SP, per exemple:

source: {leap} 15.5 to 15.6
ca: {leap} 15.5 a 15.6

source: {leap} 15.6 to {sles} 15 SP6
ca: {leap} 15.6 a {sles} 15 SP6

source: Migration of {sles} to the corresponding {slesforsap} SP
ca: Migració de {sles} al corresponent {slesforsap} SP

source: You can also migrate {sles} to the corresponding {slesforsap} SP level, for example:
ca: També podeu migrar {sles} al nivell corresponent {slesforsap} SP, per exemple:

source: {sles} 15 SP5 to {slesforsap} 15 SP5
ca: {sles} 15 SP5 a {slesforsap} 15 SP5

source: In {sles}{nbsp}12 and later, {suse} supports service pack skipping if {scclongform} provides it. For example, you can upgrade from {sles}{nbsp}15 to SP2, without installing SP1.
ca: A {sles}{nbsp}12 i posteriors, {suse} admet l'omissió de paquets de serveis si {scclongform} el proporciona. Per exemple, podeu actualitzar de {sles}{nbsp}15 a SP2, sense instal·lar SP1.

source: For supported {sles} upgrade paths, see link:https://documentation.suse.com/en-us/sles/15-SP6/html/SLES-all/cha-upgrade-paths.html#sec-upgrade-paths-supported[].
ca: Per actualitzar {sles} compatibles, vegeu l'enllaç:https://documentation.suse.com/ca-us/sles/15-SP6/html/SLES-all/cha-upgrade-paths.html].sec-upgrade-paths-supported[].

source: All recommended extensions are automatically enabled when you migrate.
ca: Totes les extensions recomanades s'activen automàticament quan migreu.

source: During migration, {productname} automatically accepts any required licenses (EULAs) before installation.
ca: Durant la migració, {productname} accepta automàticament qualsevol llicència requerida (EULAs) abans de la instal·lació.
ja: 移行中、{productname}は、インストール前に必要なライセンス(EULA)を自動的に受け入れます。
ko: 마이그레이션 과정에서 {productname}는 설치 전에 필요한 모든 라이선스(EULA)를 자동으로 수락합니다.
zh_cn: 迁移期间，{productname} 会在安装前自动接受任何必要的许可协议 (EULA)。

source: Single System Migration
ca: Instal·lació del sistema operatiu
ja: 単一システムの移行
ko: 단일 시스템 마이그레이션
zh_cn: 单系统迁移

source: Before starting the product migration:
ca: Abans d'iniciar la migració del producte:
ja: 製品の移行を開始する前に:
ko: 제품 마이그레이션을 시작하기 전에:
zh_cn: 开始迁移产品之前：

source: Ensure there are no pending updates or patches. Check the [guimenu]``System Status`` on the client system's menu:Details[Overview] page, and install all offered updates or patches. If your client system is not up to date, product migration may fail.
ca: Assegureu-vos que no hi ha actualitzacions pendents o pedaços. Consulteu la pàgina [guimenu].Estat del sistema the al menú del sistema client:Detalls[Vista anterior] i instal·leu totes les actualitzacions o pedaços oferts. Si el vostre sistema de clients no està actualitzat, la migració de productes pot fallar.
ja: 保留中の更新やパッチがないことを確認してください。 クライアントシステムのmenu:詳細[概要]ページの［[guimenu]``システムステータス`` ］を確認し、提供されているすべての更新またはパッチをインストールします。 クライアントシステムが最新でない場合、製品移行が失敗する可能性があります。
ko: 보류 중인 업데이트 또는 패치가 없는지 확인합니다. 클라이언트 시스템 menu:세부 정보[개요] 페이지에서 [guimenu]``시스템 상태`` 를 확인하고 제공된 모든 업데이트 또는 패치를 설치합니다. 클라이언트 시스템이 최신이 아닌 경우 제품 마이그레이션이 실패할 수 있습니다.
zh_cn: 确保没有待处理更新或补丁。请检查客户端系统menu:细节[概览]页面上的[guimenu]``系统状态``，然后安装提供的所有更新或补丁。如果您的客户端系统不是最新的，产品迁移可能会失败。
