Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: [.title]#{productname} {productnumber}#: Client Configuration Guide
ca: [.title] {{productname} {productnumber}:: Guia de configuració del client
ja: [.title]#{productname} {productnumber}#: クライアント設定ガイド
ko: [.title]#{productname} {productnumber}#: 클라이언트 구성 가이드
zh_cn: [.title]#{productname} {productnumber}#: 客户端配置指南

source: xref:client-config-overview.adoc[Client Configuration Guide]
ca: xref:client-config-overview.adoc[Guia de configuració del Client]
ja: xref:client-config-overview.adoc[クライアント設定ガイド]
ko: xref:client-config-overview.adoc[클라이언트 구성 안내서]
zh_cn: xref:client-config-overview.adoc[客户端配置指南]

source: xref:uyuni-client-config-overview.adoc[Client Configuration Guide]
ca: xref:uyuni-client-config-overview.adoc[Guia de configuració del Client]

source: xref:supported-features-sles.adoc[SLES and openSUSE Leap Supported Features]
ca: xref:supported-features-sle-micro.adoc[Característiques suportades per MicroSLE]
ja: xref:supported-features-sles.adoc[SLESおよびopenSUSE Leapでサポートされている機能]
ko: xref:supported-features-sles.adoc[SLES 및 openSUSE Leap 지원 지능]
zh_cn: xref:supported-features-sles.adoc[SLES 和 openSUSE Leap 支持的功能]

source: xref:supported-features-sle-micro.adoc[SLE Micro Supported Features]
ca: xref:supported-features-sle-micro.adoc[Característiques suportades per MicroSLE]
ja: xref:supported-features-sle-micro.adoc[SLES Microでサポートされている機能]
ko: xref:supported-features-sle-micro.adoc[SLE Micro 지원 기능]
zh_cn: xref:supported-features-sle-micro.adoc[SLE Micro 支持的功能]

source: xref:supported-features-sl-micro.adoc[SL Micro Supported Features]
ca: xref:supported-features-sle-micro.adoc[Característiques suportades per MicroSLE]
ja: xref:supported-features-sl-micro.adoc[SL Microでサポートされている機能]
ko: xref:supported-features-sl-micro.adoc[SL Micro 지원 기능]
zh_cn: xref:supported-features-sl-micro.adoc[SL Micro 支持的功能]

source: xref:supported-features-sll.adoc[SUSE Liberty Linux Supported Features]
ca: xref:supported-features-rocky.adoc[Característiques compatibles amb Linux]

source: xref:supported-features-tumbleweed.adoc[openSUSE {tumbleweed} Supported Features]
ca: xref:supported-features-tumbleweed.adoc[openSUSE {tumbleweed} Funcions compatibles]

source: xref:supported-features-opensuse-leap-micro.adoc[openSUSE Leap Micro Supported Features]
ca: xref:supported-features-sle-micro.adoc[Característiques suportades per MicroSLE]

source: xref:supported-features-openeuler.adoc[{openeuler} Supported Features]
ca: xref:supported-features-openeuler.adoc[{openeuler} Funcions compatibles]

source: xref:supported-features-oes.adoc[OES Supported Features]
ca: xref:supported-features-centos.adoc[CentOS Supported Features]

source: xref:supported-features-oracle.adoc[Oracle Supported Features]
ca: xref:supported-features-oracle.adoc[Característiques compatibles amb Oracle]
ja: xref:supported-features-oracle.adoc[Oracleでサポートされている機能]
ko: xref:supported-features-oracle.adoc[Oracle 지원 기능]
zh_cn: xref:supported-features-oracle.adoc[Oracle 支持的功能]

source: xref:supported-features-raspberrypios.adoc[Raspberry Pi OS Supported Features]
ca: xref:supported-features-centos.adoc[CentOS Supported Features]

source: xref:supported-features-rocky.adoc[Rocky Linux Supported Features]
ca: xref:supported-features-rocky.adoc[Característiques compatibles amb Linux]
ja: xref:supported-features-rocky.adoc[Rocky Linuxでサポートされている機能]
ko: xref:supported-features-rocky.adoc[Rocky Linux 지원 기능]
zh_cn: xref:supported-features-rocky.adoc[Rocky Linux 支持的功能]

source: xref:channels.adoc[Software Channels]
ca: xref:channels.adoc[Canals de programari]
ja: xref:channels.adoc[ソフトウェアチャンネル]
ko: xref:channels.adoc[소프트웨어 채널]
zh_cn: xref:channels.adoc[软件通道]

source: xref:repositories.adoc[Software Repositories]
ca: xref:repositories.adoc[Repositoris de programari]
ja: xref:repositories.adoc[ソフトウェアリポジトリ]
ko: xref:repositories.adoc[소프트웨어 리포지토리]
zh_cn: xref:repositories.adoc[软件储存库]

source: xref:products.adoc[Software Products]
ca: xref:products.adoc[Productes de programari]
ja: xref:products.adoc[ソフトウェア製品]
ko: xref:products.adoc[소프트웨어 제품]
zh_cn: xref:products.adoc[软件产品]

source: xref:appstreams.adoc[AppStreams]
ca: xref:system-types.adoc[System Types]

source: xref:bootstrap-repository.adoc[Bootstrap Repository]
ca: xref:bootstrap-repository.adoc[Repositori de Botstrap]
ja: xref:bootstrap-repository.adoc[ブートストラップリポジトリ]
ko: xref:bootstrap-repository.adoc[부트스트랩 리포지토리]
zh_cn: xref:bootstrap-repository.adoc[引导储存库]

source: xref:activation-keys.adoc[Activation Keys]
ca: xref:activation-keys.adoc[Claus d'activació]
ja: xref:activation-keys.adoc[アクティベーションキー]
ko: xref:activation-keys.adoc[활성화 키]
zh_cn: xref:activation-keys.adoc[激活密钥]

source: xref:gpg-keys.adoc[GPG Keys]
ca: xref:gpg-keys.adoc[Tecles GPG]
ko: xref:gpg-keys.adoc[GPG 키]
zh_cn: xref:gpg-keys.adoc[GPG 密钥]

source: xref:contact-methods-intro.adoc[Client Contact Methods]
ca: xref:registration-methods.adoc[Mètodes de registre]

source: xref:contact-methods-default.adoc[Default (Salt)]
ca: xref:contact-methods-saltbundle.adoc[Salt Bundle]

source: xref:contact-methods-saltssh.adoc[SSH Push]
ca: xref:contact-methods-saltbundle.adoc[Salt Bundle]

source: xref:contact-methods-saltssh-tunnel.adoc[SSH Push (With Tunnel)]
ca: xref:contact-methods-saltbundle.adoc[Salt Bundle]

source: xref:registration-overview.adoc[Client Registration]
ca: xref:registration-overview.adoc[Registre Client]
ja: xref:registration-overview.adoc[クライアントの登録]
ko: xref:registration-overview.adoc[클라이언트 등록]
zh_cn: xref:registration-overview.adoc[客户端注册]

source: xref:registration-methods.adoc[Registration Methods]
ca: xref:registration-methods.adoc[Mètodes de registre]
ja: xref:registration-methods.adoc[登録方法]
ko: xref:registration-methods.adoc[등록 방법]
zh_cn: xref:registration-methods.adoc[注册方法]

source: xref:registration-webui.adoc[Register With the Web UI]
ca: xref:registration-webui.adoc[Registrar amb la interfície web]

source: xref:registration-bootstrap.adoc[Register With a Bootstrap Script]
ca: xref:registration-webui.adoc[Registrar amb la interfície web]

source: xref:registration-cli.adoc[Register on the Command Line]
ca: xref:registre-cli.adoc[Registre a la línia d'ordres]
ja: xref:registration-cli.adoc[コマンドラインで登録する]
ko: xref:registration-cli.adoc[명령줄에서 등록]
zh_cn: xref:registration-cli.adoc[在命令行上注册]

source: xref:registration-overview-suse.adoc[SUSE Client Registration]
ca: xref:registration-overview-suse.adoc[Registre de client deUSE]
ja: xref:registration-overview-suse.adoc[SUSEクライアントの登録]
ko: xref:registration-overview-suse.adoc[SUSE 클라이언트 등록]
zh_cn: xref:registration-overview-suse.adoc[SUSE 客户端注册]

source: xref:clients-slemicro.adoc[SLE Micro Clients]
ca: xref:clients-slemicro.adoc[Clients de MicroSLE]
ja: xref:clients-slemicro.adoc[SLE Microクライアント]
ko: xref:clients-slemicro.adoc[SLE Micro 클라이언트]
zh_cn: xref:clients-slemicro.adoc[SLE Micro 客户端]

source: xref:clients-slmicro.adoc[SL Micro Clients]
ca: xref:clients-slemicro.adoc[Clients de MicroSLE]
ja: xref:clients-slmicro.adoc[SL Microクライアント]
ko: xref:clients-slmicro.adoc[SL Micro 클라이언트]
zh_cn: xref:clients-slmicro.adoc[SL Micro 客户端]

source: xref:clients-sleses.adoc[SUSE Liberty Linux Clients]
ca: xref:clients-sle.adoc[SUSE Linux Enterprise Clients]
ja: xref:clients-sleses.adoc[SUSE Liberty Linuxクライアント]
ko: xref:clients-sleses.adoc[SUSE Liberty Linux 클라이언트]
zh_cn: xref:clients-sleses.adoc[SUSE Liberty Linux 客户端]

source: xref:clients-opensuseleapmicro.adoc[openSUSE Leap Micro Clients]
ca: xref:clients-opensuseleap.adoc[openSUSE Leap Clients]

source: xref:registration-overview-almalinux.adoc[AlmaLinux Client Registration]
ca: xref:registration-overview-almalinux.adoc[Registre del client d'AlmaLinux]
ja: xref:registration-overview-almalinux.adoc[AlmaLinuxクライアントの登録]
ko: xref:registration-overview-almalinux.adoc[AlmaLinux 클라이언트 등록]
zh_cn: xref:registration-overview-almalinux.adoc[AlmaLinux 客户端注册]

source: xref:clients-almalinux.adoc[AlmaLinux Clients]
ca: xref:clients-almalinux.adoc[Clients d'AlmaLinux]
ja: xref:clients-almalinux.adoc[AlmaLinuxクライアント]
ko: xref:clients-almalinux.adoc[AlmaLinux 클라이언트]
zh_cn: xref:clients-almalinux.adoc[AlmaLinux 客户端]

source: xref:registration-overview-amazon.adoc[Amazon Linux Client Registration]
ca: xref:registration-overview-amazon.adoc[Registre del client d'Amazon Linux]
ja: xref:registration-overview-amazon.adoc[Amazon Linuxクライアントの登録]
ko: xref:registration-overview-amazon.adoc[Amazon Linux 클라이언트 등록]
zh_cn: xref:registration-overview-amazon.adoc[Amazon Linux 客户端注册]

source: xref:registration-overview-centos.adoc[CentOS Client Registration]
ca: xref:registration-overview-centos.adoc[Registre del client de CentOS]
ja: xref:registration-overview-centos.adoc[CentOSクライアントの登録]
ko: xref:registration-overview-centos.adoc[CentOS 클라이언트 등록]
zh_cn: xref:registration-overview-centos.adoc[CentOS 客户端注册]

source: xref:registration-overview-debian.adoc[Debian Client Registration]
ca: xref:registration-overview-debian.adoc[Registre de client Debian]
ja: xref:registration-overview-debian.adoc[Debianクライアントの登録]
ko: xref:registration-overview-debian.adoc[Debian 클라이언트 등록]
zh_cn: xref:registration-overview-debian.adoc[Debian 客户端注册]

source: xref:registration-overview-openeuler.adoc[{openeuler} Client Registration]
ca: xref:registration-overview-openeuler.adoc[{openeuler} Registre de client]

source: xref:registration-overview-oes.adoc[OES Client Registration]
ca: xref:registration-overview.adoc[Registre Client]

source: xref:clients-oes.adoc[Open Enterprise Server Clients]
ca: xref:clients-sle.adoc[SUSE Linux Enterprise Clients]

source: xref:registration-overview-oracle.adoc[Oracle Client Registration]
ca: xref:registration-overview-oracle.adoc[Registre del client d'Oracle]
ja: xref:registration-overview-oracle.adoc[Oracleクライアントの登録]
ko: xref:registration-overview-oracle.adoc[Oracle 클라이언트 등록]
zh_cn: xref:registration-overview-oracle.adoc[Oracle 客户端注册]

source: xref:clients-oracle.adoc[Oracle Clients]
ca: xref:clients-oracle.adoc[Clients oracle]
ja: xref:clients-oracle.adoc[Oracleクライアント]
ko: xref:clients-oracle.adoc[Oracle 클라이언트]
zh_cn: xref:clients-oracle.adoc[Oracle 客户端]

source: xref:registration-overview-raspberrypios.adoc[Raspberry Pi OS Client Registration]
ca: xref:registration-overview-centos.adoc[Registre del client de CentOS]

source: xref:clients-raspberrypios.adoc[Raspberry Pi OS Clients]
ca: xref:clients-centos.adoc[CentOS Clients]

source: xref:registration-overview-redhat.adoc[Red Hat Client Registration]
ca: xref:registration-overview-redhat.adoc[Registre de clients de barret vermell]
ja: xref:registration-overview-redhat.adoc[Red Hatクライアントの登録]
ko: xref:registration-overview-redhat.adoc[Red Hat 클라이언트 등록]
zh_cn: xref:registration-overview-redhat.adoc[Red Hat 客户端注册]

source: xref:clients-rh-cdn.adoc[Red Hat Clients - CDN]
ca: xref:clients-rh-cdn.adoc[Clients de barret vermell - CDN]
ja: xref:clients-rh-cdn.adoc[Red Hatクライアント - CDN]
ko: xref:clients-rh-cdn.adoc[Red Hat 클라이언트 - CDN]
zh_cn: xref:clients-rh-cdn.adoc[Red Hat 客户端 - CDN]

source: xref:clients-rh-rhui.adoc[Red Hat Clients - RHUI]
ca: xref:clients-rh-rhui.adoc[Clients de barret vermell - RHUI]
ja: xref:clients-rh-rhui.adoc[Red Hatクライアント - RHUI]
ko: xref:clients-rh-rhui.adoc[Red Hat 클라이언트 - RHUI]
zh_cn: xref:clients-rh-rhui.adoc[Red Hat 客户端 - RHUI]

source: xref:registration-overview-rocky.adoc[Rocky Linux Client Registration]
ca: xref:registration-overview-rocky.adoc[Registre del client de Linux de Rocky]
ja: xref:registration-overview-rocky.adoc[Rocky Linuxクライアントの登録]
ko: xref:registration-overview-rocky.adoc[Rocky Linux 클라이언트 등록]
zh_cn: xref:registration-overview-rocky.adoc[Rocky Linux 客户端注册]

source: xref:clients-rocky.adoc[Rocky Linux Clients]
ca: xref:clients-rocky.adoc[Clients de Linux Rocky]
ja: xref:clients-rocky.adoc[Rocky Linuxクライアント]
ko: xref:clients-rocky.adoc[Rocky Linux 클라이언트]
zh_cn: xref:clients-rocky.adoc[Rocky Linux 客户端]

source: xref:registration-overview-ubuntu.adoc[Ubuntu Client Registration]
ca: xref:registration-overview-ubuntu.adoc[Registre de client d'Ubuntu]
ja: xref:registration-overview-ubuntu.adoc[Ubuntuクライアントの登録]
ko: xref:registration-overview-ubuntu.adoc[Ubuntu 클라이언트 등록]
zh_cn: xref:registration-overview-ubuntu.adoc[Ubuntu 客户端注册]

source: xref:clients-ubuntu.adoc[Ubuntu Clients]
ca: xref:clients-centos.adoc[CentOS Clients]

source: xref:client-proxy.adoc[Client Registration to a Proxy]
ca: xref:client-proxy.adoc[Registre a un servidor intermediari]
ja: xref:client-proxy.adoc[プロキシへのクライアントの登録]
ko: xref:client-proxy.adoc[프록시에 클라이언트 등록]
zh_cn: xref:client-proxy.adoc[将客户端注册到代理]

source: xref:client-proxy-webui.adoc[Register to a Proxy With the Web UI]
ca: xref:client-proxy-webui.adoc[Registre a un servidor intermediari amb la interfície web]

source: xref:client-proxy-cli.adoc[Register to a Proxy With CLI]
ca: xref:client-proxy-cli.adoc[Registrar a un servidor intermediari amb CLI]

source: xref:client-proxy-script.adoc[Register to a Proxy With a Script]
ca: xref:client-proxy-cli.adoc[Registrar a un servidor intermediari amb CLI]

source: xref:automatic-client-registration.adoc[Automatic Registration of Clients Created by Terraform]
ca: xref:automatic-client-registration.adoc[Registre automàtic de clients Creat per Terraform]
ja: xref:automatic-client-registration.adoc[Terraformによって作成されたクライアントの自動登録]
ko: xref:automatic-client-registration.adoc[Terraform에서 생성한 클라이언트의 자동 등록]
zh_cn: xref:automatic-client-registration.adoc[自动注册 Terraform 创建的客户端]

source: xref:client-upgrades-major.adoc[Major Version Upgrade]
ca: xref:client-upgrades.adoc[Client Upgrades]
ja: xref:client-upgrades-major.adoc[ メジャーバージョンのアップグレード]
ko: xref:client-upgrades-major.adoc[주 버전 업그레이드]
zh_cn: xref:client-upgrades-major.adoc[主要版本升级]

source: xref:client-upgrades-lifecycle.adoc[Upgrade Using the Content Lifecycle Manager]
ca: xref:client-upgrades-lifecycle.adoc[Actualitza utilitzant el gestor de cicles de vida de contingut]
ja: xref:client-upgrades-lifecycle.adoc[コンテンツライフサイクルマネージャを使用したアップグレード]

source: xref:client-upgrades-product-migration.adoc[Product Migration]
ca: xref:client-upgrades-product-migration.adoc[Immigració de producte]
ja: xref:client-upgrades-product-migration.adoc[製品の移行]
ko: xref:client-upgrades-product-migration.adoc[제품 마이그레이션]
zh_cn: xref:client-upgrades-product-migration.adoc[产品迁移]

source: xref:client-upgrades-uyuni.adoc[openSUSE Leap Minor Version Upgrade]
ca: xref:client-upgrades.adoc[Client Upgrades]
ja: xref:client-upgrades-uyuni.adoc[openSUSE Leapのマイナーバージョンのアップグレード]
ko: xref:client-upgrades-uyuni.adoc[openSUSE Leap 부 버전 업그레이드]
zh_cn: xref:client-upgrades-uyuni.adoc[openSUSE Leap 次要版本升级]

source: xref:delete-clients.adoc[Client Deletion]
ca: xref:delete-clients.adoc[Supressió del Client]
ja: xref:delete-clients.adoc[クライアントの削除]
ko: xref:delete-clients.adoc[클라이언트 삭제]
zh_cn: xref:delete-clients.adoc[客户端删除]

source: xref:client-operations.adoc[Client Operations]
ca: xref:client-operations.adoc[Operacions puntuals]
ja: xref:client-operations.adoc[クライアントの操作]
ko: xref:client-operations.adoc[클라이언트 작업]
zh_cn: xref:client-operations.adoc[客户端操作]

source: xref:package-management.adoc[Package Management]
ca: xref:package-management.adoc[Gestió de paquets]
ja: xref:package-management.adoc[パッケージ管理]
ko: xref:package-management.adoc[패키지 관리]
zh_cn: xref:package-management.adoc[软件包管理]

source: xref:system-locking.adoc[System Locking]
ca: xref:system-locking.adoc[Bloqueig del sistema]
ja: xref:system-locking.adoc[システムのロック]
ko: xref:system-locking.adoc[시스템 잠금]
zh_cn: xref:system-locking.adoc[系统锁定]

source: xref:power-management.adoc[Power Management]
ca: xref:power-management.adoc[Gestió de potència]
ja: xref:power-management.adoc[電源管理]
ko: xref:power-management.adoc[전원 관리]
zh_cn: xref:power-management.adoc[电源管理]

source: xref:custom-info.adoc[Custom System Information]
ca: xref:custom-info.adoc[Informació del sistema personalitzat]
ja: xref:custom-info.adoc[カスタムシステム情報]
ko: xref:custom-info.adoc[사용자 정의 시스템 정보]
zh_cn: xref:custom-info.adoc[自定义系统信息]

source: xref:system-groups.adoc[System Groups]
ca: xref:system-groups.adoc[Grups de sistema]
ko: xref:system-groups.adoc[시스템 그룹]
zh_cn: xref:system-groups.adoc[系统组]

source: xref:autoinst-intro.adoc[Operating System Installation]
ca: xref:autoinst-intro.adoc[Instal·lació de sistema operatiu]
ja: xref:autoinst-intro.adoc[オペレーティングシステムのインストール]
ko: xref:autoinst-intro.adoc[운영 체제 설치]
zh_cn: xref:autoinst-intro.adoc[操作系统安装]

source: xref:autoinst-cdrom.adoc[Install via a CD-ROM or a USB Key]
ca: xref:autoinst-cdrom.adoc[Instal·lar mitjançant un CD-ROM o una clau USB]
ja: xref:autoinst-cdrom.adoc[CD-ROMまたはUSBメモリを使用してインストールする]
ko: xref:autoinst-cdrom.adoc[CD-ROM 또는 USB 키를 통한 설치]
zh_cn: xref:autoinst-cdrom.adoc[通过 CD-ROM 或 USB 密钥安装]

source: xref:autoinst-distributions.adoc[Autoinstallable Distributions]
ca: xref:autoinst-distributions.adoc[Distribucions autoinstal·lables]
ja: xref:autoinst-distributions.adoc[自動インストールのディストリビューション]
ko: xref:autoinst-distributions.adoc[자동 설치 가능한 배포판]
zh_cn: xref:autoinst-distributions.adoc[可自动安装的发行套件]

source: xref:autoinst-profiles.adoc[Autoinstallation Profiles]
ca: xref:autoinst-profiles.adoc[Perfils d'autoinstal·lació]
ja: xref:autoinst-profiles.adoc[自動インストールプロファイル]
ko: xref:autoinst-profiles.adoc[자동 설치 프로파일]
zh_cn: xref:autoinst-profiles.adoc[自动安装配置文件]

source: xref:autoinst-owngpgkey.adoc[Use Your Own GPG Key]
ca: xref:autoinst-owngpgkey.adoc[Usa la teva pròpia clau GPG]
ja: xref:autoinst-owngpgkey.adoc[独自のGPGキーを使用する]
ko: xref:autoinst-owngpgkey.adoc[자체 GPG 키 사용]
zh_cn: xref:autoinst-owngpgkey.adoc[使用您自己的 GPG 密钥]

source: xref:vhm.adoc[Virtual Host Managers]
ca: xref:vhm.adoc[Gestors virtuals d'amfitrió]
ja: xref:vhm.adoc[仮想ホストマネージャ]
ko: xref:vhm.adoc[가상 호스트 관리자]
zh_cn: xref:vhm.adoc[虚拟主机管理器]

source: xref:vhm-aws.adoc[VHM and AWS]
ca: xref:vhm-aws.adoc[VHM i AWS]
ja: xref:vhm-aws.adoc[VHMとAWS]
ko: xref:vhm-aws.adoc[VHM 및 AWS]
zh_cn: xref:vhm-aws.adoc[VHM 和 AWS]

source: xref:vhm-azure.adoc[VHM and Azure]
ca: xref:vhm-azure.adoc[VHM i Azure]
ja: xref:vhm-azure.adoc[VHMとAzure]
ko: xref:vhm-azure.adoc[VHM 및 Azure]
zh_cn: xref:vhm-azure.adoc[VHM 和 Azure]

source: xref:vhm-gce.adoc[VHM and GCE]
ca: xref:vhm-gce.adoc[VHM i GCE]
ja: xref:vhm-gce.adoc[VHMとGCE]
ko: xref:vhm-gce.adoc[VHM 및 GCE]
zh_cn: xref:vhm-gce.adoc[VHM 和 GCE]

source: xref:vhm-nutanix.adoc[VHM and Nutanix]
ca: xref:vhm-nutanix.adoc[VHM i Nutanix]
ja: xref:vhm-nutanix.adoc[VHMとNutanix]
ko: xref:vhm-nutanix.adoc[VHM 및 Nutanix]
zh_cn: xref:vhm-nutanix.adoc[VHM 和 Nutanix]

source: xref:vhm-vmware.adoc[VHM and VMware]
ca: xref:vhm-vmware.adoc[VHM i VMWare]

source: xref:vhm-file.adoc[VHM With Other Hosts]
ca: xref:vhm-file.adoc[VHM amb altres servidors]

source: Activation Keys
ca: Claus d'activació
ja: アクティベーションキー
ko: 활성화 키
zh_cn: 激活密钥

source: Activation keys are used to ensure that your clients have the correct software entitlements, are connecting to the appropriate channels, and are subscribed to the relevant groups. Each activation key is bound to an organization, which you can set when you create the key.
ca: Les claus d'activació s'utilitzen per assegurar que els seus clients tenen els drets de programari correctes, es connecten als canals adequats i estan subscrits als grups pertinents. Cada clau d'activació està vinculada a una organització, que podeu establir quan creeu la clau.

source: In {productname}, an activation key is a group of configuration settings with a label. You can apply all configuration settings associated with an activation key by adding its label as a parameter to a bootstrap script. We recommend you use an activation key label in combination with a bootstrap script. When the bootstrap script is executed all configuration settings associated with the label are applied to the system the script is run on.
ca: A {productname}, una clau d'activació és un grup de paràmetres de configuració amb una etiqueta. Podeu aplicar tots els paràmetres de configuració associats amb una clau d'activació afegint la seva etiqueta com a paràmetre a un script bootstrap. Us recomanem que utilitzeu una etiqueta de clau d'activació en combinació amb un script bootstrap. Quan s'executa l'script bootstrap s'apliquen tots els paràmetres de configuració associats amb l'etiqueta al sistema en el qual s'executa l'script.
ja: {productname}では、アクティベーションキーは、ラベルの付いた一連の設定です。 アクティベーションキーに関連付けられている設定は、すべて適用できます。そのためには、キーのラベルをパラメータにしてブートストラップスクリプトに追加します。 アクティベーションキーラベルをブートストラップスクリプトと組み合わせて使用することをお勧めします。 ブートストラップスクリプトが実行されると、そのラベルに関連付けられているすべての設定が、スクリプトを実行しているシステムに適用されます。
ko: {productname}에서 활성화 키는 레이블이 있는 구성 설정 그룹입니다. 레이블을 부트스트랩 스크립트에 파라미터로 추가하여 활성화 키와 연결된 모든 구성 설정을 적용할 수 있습니다. 활성화 키 레이블을 부트스트랩 스크립트와 함께 사용하는 것이 좋습니다. 부트스트랩 스크립트가 실행될 때 레이블에 연결된 모든 구성 설정은 스크립트가 실행되는 시스템에 적용됩니다.
zh_cn: 在 {productname} 中，激活密钥是一组带有标签的配置设置。您可以通过将某个激活密钥的标签作为参数添加到引导脚本，来应用与该激活密钥关联的所有配置设置。我们建议您结合引导脚本来使用激活密钥标签。当执行引导脚本时，与该标签关联的所有配置设置都将应用到运行脚本的系统上。

source: An activation key can specify:
ca: Una clau d'activació pot especificar:
ja: アクティベーションキーは以下を指定できます。
ko: 활성화 키는 다음을 지정할 수 있습니다.
zh_cn: 激活密钥可以指定以下各项：

source: Channel assignment
ca: Assignació de canal
ja: チャンネルの割り当て
ko: 채널 할당
zh_cn: 通道指派

source: System types or add-on entitlements
ca: Tipus de sistema o drets de complement
ja: システムの種類またはアドオンのエンタイトルメント
ko: 시스템 유형 또는 추가 자격
zh_cn: 系统类型或附加权利

source: Contact method
ca: Mètode de contacte
ja: 接続メソッド
ko: 연락 방법
zh_cn: 联系方法

source: Configuration files
ca: Fitxers de configuració
ja: 設定ファイル
ko: 구성 파일
zh_cn: 配置文件

source: Packages to be installed
ca: Paquets a instal·lar
ja: インストールするパッケージ
ko: 설치할 패키지
zh_cn: 要安装的软件包

source: AppStreams to be enabled
ca: AppStreams a habilitar

source: System group assignment
ca: Assignació de grup del sistema
ja: システムグループの割り当て
ko: 시스템 그룹 할당
zh_cn: 系统组

source: Activation keys are used at the time a client is registered, and not used again. After the client has been registered, the client can be changed in any way, regardless of what the activation key specifies. The association between the activation key and the client is recorded only for historical purposes.
ca: Les claus d'activació s'utilitzen en el moment en què un client està registrat, i no s'utilitzen de nou. Després que el client s'hagi registrat, el client es pot canviar de qualsevol manera, independentment del que la clau d'activació indiqui. L'associació entre la clau d'activació i el client es registra només amb finalitats històriques.
ja: アクティベーションキーは、クライアント登録時に使用され、再使用されることはありません。 アクティベーションキーで指定する内容に関係なく、クライアントは登録後、任意の方法で変更できます。 アクティベーションキーとクライアントの関連付けは、履歴を残すためだけに記録されます。
ko: 활성화 키는 클라이언트 등록 시 사용되며 다시 사용되지 않습니다. 클라이언트는 등록된 후에 지정된 활성화 키와 관계없이 변경할 수 있습니다. 활성화 키와 클라이언트 사이의 관계는 기록 목적으로만 기록됩니다.
zh_cn: 在注册客户端时需使用激活密钥，之后将不再使用。无论激活密钥指定了什么内容，注册好客户端后，就能以任何方式对其进行更改。记录激活密钥与客户端之间的关联仅为了历史记载。

source: Procedure: Creating an Activation Key
ca: Procediment: Creació d'una clau d'activació
ja: プロシージャ: アクティベーションキーの作成
ko: 절차: 활성화 키 생성
zh_cn: 过程：创建激活密钥

source: In the {productname} {webui}, as an administrator, navigate to menu:Systems[Activation Keys].
ca: A {productname} {webui}, com a administrador, navegueu al menú:Systems[Claus d'activitat].
ja: {productname}の{webui}で、管理者としてmenu:システム[アクティベーションキー]に移動します。
ko: {productname} {webui}에서 관리자 권한으로 menu:시스템[활성화 키]로 이동합니다.
zh_cn: 在 {productname} {webui} 中，以管理员身份导航到menu:系统[激活密钥]。

source: Click the btn:[Create Key] button.
ca: Feu clic al botó btn:[Crea la clau].
ja: btn:[キーの作成]ボタンをクリックします。
ko: btn:[키 생성] 버튼을 클릭합니다.
zh_cn: 单击 btn:[创建密钥] 按钮。

source: On the [guimenu]``Activation Key Details`` page, in the [guimenu]``Description`` field, enter a description of the activation key.
ca: A la pàgina [guimenu].Detalls de la clau d'activitat., al camp [guimenu].Descripció., introduïu una descripció de la clau d'activació.
ja: ［[guimenu]``アクティベーションキーの詳細``］ページの［[guimenu]``説明``］フィールドにアクティベーションキーの説明を入力します。
ko: [guimenu]``활성화 키 상세 정보`` 페이지의 [guimenu]``설명`` 필드에 활성화 키의 설명을 입력합니다.
zh_cn: 在[guimenu]``激活密钥细节``页面的[guimenu]``说明``字段中，输入激活密钥的说明。
