Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: Check [systemitem]``Select rhel-systems``.
ca: Comprova [systemitem].Seleccionar rhel-systems..
ja: ［[systemitem]``Select rhel-systems``］（RHELシステムを選択）にチェックを付けます。
ko: [systemitem]``rhel-systems 선택``의 확인란을 선택합니다.
zh_cn: 选中[systemitem]``选择 rhel-systems``。

source: Click btn:[Join Selected Groups].
ca: Feu clic a btn:[Uneix els grups seleccionats].
ja: btn:[選択されたグループに参加]をクリックします。
ko: btn:[선택한 그룹 조인]을 클릭합니다.
zh_cn: 单击 btn:[加入所选的组]。

source: For the {redhat} custom channels, if you want to check the [guimenu]``Enable GPG Check`` field, you need to populate the [guimenu]``GPG Key URL`` field. You can use the file URL of the GPG key stored in the directory [systemitem]``/etc/pki/rpm-gpg`` of the {redhat} minion.
ca: Per als {redhat} canals personalitzats, si voleu comprovar el camp [guimenu].Activa GPG Check., heu d'omplir el camp [guimenu].URL de clau GPG.. Podeu utilitzar l'URL de fitxer de la clau GPG desada al directori [systemitem]./etc/pki/rpm-gpg. del minion {redhat}.
ja: {redhat}カスタムチャンネルの場合、［[guimenu]``GPGチェックの有効化``］フィールドを確認する場合は、［[ guimenu ]`` GPGキーのURL``］フィールドに値を入力する必要があります。 {redhat} minionのディレクトリ[systemitem]``/etc/pki/rpm-gpg``に保存されているGPGキーのファイルURLを使用できます。
ko: {redhat} 사용자 정의 채널의 경우, [guimenu]``GPG 확인 활성화`` 필드를 확인하려면 [guimenu]``GPG 키 URL`` 필드를 채워야 합니다. {redhat} 미니언의 [systemitem]``/etc/pki/rpm-gpg`` 디렉토리에 저장된 GPG 키의 파일 URL을 사용할 수 있습니다.
zh_cn: 对于 {redhat} 自定义通道，如果您要选中[guimenu]``启用 GPG 检查``字段，则需填充 [guimenu]``GPG 密钥 URL`` 字段。您可以使用 {redhat} 受控端 [systemitem]``/etc/pki/rpm-gpg`` 目录下存储的 GPG 密钥的文件 URL。

source: Example: [systemitem]``file:///etc/pki/rpm-gpg/RPM-GPG-KEY-redhat-release``
ca: Exemple: [systemitem]:file:///etc/pki/rpm-gpg/RPM-GPG-KEY-redhat-release:
ja: 例: [systemitem]``file:///etc/pki/rpm-gpg/RPM-GPG-KEY-redhat-release``
ko: 예: [systemitem]``file:///etc/pki/rpm-gpg/RPM-GPG-KEY-redhat-release``
zh_cn: 示例：[systemitem]``file:///etc/pki/rpm-gpg/RPM-GPG-KEY-redhat-release``

source: For the complete list of the {redhat} product signing keys, see https://access.redhat.com/security/team/key.
ca: Per a la llista completa de les {redhat} claus de signatura de productes, vegeu https://access.redhat.com/security/team/key.
ja: {redhat}製品署名キーの完全なリストについては、link:https://access.redhat.com/security/team/key[]を参照してください。
ko: {redhat} 제품 서명 키의 전체 목록은 https://access.redhat.com/security/team/key[]를 참조하십시오.
zh_cn: 有关 {redhat} 产品签名密钥的完整列表，请参见 link:https://access.redhat.com/security/team/key[]。

source: Registering {rhel} clients with RHUI
ca: S'estan registrant {rhel} clients amb CDN

source: This section contains information about using {redhat} update infrastructure (RHUI) to register clients running {rhel} operating systems.
ca: Per obtenir informació sobre l'ús de la infraestructura d'actualització de {redhat} (RHUI) vegeu xref:client-configuration:clients-rh-rhui.adoc[].

source: If you are running {rhel} clients directly, rather than using {sleses}, you need to use Red Hat sources to retrieve and update packages.
ca: Si esteu executant directament {rhel} clients, en lloc d'utilitzar {sleses}, heu d'utilitzar fonts de Red Hat per recuperar i actualitzar paquets. Aquesta secció conté informació sobre l'ús de la xarxa de lliurament de continguts {redhat} (CDN) per registrar clients tradicionals i de Salt que executen sistemes operatius {rhel}.
ja: {sleses}を使用するのではなく、{rhel}クライアントを直接実行している場合、Red Hatソースを使用してパッケージを取得および更新する必要があります。
ko: {sleses}가 아닌 {rhel} 클라이언트를 직접 실행 중이라면 Red Hat 소스를 사용해 패키지를 검색하고 업데이트해야 합니다.
zh_cn: 如果您是直接运行 {rhel} 客户端而不是使用 {sleses} 来运行，则需要使用 Red Hat 来源检索并更新软件包。

source: If you are running clients in a public cloud, such as Amazon EC2, use this method.
ca: Si estàs executant clients en un núvol públic, com Amazon EC2, utilitza aquest mètode.

source: It is possible to use RHUI in conjunction with the {redhat} content delivery network (CDN) to manage your {rhel} subscriptions. For information about using {redhat} CDN, see xref:client-configuration:clients-rh-cdn.adoc[].
ca: És possible utilitzar RHUI juntament amb la xarxa de distribució de continguts {redhat} (CDN) per gestionar les vostres subscripcions {rhel}. Per obtenir informació sobre l'ús del CDN {redhat}, vegeu xref:client-configuration:clients-rh-cdn.adoc[].
ja: RHUIを{redhat}コンテンツデリバリネットワーク(CDN)と組み合わせて使用して、{rhel}サブスクリプションを管理できます。 {redhat} CDNの使用については、xref:client-configuration:clients-rh-cdn.adoc[]を参照してください。
ko: RHUI를 {redhat} 컨텐트 제공 네트워크(CDN)와 함께 사용하여 {rhel} 구독을 관리할 수 있습니다. {redhat} CDN 사용에 대한 정보는 xref:client-configuration:clients-rh-cdn.adoc[]을 참조하십시오.
zh_cn: 可以将 RHUI 与 {redhat} 内容分发网络 (CDN) 搭配使用来管理您的 {rhel} 订阅。有关使用 {redhat} CDN 的信息，请参见 xref:client-configuration:clients-rh-cdn.adoc[]。

source: You are responsible for connecting {productname} Server to the {redhat} update infrastructure. All clients that get updates using this RHUI certificate need to be correctly licensed, please check with your cloud provider and the {redhat} terms of service for more information.
ca: Sou responsable de connectar el servidor {productname} a la infraestructura d'actualització {redhat}. Tots els clients que obtinguin actualitzacions utilitzant aquest certificat RHUI han d'estar correctament llicenciats, si us plau, consulteu amb el vostre proveïdor del núvol i les condicions del servei {redhat} per obtenir més informació.
ja: {productname}サーバの{redhat}更新インフラストラクチャへの接続はユーザが行います。 このRHUI証明書を使用して更新したすべてのクライアントは、正しくライセンス供与されている必要があります。クラウドプロバイダに確認し、詳細については、{redhat}のサービス条項を確認してください。
ko: 사용자는 {productname} 서버를 {redhat} 업데이트 인프라에 연결할 책임이 있습니다. 이 RHUI 인증서를 사용해 업데이트를 가져오는 모든 클라이언트는 올바른 라이선스를 보유해야 합니다. 자세한 내용은 해당 클라우드 공급자에게 문의하거나 {redhat} 서비스 약관을 확인하시기 바랍니다.
zh_cn: 您需负责将 {productname} 服务器连接到 {redhat} 更新基础结构。所有使用此 RHUI 证书进行更新的客户端都需要获得正确许可，有关详细信息，请咨询您的云服务提供商，并查看服务的 {redhat} 条款。

source: When {rhel} clients registered with RHUI are switched off, {redhat} might declare the certificate invalid. In this case, you need to turn the client on again, or get a new RHUI certificate.
ca: Quan {rhel} clients registrats amb RHUI estan desactivats, {redhat} podria declarar que el certificat no és vàlid. En aquest cas, cal activar de nou el client, o obtenir un nou certificat RHUI.
ja: RHUIで登録された{rhel}クライアントの電源がオフになっている場合、{redhat}が証明書を無効と宣言する場合があります。 この場合、クライアントの電源を再度オンにするか、新しいRHUI証明書を取得する必要があります。
ko: RHUI로 등록한 {rhel} 클라이언트가 켜져 있지 않은 경우 {redhat}은 인증서가 잘못되었다고 선언할 수 있습니다. 이 경우 클라이언트를 다시 켜거나 새 RHUI 인증서를 가져와야 합니다.
zh_cn: 当使用 RHUI 注册的 {rhel} 客户端关闭时，{redhat} 可能会声称证书无效。在此情况下，您需要再次打开客户端，或获取新的 RHUI 证书。

source: Import entitlements and certificates
ca: Importa drets i certificats

source: In the past it was required to import the certificates and entitlement data manual into {productname} Server. This task has been automated by using the same mechanism as for SUSE {payg} instances. For more information, see xref:specialized-guides:public-cloud-guide/payg/payg-overview.adoc[].
ca: Abans calia importar el manual de certificats i dades de drets al servidor {productname}. Aquesta tasca s'ha automatitzat mitjançant el mateix mecanisme que per a les instàncies de SUSE {payg}. Per obtenir més informació, consulteu xref:specialized-guides:public-cloud-guide/payg/payg-overview.adoc[].

source: This guide covers clients registered to {redhat} update infrastructure (RHUI). You must have at least one system registered to RHUI, with an authorized subscription for repository content.
ca: Aquesta guia cobreix els clients registrats a la infraestructura d'actualització {redhat} (RHUI). Heu de tenir almenys un sistema registrat a RHUI, amb una subscripció autoritzada per al contingut del repositori.
ja: このガイドでは、{redhat}更新インフラストラクチャ(RHUI)に登録されるクライアントについて説明します。 リポジトリコンテンツの認可済みサブスクリプションを使用して、1つ以上のシステムがRHUIに登録されている必要があります。
ko: 이 안내서에서는 {redhat} 업데이트 인프라(RHUI)에 등록된 클라이언트에 대해 설명합니다. RHUI에 등록된 시스템이 최소 한 개 있어야 하고, 이와 함께 리포지토리 컨텐트에 대한 인증 구독이 있어야 합니다.
zh_cn: 本指南将介绍注册到 {redhat} 更新基础结构 (RHUI) 的客户端。您至少须有一个注册到 RHUI 的系统并拥有授权订阅，以获得储存库内容。

source: For information about using {redhat} content delivery network (CDN) instead, see xref:client-configuration:clients-rh-cdn.adoc[].
ca: Per obtenir informació sobre com utilitzar {redhat} xarxa de lliurament de contingut (CDN), vegeu xref:client-configuration:clients-rh-cdn.adoc[].
ja: 代わりに{redhat}コンテンツデリバリネットワーク(CDN)を使用する方法については、xref:client-configuration:clients-rh-cdn.adoc[]を参照してください。
ko: {redhat} 컨텐트 제공 네트워크(CDN)를 사용하는 방법에 대한 정보 대신에 xref:client-configuration:clients-rh-cdn.adoc[]을 참조하십시오.
zh_cn: 而有关使用 {redhat} 内容分发网络 (CDN) 的信息，请参见 xref:client-configuration:clients-rh-cdn.adoc[]。

source: The {payg} connection regular checks with the client to get the latest authentication data. It is important that the client stays running and is regular updated. If this does not happen, repository synchronization will fail with authentication errors at some point in time.
ca: La connexió {payg} comprova regularment amb el client per obtenir les últimes dades d'autenticació. És important que el client es mantingui en funcionament i estigui actualitzat regularment. Si això no passa, la sincronització del repositori fallarà amb errors d'autenticació en algun moment.

source: Update any {redhat} 7 instance before connecting it.
ca: Actualitza qualsevol instància {redhat} 7 abans de connectar-la.
ja: 接続する前に、{redhat} 7インスタンスを更新してください。
ko: {redhat} 7 인스턴스를 업데이트한 후 연결하십시오.
zh_cn: 请在连接任何 {redhat} 7 实例前先将其更新。

source: A {redhat} 9 instance needs to be configured with the crypto policy [literal]``LEGACY`` to be able to connect it. Execute [command]``sudo update-crypto-policies --set LEGACY`` to configure it accordingly.
ca: Cal configurar una instància {redhat} 9 amb la política de criptografia [literal].LEGACY. per poder connectar-la. Executeu [ordre].sudo update-crypto-policies --set LEGACY. per a configurar-lo en conseqüència.
ja: {redhat} 9インスタンスを接続するには、暗号ポリシー[literal]``LEGACY``で設定する必要があります。 [command]``sudo update-crypto-policies --set LEGACY``を実行して、それに応じて設定します。
ko: {redhat} 9 인스턴스를 연결하려면 [literal]``LEGACY`` 암호화 정책을 사용하여 구성해야 합니다. [command]``sudo update-crypto-policies --set LEGACY``를 실행하여 적절하게 구성하십시오.
zh_cn: 要连接到 {redhat} 9 实例，必须已为其配置加密策略 [literal]``LEGACY``。请执行 [command]``sudo update-crypto-policies --set LEGACY`` 进行相应配置。

source: Connecting to {redhat} update infrastructure
ca: {redhat} actualització de la infraestructura (RHUI) al núvol
ja: {redhat}更新インフラストラクチャへの接続
ko: {redhat} 업데이트 인프라에 연결
zh_cn: 连接到 {redhat} 更新基础结构

source: Procedure: Connecting new {redhat} instance
ca: Procediment: Creació d'una llista de preservació de fitxers
ja: プロシージャ: 新しい{redhat}インスタンスの接続
ko: 절차: 새 {redhat} 인스턴스 연결
zh_cn: 过程：连接新的 {redhat} 实例

source: In the {productname} {webui}, navigate to menu:Admin[Setup Wizard > {payg}], and click btn:[Add {payg}].
ca: A {productname} {webui}, navegueu al menú:Admin[Auxiliar de configuració ]. Productes].
ja: {productname}の{webui}で、menu:管理[セットアップウィザード > {payg}]に移動し、btn:[{payg}の追加]をクリックします。
ko: {productname} {webui}에서 menu:관리[설치 마법사 > {payg}]으로 이동하고 btn:[{payg} 추가]를 클릭합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:管理[安装向导 > {payg}]，然后单击 btn:[添加 {payg}]。

source: Start with the page section [guimenu]``{payg} connection Description``.
ca: Comenceu amb la secció de pàgina [guimenu].{payg} connexió Descripció..
ja: ページセクション［[guimenu]``{payg}の接続の説明``］から始めます。
ko: 페이지 섹션 [guimenu]``{payg} 연결 설명``으로 시작하십시오.
zh_cn: 从页面的 [guimenu]``{payg} 连接说明``部分开始。

source: In the [guimenu]``Description`` field, add the description.
ca: Al camp [guimenu].Regió., escriviu la regió a utilitzar.
ja: ［[guimenu]``説明``］フィールドに、説明を追加します。
ko: [guimenu]``설명`` 필드에 설명을 추가합니다.
zh_cn: 在[guimenu]``说明``字段中添加说明。

source: Move to the page section [guimenu]``Instance SSH connection data``.
ca: Mou-te a la secció de pàgina [guimenu].Instance SSH connection data..
ja: ページセクション［[guimenu]``インスタンスSSH接続データ``］に移動します。
ko: [guimenu]``인스턴스 SSH 연결 데이터`` 페이지 섹션으로 이동합니다.
zh_cn: 转移到页面的[guimenu]``实例 SSH 连接数据``部分。

source: In the [guimenu]``Host`` field, enter the instance DNS or IP address to connect from {productname}.
ca: Al camp [guimenu].Treu el camí., introduïu el camí al mitjà d'instal·lació desat al vostre servidor {productname}.
ja: ［[guimenu]``ホスト``］フィールドに、{productname}から接続するインスタンスのDNSまたはIPアドレスを入力します。
ko: [guimenu]``호스트`` 필드에 {productname}에서 연결할 인스턴스 DNS 또는 IP 주소를 입력합니다.
zh_cn: 在[guimenu]``主机``字段中，键入要从 {productname} 连接的实例 DNS 或 IP 地址。

source: In the [guimenu]``SSH Port`` field, enter the port number or use default value 22.
ca: En el camp [guimenu].Port SSH., escriviu el número de port SSH a usar per a connectar i arrencar el client.
ja: ［[guimenu]``SSHポート``］フィールドに、ポート番号を入力するか、デフォルト値22を使用します。
ko: [guimenu]``SSH 포트`` 필드에 포트 번호를 입력하거나 기본값 22를 사용합니다.
zh_cn: 在 [guimenu]``SSH 端口``字段中输入端口号或使用默认值 22。

source: In the [guimenu]``User`` field, enter the username as specified in the cloud.
ca: En el camp [guimenu].Nom d'usuari., escriviu el nom d'usuari associat amb l'amfitrió VM.
ja: ［[guimenu]``ユーザ``］フィールドに、クラウドで指定されているユーザ名を入力します。
ko: [guimenu]``사용자`` 필드에 클라우드에 지정된 대로 사용자 이름을 입력합니다.
zh_cn: 在[guimenu]``用户``字段中输入云中指定的用户名。

source: In the [guimenu]``Password`` field, enter the password.
ca: Al camp [guimenu].Password., escriviu la contrasenya associada a l'usuari de la màquina VM.
ja: ［[guimenu]``パスワード``］フィールドに、パスワードを入力します。
ko: [guimenu]``암호`` 필드에 암호를 입력합니다.
zh_cn: 在[guimenu]``口令``字段中输入口令。

source: In the [guimenu]``SSH Private Key`` field, enter the instance key.
ca: Al camp [guimenu].Clau., introduïu un nom per a la clau d'activació.
ja: ［[guimenu]``SSH機密鍵``］フィールドに、インスタンスキーを入力します。
ko: [guimenu]``SSH 개인 키`` 필드에 인스턴스 키를 입력합니다.
zh_cn: 在[guimenu]``SSH 私用密钥``字段中输入实例密钥。

source: In the [guimenu]``SSH Private Key Passphrase`` field, enter the key passphrase.
ca: Al camp [guimenu].Hypervisor., seleccioneu l'hipervisor a utilitzar.
ja: ［[guimenu]``SSH機密鍵のパスフレーズ``］フィールドに、キーパスフレーズを入力します。
ko: [guimenu]``SSH 개인 키 암호 문구`` 필드에 키 암호 문구를 입력합니다.
zh_cn: 在[guimenu]``SSH 私用密钥通行口令``字段中输入密钥通行口令。

source: Authentication keys must always be in PEM format.
ca: Les claus d'autenticació han d'estar sempre en format PEM.
ja: 認証キーは常にPEM形式である必要があります。
ko: 인증 키는 항상 PEM 형식이어야 합니다.
zh_cn: 身份验证密钥必须采用 PEM 格式。

source: If you are not connecting directly to the instance, but via SSH bastion, proceed with <<proc-adding-ssh-bastion-connection-data>>.
ca: Si no esteu connectant directament a la instància, sinó a través del bastió SSH, procediu amb <<proc-adding-ssh-bastion-connection-data>..
ja: インスタンスに直接接続していないが、SSH要塞を介して接続している場合は、<<proc-adding-ssh-bastion-connection-data>>に進みます。
ko: 인스턴스에 직접 연결하지 않고 SSH 배스천을 통해 연결하는 경우 <<proc-adding-ssh-bastion-connection-data>>를 진행합니다.
zh_cn: 如果您要通过 SSH 堡垒连接实例而不是直接连接，请执行<<proc-adding-ssh-bastion-connection-data>>。

source: Otherwise, continue with <<proc-finishing-rhui-connecting>>.
ca: En cas contrari, continua amb <<proc-finishing-rhui-connecting>..
ja: それ以外の場合は、<<proc-finishing-rhui-connecting>> に進みます。
ko: 그러지 않으면, <<proc-finishing-rhui-connecting>>를 진행합니다.
zh_cn: 否则，请执行<<proc-finishing-rhui-connecting>>。

source: Procedure: Adding SSH bastion connection data
ca: Procediment: Afegir el grup del sistema a les claus d'activació
ja: プロシージャ: SSH要塞接続データの追加
ko: 절차: SSH 배스천 연결 데이터 추가
zh_cn: 过程：添加 SSH 堡垒连接数据

source: Navigate to the page section [guimenu]``Bastion SSH connection data``.
ca: Navega a la pestanya [guimenu].Runtime..
ja: ページセクション［[guimenu]``要塞SSH接続データ``］に移動します。
ko: [guimenu]``SSH 배스천 연결 데이터`` 페이지 섹션으로 이동합니다.
zh_cn: 导航到页面的[guimenu]``堡垒 SSH 连接数据``部分。

source: In the [guimenu]``Host`` field, enter the bastion hostname.
ca: Al camp [guimenu].Regió., escriviu la regió a utilitzar.
ja: ［[guimenu]``ホスト``］フィールドに、要塞のホスト名を入力します。
ko: [guimenu]``호스트`` 필드에 배스천 호스트 이름을 입력합니다.
zh_cn: 在[guimenu]``主机``字段中输入堡垒主机名。

source: In the [guimenu]``SSH Port`` field, enter the bastion port number.
ca: Al camp [guimenu].Regió., escriviu la regió a utilitzar.
ja: ［[guimenu]``SSHポート``］フィールドに、要塞のポート番号を入力します。
ko: [guimenu]``SSH 포트`` 필드에 배스천 포트 번호를 입력합니다.
zh_cn: 在[guimenu]``SSH 端口``字段中输入堡垒端口号。

source: In the [guimenu]``User`` field, enter the bastion username.
ca: Al camp [guimenu].Regió., escriviu la regió a utilitzar.
ja: ［[guimenu]``ユーザ``］フィールドに、要塞のユーザ名を入力します。
ko: [guimenu]``사용자`` 필드에 배스천 사용자 이름을 입력합니다.
zh_cn: 在[guimenu]``用户``字段中输入堡垒用户名。

source: In the [guimenu]``Password`` field, enter the bastion password.
ca: Al camp [guimenu].Password., escriviu la contrasenya associada a l'usuari de la màquina VM.
ja: ［[guimenu]``パスワード``］フィールドに、要塞のパスワードを入力します。
ko: [guimenu]``암호`` 필드에 배스천 암호를 입력합니다.
zh_cn: 在[guimenu]``口令``字段中输入堡垒口令。

source: In the [guimenu]``SSH Private Key`` field, enter the bastion key.
ca: Al camp [guimenu].Clau., introduïu un nom per a la clau d'activació.
ja: ［[guimenu]``SSH機密鍵``］フィールドに、要塞キーを入力します。
ko: [guimenu]``SSH 개인 키`` 필드에 배스천 키를 입력합니다.
zh_cn: 在[guimenu]``SSH 私用密钥``字段中输入堡垒密钥。

source: In the [guimenu]``SSH Private Key Passphrase`` field, enter the bastion key passphrase.
ca: Al camp [guimenu].Clau., introduïu un nom per a la clau d'activació.
ja: ［[guimenu]``SSH機密鍵のパスフレーズ``］フィールドに、要塞キーのパスフレーズを入力します。
ko: [guimenu]``SSH 개인 키 암호 문구`` 필드에 배스천 키 암호 문구를 입력합니다.
zh_cn: 在[guimenu]``SSH 私用密钥通行口令``字段中输入堡垒密钥通行口令。

source: Complete the setup with <<proc-finishing-rhui-connecting>>.
ca: Completa la configuració amb <<proc-finishing-rhui-connecting>..
ja: <<proc-finishing-rhui-connecting>>でセットアップを完了します。
ko: <<proc-finishing-rhui-connecting>>로 설정을 완료합니다.
zh_cn: 执行<<proc-finishing-rhui-connecting>>完成设置。

source: Procedure: Finishing {redhat} connecting
ca: Procediment: Migració
ja: プロシージャ: {redhat}接続の終了
ko: 절차: {redhat} 연결 종료
zh_cn: 过程：完成 {redhat} 连接

source: To complete adding new {redhat} connection data, click btn:[Create].
ca: Per a completar l'addició de dades noves de connexió {redhat}, feu clic a btn:[Create].
ja: 新しい{redhat}接続データの追加を完了するには、btn:[作成]をクリックします。
ko: 새 {redhat} 연결 데이터 추가를 완료하려면 btn:[생성]을 클릭합니다.
zh_cn: 要完成添加新 {redhat} 连接数据的过程，请单击 btn:[创建]。

source: Return to {payg} connection data [guimenu]``Details`` page.
ca: Retorna a la pàgina {payg} dades de connexió [guimenu].Detalls..
ja: {payg}接続データの［[guimenu]``詳細``］ページに戻ります。
ko: {payg} 연결 데이터 [guimenu]``세부 정보`` 페이지로 돌아갑니다.
zh_cn: 返回 {payg} 连接数据[guimenu]``细节``页面。

source: The updated connection status is displayed on the top section named [guimenu]``Information``.
ca: L'estat de la connexió actualitzada es mostra a la secció superior anomenada [guimenu].Informació..
ja: 更新された接続ステータスは、［[guimenu]``情報``］という名前の上部セクションに表示されます。
ko: 업데이트된 연결 상태는 [guimenu]``정보`` 상단 섹션에 표시됩니다.
zh_cn: 顶部的[guimenu]``信息``部分会显示更新的连接状态。

source: Connection status is shown in [guimenu]``Admin > Setup Wizard > Pay-as-you-go`` screen, too.
ca: L'estat de la connexió també es mostra a la pantalla [guimenu].Admin . Assistent de configuració . Pay-as-you-go..
ja: 接続ステータスは、［[guimenu]``管理 > セットアップウィザード > Pay-as-you-go``］画面にも表示されます。
ko: 연결 상태는 [guimenu]``관리 > 설정 마법사 > 종량제`` 화면에도 표시됩니다.
zh_cn: [guimenu]``管理 > 安装向导 > Pay-as-you-go`` 屏幕中也会显示连接状态。

source: If the authentication data for the instance is correct, the column [guimenu]``Status`` shows [literal]``Credentials successfully updated.``
ca: Si les dades d'autenticació per a la instància són correctes, la columna [guimenu] theEstat shows mostra [literal].Credencials actualitzades amb èxit.,
ja: インスタンスの認証データが正しい場合、［[guimenu]``ステータス``］列に「[literal]``資格情報が正常に更新されました``」と表示されます。
ko: 인스턴스에 대한 인증 데이터가 올바른 경우 [guimenu]``상태`` 열에 [literal]``자격 증명이 업데이트되었습니다.``가 표시됩니다.
zh_cn: 如果实例的身份验证数据正确无误，[guimenu]``状态``列会显示[literal]``已成功更新身份凭证``。

source: If invalid data is entered at any point, the newly created instance is shown in [guimenu]``Admin > Setup Wizard > {payg}``, with column [guimenu]``Status`` displaying an error message.
ca: Si s'introdueixen dades no vàlides en qualsevol punt, la instància creada recentment es mostra a [guimenu].Admin . Assistent de configuració , {payg}., amb la columna [guimenu].Estat. mostrant un missatge d'error.
ja: いずれかの時点で無効なデータが入力された場合、新しく作成されたインスタンスは［[ guimenu ] `` 管理 > セットアップウィザード > {payg}``］に表示され、［[guimenu]``ステータス``］列にエラーメッセージが表示されます。
ko: 언제라도 잘못된 데이터가 입력되면 새로 생성된 인스턴스가 [guimenu]``관리 > 설정 마법사 > {payg}``에 표시되고 [guimenu]``상태`` 열에는 오류 메시지가 표시됩니다.
zh_cn: 如果在任何时间输入了无效数据，[guimenu]``管理 > 安装向导 > {payg}`` 中会显示新创建的实例，同时[guimenu]``状态``列会显示错误消息。

source: As soon as the authentication data is available on the server, repositories were added for all available repositories on the connected instance. The repositories can be seen in [guimenu]``Software > Manage > Repositories``
ca: Tan aviat com les dades d'autenticació estan disponibles al servidor, es van afegir repositoris per a tots els repositoris disponibles a la instància connectada. Els repositoris es poden veure a [guimenu] TheSoftware The Gestiona The Repositoris The
ja: サーバで認証データが利用可能になるとすぐに、接続されているインスタンスで利用可能なすべてのリポジトリにリポジトリが追加されました。 リポジトリは、［[guimenu]``ソフトウェア > 管理 > リポジトリ``］で確認できます。
ko: 서버에서 인증 데이터를 사용할 수 있게 되면, 연결된 인스턴스에서 사용 가능한 모든 리포지토리에 대한 리포지토리가 추가됩니다. 리포지토리는 [guimenu]``소프트웨어 > 관리 > 리포지토리``에서 볼 수 있습니다.
zh_cn: 当服务器上有可用的身份验证数据后，系统会立即为已连接实例上所有可用的储存库添加储存库。您可以在[guimenu]``软件 > 管理 > 储存库``中查看储存库

source: A {redhat} connection will create custom repositories which are owned by organization 1 by default. If a different organization should own the autogenerated repositories, configure [systemitem]``java.rhui_default_org_id`` in ``/etc/rhn/rhn.conf``.
ca: Una connexió {redhat} crearà repositoris personalitzats que són propietat de l'organització 1 per defecte. Si una organització diferent hauria de posseir els repositoris generats automàticament, configureu [systemitem].java.rhuidefaultorgid. a ./etc/rhn/rhn.conf..

source: This only defines and updates the repositories. If you want to use a repository for a managed client, you need to specify a Software Channel and connect the repositories to it.
ca: Això només defineix i actualitza els repositoris. Si voleu utilitzar un repositori per a un client gestionat, heu d'especificar un canal de programari i connectar-hi els repositoris.
ja: これはリポジトリを定義して更新するだけです。 管理対象クライアントにリポジトリを使用する場合は、ソフトウェアチャンネルを指定して、リポジトリを接続する必要があります。
ko: 이는 리포지토리만 정의하고 업데이트합니다. 관리 클라이언트용 리포지토리를 사용하려면 소프트웨어 채널을 지정하고 해당 채널에 리포지토리를 연결해야 합니다.
zh_cn: 此设置仅可定义和更新储存库。如果您想对受管客户端使用某个储存库，则需要指定软件通道并将储存库关联到该软件通道。

source: Add software channels
ca: Afegeix canals de programari

source: | OS Version | Product Name | {redhat} 9 | RHEL and Liberty 9 Base | {redhat} 8 | RHEL or SLES ES or CentOS 8 Base | {redhat} 7 | RHEL7 Base x86_64
ca: Versió OS Nom del producte {redhat} 9 Base RHEL i Liberty 9 {redhat} 8 Base RHEL o SLES ES o CentOS 8 {redhat} 7 Base RHEL7 x8664
ko: | OS 버전 | 제품 이름 | {redhat} 9 | RHEL and Liberty 9 Base | {redhat} 8 | RHEL or SLES ES or CentOS 8 Base | {redhat} 7 | RHEL7 Base x86_64
zh_cn: | 操作系统版本 | 产品名称 | {redhat} 9 | RHEL 和 Liberty 9 Base | {redhat} 8 | RHEL 或 SLES ES 或 CentOS 8 Base | {redhat} 7 | RHEL7 Base x86_64

source: | OS Version | Base Channel | Client Channel | Tools Channel | {redhat} 7 | rhel7-pool-uyuni | - | rhel7-uyuni-client | {redhat} 8 | rhel8-pool-uyuni | - | rhel8-uyuni-client | {redhat} 9 | rhel9-pool-uyuni | - | rhel9-uyuni-client
ca: Versió del SO Canal base Canal client s Canal d'eines {redhat} 7 rel7-pool-uyuni rel7-uyuni-client {redhat} 8 rel8-pool-uyuni rel8-uyuni-client {redhat} 9 rel9-pool-uyuni rel9-uyuni-client

source: Prepare custom channels
ca: Canals personalitzats amb barret vermell

source: To mirror the software from RHUI, you need to create custom channels in {productname} that are linked to autogenerated repositories.
ca: Per reflectir el programari de RHUI, heu de crear canals personalitzats a {productname} que estiguin vinculats a repositoris generats automàticament.
ja: RHUIからソフトウェアをミラーリングするには、自動生成リポジトリにリンクされたカスタムチャンネルを{productname}に作成する必要があります。
ko: RHUI에서 소프트웨어를 미러링하려면 자동 생성 리포지토리에 연결된 {productname}에 사용자 정의 채널을 생성해야 합니다.
zh_cn: 要从 RHUI 镜像软件，您需要在 {productname} 中创建关联到自动生成的储存库的自定义通道。
