Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: Trust GPG Keys on Clients
ca: Confia en les claus GPG dels clients
ja: クライアントでGPGキーを信頼する
ko: 클라이언트의 GPG 키 신뢰
zh_cn: 在客户端上信任 GPG 密钥

source: {openeuler} clients are registered in the same way as all other clients. For more information, see xref:client-configuration:registration-overview.adoc[].
ca: Per a més informació sobre el registre dels teus clients, consulta xref:client-configuration:registration-overview.adoc[].

source: Registering {leap} Clients
ca: Registre de clients de {leap}

source: This section contains information about registering clients running {leap} operating systems. {productname} supports {leap} 15 and {leap} 16 clients using {salt}.
ca: Aquesta secció conté informació sobre com registrar clients que executen els sistemes operatius {leap}. {productname} admet clients {leap} 15 i {leap} 16 que usen {salt}.

source: Bootstrapping is supported for starting {leap} clients and performing initial state runs such as setting repositories and performing profile updates.
ca: L'arrencada és compatible per iniciar clients {leap} i fer execucions d'estat inicial, com ara configurar repositoris i actualitzacions de perfils.

source: Before you register {leap} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de registrar els clients de {leap} al servidor {productname}, cal afegir els canals de programari necessaris i sincronitzar-los.

source: The architectures currently supported are:
ca: Les arquitectures admeses actualment són aquestes:

source: {leap} 15: `x86_64` and `aarch64`.
ca: {leap} 15: x86_64 i aarch64.

source: {leap} 16: `x86_64`, `aarch64`, `ppc64le` and `s390x`
ca: {leap} 16: x86_64, aarch64, ppc64le i s390x

source: For full list of supported products and architectures, see xref:client-configuration:supported-features.adoc[].
ca: Per obtenir una llista completa dels productes i arquitectures compatibles, consulteu xref:client-configuration:supported-features.adoc[].

source: {leap} Products - WebUI
ca: Productes {leap} - WebUI

source: | OS Version | Product Name | {leap} 16.0 | {leap} 16.0 x86_64 | {leap} 15.6 | {leap} 15.6 x86_64 | {leap} 15.5 | {leap} 15.5 x86_64 | {leap} 15.4 | {leap} 15.4 x86_64
ca: |Versió del sistema operatiu | Product Name | {leap} 16.0 | {leap} 16.0 x86_64 | {leap} 15.6 | {leap} 15.6 x86_64 | {leap} 15.5 | {leap} 15.5 x86_64 | {leap} 15.4 | {leap} 15.4 x86_64

source: {leap} Channels - CLI
ca: Canals {leap} - CLI

source: | OS Version | Base Channel | {leap} 16.0 | opensuse-leap-16.0 | {leap} 15.6 | opensuse-leap-15.6-pool | {leap} 15.5 | opensuse-leap-15.5-pool | {leap} 15.4 | opensuse-leap-15.4-pool
ca: | Versió del sistema operatiu | Canal base | {leap} 16.0 | opensuse-leap-16.0 | {leap} 15.6 | opensuse-leap-15.6-pool | {leap} 15.5 | opensuse-leap-15.5-pool | {leap} 15.4 | opensuse-leap-15.4-pool

source: | OS Version | {leap} 16.0 | {leap} 15.6 | {leap} Leap 15.5 | {leap} Leap 15.4 | Base Channel | opensuse_leap16_0 | opensuse_leap15_6 | opensuse_leap15_5 | opensuse_leap15_4 | Client Channel | opensuse_leap16_0-uyuni-client | opensuse_leap15_6-uyuni-client | opensuse_leap15_5-uyuni-client | opensuse_leap15_4-uyuni-client | Updates Channel | | opensuse_leap15_6-updates | opensuse_leap15_5-updates | opensuse_leap15_4-updates | Non-OSS Channel | opensuse_leap16_0-non-oss | opensuse_leap15_6-non-oss | opensuse_leap15_5-non-oss | opensuse_leap15_4-non-oss | Non-OSS Updates Channel | | opensuse_leap15_6-non-oss-updates | opensuse_leap15_5-non-oss-updates | opensuse_leap15_4-non-oss-updates | Backports Updates Channel| | opensuse_leap15_6-backports-updates| opensuse_leap15_5-backports-updates | opensuse_leap15_4-backports-updates | SLE Updates Channel | | opensuse_leap15_6-sle-updates | opensuse_leap15_5-sle-updates | opensuse_leap15_4-sle-updates | openh264 codecs | opensuse_leap16_0-openh264 | opensuse_leap15_6-sle-updates | opensuse_leap15_5-sle-updates | opensuse_leap15_4-sle-updates
ca: | Versió del sistema operatiu | {leap} 16.0 | {leap} 15.6 | {leap} Leap 15.5 | {leap} Leap 15.4 | Canal base | opensuse_leap16_0 | opensuse_leap15_6 | opensuse_leap15_5 | opensuse_leap15_4 | Canall client | opensuse_leap16_0-uyuni-client | opensuse_leap15_6-uyuni-client | opensuse_leap15_5-uyuni-client | opensuse_leap15_4-uyuni-client | Canal d'actualitzacions | | opensuse_leap15_6-updates | opensuse_leap15_5-updates | opensuse_leap15_4-updates | Canal no OSS | opensuse_leap16_0-non-oss | opensuse_leap15_6-non-oss | opensuse_leap15_5-non-oss | opensuse_leap15_4-non-oss | Canal d'actualitzacions no OSS | | opensuse_leap15_6-non-oss-updates | opensuse_leap15_5-non-oss-updates | opensuse_leap15_4-non-oss-updates | Canal d'actualitzacions de backports| | opensuse_leap15_6-backports-updates| opensuse_leap15_5-backports-updates | opensuse_leap15_4-backports-updates | Canal d'actualitzacions de SLE | | opensuse_leap15_6-sle-updates | opensuse_leap15_5-sle-updates | opensuse_leap15_4-sle-updates | còdecs openh264 | opensuse_leap16_0-openh264 | opensuse_leap15_6-sle-updates | opensuse_leap15_5-sle-updates | opensuse_leap15_4-sle-updates

source: {leap} channels can be very large. Synchronization can sometimes take several hours.
ca: Els canals {leap} poden ser molt grossos. La sincronització de vegades pot trigar diverses hores.

source: Registering {leapmicro} Clients
ca: S'estan registrant {sle} clients

source: This section contains information about registering clients running {leapmicro} operating systems on {x86_64} and {aarch64} architectures.
ca: Aquesta secció conté informació sobre el registre de clients que executen sistemes operatius {leapmicro} a les arquitectures {x8664} i {aarch64}.

source: The {leapmicro} is an ultra-reliable, lightweight operating system purpose built for edge computing. It leverages the enterprise hardened security and compliance components of SUSE Linux Enterprise and merges them with a modern, immutable, developer-friendly OS platform.
ca: El {leapmicro} és un sistema operatiu ultra fiable i lleuger construït per a la computació de vores. Aprofita els components de seguretat i compliment de l'empresa de SUSE Linux Enterprise i els fusiona amb una plataforma de SO moderna, immutable i fàcil de desenvolupar.

source: The {leapmicro} uses transactional updates. Transactional updates are atomic (all updates are applied only if all updates succeed) and support rollbacks. They do not affect the running system because no changes are activated until the system is rebooted. This information is displayed in the menu:Systems[Details > Overview] subtab.
ca: El {leapmicro} utilitza actualitzacions transaccionals. Les actualitzacions transaccionals són atòmiques (totes les actualitzacions només s'apliquen si totes les actualitzacions tenen èxit) i suporten els rollbacks. No afecten el sistema en execució perquè no s'activen canvis fins que el sistema es reinicia. Aquesta informació es mostra al menú:Systems[Detalls . Resum] subtab.

source: For more information on transactional updates and rebooting, see https://documentation.suse.com/sles/html/SLES-all/cha-transactional-updates.html.
ca: Per a més informació sobre actualitzacions transaccionals i reinici, vegeu https://documentation.suse.com/sles/html/SLES-all/cha-transactional-updates.html.
ja: トランザクション更新と再起動の詳細については、link:https://documentation.suse.com/sles/html/SLES-all/cha-transactional-updates.html[]を参照してください。
ko: 트랜잭션 업데이트 및 재부팅에 대한 자세한 내용은 link:https://documentation.suse.com/sles/html/SLES-all/cha-transactional-updates.html[]에서 확인할 수 있습니다.
zh_cn: 有关事务更新和重引导的详细信息，请访问 https://documentation.suse.com/sles/html/SLES-all/cha-transactional-updates.html[]。

source: {opensuse} Products - WebUI
ca: {rocky} Productes - WebUI
ja: {opensuse}製品 - WebUI
ko: {opensuse} 제품 - WebUI
zh_cn: {opensuse} 产品 - WebUI

source: | OS Version | Product Name | {leapmicro} 6.1 | {leapmicro} 6.1 {x86_64} | {leapmicro} 6.1 | {leapmicro} 6.1 {aarch64}
ca: Versió del SO Nom del producte {leapmicro} 6.1 {leapmicro} 6.1 {x8664} {leapmicro} 6.1 {leapmicro} 6.1 {aarch64}

source: {opensuse} Channels - CLI
ca: {rocky} canals - CLI
ja: {opensuse}チャンネル - CLI
ko: {opensuse} 채널 - CLI
zh_cn: {opensuse} 通道 - CLI

source: | OS Version | Base Channel | {leapmicro} | opensuse-leap-micro-5.3-pool
ca: | Versió del SO | Canal base | {amazon} 2 | amazonlinux2-core-x86_64

source: | OS Version | {leapmicro} 6.1 | {leapmicro} 5.5 | {leapmicro} 5.4 | {leapmicro} 5.3 | Base Channel | opensuse_micro6_1 | opensuse_micro5_5 | opensuse_micro5_4 | opensuse_micro5_3 | Client Channel | opensuse_micro6_1-uyuni-client | opensuse_micro5_5-uyuni-client | opensuse_micro5_4-uyuni-client | opensuse_micro5_3-uyuni-client | SLE Updates Channel | NA | opensuse_micro5_5-sle-updates | opensuse_micro5_4-sle-updates | opensuse_micro5_3-sle-updates
ca: Versió del SO {leapmicro} 6.1 {leapmicro} 5.5 {leapmicro} 5.4 {leapmicro} 5.3 Canal base opensusemicro61 opensusemicro55 opensusemicro54 opensusemicro53 Canal client opensusemicro61-uyuni-client opensusemicro55-uyuni-client opensusemicro54-uyuni-client opensusemicro53-uyuni-client s SLE Updates Channel NA s opensusemicro55-sle-updates s opensusemicro54-sle-updates opensusemicro53-sle-updates

source: {leapmicro} channels can be very large. Synchronization can sometimes take several hours.
ca: {sle} canals poden ser molt grans. La sincronització de vegades pot trigar diverses hores.

source: {leapmicro} clients require reboot after registering.
ca: {leapmicro} clients requereixen reiniciar després de registrar-se.

source: Following the bootstrapping process, automatic booting is disabled on {leapmicro}. This change was implemented due to intermittent automatic reboots, which could occurr before Salt could relay the results of applying the bootstrap salt state.
ca: Després del procés d'arrencada, l'arrencada automàtica està desactivada a {leapmicro}. Aquest canvi es va implementar a causa dels reinicis automàtics intermitents, que podrien produir-se abans que Salt pogués transmetre els resultats de l'aplicació de l'estat de sal d'arrencada.

source: Reboot is automatically scheduled after registration is completed, but it is respecting the default reboot manager maintenance window. This window may be several hours after the client is registered. To speed up {leapmicro} registration, manually reboot the client after the registration script finishes.
ca: El reinici es programa automàticament després de completar el registre, però respecta la finestra predeterminada de manteniment del gestor de reinici. Aquesta finestra pot ser diverses hores després que el client estigui registrat. Per accelerar el registre {leapmicro}, reinicieu manualment el client després que acabi l'script de registre.

source: Registering {oracle} Clients
ca: S'estan registrant {oracle} clients
ja: {oracle}クライアントの登録
ko: {oracle} 클라이언트 등록
zh_cn: 注册 {oracle} 客户端

source: This section contains information about registering clients running {oracle} operating systems.
ca: Aquesta secció conté informació sobre el registre de clients que executen sistemes operatius {oracle}.

source: {oracle} repository URLs are available from {scclongform}.
ca: Els URL del repositori {oracle} estan disponibles des de {scclongform}.

source: Packages and metadata are provided by Oracle, not by {suse}.
ca: Els paquets d'EPEL són proporcionats per la comunitat de Fedora. No són compatibles amb {suse}.

source: {oracle} base media repositories are freely available for download from https://yum.oracle.com/.
ca: Els repositoris multimèdia base {oracle} estan disponibles lliurement per a la seva descàrrega des de https://yum.oracle.com/.

source: For supported products, see the release notes and the support table at xref:client-configuration:supported-features-oracle.adoc[].
ca: Per obtenir una llista completa de clients i característiques compatibles, vegeu xref:client-configuration:supported-features.adoc[].

source: Direct synchronizing Unbreakable Linux Network (ULN) repositories with {productname} are not currently supported. An Oracle Local Distribution for ULN must be used. For more information about setting up a local ULN mirror, see the Oracle documentation provided at https://docs.oracle.com/en/operating-systems/oracle-linux/software-management/sfw-mgmt-UseSoftwareDistributionMirrors.html#local-uln-mirror.
ca: Actualment no s'admeten repositoris de la xarxa Linux Unbreakable (ULN) sincronitzats directes amb {productname}. S'ha d'utilitzar una distribució local d'Oracle per a ULN. Per a més informació sobre la configuració d'una rèplica local de l'ULN, vegeu la documentació de l'Oracle proporcionada a https://docs.oracle.com/ca/operating-systems/oracle-linux/software-management/sfw-mgmt-UseSoftwareDistributionMirrors.html.local-uln-mirror.
ja: Unbreakable Linux Network (ULN)リポジトリと{productname}を直接同期することは現在サポートされていません。 ULNのOracleローカルディストリビューションを使用する必要があります。 ローカルULNミラーの設定の詳細については、link:https://docs.oracle.com/en/operating-systems/oracle-linux/software-management/sfw-mgmt-UseSoftwareDistributionMirrors.html#local-uln-mirror[]で提供されているOracleのドキュメントを参照してください。
ko: ULN(Unbreakable Linux Network) 리포지토리와 {productname}의 직접 동기화 기능은 현재 지원되지 않습니다. ULN용 Oracle Local Distribution을 사용해야 합니다. 로컬 ULN 미러 설정에 대한 자세한 내용은 https://docs.oracle.com/en/operating-systems/oracle-linux/software-management/sfw-mgmt-UseSoftwareDistributionMirrors.html#local-uln-mirror[]에서 제공되는 Oracle 설명서를 참조하십시오.
zh_cn: 目前不支持直接将 Unbreakable Linux Network (ULN) 储存库与 {productname} 同步。必须使用 ULN 的 Oracle 本地发行版。有关设置本地 ULN 镜像的详细信息，请参见 https://docs.oracle.com/en/operating-systems/oracle-linux/software-management/sfw-mgmt-UseSoftwareDistributionMirrors.html#local-uln-mirror 上提供的相关 Oracle 文档。

source: Before you register {oracle} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de registrar {oracle} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.
ja: {oracle}クライアントを{productname}サーバに登録する前に、必要なソフトウェアチャンネルを追加して同期する必要があります。
ko: {oracle} 클라이언트를 {productname} 서버에 등록하기 전에 필요한 소프트웨어 채널을 추가하고 이 채널을 동기화해야 합니다.
zh_cn: 将 {oracle} 客户端注册到您的 {productname} 服务器之前，您需要添加所需的软件通道，并同步这些通道。

source: Oracle Products - WebUI
ca: Productes Oracle - WebUI
ja: Oracle製品 - WebUI
ko: Oracle 제품 - WebUI
zh_cn: Oracle 产品 - WebUI

source: | OS Version | Product Name | {oracle} 9 | Oracle Linux 9 x86_64 | {oracle} 8 | Oracle Linux 8 x86_64 | {oracle} 7 | Oracle Linux 7 x86_64
ca: Versió del SO Nom del producte {oracle} 9 Oracle Linux 9 x8664 {oracle} 8 Oracle Linux 8 x8664 {oracle} 7 Oracle Linux 7 x8664
ko: | OS 버전 | 제품 이름 | {oracle} 9 | Oracle Linux 9 x86_64 | {oracle} 8 | Oracle Linux 8 x86_64 | {oracle} 7 | Oracle Linux 7 x86_64
zh_cn: | 操作系统版本 | 产品名称 |{oracle} 9 | Oracle Linux 9 x86_64 | {oracle} 8 | Oracle Linux 8 x86_64 |{oracle} 7 | Oracle Linux 7 x86_64

source: Oracle Channels - CLI
ca: Canals Oracle - CLI
ja: Oracleチャンネル - CLI
ko: Oracle 채널 - CLI
zh_cn: Oracle 通道 - CLI

source: | OS Version | Base Channel | {oracle} 9 | oraclelinux9-x86_64 | {oracle} 8 | oraclelinux8-x86_64 | {oracle} 7 | oraclelinux7-x86_64
ca: Versió del SO Canal base {oracle} 9 oraclelinux9-x8664 {oracle} 8 oraclelinux8-x8664 {oracle} 7 oraclelinux7-x8664
ko: | OS 버전 | 기본 채널 | {oracle} 9 | oraclelinux9-x86_64 | {oracle} 8 | oraclelinux8-x86_64 | {oracle} 7 | oraclelinux7-x86_64
zh_cn: | 操作系统版本 | 基础通道 |{oracle} 9 | oraclelinux9-x86_64 | {oracle} 8 | oraclelinux8-x86_64 | {oracle} 7 | oraclelinux7-x86_64

source: | OS Version | Base Channel | Client Channel | Updates Channel | {oracle} 9 | oraclelinux9 | oraclelinux9-uyuni-client | oraclelinux9-appstream | {oracle} 8 | oraclelinux8 | oraclelinux8-uyuni-client | oraclelinux8-appstream | {oracle} 7 | oraclelinux7 | oraclelinux7-uyuni-client | -
ca: Versió del SO Canal base Canal client s Actualitza el canal {oracle} 9 oraclelinux9 oraclelinux9-uyuni-client oraclelinux9-appstream {oracle} 8 oraclelinux8 oraclelinux8-uyuni-client oraclelinux8-appstream {oracle} 7 oraclelinux7 oraclelinux7-uyuni-client
ko: | OS 버전 | 기본 채널 | 클라이언트 채널 | 업데이트 채널 | {oracle} 9 | oraclelinux9 | oraclelinux9-uyuni-client | oraclelinux9-appstream | {oracle} 8 | oraclelinux8 | oraclelinux8-uyuni-client | oraclelinux8-appstream | {oracle} 7 | oraclelinux7 | oraclelinux7-uyuni-client | -
zh_cn: | 操作系统版本 | 基础通道 | 客户端通道 | 更新通道 | {oracle} 9 | oraclelinux9 | oraclelinux9-uyuni-client | oraclelinux9-appstream | {oracle} 8 | oraclelinux8 | oraclelinux8-uyuni-client | oraclelinux8-appstream | {oracle} 7 | oraclelinux7 | oraclelinux7-uyuni-client | -

source: For {oracle} 9 and {oracle} 8 clients, add both the Base and AppStream channels. You require packages from both channels. If you do not add both channels, you cannot create the bootstrap repository, due to missing packages.
ca: Per als clients {oracle} 9 i {oracle} 8, afegiu els canals Base i AppStream. Necessiteu paquets d'ambdós canals. Si no afegiu els dos canals, no podreu crear el repositori bootstrap, a causa de la manca de paquets.
ja: {oracle} 9および{oracle} 8クライアントでは、ベースチャンネルとAppStreamチャンネルの両方を追加します。 両方のチャンネルのパッケージが必要です。 両方のチャンネルを追加しないと、パッケージ不足のためブートストラップリポジトリを作成できません。
ko: {oracle} 9 및 {oracle} 8 클라이언트의 경우 기본 채널과 AppStream 채널을 모두 추가하십시오. 사용자에게는 두 채널의 패키지가 모두 필요합니다. 두 채널을 모두 추가하지 않으면 패키지가 누락되어 부트스트랩 리포지토리를 생성할 수 없습니다.
zh_cn: 对于 {oracle} 9 和 {oracle} 8 客户端，请添加基础通道和 AppStream 通道。您需要来自这两个通道的软件包。如果未添加这两个通道，将会因缺少软件包而无法创建引导储存库。

source: You need to create an activation key that is associated with your {oracle} channels.
ca: Heu de crear una clau d'activació que estigui associada als vostres canals {oracle}.
ja: {oracle}チャンネルと関連付けられているアクティベーションキーを作成する必要があります。
ko: {oracle} 채널에 연결된 활성화 키를 생성해야 합니다.
zh_cn: 您需要创建与您的 {oracle} 通道关联的激活密钥。

source: For {oracle} 9 and {oracle} 8 clients use
ca: Per a {oracle} 9 i {oracle} 8 clients
ja: {oracle} 9および{oracle} 8クライアントの場合、以下を使用します
ko: {oracle} 9 및 {oracle} 8 클라이언트의 경우
zh_cn: 对于 {oracle} 9 或 {oracle} 8 客户端，请使用

source: For {oracle} 7 clients use
ca: Per a {rhel} clients, utilitzeu {kickstart}.
ja: {oracle} 7クライアントの場合、以下を使用します
ko: {oracle} 7 클라이언트의 경우
zh_cn: 对于 {oracle} 7 客户端，请使用

source: Registering Clients on a Public Cloud
ca: S'estan registrant {rhel} clients amb CDN

source: When you have your {productname} Server set up, you are ready to start registering clients.
ca: Quan tingueu el vostre servidor {productname} configurat, esteu preparat per començar a registrar clients.
ja: {productname}サーバを設定すると、クライアントの登録を開始できます。
ko: {productname} 서버를 설정한 후에는 클라이언트 등록을 시작할 수 있습니다.
zh_cn: 设置好 {productname} 服务器后，您便可开始注册客户端。

source: Add Products and Synchronize Repositories
ca: Afegeix productes i sincronitza els repositoris
ja: 製品の追加とリポジトリの同期
ko: 제품 추가 및 리포지토리 동기화
zh_cn: 添加产品并同步储存库

source: Ensure you have already added the corresponding products for your clients and synced the repositories to {productname}. This is required to create the bootstrap repositories used for registering clients.
ca: Assegureu-vos que ja heu afegit els productes corresponents per als vostres clients i sincronitzat els dipòsits a {productname}. Això és necessari per crear els repositoris d'arrencada utilitzats per registrar clients.
ja: クライアントに対応する製品をすでに追加し、リポジトリを{productname}に同期していることを確認してください。 これは、クライアントの登録に使用されるブートストラップリポジトリを作成するために必要です。
ko: 클라이언트에 해당하는 제품을 이미 추가했고 리포지토리를 {productname}에 동기화했는지 확인하십시오. 클라이언트 등록에 사용되는 부트스트랩 리포지토리를 생성하려면 이 작업은 필수입니다.
zh_cn: 确保您已添加客户端的对应产品并已将储存库同步到 {productname}。要创建用于注册客户端的引导储存库，必须执行此操作。

source: For more information, see xref:specialized-guides:public-cloud-guide/overview.adoc[].
ca: Per a més informació, vegeu xref:client-configuration:registration-cli.adoc[].

source: Prepare On-demand Images
ca: Prepara imatges sota demanda

source: An instance started from an on-demand image provided by {suse} is automatically registered, and the update infrastructure and {sle} modules are activated. To use your on-demand image as a {productname} client, you need to disable this automation before you begin.
ca: Una instància iniciada a partir d'una imatge sota demanda proporcionada per {suse} es registra automàticament, i la infraestructura d'actualització i els mòduls {sle} s'activen. Per utilitzar la imatge sota demanda com a client {productname}, heu de desactivar aquesta automatització abans de començar.
ja: {suse}によって提供されるオンデマンドイメージから起動するインスタンスは自動的に登録され、更新されたインフラストラクチャおよび{sle}モジュールはアクティブ化されます。 {productname}クライアントとしてオンデマンドイメージを使用するには、使用を始める前にこの自動化を無効にする必要があります。
ko: {suse}가 제공한 온디맨드 이미지에서 시작된 인스턴스는 자동으로 등록되고 업데이트 인프라 및 {sle} 모듈이 활성화됩니다. 온디맨드 이미지를 {productname} 클라이언트로 사용하려면 이 자동화를 비활성화한 후에 시작해야 합니다.
zh_cn: 使用 {suse} 提供的按需映像开始的实例会自动进行注册，并且更新基础结构和 {sle} 模块均已激活。要使用按需映像作为 {productname} 客户端，您需要在开始前禁用此自动功能。

source: Procedure: Preparing On-demand Images
ca: Procediment: Comparació de paquets de clients

source: Log in to the on-demand instance.
ca: Inicieu sessió a la instància sota demanda.
ja: オンデマンドインスタンスにログインします。
ko: 온디맨드 인스턴스에 로그인합니다.
zh_cn: 登录到按需实例。

source: At the command prompt, as root, remove the registration data and repositories:
ca: A l'indicador d'ordres, com a root, suprimiu les dades de registre i els repositoris:
ja: コマンドプロンプトでrootとして、登録データとリポジトリを削除します。
ko: 명령 프롬프트에서 루트 권한으로 등록 데이터 및 리포지토리를 제거합니다.
zh_cn: 在命令提示符处，以 root 身份去除注册数据和储存库：

source: Remove the trigger service for automatic registration:
ca: Elimina el servei d'activador per al registre automàtic:
ja: 自動登録のトリガーサービスを削除します。
ko: 자동 등록을 위한 트리거 서비스 제거:
zh_cn: 去除自动注册的触发服务。

source: systemctl disable guestregister.service
ca: systemctl desactiva guestregister.service

source: in Microsoft Azure, there is an additional service that needs to be disabled:
ca: A Microsoft Azure, hi ha un servei addicional que cal desactivar:

source: systemctl disable regionsrv-enabler-azure.timer
ca: systemctl edit rhnsd.timer

source: In the {productname} {webui}, navigate to menu:Systems[Bootstrapping], then fill in the ``Host``, ``SSH Port``, ``User``, and ``Password`` fields. Make sure you use stable FQDNs for the ``Host`` field, or {productname} cannot find your host when your Public Cloud gives you a different short-lived FQDNS.
ca: A {productname} {webui}, navegueu al menú:Systems[Bootstrapping] i ompliu els camps .Host., .SSH Port., .User. i .Password.. Assegureu-vos que utilitzeu FQDN estables per al camp .Host., o {productname} no pot trobar el vostre amfitrió quan el vostre Núvol Públic us proporciona un FQDNS de vida curta diferent.
ja: {productname}の{webui}で、menu:システム[ブートストラップ]に移動し、［``ホスト``］、［``SSHポート``］、［``ユーザ``］、および［``パスワード``］の各フィールドに入力します。 ［``ホスト``］フィールドで安定版FQDNを使用していることを確認してください。別の有効期間が短いFQDNをパブリッククラウドで使用している場合、{productname}ではホストを検索できません。
ko: {productname} {webui}에서 menu:시스템[부트스트래핑]으로 이동하여 ``호스트``, ``SSH 포트``, ``사용자`` 및 ``암호`` 필드를 입력합니다. ``호스트`` 필드에서 안정적인 FQDN을 사용할 수 있는지 확인합니다. 그렇지 않으면 {productname}가 공용 클라우드에서 다른 일시적인 FQDNS를 제공하는 경우 호스트를 찾을 수 없습니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[引导]，然后填写``主机``、``SSH 端口``、``用户``和``口令``字段。请确保为``主机``字段使用稳定的 FQDN，否则，如果公有云为您分配一个不同的临时 FQDN，{productname} 将找不到您的主机。
