Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: The {sll} channels can be very large. The initial channel synchronization can sometimes take up to several hours.
ca: {sle} canals poden ser molt grans. La sincronització de vegades pot trigar diverses hores.
ja: {sll}チャンネルは非常に大きいことがあります。 最初のチャンネル同期は数時間かかる場合があります。
ko: {sll} 채널은 규모가 매우 클 수 있습니다. 초기 채널 동기화는 때로 몇 시간이 걸릴 수 있습니다.
zh_cn: {sll} 通道可能会非常大。有时，初始通道同步所需的时间可能会长达数小时。

source: When the initial synchronization is complete, we recommended you clone the channel before you work with it. This gives you a backup of the original synchronization data.
ca: Quan s'hagi completat la sincronització inicial, us recomanem que cloneu el canal abans de treballar amb ell. Això us dona una còpia de seguretat de les dades de sincronització originals.
ja: 最初の同期が完了したとき、このチャンネルを使用する前にチャンネルを複製することをお勧めします。 この操作を実行すると、元の同期データのバックアップを作成できます。
ko: 초기 동기화가 완료되면 채널로 작업하기 전에 채널을 복제하는 것이 좋습니다. 이렇게 하면 원본 동기화 데이터를 백업할 수 있습니다.
zh_cn: 初始同步完成后，建议您克隆通道后再加以使用。这样您便拥有一份原始同步数据的备份。

source: Register {sll} Clients
ca: S'estan registrant {sle} clients
ja: {sll}クライアントの登録
ko: {sll} 클라이언트 등록
zh_cn: 注册 {sll} 客户端

source: Migrate Enterprise Linux (EL) clients to {sll}
ca: Migra els clients d'Enterprise Linux (EL) a {sll}
ja: Enterprise Linux (EL)クライアントを{sll}に移行する
ko: Enterprise Linux(EL) 클라이언트를 {sll}로 마이그레이션
zh_cn: 将 Enterprise Linux (EL) 客户端迁移到 {sll}

source: If an Enterprise Linux (EL) client such as {rhel} and {centos} is already registered as a minion on {productname} and users want to migrate it to {sll} they can use a re-activation key to apply the activation key that drives the migration.
ca: Si un client Enterprise Linux (EL) com {rhel} i {centos} ja està registrat com a minion a {productname} i els usuaris volen migrar-lo a {sll} poden utilitzar una clau de reactivació per aplicar la clau d'activació que impulsa la migració.

source: For more information about re-activation keys, see xref:client-configuration:activation-keys.adoc#activation-keys-reactivation[].
ca: Per obtenir més informació sobre les claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].

source: The re-activation key is per minion, and can be generated with the {webui} or using the API. For more information, see https://documentation.suse.com/multi-linux-manager/5.1/api/suse-manager/api/system.html#apidoc-system-obtainReactivationKey-loggedInUser-sid.
ca: La clau de reactivació és per minion, i es pot generar amb {webui} o utilitzant l'API. Per a més informació, vegeu https://documentation.suse.com/multi-linux-manager/5.1/api/suse-manager/api/system.html.apidoc-system-obtainReactivationKey-loggedInUser-sid.

source: To re-activate a client, the user can run the bootstrap script on the client and pass the re-activation key as an environment variable. Example:
ca: Per reactivar un client, l'usuari pot executar l'script d'arrencada al client i passar la clau de reactivació com a variable d'entorn. Exemple:
ja: クライアントを再アクティベーションするには、ユーザはクライアント上でブートストラップスクリプトを実行し、再アクティベーションキーを環境変数として渡します。 例:
ko: 클라이언트를 다시 활성화하려면 사용자가 클라이언트에서 부트스트랩 스크립트를 실행하고 재활성화 키를 환경 변수로 전달하면 됩니다. 예:
zh_cn: 要重新激活客户端，用户可以在客户端上运行引导脚本，并以环境变量的形式传递重新激活密钥。例如：

source: Another method is to add some special flags to the {salt} client configuration file located at [path]``/etc/venv-salt-minon/minion.d/susemanager.conf`` (or [path]``/etc/salt-minon/minion.d/susemanager.conf``) the following content (join this content with the already existing one):
ca: Un altre mètode és afegir algunes banderes especials al fitxer de configuració del client {salt} situat a [path] the/etc/venv-salt-minon/minion.d/susemanager.conf the (o [path] the/etc/salt-minon/minion.d/susemanager.conf the) el contingut següent (uniu-vos a aquest contingut amb el ja existent):
ja: もう1つの方法は、[path]``/etc/venv-salt-minon/minion.d/susemanager.conf``(または[path]``/etc/salt-minon/minion.d/susemanager.conf``)にある{salt}クライアント設定ファイルに特別なフラグを追加することです。次のコンテンツを参照してください(このコンテンツを既存のコンテンツと結合します):
ko: 또 다른 방법은 [path]``/etc/venv-salt-minon/minion.d/susemanager.conf``(또는 [path]``/etc/salt-minon/minion.d/susemanager.conf``)에 위치한 {salt} 클라이언트 구성 파일에 다음 콘텐츠에 특수 플래그를 추가하는 것입니다(이 내용을 이미 있는 내용과 결합).
zh_cn: 另一种方法是向位于 [path]``/etc/venv-salt-minon/minion.d/susemanager.conf``（或 [path]``/etc/salt-minon/minion.d/susemanager.conf``） 的 {salt} 客户端配置文件添加一些特殊标志，即以下内容（将此内容与现有的内容合并）：

source: grains: susemanager: activation_key: "<KEY_ID>" management_key: "MINION_REACTIVATION_KEY"
ca: grans: gestor de sus: activationkey: "<ActivationKeyName>"
ko: 세분화: susemanager: activation_key: "<KEY_ID>" management_key: "MINION_REACTIVATION_KEY"

source: After changing the [path]``susemanager.conf`` file, the [systemitem]``salt-minion`` service needs to be restarted on the {salt} server. By default with:
ca: Després de canviar el fitxer [path],susemanager.conf,, el servei [systemitem],salt-minion. s'ha de reiniciar al servidor {salt}. Per defecte amb:
ja: [path]``susemanager.conf``ファイルを変更した後、[systemitem]``salt-minion``サービスを{salt}サーバ上で再起動する必要があります。 デフォルトでは以下を使用します。
ko: [path]``susemanager.conf`` 파일을 변경한 후 {salt} 서버에서 [systemitem]``salt-minion`` 서비스를 다시 시작해야 합니다. 기본적으로:
zh_cn: 更改 [path]``susemanager.conf`` 文件后，需要在 {salt} 服务器上重启动 [systemitem]``salt-minion`` 服务。默认可运行以下命令来执行该操作：

source: systemctl restart venv-salt-minon
ca: systemctl reinicia venv-salt-minion
ko: systemctl restart venv-salt-minion

source: Or for legacy {salt} with:
ca: O per al llegat {salt} amb:
ja: レガシの{salt}の場合は、以下を使用します。
ko: 또는 레거시 {salt}의 경우:
zh_cn: 对于旧版 {salt}，请运行以下命令：

source: systemctl restart salt-minon
ca: systemctl reinicia salt-minion

source: The [systemitem]``liberate`` formula
ca: Comprova [systemitem].Seleccionar rhel-systems..
ja: [systemitem]``liberate`` formula
ko: [systemitem]``liberate``수식
zh_cn: [systemitem]``liberate`` 公式

source: Migrating Enterprise Linux (EL) clients to {sll} with the [systemitem]``liberate`` formula. For more information, see xref:specialized-guides:salt/salt-formula-liberate.adoc[].
ca: Migrant clients d'Enterprise Linux (EL) a {sll} amb la fórmula [systemitem].liberate.. Per a més informació, vegeu xref:specialized-guides:salt/salt-formula-liberate.adoc[].
ja: [systemitem]``liberate`` formulaを使用してEnterprise Linux (EL)クライアントを{sll}に移行します。 詳細については、xref:specialized-guides:salt/salt-formula-liberate.adoc[]を参照してください。
ko: [systemitem]``liberate`` 수식을 사용하여 Enterprise Linux(EL) 클라이언트를 {sll}로 마이그레이션합니다. 자세한 내용은 xref:specialized-guides:salt/salt-formula-liberate.adoc[]에서 확인할 수 있습니다.
zh_cn: 您可以使用 [systemitem]``liberate`` 公式将 Enterprise Linux (EL) 客户端迁移到 {sll}。有关详细信息，请参见 xref:specialized-guides:salt/salt-formula-liberate.adoc[]。

source: Registering {sl-micro} Clients
ca: S'estan registrant {sle} clients
ja: {sl-micro}クライアントの登録
ko: {sl-micro} 클라이언트 등록
zh_cn: 注册 {sl-micro} 客户端

source: This section contains information about registering clients running {sl-micro} operating system 6.0 {x86_64}, {arm64}, and {zsystems} (s390x).
ca: Aquesta secció conté informació sobre el registre de clients que executen el sistema operatiu {sl-micro} 6.0 {x8664}, {arm64} i {zsystems} (s390x).

source: The {sl-micro} uses transactional updates. Transactional updates are atomic (all updates are applied only if all updates succeed) and support rollbacks. They do not affect a running system as no changes are activated until after the system is rebooted.
ca: El {sl-micro} utilitza actualitzacions transaccionals. Les actualitzacions transaccionals són atòmiques (totes les actualitzacions només s'apliquen si totes les actualitzacions tenen èxit) i suporten els rollbacks. No afecten a un sistema en execució ja que no s'activen canvis fins després de reiniciar el sistema.

source: Before you register {sl-micro} clients to the {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de registrar {sle} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.

source: {sl-micro} 6.1 Products - WebUI
ca: {rocky} Productes - WebUI

source: | OS Version | Product Name | {sl-micro} 6.1 {x86_64} | SUSE Linux Micro 6.1 x86_64 | {sl-micro} 6.1 {arm64} | SUSE Linux Micro 6.1 arch64 | {sl-micro} 6.1 {s390x} | SUSE Linux Micro 6.1 s390x | {sl-micro} 6.1 {ppc64le} | SUSE Linux Micro 6.1 ppc64le
ca: Versió del SO Nom del producte {sl-micro} 6.1 {x8664} SUSE Linux Micro 6.1 x8664 {sl-micro} 6.1 {arm64} SUSE Linux Micro 6.1 arch64 {sl-micro} 6.1 {s390x} SUSE Linux Micro 6.1 s390x {sl-micro} 6.1 {ppc64le} SUSE Linux Micro 6.1 ppc64le

source: {sl-micro} 6.0 Products - WebUI
ca: {rocky} Productes - WebUI

source: | OS Version | Product Name | {sl-micro} 6.0 {x86_64} | SUSE Linux Micro 6.0 x86_64 | {sl-micro} 6.0 {arm64} | SUSE Linux Micro 6.0 arch64 | {sl-micro} 6.0 {s390x} | SUSE Linux Micro 6.0 s390x
ca: Versió del SO Nom del producte {sl-micro} 6.0 {x8664} SUSE Linux Micro 6.0 x8664 {sl-micro} 6.0 {arm64} SUSE Linux Micro 6.0 arch64 {sl-micro} 6.0 {s390x} SUSE Linux Micro 6.0 s390x
ja: | OSバージョン | 製品名 | {sl-micro} 6.0 {x86_64} | SUSE Linux Micro 6.0 x86_64 | {sl-micro} 6.0 {arm64} | SUSE Linux Micro 6.0 arch64 | {sl-micro} 6.0 {s390x} | SUSE Linux Micro 6.0 s390x
ko: | OS 버전 | 제품 이름 | {sl-micro} 6.0 {x86_64} | SUSE Linux Micro 6.0 x86_64 | {sl-micro} 6.0 {arm64} | SUSE Linux Micro 6.0 arch64 | {sl-micro} 6.0 {s390x} | SUSE Linux Micro 6.0 s390x
zh_cn: | 操作系统版本 | 产品名称 | {sl-micro} 6.0 {x86_64} | SUSE Linux Micro 6.0 x86_64 | {sl-micro} 6.0 {arm64} | SUSE Linux Micro 6.0 arch64 | {sl-micro} 6.0 {s390x} | SUSE Linux Micro 6.0 s390x

source: {sl-micro} 6.1 Products - CLI
ca: Micro Productes SLE - CLI

source: | OS Version | Base Channel | {sl-micro} 6.1 {x86_64} | sl-micro-6.1-pool-x86_64
ca: | Versió del SO | Canal base | {alibabaclo} 2 | alibaba-2-x86_64

source: {sl-micro} 6.0 Products - CLI
ca: Micro Productes SLE - CLI

source: | OS Version | Base Channel | {sl-micro} 6.0 {x86_64} | sl-micro-6.0-pool-x86_64
ca: | Versió del SO | Canal base | {alibabaclo} 2 | alibaba-2-x86_64
ja: | OSバージョン | ベースチャンネル | {sl-micro} 6.0 {x86_64} | sl-micro-6.0-pool-x86_64
ko: | OS 버전 | 기본 채널 | {sl-micro} 6.0 {x86_64} | sl-micro-6.0-pool-x86_64
zh_cn: | 操作系统版本 | 基础通道 | {sl-micro} 6.0 {x86_64} | sl-micro-6.0-pool-x86_64

source: Without client tools onboarding clients will fail.
ca: Sense les eines del client, els clients que s'incorporin fallaran.

source: SL Micro Channels - CLI
ca: Canals ES - CLI

source: | OS Version | Client Channel | {sl-micro} 6.1 | sl-microos-6.1-uyuni-client | {sl-micro} 6.0 | sl-microos-6.0-uyuni-client
ca: Versió del SO Canal client {sl-micro} 6.1 sl-microos-6.1-uyuni-client {sl-micro} 6.0 sl-microos-6.0-uyuni-client

source: {sl-micro} clients require a reboot after registering. Although a reboot is automatically scheduled after registration is completed, it is respecting the default reboot manager maintenance window. This window may be several hours after the client is registered. It is advisable to manually reboot the client after the registration script finishes, to speed up the registration and to see the system appear in the system list.
ca: {sl-micro} clients requereixen un reinici després de registrar-se. Tot i que un reinici es programa automàticament després de completar el registre, es respecta la finestra predeterminada de manteniment del gestor de reinici. Aquesta finestra pot ser diverses hores després que el client estigui registrat. És aconsellable reiniciar manualment el client un cop finalitzat el script de registre, per accelerar el registre i per veure el sistema apareix a la llista de sistemes.
ja: {sl-micro}クライアントは、登録後に再起動が必要です。 登録が完了すると、再起動が自動的にスケジュールされますが、デフォルトの再起動マネージャのメンテナンスウィンドウに従って実行されます。このウィンドウは、クライアントが登録されてから数時間後に表示される場合があります。 登録を高速化し、システムがシステムリストに表示されるようにするには、登録スクリプトの終了後にクライアントを手動で再起動することをお勧めします。
ko: {sl-micro} 클라이언트를 등록한 후 재부팅해야 합니다. 등록이 완료된 후 재부팅이 자동으로 예약되지만, 기본 재부팅 관리자 유지보수 기간을 따릅니다. 이 기간은 클라이언트가 등록된 후 몇 시간이 걸릴 수 있습니다. 등록 속도를 향상하고 시스템이 시스템 목록에 표시되는 것을 확인하려면 등록 스크립트가 완료된 후 클라이언트를 수동으로 재부팅하는 것이 좋습니다.
zh_cn: {sl-micro} 客户端在注册后需要进行重引导。尽管系统在完成注册后会自动安排重引导，但会采用默认的重引导管理器维护时段。此时段在客户端注册后可能会持续几个小时。建议在注册脚本完成后手动重引导客户端，以加速注册过程并使系统显示在系统列表中。

source: When using a bootstrap script with {sl-micro} systems, ensure that the certificate section of the script has this content:
ca: Quan utilitzeu un script d'arrencada amb sistemes {sl-micro}, assegureu-vos que la secció de certificat de l'script tingui aquest contingut:
ja: {sl-micro}システムでブートストラップスクリプトを使用する場合は、スクリプトの証明書セクションに次のコンテンツがあることを確認します。
ko: {sl-micro} 시스템에서 부트스트랩 스크립트를 사용할 때 스크립트의 인증서 섹션에 다음 내용이 있는지 확인하십시오.
zh_cn: 对 {sl-micro} 系统使用引导脚本时，请确保脚本的 certificate 部分包含以下内容：

source: Reboot {sl-micro}
ca: Reinicia {sl-micro}
ja: {sl-micro}の再起動
ko: {sl-micro} 재부팅
zh_cn: 重引导 {sl-micro}

source: {sl-micro} is a transactional system. Transactional updates in general support several reboot methods. It is recommended to use [systemitem]``systemd`` for rebooting in systems managed by {productname}. Using other methods can lead to undesired behavior.
ca: {sl-micro} és un sistema transaccional. Les actualitzacions transaccionals en general suporten diversos mètodes de reinici. Es recomana utilitzar [systemitem] tosystemd to per reiniciar en sistemes gestionats per {productname}. L'ús d'altres mètodes pot conduir a un comportament no desitjat.
ja: {sl-micro}はトランザクションシステムです。トランザクション更新は通常、いくつかの再起動方法をサポートしています。 {productname}で管理されるシステムの再起動には、[systemitem]``systemd``を使用することをお勧めします。他の方法を使用すると、望ましくない動作が発生する可能性があります。
ko: {sl-micro}는 트랜잭션 시스템입니다. 일반적으로 트랜잭션 업데이트는 다양한 재부팅 방법을 지원합니다. {productname}에서 관리하는 시스템에서 재부팅을 수행하려면 [systemitem]``systemd``를 사용하는 것이 좋습니다. 다른 방법을 사용하면 원하지 않은 동작이 발생할 수 있습니다.
zh_cn: {sl-micro} 是一种事务系统。事务更新一般支持数种重引导方法。建议在 {productname} 所管理的系统中使用 [systemitem]``systemd`` 来进行重引导。使用其他方法可能会导致系统出现意外行为。

source: Registering {opensuse} {tumbleweed} Clients
ca: Registre de clients del producte {opensuse} {tumbleweed}

source: This section contains information about registering clients running {opensuse} operating systems. {productname} supports {opensuse} Tumbleweed clients using {salt}.
ca: Aquesta secció conté informació sobre com registrar clients que executen els sistemes operatius {opensuse}. {productname} admet clients de Tumbleweed, {opensuse}, que usen {salt}.

source: Bootstrapping is supported for starting {opensuse} clients and performing initial state runs such as setting repositories and performing profile updates.
ca: El bootstrapping es pot utilitzar amb {debian} clients per realitzar execucions d'estat inicials i per actualitzacions de perfil.
ja: ブートストラップは、リポジトリの設定やプロファイルの更新の実行など、{opensuse}クライアントの起動および初期状態の実行のためにサポートされています。
ko: 부트스트래핑은 {opensuse} 클라이언트 시작과 초기 상태 실행 수행(예: 리포지토리 설정, 프로파일 업데이트 수행)에 대해 지원됩니다.
zh_cn: 支持使用引导功能启动 {opensuse} 客户端并执行初始状态运行，例如设置储存库和执行配置文件更新。

source: Before you register {opensuse} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de registrar {opensuse} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.
ja: {opensuse}クライアントを{productname}サーバに登録する前に、必要なソフトウェアチャンネルを追加して同期する必要があります。
ko: {opensuse} 클라이언트를 {productname} 서버에 등록하기 전에 필요한 소프트웨어 채널을 추가하고 이 채널을 동기화해야 합니다.
zh_cn: 将 {opensuse} 客户端注册到您的 {productname} 服务器之前，您需要添加所需的软件通道，并同步这些通道。

source: | OS Version | Product Name | {opensuse} Tumbleweed | {opensuse} Tumbleweed x86_64
ca: | Versió del sistema operatiu | Nom del producte | {opensuse} Tumbleweed | {opensuse} Tumbleweed x86_64

source: | OS Version | Base Channel | {opensuse} | opensuse-tumbleweed-pool
ca: | Versió del sistema operatiu | Canal base | {opensuse} | opensuse-tumbleweed-pool

source: | OS Version | {opensuse} {tumbleweed} | Base Channel | opensuse_tumbleweed | Client Channel | opensuse_tumbleweed-uyuni-client | Updates Channel | opensuse_tumbleweed-updates | Non-OSS Channel | opensuse_tumbleweed-non-oss | Non-OSS Updates Channel | opensuse_tumbleweed-non-oss-updates | Backports Updates Channel| opensuse_tumbleweed-backports-updates | SLE Updates Channel | opensuse_tumbleweed-sle-updates
ca: | Versió del sistema operatiu | {opensuse} {tumbleweed} | Canal base | opensuse_tumbleweed | Canal client | opensuse_tumbleweed-uyuni-client | Canal d'actualitzacions | opensuse_tumbleweed-updates | Canal no OSS | opensuse_tumbleweed-non-oss | Canal d'actualitzacions no OSS | opensuse_tumbleweed-non-oss-updates | Canal d'actualitzacions de retrocompatibilitats | opensuse_tumbleweed-backports-updates | Canal d'actualitzacions de SLE | opensuse_tumbleweed-sle-updates

source: {opensuse} channels can be very large. Synchronization can sometimes take several hours.
ca: {opensuse} canals poden ser molt grans. La sincronització de vegades pot trigar diverses hores.
ja: {opensuse}チャンネルは非常に大きいことがあります。 同期に数時間かかる場合があります。
ko: {opensuse} 채널은 규모가 매우 클 수 있습니다. 때로 동기화에 몇 시간이 걸릴 수 있습니다.
zh_cn: {opensuse} 通道可能会非常大。同步所需的时间可能会长达数小时。

source: Registering {ubuntu} Clients
ca: Registre de clients d'{ubuntu}

source: This section contains information about registering clients running {ubuntu} operating systems.
ca: Aquesta secció conté informació sobre com registrar clients que executen sistemes operatius {ubuntu}.

source: {ubuntu} repository URLs are available from {scclongform}.
ca: Els URL del repositori {ubuntu} estan disponibles des de {scclongform}.

source: Packages and metadata are provided by Ubuntu, not by {suse}.
ca: Els paquets i les metadades són proporcionats per Ubuntu, no per {suse}.

source: For supported products, see the release notes and the support table at xref:client-configuration:supported-features-ubuntu.adoc[].
ca: Per obtenir una llista completa de clients i característiques compatibles, vegeu xref:client-configuration:supported-features.adoc[].

source: {productname} supports {ubuntu} 22.04 LTS and 24.04 LTS clients using {salt}.
ca: {productname} admet {ubuntu} 22.04 LTS i 24.04 LTS clients que utilitzen {salt}.

source: Bootstrapping is supported for starting {ubuntu} clients and performing initial state runs such as setting repositories and performing profile updates. However, the root user on {ubuntu} is disabled by default, so to use bootstrapping, you require an existing user with [command]``sudo`` privileges for Python.
ca: Bootstrapping és compatible per iniciar {ubuntu} clients i realitzar operacions d'estat inicial, com ara establir repositoris i realitzar actualitzacions de perfil. No obstant això, l'usuari root a {ubuntu} està desactivat de manera predeterminada, de manera que per utilitzar bootstrapping, necessiteu un usuari existent amb privilegis [command].sudo. per a Python.
ja: ブートストラップは、リポジトリの設定やプロファイルの更新の実行など、{ubuntu}クライアントの起動および初期状態の実行のためにサポートされています。 ただし、{ubuntu}のrootユーザはデフォルトで無効になっているため、ブートストラップを使用するには、Pythonの[command]``sudo``特権がある既存ユーザが必要です。
ko: 부트스트래핑은 {ubuntu} 클라이언트 시작과 초기 상태 실행 수행(예: 리포지토리 설정, 프로파일 업데이트 수행)에 대해 지원됩니다. 하지만 {ubuntu}의 루트 사용자는 기본적으로 비활성화되므로 부트스트래핑을 사용하려면 Python에 대한 [command]``sudo`` 권한이 있는 기존 사용자가 필요합니다.
zh_cn: 支持使用引导功能启动 {ubuntu} 客户端，并执行初始状态运行，例如设置储存库和执行配置文件更新。不过，默认会禁用 {ubuntu} 上的 root 用户，因此要使用引导，需要有一个具有 Python [command]``sudo`` 特权的现有用户。

source: Canonical does not endorse or support {productname}.
ca: Canonical no dona suport ni suport a {productname}.
ja: Canonicalは、{productname}を保証またはサポートしていません。
ko: Canonical은 {productname}를 지지하거나 지원하지 않습니다.
zh_cn: Canonical 未授权也不支持 {productname}。

source: Before you register {ubuntu} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de registrar {ubuntu} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.
ja: {ubuntu}クライアントを{productname}サーバに登録する前に、必要なソフトウェアチャンネルを追加して同期する必要があります。
ko: {ubuntu} 클라이언트를 {productname} 서버에 등록하기 전에 필요한 소프트웨어 채널을 추가하고 이 채널을 동기화해야 합니다.
zh_cn: 将 {ubuntu} 客户端注册到您的 {productname} 服务器之前，您需要添加所需的软件通道，并同步这些通道。

source: Ubuntu Products - WebUI
ca: Productes Ubuntu - WebUI
ja: Ubuntu製品 - WebUI
ko: Ubuntu 제품 - WebUI
zh_cn: Ubuntu 产品 - WebUI

source: | OS Version | Product Name | {ubuntu} 24.04 | Ubuntu 24.04 | {ubuntu} 22.04 | Ubuntu 22.04
ca: Versió del SO Nom del producte {ubuntu} 24.04 Ubuntu 24.04 {ubuntu} 22.04 Ubuntu 22.04

source: Ubuntu Channels - CLI
ca: Canals d'Ubuntu - CLI
ja: Ubuntuチャンネル - CLI
ko: Ubuntu 채널 - CLI
zh_cn: Ubuntu 通道 - CLI

source: | OS Version | Base Channel | {ubuntu} 24.04 | ubuntu-2404-amd64-main-amd64 | {ubuntu} 22.04 | ubuntu-2204-amd64-main-amd64
ca: Versió del SO Canal base {ubuntu} 24.04 ubuntu-2404-amd64-main-amd64 {ubuntu} 22.04 ubuntu-2204-amd64-main-amd64

source: | OS Version | Base Channel | Main Channel | Updates Channel | Security Channel | Client Channel | {ubuntu} 24.04 | ubuntu-2404-pool-amd64-uyuni | ubuntu-2404-amd64-main-uyuni | ubuntu-2404-amd64-main-updates-uyuni | ubuntu-2404-amd64-main-security-uyuni | ubuntu-2404-amd64-uyuni-client | {ubuntu} 22.04 | ubuntu-2204-pool-amd64-uyuni | ubuntu-2204-amd64-main-uyuni | ubuntu-2204-amd64-main-updates-uyuni | ubuntu-2204-amd64-main-security-uyuni | ubuntu-2204-amd64-uyuni-client | {ubuntu} 20.04 | ubuntu-2004-pool-amd64-uyuni | ubuntu-2004-amd64-main-uyuni | ubuntu-2004-amd64-main-updates-uyuni | ubuntu-2004-amd64-main-security-uyuni | ubuntu-2004-amd64-uyuni-client
ca: Versió del SO Canal base Canal principal Canal d'actualitzacions Canal de seguretat Canal client {ubuntu} 24.04 ubuntu-2404-pool-amd64-uyuni ubuntu-2404-amd64-main-uyuni ubuntu-2404-amd64-main-updates-uyuni ubuntu-2404-amd64-main-security-uyuni ubuntu-2404-amd64-amd64-uyuni ub {ubuntu} 22.04 ubuntu-2204-pool-amd64-uyuni ubuntu-2204-amd64-main-uyuni ubuntu-2204-amd64-main-updates-uyuni ubuntu-2204-amd64-main-security-uyuni ubuntu-2204-amd64-amd64-uyuni ub {ubuntu} 20.04 ubuntu-2004-pool-amd64-uyuni ubuntu-2004-amd64-main-uyuni ubuntu-2004-amd64-main-updates-uyuni ubuntu-2004-amd64-main-security-uyuni ubuntu-2004-amd64-uyuni-client

source: Version 20.04 also requires the Universe channels:
ca: La versió 20.04 també requereix els canals de l'Univers:

source: Ubuntu 20.04 Universe Channels - CLI
ca: Canals d'Ubuntu - CLI

source: | {ubuntu} 20.04 | {nbsp} | Universe Channel | ubuntu-2004-amd64-universe-uyuni | Universe Updates Channel | ubuntu-2004-amd64-universe-updates-uyuni | Universe Security Updates Channel | ubuntu-2004-amd64-universe-security-uyuni | Universe Backports Channel | ubuntu-2004-amd64-universe-backports-uyuni
ca: {ubuntu} 20.04 {nbsp} Canal de l'Univers ubuntu-2004-amd64-universe-uyuni s Universe Updates Channel ubuntu-2004-amd64-universe-updates-uyuni s Universe Security Updates Channel ubuntu-2004-amd64-universe-security-uyuni Universe Backports Channel ubuntu-2004-amd64-universe-backports-uyuni

source: You need all the new channels fully synchronized before bootstrapping any Ubuntu client.
ca: Necessiteu tots els canals nous completament sincronitzats abans d'arrencar qualsevol client d'Ubuntu.
ja: Ubuntuクライアントをブートストラップする前に、新しいチャンネルはすべて完全に同期されている必要があります。
ko: 새 채널을 완전히 동기화한 후에 Ubuntu 클라이언트를 부트스트랩해야 합니다.
zh_cn: 在引导任何 Ubuntu 客户端之前，您需要完全同步所有新通道。

source: Mirror Ubuntu ESM packages
ca: Emmiralla els paquets ESM d'Ubuntu

source: Canonical provides https://ubuntu.com/security/esm[Expanded Security Maintenance] (**ESM**) packages for https://ubuntu.com/pro[Ubuntu Pro] users and customers. These packages offer longer maintenance (_10 to 12 years_) for several operating system components and selected applications.
ca: Canonical proporciona https://ubuntu.com/security/esm[Expanded Security Maintenance] (**ESM**) paquets per a usuaris i clients https://ubuntu.com/pro[Ubuntu Pro]. Aquests paquets ofereixen un manteniment més llarg (10 a 12 anys) per a diversos components del sistema operatiu i aplicacions seleccionades.
