Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: If the client has SELinux enabled, you can configure [guimenu]``SELinux contexts`` to enable the required file attributes (for example: user, role, and file type).
ca: Si el client té SELinux habilitat, podeu configurar [guimenu]).contextos SELinux). per a habilitar els atributs de fitxer requerits (per exemple: usuari, rol i tipus de fitxer).
ja: クライアントでSELinuxが有効になっている場合、［[guimenu]``SELinux contexts``］（SELinuxコンテキスト）を設定して、必要なファイル属性(ユーザ、ロール、ファイルタイプなど)を有効にできます。
ko: 클라이언트가 SELinux를 활성화한 경우 [guimenu]``SELinux 컨텍스트``를 구성하여 필수 파일 속성(예: 사용자, 역할, 파일 형식)을 활성화할 수 있습니다.
zh_cn: 如果客户端启用了 SELinux，您可以配置 [guimenu]``SELinux 上下文``以启用所需的文件属性（例如用户、角色和文件类型）。

source: If the configuration file includes a macro, enter the symbol that marks the beginning and end of the macro.
ca: Si el fitxer de configuració inclou una macro, introduïu el símbol que marca l'inici i el final de la macro.
ja: 設定ファイルにマクロが含まれている場合、マクロの先頭および末尾をマークする記号を入力します。
ko: 구성 파일에 매크로가 포함된 경우 매크로의 시작과 끝을 표시하는 기호를 입력하십시오.
zh_cn: 如果配置文件包含宏，请输入标记宏开始位置和结束位置的符号。

source: Enter the configuration file contents in the [guimenu]``File Contents`` text box, using the script drop-down box to choose the appropriate scripting language.
ca: Introduïu el contingut del fitxer de configuració al quadre de text [guimenu].Continguts del fitxer., utilitzant la llista desplegable script per a triar el llenguatge de script adequat.
ja: ［[guimenu]``ファイルの内容``］テキストボックスで設定ファイルの内容を入力し、スクリプトドロップダウンボックスを使用して、適切なスクリプト言語を選択します。
ko: [guimenu]``파일 내용`` 텍스트 상자에 구성 파일 내용을 입력합니다. 이때 스크립트 드롭다운 상자를 사용해 적절할 스크립팅 언어를 선택합니다.
zh_cn: 在[guimenu]``文件内容``文本框中，使用脚本下拉框选择相应的脚本语言输入配置文件内容。

source: Click btn:[Create Configuration File].
ca: Feu clic a btn:[Crea el fitxer de configuració].
ja: btn:[設定ファイルの作成]をクリックします。
ko: btn:[구성 파일 생성]을 클릭합니다.
zh_cn: 单击 btn:[创建配置文件]。

source: Subscribe Clients to Configuration Channels
ca: Subscriu els clients als canals de configuració
ja: クライアントを設定チャンネルにサブスクライブする
ko: 클라이언트를 구성 채널에 가입
zh_cn: 为客户端订阅配置通道

source: You can subscribe individual clients to configuration channels by navigating to menu:Systems[System List], selecting the client you want to subscribe, and navigating to the [guimenu]``Configuration`` tab. To subscribe multiple clients to a configuration channel, you can use the system set manager (SSM).
ca: Podeu subscriure clients individuals als canals de configuració navegant al menú:Sistemes[Llista de sistemes], seleccionant el client que voleu subscriure, i navegant a la pestanya [guimenu].Configuració.. Per a subscriure múltiples clients a un canal de configuració, podeu utilitzar el gestor de conjunts de sistema (SSM).
ja: 個々のクライアントを設定チャンネルにサブスクライブできます。そのためには、menu:システム[システム一覧]に移動し、サブスクライブするクライアントを選択し、［[guimenu]``設定``］タブに移動します。 複数のクライアントを設定チャンネルにサブスクライブするには、システムセットマネージャ(SSM)を使用できます。
ko: menu:시스템[시스템 목록]으로 이동하여 가입하려는 클라이언트를 선택하고 [guimenu]``구성`` 탭으로 이동하여 개별 클라이언트를 구성 채널에 가입할 수 있습니다. 여러 클라이언트를 구성 채널에 가입하려면 시스템 세트 관리자(SSM)를 사용하면 됩니다.
zh_cn: 您可以为单个客户端订阅配置通道，方法是导航到menu:系统[系统列表]，选择要使用的客户端，然后导航到[guimenu]``配置``选项卡。要为多个客户端订阅配置通道，可以使用系统集管理器 (SSM)。

source: Procedure: Subscribing Multiple Clients to Configuration Channels
ca: Procediment: Subscriure múltiples clients a canals de configuració
ja: プロシージャ: 複数のクライアントを設定チャンネルにサブスクライブする
ko: 절차: 여러 클라이언트를 구성 채널에 가입
zh_cn: 过程：为多个客户端订阅配置通道

source: In the {productname} {webui}, navigate to menu:Systems[Systems List] and select the clients you want to work with.
ca: A {productname} {webui}, navegueu al menú:Systems[Llista de sistemes] i seleccioneu els clients amb els quals voleu treballar.
ja: {productname}の{webui}で、menu:システム[システム一覧]に移動し、操作するクライアントを選択します。
ko: {productname} {webui}에서 menu:시스템[시스템 목록]으로 이동하여 작업하려는 클라이언트를 선택합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[系统列表]，然后选择要使用的客户端。

source: Navigate to menu:Systems[System Set Manager], and go to the menu:Configuration[Subscribe to Channels] subtab to see the list of available configuration channels.
ca: Navega al menú:Systems[System Set Manager], i ves a la sub pestanya menu:Configuration[Subscribe to Channels] per veure la llista de canals de configuració disponibles.
ja: menu:システム[システムセットマネージャ]に移動し、menu:設定[チャンネルにサブスクライブ]サブタブに移動し、使用できる設定チャンネルの一覧を表示します。
ko: menu:시스템[시스템 세트 관리자]로 이동하여 menu:구성[채널에 가입] 하위 탭에서 사용 가능한 구성 채널의 목록을 확인합니다.
zh_cn: 导航到menu:系统[系统集管理器]，然后转到menu:配置[订阅通道]子选项卡，以查看可用配置通道的列表。

source: OPTIONAL: Click the number in the [guimenu]``Systems currently subscribed`` column to see which clients are currently subscribed to the configuration channel.
ca: OPCIONAL: Feu clic al número a la columna [guimenu].Sistemes actualment subscrits. per a veure quins clients estan subscrits al canal de configuració.
ja: オプション: ［[guimenu]``現在サブスクライブしているシステム``］列で番号をクリックして、設定チャンネルに現在サブスクライブされているクライアントを表示します。
ko: 옵션: [guimenu]``현재 가입된 시스템`` 열의 숫자를 클릭하여 현재 어떤 클라이언트가 구성 채널에 가입되어 있는지 확인합니다.
zh_cn: 可选：单击[guimenu]``目前订阅的系统``列中的数字以查看目前订阅了配置通道的客户端。

source: Check the configuration channels you want to subscribe to, and click btn:[Continue].
ca: Comproveu els canals de configuració als quals voleu subscriure-us i feu clic a btn:[Continue].
ja: サブスクライブ先の設定チャンネルを確認し、btn:[続行]をクリックします。
ko: 가입하려는 구성 채널을 확인하고 btn:[계속]을 클릭합니다.
zh_cn: 选中要订阅的配置通道，然后单击 btn:[继续]。

source: Rank the configuration channels using the up and down arrows.
ca: Ordena els canals de configuració utilitzant les fletxes amunt i avall.
ja: 上下矢印を使用して設定チャンネルをランクします。
ko: 위 및 아래 방향 화살표를 사용해 구성 채널의 순위를 지정합니다.
zh_cn: 使用向上和向下箭头对配置通道排名。

source: Where settings conflicts occur between configuration channels, channels closer to the top of the list take precedence.
ca: Quan els conflictes de configuració es produeixen entre els canals de configuració, els canals més propers a la part superior de la llista tenen prioritat.
ja: 設定の競合が設定チャンネルで発生した場合、一覧の上の方にあるチャンネルが優先されます。
ko: 설정이 구성 채널 간에 서로 충돌하는 경우 목록 상단에 더 가까이 있는 채널이 우선합니다.
zh_cn: 两个配置通道之间的设置发生冲突时，系统会优先使用更靠近列表顶部的通道。

source: Determine how the channels are applied to the selected clients.
ca: Determina com s'apliquen els canals als clients seleccionats.
ja: 選択したクライアントにチャンネルを適用する方法を決定します。
ko: 선택한 클라이언트에 채널이 적용되는 방식을 결정합니다.
zh_cn: 确定通道应用到所选客户端的方式。

source: Click btn:[Subscribe With Lowest Priority] to add the new channels at a lower priority than currently subscribed channels. Click btn:[Subscribe with Highest Priority] to add the new channels at a higher priority than currently subscribed channels. Click btn:[Replace Existing Subscriptions] to remove existing channels and replace them with the new channels.
ca: Feu clic a btn:[Subscriu amb la prioritat més baixa] per afegir els canals nous amb una prioritat més baixa que els canals subscrits actualment. Feu clic a btn:[Subscriu amb la prioritat més alta] per afegir els canals nous amb una prioritat més alta que els canals subscrits actualment. Feu clic a btn:[Reemplaça les subscripcions existents] per a eliminar els canals existents i substituir-los pels nous canals.
ja: btn:[最も低い順位でサブスクライブ]をクリックして、現在サブスクライブしているチャンネルより低い優先度で新しいチャンネルを追加します。 btn:[最も高い順位でサブスクライブ]をクリックして、現在サブスクライブしているチャンネルより高い優先度で新しいチャンネルを追加します。 btn:[既存のサブスクリプションを置換]をクリックして、既存のチャンネルを削除し、新しいチャンネルに置き換えます。
ko: btn:[최하위 우선순위로 가입]을 클릭하여 새 채널을 현재 가입된 채널보다 낮은 우선순위로 추가합니다. btn:[최상위 우선순위로 가입]을 클릭하여 새 채널을 현재 가입된 채널보다 높은 우선순위로 추가합니다. btn:[기존 구독 대체]를 클릭하여 기존 채널을 제거하고 새 채널로 교체합니다.
zh_cn: 单击 btn:[订阅为最低优先级] 可将新通道添加为比目前订阅的通道都低的优先级。单击 btn:[订阅为最高优先级] 可将新通道添加为比目前订阅的通道都高的优先级。单击 btn:[替换现有订阅] 可去除现有通道并将其替换为新通道。

source: Click btn:[Apply Subscriptions].
ca: Feu clic a btn:[Aplica les subscripcions].
ja: btn:[サブスクリプションの適用]をクリックします。
ko: btn:[구독 적용]을 클릭합니다.
zh_cn: 单击 btn:[应用订阅]。

source: If new configuration channel priorities conflict with existing channels, the duplicate channel is removed and replaced according to the new priority. If the client's configuration priorities are going to be reordered by an action, the {webui} requires you to confirm the change before proceeding.
ca: Si les prioritats del canal de configuració nou entren en conflicte amb els canals existents, el canal duplicat s'eliminarà i se substituirà d'acord amb la nova prioritat. Si les prioritats de configuració del client es reordenaran amb una acció, la {webui} requereix que confirmeu el canvi abans de continuar.
ja: 新しい設定チャンネルの優先度が既存のチャンネルと競合する場合、重複チャンネルが削除され、新しい優先度に応じて置き換えられます。 クライアントの設定優先度をアクションで順序変更する場合、{webui}では続行する前に変更を確認する必要があります。
ko: 새 구성 채널 우선순위가 기존 채널과 충돌하는 경우 중복 채널이 제거되고 새로운 우선순위에 따라 교체됩니다. 작업에 의해 클라이언트의 구성 우선순위가 변경되는 경우 {webui}는 작업을 진행하기 전에 이러한 변경을 확인하도록 사용자에게 요구합니다.
zh_cn: 如果新配置通道优先级与现有通道冲突，系统会去除重复的通道并根据新优先级进行替换。如果某个操作要对客户端的配置优先级重新排序，{webui} 会要求您在继续之前先确认更改。

source: Compare Configuration Files
ca: Fitxers de configuració
ja: 設定ファイルの比較
ko: 구성 파일 비교
zh_cn: 比较配置文件

source: You can also use the system set manager (SSM) to compare the configuration file deployed on clients with the configuration file stored on the {productname} Server.
ca: També podeu utilitzar el gestor de conjunts de sistema (SSM) per comparar el fitxer de configuració desplegat als clients amb el fitxer de configuració emmagatzemat al servidor {productname}.
ja: システムセットマネージャ(SSM)を使用して、{productname}サーバに保存されている設定ファイルを使用してクライアントに展開された設定ファイルを比較することもできます。
ko: 또한 시스템 세트 관리자(SSM)를 사용해 클라이언트에 배포된 구성 파일을 {productname} 서버에 저장된 구성 파일과 비교할 수 있습니다.
zh_cn: 您也可以使用系统集管理器 (SSM) 将客户端上部署的配置文件与存储在 {productname} 服务器上的配置文件进行比较。

source: Procedure: Comparing Configuration Files
ca: Procediment: Creació d'un canal de configuració central
ja: プロシージャ: 設定ファイルの比較
ko: 절차: 구성 파일 비교
zh_cn: 过程：比较配置文件

source: In the {productname} {webui}, navigate to menu:Systems[Systems List] and select the clients subscribed to the configuration files you want to compare.
ca: A {productname} {webui}, navegueu al menú:Systems[Llista de sistemes] i seleccioneu els clients subscrits als fitxers de configuració que voleu comparar.
ja: {productname}の{webui}で、menu:システム[システム一覧]に移動して、比較する設定ファイルにサブスクライブされているクライアントを選択します。
ko: {productname} {webui}에서 menu:시스템[시스템 목록]으로 이동하여 비교하려는 구성 파일에 가입된 클라이언트를 선택합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[系统列表]，然后选择订阅了要比较的配置文件的客户端。

source: Navigate to menu:Systems[System Set Manager], and go to the menu:Configuration[Compare Files] subtab to the list of available configuration files.
ca: Navega al menú:Systems[System Set Manager], i ves a la subpestanya menu:Configuration[Compare Files] a la llista de fitxers de configuració disponibles.
ja: menu:システム[システムセットマネージャ]に移動し、menu:設定[ファイルの比較]サブタブに移動し、使用できる設定チャンネルの一覧を表示します。
ko: menu:시스템[시스템 세트 관리자]로 이동하여 menu:구성[파일 비교] 하위 탭에서 사용 가능한 구성 채널의 목록으로 이동합니다.
zh_cn: 导航到menu:系统[系统集管理器]，然后转到menu:配置[比较文件]子选项卡，以查看可用配置文件的列表。

source: OPTIONAL: Click the number in the [guimenu]``Systems`` column to see which clients are currently subscribed to the configuration file.
ca: OPCIONAL: Feu clic al número de la columna [guimenu].Sistemes. per a veure quins clients estan subscrits al fitxer de configuració.
ja: オプション: ［[guimenu]``システム``］列で番号をクリックして、設定ファイルに現在サブスクライブされているクライアントを表示します。
ko: 옵션: [guimenu]``시스템`` 열의 숫자를 클릭하여 현재 어떤 클라이언트가 구성 파일에 가입되어 있는지 확인합니다.
zh_cn: 可选：单击[guimenu]``系统``列中的数字以查看目前订阅了配置文件的客户端。

source: Check the configuration files to compare, and click btn:[Schedule File Comparison].
ca: Comproveu els fitxers de configuració a comparar i feu clic a btn:[Calificació de fitxers de planificació].
ja: 比較する設定ファイルを確認し、btn:[ファイルの比較をスケジュール]をクリックします。
ko: 비교할 구성 파일을 확인하고 btn:[파일 비교 작업 일정 잡기]를 클릭합니다.
zh_cn: 选中要比较的配置文件，然后单击 btn:[安排文件比较]。

source: Jinja templating on clients
ca: Jinja templating en clients

source: Jinja templating is possible on {salt} clients. Jinja provides variables from pillars or grains. They can be used in configuration files or {salt} states.
ca: La temptació de Jinja és possible en {salt} clients. Jinja proporciona variables a partir de pilars o grans. Es poden utilitzar en fitxers de configuració o estats {salt}.
ja: Jinjaテンプレートは、{salt}クライアントで可能です。 Jinjaはピラーまたはグレインからの変数を提供します。 これらは、設定ファイルまたは{salt}状態で使用できます。
ko: {salt} 클라이언트에서 Jinja 템플릿을 사용할 수 있습니다. Jinja는 열 또는 입자에서 변수를 제공합니다. 이러한 변수는 구성 파일 또는 {salt} 상태에서 사용할 수 있습니다.
zh_cn: 在 {salt} 客户端上可以建立 Jinja 模板。Jinja 通过 pillar 或 grain 提供变量。它们可用于配置文件或 {salt} 状态中。

source: For more information, see https://docs.saltproject.io/salt/user-guide/en/latest/topics/jinja.html with this example:
ca: Per a més informació sobre el mode d'apagada a Salt, vegeu https://docs.saltstack.com/ca/latest/topics/blackout/index.html.
ja: 詳細については、次の例のlink:https://docs.saltproject.io/salt/user-guide/en/latest/topics/jinja.html[]を参照してください。
ko: 자세한 내용은 다음 예제와 함께 https://docs.saltproject.io/salt/user-guide/en/latest/topics/jinja.html[]에서 확인할 수 있습니다.
zh_cn: 有关详细信息，请参见 https://docs.saltproject.io/salt/user-guide/en/latest/topics/jinja.html[]，该页面包含以下示例：

source: {% if grains.os_family == 'RedHat' %} {% set dns_cfg = '/etc/named.conf' %} {% elif grains.os_family == 'Debian' %} {% set dns_cfg = '/etc/bind/named.conf' %} {% else %} {% set dns_cfg = '/etc/named.conf' %} {% endif %} dns_conf: file.managed: - name: {{ dns_cfg }} - source: salt://dns/files/named.conf
ca: {% if grains.osfamily 'RedHat' %} {% set dnscfg '/etc/named.conf' %} {% elif grains.osfamily 'Debian' %} {% set dnscfg '/etc/bind/named.conf' %} {% més %} {% set dnscfg '/etc/named.conf' %} {% endif %} dnsconf: fitxer.gestionat: - nom: {{ dnscfg }} - font: salt://dns/files/named.conf

source: Default Contact Method
ca: Mètode de contacte

source: The default contact method using the {salt} protocol is recommended unless there are specific needs. By default, the {salt} Bundle implementation ([package]``venv-salt-minion``) will be deployed. For more information about {salt} in general, see xref:specialized-guides:salt/salt-overview.adoc[].
ca: Es recomana el mètode de contacte per defecte que utilitza el protocol {salt} llevat que hi hagi necessitats específiques. Per defecte, es desplegarà la implementació de {salt} Bundle ([package].venv-salt-minion.). Per a més informació sobre {salt} en general, vegeu xref:specialized-guides:salt/salt-overview.adoc[].

source: The default contact method ([literal]``Default``) is the best scaling method. All new {productname} features are supported.
ca: El mètode de contacte per defecte ([literal].Default.) és el millor mètode d'escalat. S'admeten totes les funcionalitats noves de {productname}.

source: The so-called traditional contact protocol is no longer supported with {productname} 5.0 and later. Before upgrading from {productname} 4 to 5, any existing traditional clients including the traditional proxies must be migrated to {salt} or replaced with {salt} proxies.
ca: L'anomenat protocol de contacte tradicional ja no és compatible amb {productname} 5.0 i posterior. Abans d'actualitzar de {productname} 4 a 5, qualsevol client tradicional existent, inclosos els intermediaris tradicionals, ha de ser migrat a {salt} o reemplaçat per {salt} intermediaris.

source: For more information about migrating traditional {productname} 4 clients to {salt} clients, see https://documentation.suse.com/suma/4.3/en/suse-manager/client-configuration/contact-methods-migrate-traditional.html
ca: Per a més informació sobre la migració de clients tradicionals {productname} a clients {salt}, vegeu https://documentation.suse.com/suma/4.3/en/suse-manager/client-configuration/contact-methods-migrate-traditional.html

source: Software updates are generally pushed from the server to the client. Connections are initiated from the client. This means you must open ports on the server, not on clients. The {salt} clients are also known as {salt} minions. {productname} Server installs a daemon on every client.
ca: Les actualitzacions de programari generalment es transmeten des del servidor al client. Les connexions s'inicien des del client. Això significa que has d'obrir ports al servidor, no als clients. Els clients de {salt} també es coneixen com a {salt} minions. El servidor {productname} instal·la un dimoni a cada client.

source: If you need to use {salt} clients in a disconnected setup you can configure SSH Push as a contact method. With this contact method, clients can be located in a firewall-protected zone called a DMZ. For more information about SSH Push, see xref:client-configuration:contact-methods-saltssh.adoc[].
ca: Si necessiteu utilitzar {salt} clients en una configuració desconnectada, podeu configurar SSH Push com a mètode de contacte. Amb aquest mètode de contacte, els clients poden estar ubicats en una zona protegida per tallafocs anomenada DMZ. Per a més informació sobre SSH Push, vegeu xref:client-configuration:contact-methods-saltssh.adoc[].

source: Onboarding Details
ca: Detalls de l'Onboarding
ja: オンボードの詳細
ko: 온보딩 정보
zh_cn: 初始配置细节

source: {salt} has its own database to keep the keys for the minions. This needs to be kept in sync with the {productname} database. As soon as the key is accepted in {salt}, the onboarding process in {productname} starts.
ca: {salt} té la seva pròpia base de dades per mantenir les claus dels minions. Això s'ha de mantenir sincronitzat amb la base de dades {productname}. Tan aviat com s'accepta la clau a {salt}, s'inicia el procés d'onboarding a {productname}.

source: The onboarding process will look for existing systems in the {productname} database by searching for the ``minion_id`` and the ``machine-id``. Depending on the outcome, the following scenarios are possible:
ca: El procés d'onboarding cercarà els sistemes existents a la base de dades {productname} cercant el andminionid. i el themachine-id.. Segons el resultat, són possibles els següents escenaris:

source: If nothing is found, the new system gets created.
ca: Si no es troba res, es crea el nou sistema.

source: In case an entry with the ``minion_id`` or the ``machine-id`` is found, that system will be migrated to match the new system.
ca: En el cas que es trobi una entrada amb el .minionid. o el .machine-id., aquest sistema serà migrat per coincidir amb el nou sistema.

source: In case there is a match for both entries, and they are not the same system, the onboarding will be aborted with an error.
ca: En cas que hi hagi una coincidència per a ambdues entrades, i no siguin el mateix sistema, l'onboarding s'interromprà amb un error.

source: In this case the administrator needs to resolve the conflict by removing at least one of the systems.
ca: En aquest cas l'administrador ha de resoldre el conflicte eliminant almenys un dels sistemes.

source: Client Contact Methods
ca: Mètode de contacte

source: There are three contact methods how the {productname} Server can communicate with clients. They are based on {salt} protocols.
ca: Hi ha tres mètodes de contacte com el servidor {productname} pot comunicar-se amb els clients. Es basen en protocols {salt}.

source: Which {salt} contact method you use depends on the type of client and your network architecture:
ca: El mètode de contacte {salt} que utilitzeu depèn del tipus de client i de l'arquitectura de la xarxa:

source: Default
ca: Per defecte

source: is recommended unless there are specific user needs. By default, the {salt} Bundle implementation will be deployed. For more information, see xref:client-configuration:contact-methods-default.adoc[].
ca: Les actualitzacions de paquets planificades s'instal·len utilitzant el mètode de contacte configurat per a cada client. Per a més informació, vegeu xref:client-configuration:contact-methods-intro.adoc[].

source: SSH Push
ca: Push de SSH

source: is useful only if network restrictions make it impossible for clients to establish contact to the server. It is supported with the {salt} Bundle only. This contact method has serious limitations. For more information, see xref:client-configuration:contact-methods-saltssh.adoc[].
ca: només és útil si les restriccions de xarxa fan impossible que els clients estableixin contacte amb el servidor. Només està suportat amb el paquet {salt}. Aquest mètode de contacte té serioses limitacions. Per a més informació, vegeu xref:client-configuration:contact-methods-saltssh.adoc[].

source: SSH Push (with tunnel)
ca: SSH Push (amb túnel)

source: is the same as SSH Push, but with using a secured communication tunnel. For more information, see xref:client-configuration:contact-methods-saltssh-tunnel.adoc[].
ca: Les actualitzacions de paquets planificades s'instal·len utilitzant el mètode de contacte configurat per a cada client. Per a més informació, vegeu xref:client-configuration:contact-methods-intro.adoc[].

source: Implementation of {salt} communication software options:
ca: Implementació d'opcions de programari de comunicació {salt}:

source: Salt Bundle ([package]``venv-salt-minion``)
ca: Salt Bundle ([paquet])venv-salt-minió))

source: is a single binary package containing {salt} Minion, Python 3, required Python modules, and libraries. Thus the {salt} contact method is independent from software installed on the client.
ca: és un únic paquet binari que conté {salt} Minion, Python 3, els mòduls Python necessaris i biblioteques. Per tant, el mètode de contacte {salt} és independent del programari instal·lat al client.

source: For more information, see xref:client-configuration:contact-methods-saltbundle.adoc[].
ca: Per obtenir més informació, vegeu xref:client-configuration:contact-methods-saltbundle.adoc[].

source: Salt Minion ([package]``salt-minion``)
ca: Minió salat ([paquet])salt-minió))

source: is {salt} software installed on the client system and it is no longer supported with {productname} in general. If needed, you can install it on {sle} 15 clients and derivatives (like {sle-micro}) for bootstrapping only. Then, during bootstrapping it will be replaced with [package]``venv-salt-minion``.
ca: El programari {salt} està instal·lat al sistema client i ja no és compatible amb {productname} en general. Si cal, el podeu instal·lar en clients {sle} 15 i derivats (com ara {sle-micro}) només per a l'arrencada. Aleshores, durant l'arrencada, se substituirà per [package]``venv-salt-minion``.

source: What is Salt Bundle?
ca: Què és Salt Bundle?
ja: Salt Bundleの概要
ko: Salt Bundle이란 무엇입니까?
zh_cn: 什么是 Salt 捆绑包？

source: The Salt Bundle is a single binary package containing {salt} Minion, Python 3, required Python modules, and libraries.
ca: El Salt Bundle és un únic paquet binari que conté {salt} Minion, Python 3, mòduls de Python requerits i biblioteques.

source: The Salt Bundle is shipped with Python 3 and all the requirements for {salt} to run. Thus Salt Bundle does not use the Python version install on the client as system software. The Salt Bundle can be installed on clients that do not meet the requirements for a given {salt} version.
ca: El Salt Bundle s'envia amb Python 3 i tots els requisits perquè {salt} s'executi. Per tant Salt Bundle no utilitza la versió de Python instal·lació al client com a programari de sistema. El Salt Bundle es pot instal·lar en clients que no compleixin els requisits per a una versió {salt}.

source: It is also possible to use the Salt Bundle on systems that run a {salt} Minion connected to a {salt} Master other than the {productname} {salt} Master.
ca: També és possible utilitzar el Salt Bundle en sistemes que executen un {salt} Minion connectat a un {salt} Master diferent del {productname} {salt} Master.

source: Client Registration With Salt Bundle as a Minion
ca: Registre del client amb Salt Bundle com a Minion

source: The registration method with the Salt Bundle is the recommended registration method. This section explains the advantages and limitations of the current implementation.
ca: El mètode d'inscripció amb el Bundle Salt és el mètode d'inscripció recomanat. En aquest apartat s'expliquen els avantatges i limitacions de la implementació actual.

source: The Salt Bundle is provided as the [package]``venv-salt-minion`` package that consists of {salt}, Python 3, and the Python modules {salt} depends on.
ca: El paquet de sal es proporciona com el paquet [package].venv-salt-minion. que consisteix en {salt}, Python 3, i els mòduls de Python {salt} depenen.
