Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: Bootstrapping with {webui} is using Salt Bundle as well, so bootstrapping with {webui} is not Python dependant. Using the Salt Bundle, it is no longer needed that the client provides any Python interpreter or modules.
ca: L'arrencada amb {webui} també està utilitzant Salt Bundle, de manera que l'arrencada amb {webui} no depèn de Python. Utilitzant el Salt Bundle, ja no és necessari que el client proporcioni cap intèrpret o mòdul de Python.

source: If you bootstrap new clients, registration with the Salt Bundle is the default method. You can switch existing clients to the Salt Bundle method. If you switch, the [package]``salt-minion`` package and its dependencies will stay installed.
ca: Si arrenqueu clients nous, registrar-vos amb el Salt Bundle és el mètode per defecte. Podeu canviar els clients existents al mètode Salt Bundle. Si canvieu, el paquet [package].salt-minion. i les seves dependències romandran instal·lades.
ja: 新しいクライアントをブートストラップする場合、Salt Bundleを使用した登録がデフォルトの方法です。 既存のクライアントをSalt Bundleの方式に切り替えることができます。 切り替える場合、[package]``salt-minion``パッケージおよびその依存関係はインストールされたままになります。
ko: 새 클라이언트를 부트스트랩하는 경우 Salt Bundle에 등록하는 것이 기본 방법입니다. 기존 클라이언트를 Salt Bundle 방식으로 전환할 수 있습니다. 전환하면 [package]``salt-minion`` 패키지와 종속 항목이 설치된 상태로 유지됩니다.
zh_cn: 如果您引导新客户端，默认的注册方法是使用 Salt 捆绑包注册。您可以将现有客户端切换为使用 Salt 捆绑包方法。如果切换，将会安装 [package]``salt-minion`` 软件包及其依赖项。

source: Using the {salt} Bundle With the {salt} Minion
ca: Utilitzant el paquet {salt} amb el mineral {salt}

source: The {salt} Bundle can be used with the {salt} Minion managed by the {salt} Master other than {productname} Server at the same time. If the Salt Bundle is installed on a client {productname} Server will manage the configuration files of the Salt Bundle, the configuration files of [literal]``salt-minion`` will not be managed in this case. For more information, see xref:client-configuration:registration-cli.adoc#_salt_bundle_configuration[Salt Bundle configuration].
ca: El paquet {salt} es pot utilitzar amb el minió {salt} gestionat pel mestre {salt} diferent del servidor {productname}. Si el Salt Bundle està instal·lat en un client {productname} Server gestionarà els fitxers de configuració del Salt Bundle, els fitxers de configuració de [literal].salt-minion. no es gestionaran en aquest cas. Per a més informació, vegeu xref:client-configuration:registration-cli.adoc].saltbundleconfiguration[Configuració de salt de bobina].

source: To bootstrap a client with the {salt} Minion managed by the {salt} Master other than {productname} Server it is recommended to use [command]``mgr-bootstrap`` [option]``--force-bundle`` when generating the bootstrap script, or to set [option]``FORCE_VENV_SALT_MINION`` to `1` in the bootstrap script.
ca: Per arrencar un client amb el {salt} Minion gestionat pel {salt} Master diferent del servidor {productname} es recomana utilitzar [ordre].mgr-bootstrap. [opció].--force-bundle. quan es generi l'script bootstrap, o establir [option].FORCEVENVSALTMINION. a the1. a l'script bootstrap.

source: For bootstrapping with {webui} [literal]``mgr_force_venv_salt_minion`` set to [literal]``true`` pillar can be specified globally. For more information, see xref:specialized-guides:salt/salt-states-and-pillars.adoc[].
ca: Per a l'arrencada amb {webui} [literal].mgrforcevenvsaltminion. establert al pilar [literal].true. es pot especificar globalment. Per a més informació, vegeu xref: Specialized-guides:salt/salt-states-and-pillars.adoc[].
ja: {webui} [literal]``mgr_force_venv_salt_minion``を[literal]``true``に設定してブートストラップする場合、pillarをグローバルに指定できます。 詳細については、xref:specialized-guides:salt/salt-states-and-pillars.adoc[]を参照してください。
ko: {webui} [literal]``mgr_force_venv_salt_minion``이 [literal]``true``로 설정된 부트스트래핑의 경우 열을 전역적으로 지정할 수 있습니다. 자세한 내용은 xref:specialized-guides:salt/salt-states-and-pillars.adoc[]에서 확인할 수 있습니다.
zh_cn: 要使用 {webui} 进行引导，可以全局指定 [literal]``mgr_force_venv_salt_minion`` 设为 [literal]``true`` 的 pillar。有关详细信息，请参见 xref:specialized-guides:salt/salt-states-and-pillars.adoc[]。

source: Switching From {salt} Minion to Salt Bundle
ca: S'està canviant de {salt} minion a Salt Bundle

source: The {salt} state [literal]``util.mgr_switch_to_venv_minion`` is available to switch from [package]``salt-minion`` to [package]``venv-salt-minion``. It is recommended to switch to [package]``venv-salt-minion`` in two steps to avoid trouble with shifting processes:
ca: L'estat {salt} [literal].util.mgrswitchtovenvminion. està disponible per a canviar de [paquet].salt-minió. a [paquet].venv-salt-minió.. Es recomana canviar a [package]:venv-salt-minion: en dos passos per evitar problemes amb els processos de canvi:

source: Procedure: SwitchingWwith [literal]``util.mgr_switch_to_venv_minion`` State to [package]``venv-salt-minion``
ca: Procediment: Canvi amb [literal] toutil.mgrswitchtovenvminion to estat a [package] tovenv-salt-minion to

source: Apply [literal]``util.mgr_switch_to_venv_minion`` with no pillar specified first. This will result in the switch to [package]``venv-salt-minion`` with copying configuration files etc. It will not clean up the original [package]``salt-minion`` configurations and its packages.
ca: Aplica [literal].util.mgrswitchtovenvminion. sense cap pilar especificat primer. Això resultarà en el canvi a [package].venv-salt-minion. amb la còpia de fitxers de configuració, etc. No netejarà les configuracions originals [package].salt-minion. i els seus paquets.
ja: まず、pillarを指定せずに[literal]``util.mgr_switch_to_venv_minion``を適用します。 [package]``venv-salt-minion``に切り替わり、設定ファイルなどがコピーされます。 元の[package]``salt-minion``の設定およびそのパッケージはクリーンアップされません。
ko: 우선 열을 지정하지 않고 [literal]``util.mgr_switch_to_venv_minion``을 적용하십시오. 그러면 구성 파일 등을 복사하는 [package]``venv-salt-minion``으로 전환됩니다. 원래 [package]``salt-minion`` 구성 및 해당 패키지는 정리되지 않습니다.
zh_cn: 首先，在不指定任何 pillar 的情况下应用 [literal]``util.mgr_switch_to_venv_minion``。这样会通过复制配置文件等数据切换到 [package]``venv-salt-minion``。此过程不会清理原始的 [package]``salt-minion`` 配置及其软件包。

source: salt <minion_id> state.apply util.mgr_switch_to_venv_minion
ca: sal <minionid> estat.apply util.mgrswitchtovenvminion

source: Apply [literal]``util.mgr_switch_to_venv_minion`` with [literal]``mgr_purge_non_venv_salt`` set to [literal]``True`` to remove [package]``salt-minion`` and with [literal]``mgr_purge_non_venv_salt_files`` set to [literal]``True`` to remove all the files related to [package]``salt-minion``. This second step ensures the first step was processed, and then removes the old configuration files and the now obsolete [package]``salt-minion`` package.
ca: Aplica [literal].util.mgrswitchtovenvminion. amb [literal].mgrpurgenonvenvsalt. establert a [literal].True to per eliminar [package] tosalt-minion to i amb [literal].mgrpurgenonvenvsaltfiles. establert a [literal].True. per eliminar tots els fitxers relacionats amb [package].salt-minion.. Aquest segon pas assegura que el primer pas s'ha processat, i després elimina els fitxers de configuració antics i el paquet [package].salt-minion. ara obsolet.
ja: [literal]``util.mgr_switch_to_venv_minion``を適用し、[literal]``mgr_purge_non_venv_salt``を[literal]``True``に設定して[package]``salt-minion``を削除し、[literal]``mgr_purge_non_venv_salt_files``を[literal]``True``に設定して[package]``salt-minion``に関するすべてのファイルを削除します。 この2番目の手順によって、最初の手順が処理されたことが保証され、古い設定ファイルおよび古くなった[package]``salt-minion``パッケージが削除されます。
ko: [literal]``mgr_purge_non_venv_salt``가 [literal]``True``로 설정된 [literal]``util.mgr_switch_to_venv_minion``을 적용하여 [package]``salt-minion``을 제거하고 [literal]``mgr_purge_non_venv_salt_files``을 [literal]``True``로 설정하여 [package]``salt-minion``과 관련된 모든 파일을 제거하십시오. 이 두 번째 단계는 첫 번째 단계가 처리되었는지 확인한 후 이전 구성 파일과 더 이상 사용되지 않는 [package]``salt-minion`` 패키지를 제거합니다.
zh_cn: 在 [literal]``mgr_purge_non_venv_salt`` 设为 [literal]``True``（用于去除 [package]``salt-minion``）以及 [literal]``mgr_purge_non_venv_salt_files`` 设为 [literal]``True``（用于去除与 [package]``salt-minion`` 相关的所有文件）的情况下应用 [literal]``util.mgr_switch_to_venv_minion``。此第二步用于确保第一步已经处理，然后去除旧配置文件以及现已过时的 [package]``salt-minion`` 软件包。

source: salt <minion_id> state.apply util.mgr_switch_to_venv_minion pillar='{"mgr_purge_non_venv_salt_files": True, "mgr_purge_non_venv_salt": True}'
ca: sal <minionid> estat.aplica util.mgrswitchtovenvminion pilar":'{"mgrpurgenonvenvsaltfiles": Cert, "mgrpurgenonvenvsalt": Cert}'

source: Additional Concerns
ca: Preocupacions addicionals

source: In case of running the second step only and the first step, state apply process could fail as it requires stopping the [systemitem]``salt-minion`` which is used to execute the command on the client side.
ca: En cas d'executar el segon pas de commutar amb saltar el primer pas, el procés d'aplicació d'estat podria fallar, ja que requereix aturar el [systemitem]altsalt-minion. que s'utilitza per executar l'ordre al costat del client.

source: It is also possible to avoid installing the Salt Bundle and keep using [package]``salt-minion`` instead. In this case, specify one of these options:
ca: D'altra banda, també és possible evitar instal·lar el Salt Bundle i seguir utilitzant [package].salt-minion. en el seu lloc. En aquest cas, especifiqueu una d'aquestes opcions:

source: Execute [command]``mgr-bootstrap`` with [option]``--no-bundle`` option.
ca: Executa [command].mgr-bootstrap with amb l'opció [option].--no-bundle..
ja: [option]``--no-bundle``オプションを指定して[command]``mgr-bootstrap``を実行します。
ko: [option]``--no-bundle`` 옵션으로 [command]``mgr-bootstrap``을 실행하십시오.
zh_cn: 指定 [option]``--no-bundle`` 选项来执行 [command]``mgr-bootstrap``。

source: Set [literal]``AVOID_VENV_SALT_MINION`` to [literal]``1`` in the generated bootstrap script.
ca: Estableix [literal].AVOIDVENVSALTMINION to a [literal]11. a l'script d'arrencada generat.
ja: 生成されたブートストラップスクリプトで[literal]``AVOID_VENV_SALT_MINION``を[literal]``1``に設定します。
ko: 생성된 부트스트랩 스크립트에서 [literal]``AVOID_VENV_SALT_MINION``을 [literal]``1``로 설정합니다.
zh_cn: 在生成的引导脚本中，将 [literal]``AVOID_VENV_SALT_MINION`` 设为 [literal]``1``。

source: For bootstrap state set the [literal]``mgr_avoid_venv_salt_minion`` pillar to [literal]``True`` in [path]``/srv/pillar/salt_bundle_config.sls``.
ca: Per a l'estat d'arrencada, establiu el pilar [literal] mgr_avoid_venv_salt_minion a [literal] «True» a [path] /srv/pillar/salt_bundle_config.sls.

source: SSH Push With the Salt Bundle
ca: Què és Salt Bundle?

source: The Salt Bundle is also used when performing SSH Push actions to clients.
ca: El Salt Bundle també s'utilitza quan es realitzen accions SSH Push als clients.

source: A shell script deploys the Salt Bundle onto the target system without installing [package]``venv-salt-minion`` before any {salt} command is executed. Because the Salt Bundle contains the whole {salt} code base, no [literal]``salt-thin`` is deployed. SSH Push (including bootstrapping using the {webui}) uses the Python 3 interpreter within the bundle. The target system does not need to have any other Python interpreter installed.
ca: Un script d'intèrpret d'ordres desplega el Salt Bundle al sistema de destinació sense instal·lar [package].venv-salt-minion. abans que s'executi qualsevol ordre {salt}. Com que el Bolet de Sal conté tota la base de codi {salt}, no es desplega cap [literal].salt-thin.. SSH Push (incloent-hi l'arrencada utilitzant el {webui}) utilitza l'intèrpret Python 3 dins del paquet. El sistema de destinació no necessita tenir instal·lat cap altre intèrpret Python.

source: The Python 3 deployed with the Bundle is used to handle SSH Push session on the client, so SSH Push (including bootstrapping with {webui}) is not dependant on Python installed on the system.
ca: El Python 3 desplegat amb el Bundle s'utilitza per gestionar la sessió SSH Push al client, de manera que SSH Push (incloent l'arrencada amb {webui}) no depèn de Python instal·lat al sistema.

source: Using `salt-thin` can be enabled as a fallback method, but it requires Python 3 to be installed on the client. This method is not recommended nor supported and exists for development purposes only. Set [option]``web.ssh_use_salt_thin`` to `true` in the [path]``/etc/rhn/rhn.conf`` configuration file.
ca: L'ús de .salt-thin. es pot habilitar com a mètode alternatiu, però requereix que Python 3 s'instal·li al client. Aquest mètode no és recomanable ni suportat i només existeix amb finalitats de desenvolupament. Establiu [option].web.sshusesaltthin. a thetrue. al fitxer de configuració [path]./etc/rhn/rhn.conf..

source: The bootstrap repository must be created before bootstrapping the client with {webui}. SSH Push is using the Salt Bundle taken from the bootstrap repository based on the detected target operating system. For more information, see xref:client-configuration:bootstrap-repository.adoc#_prepare_to_create_a_bootstrap_repository[].
ca: Com que Salt Bundle s'envia amb el repositori bootstrap, el repositori s'ha de crear abans d'iniciar el procés bootstrap per al client. Un shell script detecta el sistema operatiu en el client i desplega el Salt Bundle des del repositori bootstrap apropiat, utilitzant la mateixa lògica que el bootstrap script. Per a més informació, vegeu xref:client-configuration:bootstrap-repository.adoc].preparetocreateabootstraprepository[Prepare to Create a Bootstrap Repository].

source: SSH Push is using [path]``/var/tmp`` to deploy Salt Bundle to and execute {salt} commands on the client with the bundled Python. Therefore you must not mount [path]``/var/tmp`` with the [option]``noexec`` option. It is not possible to bootstrap the clients, which have [path]``/var/tmp`` mounted with [option]``noexec`` option, with the {webui} because the bootstrap process is using SSH Push to reach a client.
ca: SSH Push està utilitzant [path]./var/tmp. per desplegar Salt Bundle i executar {salt} ordres al client amb el Python empaquetat. Per tant, no heu de muntar [camí]./var/tmp. amb l'opció [opció].noexec.. No és possible arrencar els clients, que tenen [camí]./var/tmp. muntat amb l'opció [option].noexec,, amb el {webui} perquè el procés d'arrencada està utilitzant SSH Push per arribar a un client.

source: Extend Salt Bundle With Python Packages using [literal]``pip``
ca: Amplia el paquet de sal amb paquets Python usant [literal]spips

source: The Salt Bundle includes [literal]``pip`` to make it possible to extend the functionality of the bundled {salt} Minion with extra Python packages.
ca: El Salt Bundle inclou [literal].pip. per fer possible estendre la funcionalitat del Minion {salt} empaquetat amb paquets Python addicionals.

source: By default, [command]``salt <minion_id> pip.install <package-name>`` installs the Python package specified by [literal]``<package_name>`` into [path]``/var/lib/venv-salt-minion/local``.
ca: Per defecte, [command],salt <minionid> pip.install <package-name> the instal·la el paquet Python especificat per [literal].<packagename> the a [path]./var/lib/venv-salt-minion/local..
ja: デフォルトで、[command]``salt <minion_id> pip.install <package-name>``は、[literal]``<package_name>``で指定されたPythonパッケージを[path]``/var/lib/venv-salt-minion/local``にインストールします。
ko: 기본적으로 [command]``salt <minion_id> pip.install <package-name>`` 은 [literal]``<package_name>``에 의해 지정된 Python 패키지를 [path]``/var/lib/venv-salt-minion/local``에 설치합니다.
zh_cn: 默认情况下，[command]``salt <minion_id> pip.install <package-name>`` 会将 [literal]``<package_name>`` 指定的 Python 软件包安装到 [path]``/var/lib/venv-salt-minion/local`` 中。

source: If needed, the path [path]``/var/lib/venv-salt-minion/local`` can be overridden by setting the [literal]``VENV_PIP_TARGET`` environment variable for the [literal]``venv-salt-minion.service``. It is recommended to use a systemd drop-in configuration file for the service. It could be done with the configuration file [path]``/etc/systemd/system/venv-salt-minion.service.d/10-pip-destination.conf``:
ca: Si cal, el camí [camí]./var/lib/venv-salt-minion/local. es pot anul·lar establint la variable d'entorn [literal].VENVPIPTARGET. per al [literal].venv-salt-minion.service.. Es recomana l'ús d'un fitxer de configuració del sistema per al servei. Es podria fer amb el fitxer de configuració [camí] the/etc/systemd/system/venv-salt-minion.service.d/10-pip-destination.conf the:
ja: 必要に応じて、[literal]``venv-salt-minion.service``の環境変数[literal]``VENV_PIP_TARGET``を設定することで、パス[path]``/var/lib/venv-salt-minion/local``を上書きできます。 サービスにはsystemdのドロップイン設定ファイルを使用することをお勧めします。 設定ファイル[path]``/etc/systemd/system/venv-salt-minion.service.d/10-pip-destination.conf``で実行できます。
ko: 필요한 경우 [path]``/var/lib/venv-salt-minion/local`` 경로는 [literal]``venv-salt-minion.service``에 대한 [literal]``VENV_PIP_TARGET`` 환경 변수를 설정하여 재정의할 수 있습니다. 서비스에 대한 systemd drop-in 구성 파일을 사용하는 것이 좋습니다. 이는 구성 파일 [path]``/etc/systemd/system/venv-salt-minion.service.d/10-pip-destination.conf``를 사용하여 수행할 수 있습니다.
zh_cn: 如果需要，可以通过为 [literal]``venv-salt-minion.service`` 设置 [literal]``VENV_PIP_TARGET`` 环境变量来覆盖路径 [path]``/var/lib/venv-salt-minion/local``。建议为该服务使用 systemd 普适性配置文件。可以使用配置文件 [path]``/etc/systemd/system/venv-salt-minion.service.d/10-pip-destination.conf`` 来实现该目的：

source: [Service] Environment=VENV_PIP_TARGET=/new/path/local/venv-salt-minion/pip
ca: [Servei] Environment/VENVPIPTARGET//new/path/local/venv-salt-minion/pip

source: The Python packages installed through [literal]``pip`` are not changing on updating the Salt Bundle. To ensure that such packages are available and functional after an update, it is recommended to install them with a {salt} state that is applied after Salt Bundle updates.
ca: Els paquets Python instal·lats a través de [literal].pip. no estan canviant en actualitzar el Salt Bundle. Per assegurar que aquests paquets estiguin disponibles i siguin funcionals després d'una actualització, es recomana instal·lar-los amb un estat {salt} que s'aplica després d'actualitzar Salt Bundle.

source: SSH Push (With Tunnel) Contact Method
ca: Mètode de contacte SSH Push (amb túnel)

source: SSH Push (with tunnel) ([literal]``ssh-push-tunnel``) is used in environments where clients cannot reach the {productname} Server directly. In this environment, clients are located in a firewall-protected zone called a DMZ. No system within the DMZ is authorized to open a connection to the internal network, including the {productname} Server.
ca: SSH Push (amb túnel) ([literal].ssh-push-tunnel.) s'utilitza en entorns on els clients no poden arribar directament al servidor {productname}. En aquest entorn, els clients es troben en una zona protegida per tallafocs anomenada DMZ. Cap sistema dins de la DMZ està autoritzat a obrir una connexió a la xarxa interna, inclòs el servidor {productname}.

source: In other words: SSH Push (with tunnel) also creates a reverse tunnel from the client to the {productname} Server, not only from the server to the client.
ca: En altres paraules: SSH Push (amb túnel) també crea un túnel invers del client al servidor {productname}, no només del servidor al client.

source: The server uses SSH to contact the clients at regular intervals, checking in and performing scheduled actions and events.
ca: El servidor utilitza SSH per contactar amb els clients a intervals regulars, comprovant i realitzant accions i esdeveniments programats.
ja: サーバは、SSHを使用して、定期的にクライアントに接続し、チェックインし、スケジュールされたアクションおよびイベントを実行します。
ko: 서버는 SSH를 사용해 정기적으로 클라이언트에 연결하여 체크인하고 예약된 작업과 이벤트를 수행합니다.
zh_cn: 服务器使用 SSH 定期联系客户端，以签入和执行安排的操作和事件。

source: Re-installing systems using the provisioning model is not currently supported on clients managed with SSH Push.
ca: Els sistemes de reinstal·lació que utilitzen el model d'aprovisionament actualment no estan suportats per clients gestionats amb SSH Push.

source: The tunnel is used to provide the access to the server through the encrypted tunnel. The repositories assigned to the SSH Push client (with tunnel) are provided through this tunnel only, thus it is not possible to use package manager tools directly from the client system because the repositories are available only while the tunnel is up. In other words, access is only possible if the session is initiated by the server. All package managing operations on the client can be performed from the server side only.
ca: El túnel s'utilitza per proporcionar l'accés al servidor a través del túnel encriptat. Els repositoris assignats al client SSH Push (amb túnel) només es proporcionen a través d'aquest túnel, per tant no és possible utilitzar eines de gestor de paquets directament des del sistema client perquè els repositoris només estan disponibles mentre el túnel està pujat. En altres paraules, l'accés només és possible si la sessió és iniciada pel servidor. Totes les operacions de gestió de paquets del client només es poden realitzar des del costat del servidor.

source: Use [literal]``mgrctl term`` before running steps inside the server container.
ca: Utilitzeu [literal].terme de mgrctl. abans d'executar passos dins del contenidor del servidor.

source: For tunneling connections via SSH, a port number is required for tunneling via HTTPS. The port number used by default is [literal]``1233``. To overwrite it, inside the container, you can add a custom port numbers greater than 1024 to [path]``/etc/rhn/rhn.conf``:
ca: Per a les connexions de túnel a través de SSH, es requereix un número de port per a la connexió de túnel a través d'HTTPS. El número de port utilitzat per defecte és [literal]121233.. Per a sobreescriure'l, dins del contenidor, podeu afegir números de port personalitzats superiors a 1024 a [path] the/etc/rhn/rhn.conf::

source: After changing this configuration parameter you must restart services such as [systemitem]``salt-secrets-config.service``, [systemitem]``tomcat.service``, and [systemitem]``taskomatic.service``. To cover all needed services, it is the best to restart the {productname} Server as root. Outside of the container, from the container host, enter:
ca: Després de canviar aquest paràmetre de configuració heu de reiniciar serveis com [systemitem].salt-secrets-config.service., [systemitem].tomcat.service., i [systemitem].taskomatic.service.. Per cobrir tots els serveis necessaris, és millor reiniciar el servidor {productname} com a root. Fora del contenidor, des de l'amfitrió del contenidor, introduïu:

source: mgradm restart
ca: reinici del mgradm

source: For security reasons, you might want to use sudo with SSH, to access the system as an unprivileged user instead of as root.
ca: Per raons de seguretat, és possible que vulgueu utilitzar sudo amb SSH, per accedir al sistema com un usuari sense privilegis en lloc de com a root.
ja: セキュリティ上の理由から、SSHでsudoを使用して、rootとしてではなく非特権ユーザとしてシステムにアクセスする必要がある場合があります。
ko: 보안상의 이유로 sudo를 SSH와 함께 사용해 루트 권한 대신에 권한이 없는 사용자로 시스템에 액세스하고 싶을 때가 있을 수 있습니다.
zh_cn: 出于安全原因，您可能需要结合使用 sudo 和 SSH，以非特权用户身份而不是 root 身份访问系统。

source: Procedure: Configuring Unprivileged SSH Access
ca: Procediment: Configuració d'accés SSH no privilegiat
ja: プロシージャ: 非特権SSHアクセスの設定
ko: 절차: 권한이 없는 SSH 액세스 구성
zh_cn: 过程：配置非特权 SSH 访问

source: On each client system, create an appropriate unprivileged user.
ca: A cada sistema de client, crea un usuari adequat i sense privilegis.
ja: それぞれのクライアントシステムで、適切な非特権ユーザを作成します。
ko: 각 클라이언트 시스템에서 적절한 권한 없는 사용자를 생성합니다.
zh_cn: 在每个客户端系统上，创建相应的非特权用户。

source: On each client system, edit the [filename]``sudoers`` file:
ca: Al client, editeu el fitxer [filename]:sudoers::

source: Inside the {productname} Server container, edit the [path]``/etc/rhn/rhn.conf`` configuration file, and add or amend this line to include the unprivileged username:
ca: Al servidor {productname}, al fitxer de configuració [path] /etc/rhn/rhn.conf, afegiu o modifiqueu aquesta línia per incloure el nom d'usuari sense privilegis:

source: You need to use the {webui} or API to register these clients with the {productname} Server.
ca: Hi ha diverses maneres de registrar clients al vostre servidor {productname}.
