Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: Clients now use GPG key information entered for a software channel to manage the trusted keys. When a software channel with GPG key information is assigned to a client, the key is trusted when the channel is refreshed or the first package is installed from this channel.
ca: Els clients ara utilitzen la informació de la clau GPG introduïda per a un canal de programari per gestionar les claus de confiança. Quan un canal de programari amb informació de clau GPG s'assigna a un client, la clau és de confiança quan el canal s'actualitza o el primer paquet s'instal·la des d'aquest canal.

source: The GPG key URL parameter in the software channel page can contain multiple key URLs separated by "whitespace". In case it is a file URL, the GPG key file must be deployed on the client before the software channel is used.
ca: El paràmetre d'URL de la clau GPG a la pàgina del canal de programari pot contenir múltiples URL de claus separades per "espais en blanc". En el cas que es tracti d'un URL de fitxer, el fitxer de clau GPG s'ha de desplegar al client abans d'utilitzar el canal de programari.
ja: ソフトウェアチャンネルページのGPGキーのURLには、「空白」で区切られた複数のキーのURLを含めることができます。 ファイルURLの場合は、ソフトウェアチャンネルを使用する前に、GPGキーファイルをクライアントに配備する必要があります。
ko: 소프트웨어 채널 페이지의 GPG 키 URL 파라미터에는 "공백"으로 구분된 여러 키 URL이 포함될 수 있습니다. 파일 URL인 경우 클라이언트에 GPG 키 파일을 배포한 후 소프트웨어 채널을 사용해야 합니다.
zh_cn: 软件通道页面中的 GPG 密钥 URL 参数可以包含以空格分隔的多个密钥 URL。如果其为文件 URL，则必须在使用软件通道之前在客户端上部署 GPG 密钥文件。

source: The GPG keys for the Client Tools Channels of {redhat} based clients are deployed on the client into [path]``/etc/pki/rpm-gpg/`` and can be referenced with file URLs.
ca: Les claus GPG per als canals d'eines de client de {redhat} basats en clients es despleguen al client a [path]./etc/pki/rpm-gpg/. i es poden fer referències amb URL de fitxer.

source: Same is the case with the GPG keys of {sll} clients.
ca: El mateix passa amb les claus GPG dels clients {sll}.

source: Only in case a software channel is assigned to the client they will be imported and trusted by the system.
ca: Només en el cas que s'assigni un canal de programari al client serà importat i de confiança pel sistema.

source: Because Debian based systems sign only metadata, there is no need to specify extra keys for single channels. If a user configures an own GPG key to sign the metadata as described in "Use Your Own GPG Key" in xref:administration:repo-metadata.adoc[] the deployment and trust of that key is executed automatically.
ca: Com que els sistemes basats en Debian només signen metadades, no hi ha necessitat d'especificar claus addicionals per a canals individuals. Si un usuari configura una clau GPG pròpia per signar les metadades tal com es descriu a "Utilitza la teva pròpia clau GPG" a xref:administration:repo-metadata.adoc[] el desplegament i la confiança d'aquesta clau s'executa automàticament.
ja: Debianベースのシステムはメタデータのみに署名するため、単一チャンネルに追加のキーを指定する必要はありません。 xref:administration:repo-metadata.adoc[]の「独自のGPGキーを使用する」で説明されているように、ユーザが独自のGPGキーを設定してメタデータに署名すると、そのキーの配備と信頼が自動的に実行されます。
ko: Debian 기반 시스템은 메타데이터에만 서명하므로 단일 채널에 대해 추가 키를 지정할 필요가 없습니다. xref:administration:repo-metadata.adoc[]에서 "자체 GPG 키 사용"의 설명과 같이 사용자가 자체 GPG 키를 구성하여 메타데이터에 서명하는 경우 해당 키의 배포 및 신뢰가 자동으로 실행됩니다.
zh_cn: 由于基于 Debian 的系统仅会对元数据签名，因此不需要为各个通道指定确切的密钥。如果用户按 xref:administration:repo-metadata.adoc[] 中的“使用自己的 GPG 密钥”所述配置了自己的 GPG 密钥来对元数据签名，系统会自动部署并信任该密钥。

source: User Defined GPG Keys
ca: Usa la vostra pròpia clau GPG

source: Users can define custom GPG keys to be deployed to a client.
ca: Els usuaris poden definir claus GPG personalitzades que s'han de desplegar a un client.

source: By providing some pillar data and providing the GPG key files in the {salt} filesystem, they are automatically deployed to the client.
ca: En proporcionar algunes dades de pilar i proporcionar els fitxers de clau GPG en el sistema de fitxers {salt}, es despleguen automàticament al client.
ja: いくつかのpillarデータを提供し、{salt}ファイルシステムにGPGキーファイルを提供することで、自動的にクライアントに配備されます。
ko: 일부 열 데이터를 제공하고 {salt} 파일 시스템에 GPG 키 파일을 제공하면 클라이언트에 자동으로 배포됩니다.
zh_cn: 通过提供某些 pillar 数据并在 {salt} 文件系统中提供 GPG 密钥文件，系统会自动将它们部署到客户端。

source: These keys are deployed into [path]``/etc/pki/rpm-gpg/`` on RPM based operating systems and to [path]``/usr/share/keyrings/`` on Debian systems:
ca: Aquestes claus es despleguen a [path]:/etc/pki/rpm-gpg/: en sistemes operatius basats en RPM i a [path] and/usr/share/keyrings/: en sistemes Debian:
ja: これらのキーは、RPMベースのオペレーティングシステムでは[path]``/etc/pki/rpm-gpg/``に、Debianシステムでは[path]``/usr/share/keyrings/``に配備されます。
ko: 이러한 키는 RPM 기반 운영 체제의 [path]``/etc/pki/rpm-gpg/``및 Debian 시스템의 [path]``/usr/share/keyrings/``에 배포됩니다.
zh_cn: 这些密钥会分别部署到 [path]``/etc/pki/rpm-gpg/``（在基于 RPM 的操作系统上）和 [path]``/usr/share/keyrings/``（在 Debian 系统上）中：

source: Define the pillar key [literal``custom_gpgkeys`` for the client you want to deploy the key to and list the names of the key file.
ca: Definiu la clau de pilar [literal.customgpgkeys. per al client que voleu desplegar la clau i llistar els noms del fitxer de clau.
ja: キーを配備するクライアントのpillarキー[literal]``custom_gpgkeys``を定義し、キーファイルの名前を一覧にします。
ko: 키를 배포할 클라이언트에 대한 열 키 [literal]``custom_gpgkeys``를 정의하고 키 파일의 이름을 나열합니다.
zh_cn: 为您要将密钥部署到的客户端定义 pillar 键 [literal]``custom_gpgkeys`` 并列出密钥文件名。

source: cat /srv/pillar/mypillar.sls custom_gpgkeys: - my_first_gpg.key - my_second_gpgkey.gpg
ca: gat /srv/pillar/mypillar.sls tecles personalitzades: - myfirstgpg.key - mysecondgpgkey.gpg

source: Additionally in the {salt} filesystem create a directory named [path]``gpg`` and store there the GPG key files with the name specified in the [iteral]``custom_gpgkeys`` pillar data.
ca: A més, en el sistema de fitxers {salt} creeu un directori anomenat [camí].gpg. i deseu allà els fitxers de claus GPG amb el nom especificat en les dades del pilar [iteral].customgpgkeys..
ja: さらに、{salt}ファイルシステムでは、[path]``gpg``という名前のディレクトリを作成し、[iteral]``custom_gpgkeys`` pillarデータで指定された名前のGPGキーファイルを保存します。
ko: 추가적으로 {salt} 파일 시스템에서 [path]``gpg`` 디렉토리를 생성한 후 해당 디렉토리에 [literal]``custom_gpgkeys`` 열 데이터에 지정된 이름으로 GPG 키 파일을 저장합니다.
zh_cn: 此外，在 {salt} 文件系统中创建名为 [path]``gpg`` 的目录，并将 [literal]``custom_gpgkeys`` pillar 数据中所指定的 GPG 密钥文件存储在该目录下。

source: The keys are deployed to the client at [path]``/etc/pki/rpm-gpg/my_first_gpg.key`` and [path]``/etc/pki/rpm-gpg/my_second_gpgkey.gpg``.
ca: Les claus es despleguen al client a [path]./etc/pki/rpm-gpg/myfirstgpg.key. i [path]./etc/pki/rpm-gpg/mysecondgpgkey.gpg..

source: The last step is to add the URL to the GPG key URL field of the software channel. Navigate to menu:Software[Manage > Channels] and select the channel you want to modify. Add to [guimenu]``GPG key URL`` the value [literal]``file:///etc/pki/rpm-gpg/my_first_gpg.key``.
ca: L'últim pas és afegir l'URL al camp de la clau GPG del canal de programari. Navega al menú:Software[Gestiona . Canals] i selecciona el canal que vols modificar. Afegeix a [guimenu].URL de la clau GPG. el valor [literal].file:///etc/pki/rpm-gpg/myfirstgpg.key..
ja: 最後のステップでは、ソフトウェアチャンネルのGPGキーのURLフィールドにURLを追加します。 menu:ソフトウェア[管理 > チャンネル]に移動し、変更するチャンネルを選択します。 ［[guimenu]``GPGキーのURL``］に値[literal]``file:///etc/pki/rpm-gpg/my_first_gpg.key``を追加します。
ko: 마지막 단계로 소프트웨어 채널의 GPG 키 URL 필드에 URL을 추가합니다. menu:소프트웨어[관리 > 채널]로 이동하고 수정할 채널을 선택합니다. [guimenu]``GPG 키 URL``에 [literal]``file:///etc/pki/rpm-gpg/my_first_gpg.key`` 값을 추가합니다.
zh_cn: 最后一步是将 URL 添加到软件通道的“GPG 密钥 URL”字段中。请导航到menu:软件[管理 > 通道]，然后选择要修改的通道。将值 [literal]``file:///etc/pki/rpm-gpg/my_first_gpg.key`` 添加到 [guimenu]``GPG 密钥 URL``中。

source: GPG Keys in Bootstrap Scripts
ca: Procediment: Creació d'un script Bootstrap
ja: ブートストラップスクリプトのGPGキー
ko: 부트스트랩 스크립트의 GPG 키
zh_cn: 引导脚本中的 GPG 密钥

source: Procedure: Trusting GPG Keys on Clients Using a Bootstrap Script
ca: Procediment: Confiar en les claus GPG dels clients mitjançant un script Bootstrap
ja: プロシージャ: ブートストラップスクリプトを使用してクライアントでGPGキーを信頼する
ko: 절차: 부트스트랩 스크립트를 사용하여 클라이언트의 GPG 키 신뢰
zh_cn: 过程：在客户端上使用引导脚本信任 GPG 密钥

source: On the {productname} Server, at the command prompt, check the contents of the [path]``/srv/www/htdocs/pub/`` directory. This directory contains all available public keys. Take a note of the key that applies to the channel assigned to the client you are registering.
ca: Al servidor {productname}, a l'indicador d'ordres, comproveu el contingut del directori [path]./srv/www/htdocs/pub/.. Aquest directori conté totes les claus públiques disponibles. Pren nota de la clau que s'aplica al canal assignat al client que estàs registrant.
ja: {productname}サーバのコマンドプロンプトで、[path]``/srv/www/htdocs/pub/``ディレクトリの内容を確認します。 このディレクトリには、使用できるすべての公開鍵が含まれています。 登録クライアントに割り当てるチャンネルに適用するキーをメモします。
ko: {productname} 서버의 명령 프롬프트에서 [path]``/srv/www/htdocs/pub/`` 디렉토리의 내용을 확인합니다. 이 디렉토리에는 사용 가능한 모든 공용 키가 포함되어 있습니다. 등록하려는 클라이언트에 할당된 채널에 적용되는 키를 적어 두십시오.
zh_cn: 在 {productname} 服务器上的命令提示符处，检查 [path]``/srv/www/htdocs/pub/`` 目录的内容。此目录包含所有可用的公共密钥。记下为您正在注册的客户端指派的通道适用的密钥。

source: Open the relevant bootstrap script, locate the [systemitem]``ORG_GPG_KEY=`` parameter and add the required key. For example:
ca: Obriu l'script d'arrencada pertinent, localitzeu el paràmetre [systemitem].ORGGPGKEY. i afegiu la clau requerida. Per exemple:
ja: 関連するブートストラップスクリプトを開き、[systemitem]``ORG_GPG_KEY=``パラメータを見つけて、必要なキーを追加します。 次に例を示します。
ko: 관련 부트스트랩 스크립트를 열어 [systemitem]``ORG_GPG_KEY=`` 파라미터를 찾고 필요한 키를 추가합니다. 예:
zh_cn: 打开相关的引导脚本，找到 [systemitem]``ORG_GPG_KEY=`` 参数并添加所需的密钥。例如：

source: You do not need to delete any previously stored keys.
ca: No cal que suprimiu cap clau emmagatzemada prèviament.
ja: 以前保存したキーを削除する必要はありません。
ko: 이전에 저장한 키는 삭제하지 않아도 됩니다.
zh_cn: 您无需删除任何以前存储的密钥。

source: xref:supported-features.adoc[Supported Clients and Features]
ja: xref:supported-features.adoc[サポートされているクライアントと機能]
ko: xref:supported-features.adoc[지원되는 클라이언트 및 기능]
zh_cn: xref:supported-features.adoc[支持的客户端和功能]

source: xref:supported-features-alibaba.adoc[Alibaba Cloud Linux Supported Features]
ja: xref:supported-features-alibaba.adoc[Alibaba Cloud Linuxでサポートされている機能]
ko: xref:supported-features-alibaba.adoc[Alibaba Cloud Linux 지원 기능]
zh_cn: xref:supported-features-alibaba.adoc[Alibaba Cloud Linux 支持的功能]

source: xref:supported-features-almalinux.adoc[AlmaLinux Supported Features]
ja: xref:supported-features-almalinux.adoc[AlmaLinuxでサポートされている機能]
ko: xref:supported-features-almalinux.adoc[AlmaLinux 지원 기능]
zh_cn: xref:supported-features-almalinux.adoc[AlmaLinux 支持的功能]

source: xref:supported-features-amazon.adoc[Amazon Linux Supported Features]
ja: xref:supported-features-amazon.adoc[Amazon Linuxでサポートされている機能]
ko: xref:supported-features-amazon.adoc[Amazon Linux 지원 기능]
zh_cn: xref:supported-features-amazon.adoc[Amazon Linux 支持的功能]

source: xref:supported-features-centos.adoc[CentOS Supported Features]
ja: xref:supported-features-centos.adoc[CentOSでサポートされている機能]
ko: xref:supported-features-centos.adoc[CentOS 지원 기능]
zh_cn: xref:supported-features-centos.adoc[CentOS 支持的功能]

source: xref:supported-features-debian.adoc[Debian Supported Features]
ja: xref:supported-features-debian.adoc[Debianでサポートされている機能]
ko: xref:supported-features-debian.adoc[Debian 지원 기능]
zh_cn: xref:supported-features-debian.adoc[Debian 支持的功能]

source: xref:supported-features-rh.adoc[Red Hat Supported Features]
ja: xref:supported-features-rh.adoc[Red Hatでサポートされている機能]
ko: xref:supported-features-rh.adoc[Red Hat 지원 기능]
zh_cn: xref:supported-features-rh.adoc[Red Hat 支持的功能]

source: xref:supported-features-ubuntu.adoc[Ubuntu Supported Features]
ja: xref:supported-features-ubuntu.adoc[Ubuntuでサポートされている機能]
ko: xref:supported-features-ubuntu.adoc[Ubuntu 지원 기능]
zh_cn: xref:supported-features-ubuntu.adoc[Ubuntu 支持的功能]

source: xref:configuration-basics.adoc[Configuration Basics]
ja: xref:configuration-basics.adoc[設定の基本]
ko: xref:configuration-basics.adoc[구성 기본]
zh_cn: xref:configuration-basics.adoc[配置基本知识]

source: xref:contact-methods-saltbundle.adoc[Salt Bundle]
ja: xref:contact-methods-saltbundle.adoc[Saltバンドル]
ko: xref:contact-methods-saltbundle.adoc[Salt 번들]
zh_cn: xref:contact-methods-saltbundle.adoc[Salt 捆绑包]

source: xref:registration-webui.adoc[Register with the Web UI]
ja: xref:registration-webui.adoc[Web UIで登録する]
ko: xref:registration-webui.adoc[Web UI로 등록]
zh_cn: xref:registration-webui.adoc[使用 Web UI 注册]

source: xref:clients-sle.adoc[SUSE Linux Enterprise Clients]
ja: xref:clients-sle.adoc[SUSE Linux Enterpriseクライアント]
ko: xref:clients-sle.adoc[SUSE Linux Enterprise 클라이언트]
zh_cn: xref:clients-sle.adoc[SUSE Linux Enterprise 客户端]

source: xref:registration-overview-opensuse.adoc[openSUSE Client Registration]
ja: xref:registration-overview-opensuse.adoc[openSUSEクライアントの登録]
ko: xref:registration-overview-opensuse.adoc[openSUSE 클라이언트 등록]
zh_cn: xref:registration-overview-opensuse.adoc[openSUSE 客户端注册]

source: xref:clients-opensuseleap.adoc[openSUSE Leap Clients]
ja: xref:clients-opensuseleap.adoc[openSUSE Leapクライアント]
ko: xref:clients-opensuseleap.adoc[openSUSE Leap 클라이언트]
zh_cn: xref:clients-opensuseleap.adoc[openSUSE Leap 客户端]

source: xref:registration-overview-alibaba.adoc[Alibaba Cloud Linux Client Registration]
ja: xref:registration-overview-alibaba.adoc[Alibaba Cloud Linuxクライアントの登録]
ko: xref:registration-overview-alibaba.adoc[Alibaba Cloud Linux 클라이언트 등록]
zh_cn: xref:registration-overview-alibaba.adoc[Alibaba Cloud Linux 客户端注册]

source: xref:clients-alibaba.adoc[Alibaba Cloud Linux Clients]
ja: xref:clients-alibaba.adoc[Alibaba Cloud Linuxクライアント]
ko: xref:clients-alibaba.adoc[Alibaba Cloud Linux 클라이언트]
zh_cn: xref:clients-alibaba.adoc[Alibaba Cloud Linux 客户端]

source: xref:clients-amazon.adoc[Amazon Linux Clients]
ja: xref:clients-amazon.adoc[Amazon Linuxクライアント]
ko: xref:clients-amazon.adoc[Amazon Linux 클라이언트]
zh_cn: xref:clients-amazon.adoc[Amazon Linux 客户端]

source: xref:clients-centos.adoc[CentOS Clients]
ja: xref:clients-centos.adoc[CentOSクライアント]
ko: xref:clients-centos.adoc[CentOS 클라이언트]
zh_cn: xref:clients-centos.adoc[CentOS 客户端]

source: xref:clients-debian.adoc[Debian Clients]
ja: xref:clients-debian.adoc[Debianクライアント]
ko: xref:clients-debian.adoc[Debian 클라이언트]
zh_cn: xref:clients-debian.adoc[Debian 客户端]

source: xref:clients-ubuntu.adoc[Ubuntu 20.04 and 22.04 Clients]
ja: xref:clients-ubuntu.adoc[Ubuntu 20.04および22.04クライアント]
ko: xref:clients-ubuntu.adoc[Ubuntu 20.04 및 22.04 클라이언트]
zh_cn: xref:clients-ubuntu.adoc[Ubuntu 20.04 和 22.04 客户端]

source: xref:client-proxy-webui.adoc[Register to a Proxy with the Web UI]
ja: xref:client-proxy-webui.adoc[Web UIでプロキシに登録する]
ko: xref:client-proxy-webui.adoc[Web UI로 프록시에 등록]
zh_cn: xref:client-proxy-webui.adoc[使用 Web UI 注册到代理]

source: xref:client-proxy-cli.adoc[Register to a Proxy with CLI]
ja: xref:client-proxy-cli.adoc[CLIでプロキシに登録する]
ko: xref:client-proxy-cli.adoc[CLI로 프록시에 등록]
zh_cn: xref:client-proxy-cli.adoc[使用 CLI 注册到代理]

source: xref:clients-pubcloud.adoc[Public Cloud Clients]
ja: xref:clients-pubcloud.adoc[パブリッククラウドクライアント]
ko: xref:clients-pubcloud.adoc[공용 클라우드 클라이언트 ]
zh_cn: xref:clients-pubcloud.adoc[公有云客户端]

source: xref:client-upgrades.adoc[Client Upgrades]
ja: xref:client-upgrades.adoc[クライアントのアップグレード]
ko: xref:client-upgrades.adoc[클라이언트 업그레이드]
zh_cn: xref:client-upgrades.adoc[客户端升级]

source: xref:patch-management.adoc[Patch Management]
ja: xref:patch-management.adoc[パッチ管理]
ko: xref:patch-management.adoc[패치 관리]
zh_cn: xref:patch-management.adoc[补丁管理]

source: xref:configuration-management.adoc[Configuration Management]
ja: xref:configuration-management.adoc[設定の管理]
ko: xref:configuration-management.adoc[구성 관리]
zh_cn: xref:configuration-management.adoc[配置管理]

source: xref:system-set-manager.adoc[System Set Manager]
ko: xref:system-set-manager.adoc[시스템 세트 관리자]
zh_cn: xref:system-set-manager.adoc[系统集管理器]

source: xref:system-types.adoc[System Types]
ja: xref:system-types.adoc[システムの種類]
ko: xref:system-types.adoc[시스템 유형]
zh_cn: xref:system-types.adoc[系统类型]

source: xref:autoinst-reinstall.adoc[Reinstall Registered Systems]
ja: xref:autoinst-reinstall.adoc[登録済みシステムを再インストールする]
ko: xref:autoinst-reinstall.adoc[등록된 시스템 재설치]
zh_cn: xref:autoinst-reinstall.adoc[重新安装已注册系统]

source: xref:autoinst-unattended.adoc[Unattended Provisioning]
ja: xref:autoinst-unattended.adoc[無人プロビジョニング]
ko: xref:autoinst-unattended.adoc[무인 프로비저닝]
zh_cn: xref:autoinst-unattended.adoc[无人照管的置备]

source: xref:virtualization.adoc[Virtualization]
ja: xref:virtualization.adoc[仮想化]
ko: xref:virtualization.adoc[가상화]
zh_cn: xref:virtualization.adoc[虚拟化]

source: xref:virt-xenkvm.adoc[Virtualization with Xen and KVM]
ja: xref:virt-xenkvm.adoc[XenおよびKVMを使用した仮想化]
ko: xref:virt-xenkvm.adoc[Xen 및 KVM을 이용한 가상화]
zh_cn: xref:virt-xenkvm.adoc[使用 Xen 和 KVM 虚拟化]

source: xref:vhm-vmware.adoc[VHM and VMWare]
ja: xref:vhm-vmware.adoc[VHMとVMWare]
ko: xref:vhm-vmware.adoc[VHM 및 VMWare]
zh_cn: xref:vhm-vmware.adoc[VHM 和 VMWare]

source: xref:vhm-file.adoc[VHM with Other Hosts]
ja: xref:vhm-file.adoc[その他のホストを使用したVHM]
ko: xref:vhm-file.adoc[기타 호스트가 포함된 VHM]
zh_cn: xref:vhm-file.adoc[VHM 与其他主机]

source: Create a client activation key on the {productname} server using the {webui}.
ja: {webui}を使用して{productname}サーバにクライアントアクティベーションキーを作成します。
ko: {webui}를 사용해 {productname} 서버에서 클라이언트 활성화 키를 생성합니다.
zh_cn: 在 {productname} 服务器上，使用 {webui} 创建客户端激活密钥。

source: On the proxy, execute the [command]``mgr-bootstrap`` command line tool as {rootuser}.
ja: プロキシで、[command]``mgr-bootstrap``コマンドラインツールを{rootuser}として実行します。
ko: 프록시에서 [command]``mgr-bootstrap`` 명령줄 도구를 {rootuser}로 실행합니다.
zh_cn: 在代理上，以 {rootuser} 身份执行 [command]``mgr-bootstrap`` 命令行工具。

source: To view available options type [command]``mgr-bootstrap --help`` from the command line:
ja: 使用できるオプションを表示するには、コマンドラインに[command]``mgr-bootstrap --help``と入力します。
ko: 사용 가능한 옵션을 보려면 명령줄에서 다음과 같이 [command]``mgr-bootstrap --help``를 입력합니다.
zh_cn: 要从命令行查看可用选项类型 [command]``mgr-bootstrap --help``，请执行以下命令：

source: Execute the bootstrap script directly on the clients or from the proxy with [command]``ssh``. Replace [systemitem]``<bootstrap>`` with the name of the bootstrap script and [systemitem]`` <client.example.com>`` with the host name of your client:
ja: クライアントで直接ブートストラップスクリプトを実行するか、または[command]``ssh``を使用してプロキシからブートストラップスクリプトを実行します。 [systemitem]``<bootstrap>``をブートストラップスクリプトの名前に置き換え、[systemitem]`` <client.example.com>``をクライアントのホスト名に置き換えます。
ko: 클라이언트에서 직접 또는 프록시에서 [command]``ssh``로 부트스트랩 스크립트를 실행합니다. 다음과 같이 [systemitem]``<bootstrap>``을 부트스트랩 스크립트 이름으로, [systemitem]`` <client.example.com>``을 클라이언트의 호스트 이름으로 대체합니다.
zh_cn: 直接在客户端上执行引导脚本，或从代理上使用 [command]``ssh`` 来执行。使用引导脚本的名称替换 [systemitem]``<bootstrap>``，使用您客户端的主机名替换 [systemitem]``<client.example.com>``：

source: Select the child channels you need (for example, the mandatory {susemgr} tools and updates channels).
ja: 必要な子チャンネルを選択します(必須の{susemgr}ツールや更新チャンネルなど)。
ko: 필요한 하위 채널을 선택합니다(예: 필수 {susemgr} 도구 및 업데이트 채널).
zh_cn: 选择所需的子通道（例如，必需的 {susemgr} 工具和更新通道）。

source: Check the [guimenu]``Add-On System Types`` check box if you need to enable any of the options.
ja: いずれかのオプションを有効にする必要がある場合は、［[guimenu]``付属エンタイトルメント``］チェックボックスにチェックを付けます。
ko: 옵션을 활성화하려면 [guimenu]``추가 시스템 유형`` 확인란을 선택합니다.
zh_cn: 如果需要启用任何选项，请选中[guimenu]``附加系统类型``复选框。

source: We recommend you leave the [guimenu]``Contact Method`` set to [guimenu]``Default``.
ja: ［[guimenu]``接続メソッド``］は［[guimenu]``デフォルト``］のままにすることをお勧めします。
ko: [guimenu]``연결 방법``은 [guimenu]``기본값``으로 설정된 상태 그대로 두는 것이 좋습니다.
zh_cn: 建议您保留[guimenu]``默认``设置的[guimenu]``联系方法``。

source: Check the [guimenu]``Configuration File Deployment`` check box to enable configuration management for this key, and click btn:[Update Activation Key] to save this change.
ja: ［[guimenu]``設定ファイルの展開``］チェックボックスをチェックし、このキーの設定管理を有効にし、btn:[アクティベーションキーの更新]をクリックしてこの変更を保存します。
ko: [guimenu]``구성 파일 배포`` 확인란을 선택하여 이 키에 대한 구성 관리를 활성화하고, btn:[활성화 키 업데이트]를 클릭하여 이 변경 사항을 저장합니다.
zh_cn: 选中[guimenu]``配置文件部署``复选框以对此密钥启用配置管理，然后单击 btn:[更新激活密钥] 保存此更改。

source: The [guimenu]``Configuration File Deployment`` check box does not appear until after you have created the activation key. Ensure you go back and check the box if you need to enable configuration management.
ja: ［[guimenu]``設定ファイルの展開``］チェックボックスは、アクティベーションキーを作成するまで表示されません。 設定管理を有効にする必要がある場合、前に戻ってボックスにチェックを付けます。
ko: [guimenu]``구성 파일 배포`` 확인란은 활성화 키를 생성한 후에야 표시됩니다. 구성 관리를 활성화해야 하는 경우 되돌아가 확인란을 선택하십시오.
zh_cn: 在您创建激活密钥前，[guimenu]``配置文件部署``复选框将不会显示。如果您需要启用配置管理，请务必返回并选中该复选框。

source: Avoid using the [systemitem]``SUSE Manager Default`` parent channel. This setting forces {productname} to choose a parent channel that best corresponds to the installed operating system, which can sometimes lead to unexpected behavior. Instead, we recommend you create activation keys specific to each distribution and architecture.
ja: [systemitem]``SUSEマネージャのデフォルト``の親チャンネルを使用しないでください。 この設定では、{productname}は、インストールされるオペレーティングシステムに最適な親チャンネルを強制的に選択します。その場合、予期しない動作が発生する可能性があります。 代わりに、それぞれのディストリビューションおよびアーキテクチャに固有のアクティベーションキーを作成することをお勧めします。
ko: [systemitem]``SUSE Manager 기본값`` 상위 채널을 사용하지 마십시오. 이 설정은 {productname}가 설치된 운영 체제와 가장 부합하는 상위 채널을 선택하도록 강제합니다. 이로 인해 때로 예기치 않은 동작이 발생할 수 있습니다. 대신에 각 배포 및 아키텍처별로 활성화 키를 생성하는 것이 좋습니다.
zh_cn: 避免使用 [systemitem]``SUSE Manager Default`` 父通道。此设置会强制 {productname} 选择与所安装操作系统最匹配的父通道，而这有时可能会导致非预期的行为。请改为创建特定于每个发行套件和体系结构的激活密钥。

source: Bootstrapping with Activation Keys
ja: アクティベーションキーによるブートストラップ
ko: 활성화 키를 이용한 부트스트래핑
zh_cn: 使用激活密钥引导

source: Bootstrapping LTSS clients
ja: LTSSクライアントのブートストラップ
ko: LTSS 클라이언트 부트스트래핑
zh_cn: 引导 LTSS 客户端

source: You must use distro and profile labels as listed by {cobbler}, and not simply as shown in the UI.
ko: 단순히 UI에 표시된 대로가 아니라 {cobbler}에서 나열한 배포판 및 프로파일 레이블을 사용해야 합니다.
zh_cn: 必须按 {cobbler} 中所列的名称（而不是简单地按 UI 中所示）使用发行套件和配置文件标签。

source: To list the names of distributions and profiles stored by {cobbler}, run the commands:
ja: {cobbler}によって保存されているディストリビューションとプロファイルの名前を一覧表示するには、次のコマンドを実行します。
ko: {cobbler}가 저장한 배포 및 프로파일의 이름을 나열하려면 다음 명령을 실행합니다.
zh_cn: 要列出 {cobbler} 存储的发行套件和配置文件的名称，请运行以下命令：

source: # cobbler distro list # cobbler profile list
ko: # cobbler distro 목록 # cobbler 프로파일 목록

source: The boot ISO includes all profiles and systems by default. You can limit which profiles and systems are used with the [option]``--profiles`` and [option]``--systems`` options. For example:
ja: ブートISOには、すべてのプロファイルおよびシステムがデフォルトで含まれています。 [option]``--profiles``オプションと[option]``--systems``オプションで、使用するプロファイルおよびシステムを制限できます。 次に例を示します。
ko: 부팅 ISO에는 모든 프로파일 및 시스템이 기본적으로 포함되어 있습니다. [option]``--profiles`` 및 [option]``--systems`` 옵션을 사용하면 사용되는 프로파일 및 시스템을 제한할 수 있습니다. 예:
zh_cn: 引导 ISO 默认包含所有配置文件和系统。您可以通过 [option]``--profiles`` 和 [option]``--systems`` 选项来限制使用的配置文件和系统。例如：

source: For information on how to create the key and sign the metadata with it, see xref:administration:repo-metadata.adoc[Signing Repository Metadata].
ja: キーを作成し、そのキーを使用してメタデータに署名する方法については、xref:administration:repo-metadata.adoc[リポジトリメタデータの署名]を参照してください。
ko: 키를 생성한 후 이 키를 사용하여 메타데이터에 서명하는 방법은 xref:administration:repo-metadata.adoc[리포지토리 메타데이터 서명]을 참조하십시오.
zh_cn: 有关如何创建密钥并使用它对元数据签名的信息，请参见 xref:administration:repo-metadata.adoc[对储存库元数据签名]。

source: For information on how to add the key to installation media used for network boot, see xref:client-configuration:autoinst-owngpgkey.adoc#gpg-key-pxeboot[Own GPG Key for PXE Boot].
ja: ネットワークブートに使用するインストールメディアにキーを追加する方法については、xref:client-configuration:autoinst-owngpgkey.adoc#gpg-key-pxeboot[PXEブート用の独自のGPGキー]を参照してください。
ko: 네트워크 부팅을 위해 사용되는 설치 미디어에 키를 추가하는 방법은 xref:client-configuration:autoinst-owngpgkey.adoc#gpg-key-pxeboot[PXE 부팅을 위한 자체 GPG 키]를 참조하십시오.
zh_cn: 有关如何将密钥添加到用于网络引导的安装媒体的信息，请参见xref:client-configuration:autoinst-owngpgkey.adoc#gpg-key-pxeboot[用于 PXE 引导的自己的 GPG 密钥]。
