Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: In the [guimenu]``Project ID`` field, type the project ID used by the GCE instance.
ca: Al camp [guimenu].ID del projecte., escriviu l'ID del projecte utilitzat per la instància GCE.
ja: ［[guimenu]``プロジェクトID``］フィールドに、GCEインスタンスで使用するプロジェクトIDを入力します。
ko: [guimenu]``프로젝트 ID`` 필드에 GCE 인스턴스가 사용하는 프로젝트 ID를 입력합니다.
zh_cn: 在[guimenu]``项目 ID`` 字段中，键入 GCE 实例使用的项目 ID。

source: In the [guimenu]``Zone`` field, type the zone your VM is located in.
ca: Al camp [guimenu].Zona., escriviu la zona on es troba la vostra MV.
ja: ［[guimenu]``Zone``］（ゾーン）フィールドに、VMが存在するゾーンを入力します。
ko: [guimenu]``영역`` 필드에 VM이 있는 영역을 입력합니다.
zh_cn: 在[guimenu]``区域``字段中，键入您的 VM 所在的区域。

source: Assigning Permissions
ca: Assignació de permisos
ja: パーミッションの割り当て
ko: 권한 할당
zh_cn: 指派权限

source: ERROR: {'domain': 'global', 'reason': 'forbidden', 'message': "Required 'compute.zones.list' permission for 'projects/project-id'"} ERROR: Could not connect to the Google Compute Engine Public Cloud using specified credentials.
ca: ERROR: {'domain': 'global', 'reason': 'forbidden', 'message': "Requerit permís 'compute.zones.list' per a 'projects/project-id'"} ERROR: No s'ha pogut connectar al Google Compute Engine Public Cloud utilitzant les credencials especificades.
ja: ERROR:（エラー:）{'domain': 'global', 'reason': 'forbidden', 'message': "Required 'compute.zones.list' permission for 'projects/project-id'"} ERROR:（エラー:）Could not connect to the Google Compute Engine Public Cloud using specified credentials.（指定した資格情報を使用してGoogle Compute Engineのパブリッククラウドに接続できませんでした。）
ko: 오류: {'domain': 'global', 'reason': 'forbidden', 'message': "Required 'compute.zones.list' permission for 'projects/project-id'"} 오류: 지정된 인증서를 사용해 Google Compute Engine 공용 클라우드에 연결할 수 없습니다.
zh_cn: 错误：{'domain': 'global', 'reason': 'forbidden', 'message': "需要 'compute.zones.list' 权限，'projects/project-id'"} 错误：无法使用指定的身份凭证连接 Google Compute Engine 公有云。

source: virtual-host-gatherer -i input_google.json -o out_google.json -vvv
ca: virtual-host-gatherer -i inputgoogle.json -o outgoogle.json -vvvv

source: The [path]``input_google.json`` file should contain this information:
ca: El fitxer [path]:inputgoogle.json contain hauria de contenir aquesta informació:
ja: [path]``input_google.json``ファイルには次の情報が含まれています。
ko: [path]``input_google.json`` 파일은 다음과 같은 정보를 포함해야 합니다.
zh_cn: [path]``input_google.json`` 文件应包含以下信息：

source: [ { "id": "google_vhm", "module": "GoogleCE", "service_account_email": "mail@example.com", "cert_path": "secret-key", "project_id": "project-id", "zone": "zone" } ]
ca: [ { {{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{ "id": "googlevhm", "Mòdul": "GoogleCE", "serviceaccountemail": "mail",example.com", "certpath": "secret-key", "projectid": "project-id", "zona": "zona" } ]

source: GCE UUID
ca: UUID DE GCE

source: Instances running on the Google public cloud report this UUID to {productname} Server:
ca: Instàncies que s'executen al núvol públic de Google informen d'aquest UUID a {productname} Servidor:
ja: Googleパブリッククラウドで実行されているインスタンスは、このUUIDを{productname}サーバに報告できます。
ko: Google 공용 클라우드에서 실행되는 인스턴스는 다음과 같이 이 UUID를 {productname} 서버에 보고합니다.
zh_cn: 在 Google 公有云上运行的实例会向 {productname} 服务器报告如下 UUID：

source: Virtualization with Nutanix
ca: Virtualització amb Nutanix
ja: Nutanixによる仮想化
ko: Nutanix를 이용한 가상화
zh_cn: 使用 Nutanix 虚拟化

source: {suse} is a Nutanix ecosystem partner and {productname} has obtained the Nutanix-ready certification in the "Nutanix AHV integrated" category.
ca: {suse} és soci de l'ecosistema de Nutanix i SUSE Manager ha obtingut la certificació Nutanix-ready en la categoria "Nutanix AHV integrated".

source: For more information about Nutanix integrations, see https://www.nutanix.com/partners/technology-alliances/suse
ca: Per a més informació sobre les integracions de Nutanix, consulteu https://www.nutanix.com/partners/technology-alliances/suse
ja: Nutanixの統合の詳細については、link:https://www.nutanix.com/partners/technology-alliances/suse[]を参照してください。
ko: Nutanix 통합에 대한 자세한 내용은 https://www.nutanix.com/partners/technology-alliances/suse[]에서 참조하십시오.
zh_cn: 有关 Nutanix 集成的详细信息，请参见 https://www.nutanix.com/partners/technology-alliances/suse

source: You can use Nutanix AHV virtual machines with {productname} by setting up a virtual host manager (VHM). To begin, you need to set up a VHM on your {productname} Server, and inventory the available VM hosts.
ca: Podeu utilitzar màquines virtuals Nutanix AHV amb {productname} configurant un gestor d'amfitrió virtual (VHM). Per començar, heu de configurar una VHM al vostre servidor {productname}, i inventar els servidors VM disponibles.
ja: {productname}ではNutanix AHV仮想マシンを使用できます。そのためには、仮想ホストマネージャ(VHM)を設定します。 まず、{productname}サーバでVHMを設定し、使用できるVMホストを評価する必要があります。
ko: 가상 호스트 관리자(VHM)를 설정하여 {productname}에서 Nutanix AHV 가상 머신을 사용할 수 있습니다. 먼저 {productname} 서버에서 VHM을 설정하고 사용 가능한 VM 호스트를 목록에 포함해야 합니다.
zh_cn: 您可以通过在 {productname} 中设置虚拟主机管理器 (VHM) 来使用 Nutanix AHV 虚拟机。开始前，您需要在 {productname} 服务器上设置 VHM，然后清点可用的 VM 主机。

source: VHM Setup
ca: Configuració VHM
ja: VHMの設定
ko: VHM 설정
zh_cn: VHM 设置

source: Ensure you have installed the [systemitem]``virtual-host-gatherer-Nutanix`` package on the {productname} Server.
ca: Assegureu-vos que heu instal·lat el paquet [systemitem].virtual-host-gatherer-Nutanix. al servidor {productname}.
ja: [systemitem]``virtual-host-gatherer-Nutanix``パッケージを{productname}サーバにインストール済みであることを確認してください。
ko: {productname} 서버에 [systemitem]``virtual-host-gatherer-Nutanix`` 패키지를 설치했는지 확인하십시오.
zh_cn: 确保您已在 {productname} 服务器上安装 [systemitem]``virtual-host-gatherer-Nutanix`` 软件包。

source: To run a VHM, your {productname} Server must have port 9440 open to access the Nutanix Prism Element API.
ca: Per executar una VHM, el vostre servidor {productname} ha de tenir el port 9440 obert per accedir a l'API Nutanix Prism Element.
ja: VHMを実行するには、{productname}サーバでポート9440がオープンになっていて、Nutanix Prism Element APIにアクセスする必要があります。
ko: VHM을 실행하려면 {productname} 서버가 포트 9440을 열어 Nutanix Prism Element API에 액세스해야 합니다.
zh_cn: 要运行 VHM，必须打开端口 9440 以使您的 {productname} 服务器可访问 Nutanix Prism Element API。

source: Procedure: Creating a Nutanix VHM
ca: Procediment: Creació d'un Nutanix VHM
ja: プロシージャ: Nutanix VHMの作成
ko: 절차: Nutanix VHM 생성
zh_cn: 过程：创建 Nutanix VHM

source: Click btn:[Create] and select [guimenu]``Nutanix AHV``.
ca: Feu clic a btn:[Crea] i seleccioneu [guimenu].Nutanix AHV..
ja: btn:[作成]をクリックし、［[guimenu]``Nutanix AHV``］を選択します。
ko: btn:[생성]을 클릭하고 [guimenu]``Nutanix AHV``를 선택합니다.
zh_cn: 单击 btn:[创建]，然后选择 [guimenu]``Nutanix AHV``。

source: In the [guimenu]``Add a Nutanix AHV Virtual Host Manager`` section, use these parameters:
ca: A la secció [guimenu] theAfegeix un gestor d'amfitrió virtual AHV de Nutanix``, utilitzeu aquests paràmetres:
ja: ［[guimenu]``Add a Nutanix AHV Virtual Host Manager``］（Nutanix AHV仮想ホストマネージャの追加）セクションで、次のパラメータを使用します。
ko: [guimenu]``Nutanix AHV 가상 호스트 관리자 추가`` 섹션에서 다음과 같은 파라미터를 사용합니다.
zh_cn: 在[guimenu]``添加 Nutanix AHV 虚拟主机管理器``部分，使用以下参数：

source: In the [guimenu]``Hostname`` field, type the fully qualified domain name (FQDN) or host IP address.
ca: Al camp [guimenu].Hostname., escriviu el nom de domini (FQDN) o l'adreça IP de l'amfitrió.
ja: ［[guimenu]``ホスト名``］フィールドに、完全修飾ドメイン名(FQDN)またはホストIPアドレスを入力します。
ko: [guimenu]``호스트 이름`` 필드에 전체 도메인 이름(FQDN) 또는 호스트 IP 주소를 입력합니다.
zh_cn: 在[guimenu]``主机名``字段中，键入完全限定的域名 (FQDN) 或主机的 IP 地址。

source: In the [guimenu]``Port`` field, type the Prism Element API port to use (for example, [parameter]``9440``).
ca: Al camp [guimenu]).Port)., escriviu el port de l'API de l'element de prisma a usar (per exemple, [parameter]).9440).).
ja: ［[guimenu]``ポート``］フィールドに、使用するPrism Element APIポートを入力します([parameter]``9440``など)。
ko: [guimenu]``포트`` 필드에 사용할 Prism Element API 포트를 입력합니다(예: [parameter]``9440``).
zh_cn: 在[guimenu]``端口``字段中，键入要使用的 Prism Element API 端口（例如，[parameter]``9440``）。

source: In the [guimenu]``Username`` field, type the username associated with the VM host.
ca: En el camp [guimenu].Nom d'usuari., escriviu el nom d'usuari associat amb l'amfitrió VM.
ja: ［[guimenu]``ユーザ名``］フィールドに、VMホストに関連付けられているユーザ名を入力します。
ko: [guimenu]``사용자 이름`` 필드에 VM 호스트와 연결된 사용자 이름을 입력합니다.
zh_cn: 在[guimenu]``用户名``字段中，键入与 VM 主机关联的用户名。

source: In the [guimenu]``Password`` field, type the password associated with the VM host user.
ca: Al camp [guimenu].Password., escriviu la contrasenya associada a l'usuari de la màquina VM.
ja: ［[guimenu]``パスワード``］フィールドに、VMホストユーザに関連付けられているパスワードを入力します。
ko: [guimenu]``사용자 이름`` 필드에 VM 호스트 사용자와 연결된 비밀번호를 입력합니다.
zh_cn: 在[guimenu]``口令``字段中，键入与 VM 主机用户关联的口令。

source: On the [guimenu]``Virtual Host Managers`` page select the new VHM.
ca: A la pàgina [guimenu].Virtual Host Managers. seleccioneu la nova VHM.
ja: ［[guimenu]``仮想ホストマネージャ``］ページで、新しいVHMを選択します。
ko: [guimenu]``가상 호스트 관리자`` 페이지에서 새 VHM을 선택합니다.
zh_cn: 在[guimenu]``虚拟主机管理器``页面中选择新 VHM。

source: Connecting to the Nutanix Prism API server from a browser using HTTPS can sometimes log an ``invalid certificate`` error. If this occurs, refreshing the data from the virtual host manager fails. A valid SSL certificate (not self-signed) is required on your Nutanix API server. If you are using a custom CA authority for your Nutanix SSL certificate, copy the custom CA certificate to [path]``/etc/pki/trust/anchors`` on the {productname} Server.
ca: Connectar al servidor ESXi des d'un navegador que utilitza HTTPS pot de vegades registrar un error de .certificat no vàlid.. Si això passa, l'actualització de les dades del servidor virtual d'amfitrions falla. Per corregir el problema, extraieu el certificat del servidor ESXi i copieu-lo a [path]./etc/pki/trust/anchors.. Torna a confiar en el certificat executant l'ordre [command].update-ca-certificates. a la línia d'ordres i reinicia els serveis de passeig espacial.

source: Re-trust the certificate by running the [command]``update-ca-certificates`` command on the command line, and restart the spacewalk services.
ca: Torna a confiar el certificat executant l'ordre [command].update-ca-certificates, a la línia d'ordres, i reinicia els serveis de passeig espacial.

source: After your VHM has been created and configured, Taskomatic runs data collection automatically. If you want to manually perform data collection, navigate to menu:Systems[Virtual Host Managers], select the appropriate VHM, and click btn:[Refresh Data].
ca: Després que la vostra VHM hagi estat creada i configurada, Taskomatic executa la recollida de dades automàticament. Si voleu realitzar manualment la recollida de dades, navegueu a menu:Systems[Virtual Host Managers], seleccioneu la VHM adequada i feu clic a btn:[Refresh Data].
ja: VHMが作成されて設定されると、Taskomaticは、データ収集を自動的に実行します。 データ収集を手動で実行する場合、menu:システム[仮想ホストマネージャ]に移動し、適切なVHMを選択してbtn:[データの更新]をクリックします。
ko: taskomatic은 VHM을 생성하여 구성한 후 데이터 수집을 자동으로 실행합니다. 데이터 수집을 수동으로 수행하려면 menu:시스템[가상 호스트 관리자]로 이동하여 적절한 VHM을 선택한 후 btn:[데이터 새로 고침]을 클릭합니다.
zh_cn: 创建并配置好 VHM 后，Taskomatic 即会自动运行数据收集过程。如果您要手动进行数据收集，请导航到menu:系统[虚拟主机管理器]，选择适当的 VHM，然后单击 btn:[刷新数据]。

source: {productname} ships with a tool called [command]``virtual-host-gatherer`` that can connect to VHMs using their API, and request information about virtual hosts. [command]``virtual-host-gatherer`` maintains the concept of optional modules, where each module enables a specific VHM. This tool is automatically invoked nightly by Taskomatic. Log files for the [command]``virtual-host-gatherer`` tool are located at [path]``/var/log/rhn/gatherer.log``.
ca: {productname} es distribueix amb una eina anomenada [command].virtual-host-gatherer. que es pot connectar a VHMs utilitzant la seva API i sol·licitar informació sobre ordinadors virtuals. [command].virtual-host-gatherer. manté el concepte de mòduls opcionals, on cada mòdul habilita una VHM específica. Taskomatic invoca automàticament aquesta eina de manera nocturna. Els fitxers de registre de l'eina [command].virtual-host-gatherer. es troben a [path]./var/log/rhn/gatherer.log..
ja: APIを使用してVHMに接続して仮想ホストの情報をリクエストできる[command]``virtual-host-gatherer``というツールが{productname}に付属しています。 [command]``virtual-host-gatherer``は、オプションモジュールの概念を維持していて、各モジュールが特定のVHMを有効にします。 このツールは、Taskomaticによって毎晩自動的に呼び出されます。 [command]``virtual-host-gatherer``ツールのログファイルは[path]``/var/log/rhn/gatherer.log``にあります。
ko: {productname}는 API를 사용해 VHM에 연결하고 가상 호스트에 대한 정보를 요청할 수 있는 [command]``virtual-host-gatherer``라고 하는 도구와 함께 제공됩니다. [command]``virtual-host-gatherer``는 각 모듈이 특정 VHM을 활성화하는 옵션 모듈의 개념을 유지합니다. 이 도구는 Taskomat이 야간에 자동으로 호출합니다. [command]``virtual-host-gatherer`` 도구의 로그 파일은 [path]``/var/log/rhn/gatherer.log``에 있습니다.
zh_cn: {productname} 随附了一个名为 [command]``virtual-host-gatherer`` 的工具，可以使用相应 API 连接到 VHM 并请求虚拟主机的相关信息。[command]``virtual-host-gatherer`` 计算机会维护可选模块的概念，每个模块可启用一个特定的 VHM。Taskomatic 会在夜间自动调用此工具。[command]``virtual-host-gatherer`` 工具的日志文件位于 [path]``/var/log/rhn/ gatherer.log``。

source: Virtualization with VMware
ca: Virtualització amb VMWare

source: You can use VMware vSphere virtual machines, including ESXi and vCenter, with {productname} by setting up a virtual host manager (VHM).
ca: Podeu utilitzar màquines virtuals VMWare vSphere, incloent ESXi i vCenter, amb {productname} configurant un gestor d'amfitrió virtual (VHM).

source: To begin, you need to set up a VHM on your {productname} Server, and inventory the available VM hosts. Taskomatic can then begin data collection using the VMs API.
ca: Per començar, heu de configurar una VHM al vostre servidor {productname}, i inventar els servidors VM disponibles. Taskomatic pot llavors començar la recollida de dades utilitzant l'API VMs.
ja: まず、{productname}サーバでVHMを設定し、使用できるVMホストを評価する必要があります。 次に、Taskomaticは、VMのAPIを使用してデータ収集を開始できます。
ko: 먼저 {productname} 서버에서 VHM을 설정하고 사용 가능한 VM 호스트를 목록에 포함해야 합니다. 이렇게 하면 Taskomatic이 VM API를 사용해 데이터 수집을 시작할 수 있습니다.
zh_cn: 开始前，您需要在 {productname} 服务器上设置 VHM，然后清点可用的 VM 主机。之后，Taskomatic 便可以开始使用 VM API 收集数据。

source: To run a VHM, your {productname} Server needs to have port 443 open, to access the VMware API.
ca: Per a executar una VHM, el vostre servidor {productname} ha de tenir el port 443 obert, per a accedir a l'API VMWare.

source: VMware hosts use access roles and permissions to control access to hosts and guests. Ensure that any VMware objects or resources that you want to be inventoried by the VHM have at least [parameter]``read-only`` permissions. If you want to exclude any objects or resources, mark them with [parameter]``no-access``.
ca: Els amfitrions VMWare utilitzen rols d'accés i permisos per controlar l'accés als amfitrions i convidats. Assegureu-vos que qualsevol objecte o recurs de VMWare que vulgueu inventariar per la VHM tingui almenys permisos [parameter].read-only.. Si voleu excloure qualsevol objecte o recurs, marqueu-lo amb [parameter].no-access..

source: When you are adding new hosts to {productname}, you need to consider if the roles and permissions that have been assigned to users and objects need to be inventoried by {productname}.
ca: Quan afegiu amfitrions nous a {productname}, heu de considerar si els rols i permisos que s'han assignat als usuaris i objectes han de ser inventariats per {productname}.
ja: 新しいホストを{productname}に追加している場合、ユーザおよびオブジェクトに割り当てられているロールおよびパーミッションを{productname}で評価する必要があるかどうかを検討する必要があります。
ko: 새 호스트를 {productname}에 추가하려면 사용자 및 객체에 할당된 역할 및 권한을 {productname}가 목록에 포함해야 할지 여부를 고려해야 합니다.
zh_cn: 当您向 {productname} 添加新主机时，需考虑是否需要让 {productname} 清点已指派给用户和对象的角色和权限。

source: For more information on users, roles, and permissions, see the VMware vSphere documentation: https://techdocs.broadcom.com/us/en/vmware-cis/vsphere.html
ca: Per obtenir més informació sobre usuaris, rols i permisos, consulteu la documentació de VMware vSphere: https://techdocs.broadcom.com/us/en/vmware-cis/vsphere.html

source: Procedure: Creating a VMware VHM
ca: Procediment: Creació d'una VHM de VMWare

source: Click btn:[Create] and select [guimenu]``VMware-based``.
ca: Feu clic a btn:[Crea] i seleccioneu [guimenu].basat en VMWare..

source: In the [guimenu]``Add a VMware-based Virtual Host Manager`` section, use these parameters:
ca: A la secció [guimenu] theAfegeix un gestor d'amfitrió virtual basat en VMWare:, utilitzeu aquests paràmetres:

source: In the [guimenu]``Port`` field, type the ESXi API port to use (for example, [parameter]``443``).
ca: Al camp [guimenu]).Port)., escriviu el port de l'API ESXi a usar (per exemple, [parameter]).443).).
ja: ［[guimenu]``ポート``］フィールドに、使用するESXi APIポートを入力します([parameter]``443``など)。
ko: [guimenu]``포트`` 필드에 사용할 ESXi API 포트를 입력합니다(예: [parameter]``443``).
zh_cn: 在[guimenu]``端口``字段中，键入要使用的 ESXi API 端口（例如，[parameter]``443``）。

source: Connecting to the ESXi server from a browser using HTTPS can sometimes log an ``invalid certificate`` error. If this occurs, refreshing the data from the virtual hosts server fails. To correct the problem, extract the certificate from the ESXi server, and copy it to [path]``/etc/pki/trust/anchors``. Re-trust the certificate by running the [command]``update-ca-certificates`` command on the command line, and restart the spacewalk services.
ca: Connectar al servidor ESXi des d'un navegador que utilitza HTTPS pot de vegades registrar un error de .certificat no vàlid.. Si això passa, l'actualització de les dades del servidor virtual d'amfitrions falla. Per corregir el problema, extraieu el certificat del servidor ESXi i copieu-lo a [path]./etc/pki/trust/anchors.. Torna a confiar en el certificat executant l'ordre [command].update-ca-certificates. a la línia d'ordres i reinicia els serveis de passeig espacial.
ja: HTTPSを使用してブラウザからESXiサーバに接続すると、``無効な証明書``エラーがログされる場合があります。 このエラーが発生すると、仮想ホストサーバからのデータの更新は失敗します。 この問題を修正するには、ESXiサーバから証明書を抽出して[path]``/etc/pki/trust/anchors``にコピーします。 証明書を再度信頼します。そのためには、コマンドラインで[command]``update-ca-certificates``コマンドを実行し、spacewalkサービスを再起動します。
ko: HTTPS를 사용해 브라우저에서 ESXi 서버에 연결하면 때로 ``잘못된 인증서`` 오류가 로깅될 수 있습니다. 이런 오류가 발생하는 경우 가상 호스트 서버에서 데이터를 새로 고침하는 작업이 실패합니다. 이 문제를 해결하려면 ESXi 서버에서 인증서를 추출하여 [path]``/etc/pki/trust/anchors``로 복사하십시오. 명령줄에서 [command]``update-ca-certificates`` 명령을 실행하여 인증서를 다시 신뢰하고 spacewalk 서비스를 다시 시작합니다.
zh_cn: 有时，在浏览器中使用 HTTPS 连接 ESXi 服务器可能会发生``证书无效``错误。如果发生此情况，刷新来自虚拟主机服务器的数据将会失败。要纠正该问题，请解压缩来自 ESXi 服务器的证书，然后将其复制到 [path]``/etc/pki/trust/ anchors``。在命令行上运行 [command]``update-ca-certificates`` 命令以重新信任证书，然后重启动 spacewalk 服务。

source: Troubleshooting SSL Errors on VMware
ca: Resolució de problemes d'errors SSL a VMWare

source: If you see SSL errors while configuring your VMware installation, you need to download the CA certificate file from VMware, and trust it on {productname}.
ca: Si veieu errors SSL mentre configureu la instal·lació de VMWare, heu de baixar el fitxer de certificat CA de VMWare i confiar-hi a {productname}.

source: Procedure: Trusting VMware CA Certificates
ca: Procediment: Confiança en els certificats CA de VMWare

source: Download the CA Certificate from your VMware installation.
ca: Descarrega't el Certificat CA de la teva instal·lació de VMWare.

source: You can do this by logging in to your vCenter {webui}, and clicking btn:[Download trusted root CA certificates].
ca: Podeu fer-ho iniciant sessió al vostre vCenter {webui} i fent clic a btn:[Descarrega els certificats de CA arrel de confiança].
ko: vCenter {webui}에 로그인해 btn:[신뢰할 수 있는 루트 CA 인증서 다운로드]를 클릭하여 다운로드할 수 있습니다.
zh_cn: 您可以通过登录 vCenter {webui} 并单击 btn:[下载可信根 CA 证书] 来实现此目的。

source: If the downloaded CA certificates file is in ``.zip`` format, extract the archive.
ca: Si el fitxer de certificats CA descarregats està en format ..zip., extreu l'arxiu.
ja: ダウンロードしたCA証明書ファイルが``.zip``フォーマットの場合、アーカイブを抽出します。
ko: 다운로드한 CA 인증서 파일이 ``.zip`` 형식인 경우 아카이브의 압축을 풉니다.
zh_cn: 如果下载的 CA 证书文件为 ``.zip`` 格式，请解压缩该存档文件。

source: The certificate files have a number as an extension. For example, ``certificate.0``.
ca: Els fitxers de certificat tenen un número com a extensió. Per exemple, .certificate.0..
ja: 証明書ファイルには拡張子として番号が含まれています。 たとえば、``certificate.0``のようになります。
ko: 인증서 파일의 확장자는 숫자입니다. 예를 들면 ``certificate.0``과 같습니다.
zh_cn: 证书文件的扩展名有多种。例如，``certificate.0``。

source: Copy the certificate files to your {productname} Server, and save them to the [path]``/etc/pki/trust/anchors/`` directory.
ca: Copieu els fitxers de certificat al vostre servidor {productname} i deseu-los al directori [path]./etc/pki/trust/anchors/..
ja: 証明書ファイルを{productname}サーバにコピーし、[path]``/etc/pki/trust/anchors/``ディレクトリに保存します。
ko: 인증서 파일을 {productname} 서버로 복사하고 [path]``/etc/pki/trust/anchors/`` 디렉토리에 저장합니다.
zh_cn: 将证书文件复制到 {productname} 服务器上并保存到 [path]``/etc/pki/trust/anchors/`` 目录中。

source: Change the filename suffix on the copied certificate to either ``.crt`` or ``.pem``.
ca: Canvia el sufix del nom de fitxer del certificat copiat a ..crt. o ..pem..
ja: コピーした証明書のファイル名のサフィックスを``.crt``または``.pem``に変更します。
ko: 복사한 인증서의 파일 이름 접미사를 ``.crt`` 또는 ``.pem``으로 변경합니다.
zh_cn: 将复制的证书的文件名后缀改为 ``.crt`` 或 ``.pem``。

source: On the {productname} Server, at the command prompt, update the CA certificate record:
ca: Al servidor {productname}, a l'indicador d'ordres, actualitzeu el registre del certificat de la CA:
ja: {productname}サーバのコマンドプロンプトで、CA証明書のレコードを更新します。
ko: {productname} 서버의 명령 프롬프트에서 다음과 같이 CA 인증서 레코드를 업데이트합니다.
zh_cn: 在 {productname} 服务器上的命令提示符处更新 CA 证书记录：

source: update-ca-certificates
ca: update-ca-certificats

source: Virtual Host Managers
ca: Gestors de l'amfitrió virtual
ja: 仮想ホストマネージャ
ko: 가상 호스트 관리자
zh_cn: 虚拟主机管理器

source: Virtual Host Managers (VHMs) are used to gather information from a range of client types.
ca: Virtual Host Managers (VHMs) s'utilitza per recopilar informació de diversos tipus de clients.
ja: 仮想ホストマネージャ(VHM)は、さまざまなクライアントの種類から情報を収集するために使用します。
ko: 가상 호스트 관리자(VHM)는 다양한 클라이언트 유형에서 정보를 수집하는 데 사용됩니다.
zh_cn: 虚拟主机管理器 (VHM) 用于收集各种客户端类型的信息。

source: VHMs can be used to collect private or public cloud instances and organize them into virtualization groups. With your virtualized clients organized this way, Taskomatic collects data on the clients for display in the {productname} {webui}. VHMs also allow you to use subscription matching on your virtualized clients.
ca: Les VHMs es poden utilitzar per recollir instàncies privades o públiques al núvol i organitzar-les en grups de virtualització. Amb els vostres clients virtualitzats organitzats d'aquesta manera, Taskomatic recull dades dels clients per a mostrar-les a {productname} {webui}. VHMs també us permet utilitzar la coincidència de subscripcions als vostres clients virtualitzats.
ja: VHMを使用して、プライベートクラウドまたはパブリッククラウドのインスタンスを収集し仮想化グループに編成できます。 このように編成された仮想化クライアントを使用して、Taskomaticは、クライアントのデータを収集し、{productname}の{webui}に表示します。 VHMを使用すると、仮想化されたクライアントでサブスクリプションマッチングを使用することもできます。
ko: VHM을 사용해 개인 또는 공용 클라우드 인스턴스를 수집하여 가상화 그룹으로 편성할 수 있습니다. 가상화 클라이언트를 이렇게 편성한 상태에서 Taskomatic은 {productname} {webui}에 표시할 클라이언트의 데이터를 수집합니다. VHM을 통해 가상화 클라이언트에서 일치하는 구독을 사용할 수도 있습니다.
zh_cn: VHM 可用于收集私有云或公有云实例，并将其分为不同的虚拟化组。以这种方式组织虚拟化客户端后，Taskomatic 便可收集客户端的相关数据以显示在 {productname} {webui} 中。借助 VHM，您还可以在虚拟化客户端上使用订阅匹配。

source: You can create a VHM on your {productname} Server, and use it to inventory available public cloud instances. You can also use a VHM to manage clusters created with {kube}.
ca: Podeu crear una VHM al vostre servidor {productname} i utilitzar-la per inventar les instàncies públiques disponibles al núvol. També podeu utilitzar una VHM per gestionar els clústers creats amb {kube}.
ja: {productname}サーバにVHMを作成して使用し、使用可能なパブリッククラウドのインスタンスを評価できます。 VHMを使用して、{kube}で作成したクラスタを管理することもできます。
ko: {productname} 서버에서 VHM을 생성한 후 이를 사용해 사용 가능한 공용 클라우드 인스턴스를 목록에 포함할 수 있습니다. VHM을 사용해 {kube}로 생성한 클러스터를 관리할 수도 있습니다.
zh_cn: 您可以在 {productname} 服务器上创建 VHM，并使用它来清点可用的公有云实例。您还可以使用 VHM 管理通过 {kube} 创建的群集。
