Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: You can use a virtual host manager (VHM) to gather instances from Microsoft Azure.
ca: Podeu utilitzar un gestor d'amfitrió virtual (VHM) per a recollir instàncies de Microsoft Azure.
ja: 仮想ホストマネージャ(VHM)を使用して、Microsoft Azureからインスタンスを収集できます。
ko: 가상 호스트 관리자(VHM)을 사용하여 Microsoft Azure에서 인스턴스를 수집할 수 있습니다.
zh_cn: 您可以使用虚拟主机管理器 (VHM) 收集 Microsoft Azure 中的实例。

source: The VHM allows {productname} to obtain and report information about your virtual machines. For more information on VHMs, see xref:client-configuration:vhm.adoc[].
ca: La VHM permet a {productname} obtenir i informar d'informació sobre les màquines virtuals. Per a més informació sobre VHMs, vegeu xref:client-configuration:vhm.adoc[].
ja: VHMを使用すると、{productname}は、使用している仮想マシンに関する情報を取得して報告できます。 VHMの詳細については、xref:client-configuration:vhm.adoc[]を参照してください。
ko: VHM을 통해 {productname}는 가상 머신에 대한 정보를 획득하고 보고할 수 있습니다. VHM에 대한 자세한 내용은 xref:client-configuration:vhm.adoc[]을 참조하십시오.
zh_cn: VHM 允许 {productname} 获取并报告有关您的虚拟机的信息。有关 VHM 的详细信息，请参见 xref:client-configuration:vhm.adoc[]。

source: Prerequisites
ca: Prerequisits
ja: 前提条件
ko: 전제 조건
zh_cn: 先决条件

source: The VHM you create needs to have the correct permissions assigned, in order for it to access the Azure VM.
ca: La VHM que creeu ha de tenir els permisos correctes assignats, perquè pugui accedir a la VM Azure.
ja: 作成したVHMは、Azure VMにアクセスするために、正しいパーミッションが割り当てられている必要があります。
ko: 사용자가 생성하는 VHM은 Azure VM에 액세스하려면 올바른 권한이 할당되어 있어야 합니다.
zh_cn: 要让您创建的 VHM 访问 Azure VM，需要为其指派正确的权限。

source: Log in to your Azure account as the subscription administrator, and ensure that the Azure user account and application are in the correct groups. The group that the application is in determines the role it has, and therefore the permissions.
ca: Inicieu sessió al vostre compte d'Azure com a administrador de subscripcions, i assegureu-vos que el compte d'usuari d'Azure i l'aplicació estan en els grups correctes. El grup en el qual es troba l'aplicació determina el rol que té, i per tant els permisos.
ja: サブスクリプション管理者としてAzureアカウントにログインし、Azureユーザアカウントとアプリケーションが正しいグループに属していることを確認してください。 アプリケーションが属しているグループによって、そのロールが決まり、パーミッションが決まります。
ko: Azure 계정에 구독 관리자로 로그인하여 Azure 사용자 계정 및 응용 프로그램이 올바른 그룹에 있는지 확인하십시오. 응용 프로그램이 속한 그룹에 따라 응용 프로그램의 역할이 결정되고, 이에 따라 권한도 결정됩니다.
zh_cn: 请以订阅管理员身份登录您的 Azure 帐户，并确保该 Azure 用户帐户和应用程序在正确的组中。应用程序所在的组决定了应用程序所拥有的角色，因而决定了其拥有的权限。

source: Create an Azure VHM
ca: Crea una VHM d'Azure
ja: Azure VHMの作成
ko: Azure VHM 생성
zh_cn: 创建 Azure VHM

source: Procedure: Creating an Azure VHM
ca: Procediment: Creació d'una VHM d'Azure
ja: プロシージャ: Azure VHMの作成
ko: 절차: Azure VHM 생성
zh_cn: 过程：创建 Azure VHM

source: Click btn:[Create] and select [guimenu]``Azure`` from the drop-down menu.
ca: Feu clic a btn:[Crea] i seleccioneu [guimenu].Azure. des del menú desplegable.
ja: btn:[作成]をクリックし、ドロップダウンメニューから［[guimenu]``Azure``］を選択します。
ko: btn:[생성]을 클릭하고 드롭다운 메뉴에서 [guimenu]``Azure``를 선택합니다.
zh_cn: 单击 btn:[创建] 并从下拉菜单中选择 [guimenu]``Azure``。

source: In the [guimenu]``Add an Azure Virtual Host Manager`` section, use these parameters:
ca: A la secció [guimenu] theAfegeix un gestor d'amfitrió virtual Azure:, utilitzeu aquests paràmetres:
ja: ［[guimenu]``Add an Azure Virtual Host Manager``］（Azure仮想ホストマネージャの追加）セクションで、次のパラメータを使用します。
ko: [guimenu]``Azure 가상 호스트 관리자 추가`` 섹션에서 다음과 같은 파라미터를 사용합니다.
zh_cn: 在[guimenu]``添加 Azure 虚拟主机管理器``部分，使用以下参数：

source: In the [guimenu]``Subscription ID`` field, type the subscription ID found in [path]``Azure portal > Services > Subscriptions`` page.
ca: Al camp [guimenu].ID de subscripció., escriviu l'ID de subscripció que es troba a la pàgina [path].Portal segur . Serveis . Subscripcions..
ja: ［[guimenu]``Subscription ID``］（サブスクリプションID）フィールドに、[path]``Azure portal > Services > Subscriptions``ページにあるサブスクリプションIDを入力します。
ko: [guimenu]``구독 ID`` 필드에서 [path]``Azure 포털 > 서비스 > 구독`` 페이지에서 찾은 구독 ID를 입력합니다.
zh_cn: 在[guimenu]``订阅 ID`` 字段中，键入在 [path]``Azure 门户 > 服务 > 订阅``页面中找到的订阅 ID。

source: In the [guimenu]``Application ID`` field, type the application ID that you collected when you registered the application.
ca: Al camp [guimenu].ID d'aplicació., escriviu l'ID d'aplicació que heu recollit quan heu registrat l'aplicació.
ja: ［[guimenu]``Application ID``］（アプリケーションID）フィールドに、このアプリケーションを登録したときに収集したアプリケーションIDを入力します。
ko: [guimenu]``응용 프로그램 ID`` 필드에 응용 프로그램 등록 시 수집한 응용 프로그램 ID를 입력합니다.
zh_cn: 在[guimenu]``应用程序 ID`` 字段中，键入您在注册应用程序时获得的应用程序 ID。

source: In the [guimenu]``Tenant ID`` field, type the tenant ID provided by Azure that you collected when you registered the application.
ca: En el camp [guimenu].ID del contenidor., escriviu l'ID de l'inquilí proporcionat per Azure que heu recollit quan heu registrat l'aplicació.
ja: ［[guimenu]``Tenant ID``］（テナントID）フィールドに、このアプリケーションを登録したときに収集したAzureが提供するテナントIDを入力します。
ko: [guimenu]``테넌트 ID`` 필드에서 응용 프로그램을 등록할 때 수집한 Azure에서 제공한 테넌트 ID를 입력합니다.
zh_cn: 在[guimenu]``租户 ID`` 字段中，键入您在注册应用程序时获得的、由 Azure 提供的租户 ID。

source: In the [guimenu]``Secret Key`` field, type the secret key associated with the Azure instance.
ca: Al camp [guimenu].Clau secreta., escriviu la clau secreta associada a la instància d'Azure.
ja: ［[guimenu]``Secret Key``］（秘密鍵）フィールドに、Azureインスタンスに関連付けられた秘密鍵を入力します。
ko: [guimenu]``비밀 키`` 필드에 Azure 인스턴스에 연결된 비밀 키를 입력합니다.
zh_cn: 在[guimenu]``机密密钥``字段中，键入与 Azure 实例关联的机密密钥。

source: In the [guimenu]``Zone`` field, type the zone your VM is located in. For example, for West Europe, enter [path]``westeurope``.
ca: Al camp [guimenu].Zona., escriviu la zona on es troba la vostra MV. Per exemple, per a Europa Occidental, entreu [camí] enteroccidental d'Europa..
ja: ［[guimenu]``Zone``］（ゾーン）フィールドに、VMが存在するゾーンを入力します。たとえば、西ヨーロッパの場合、[path]``westeurope``と入力します。
ko: [guimenu]``영역`` 필드에 VM이 있는 영역을 입력합니다. 예를 들어, 서유럽의 경우 [path]``westeurope``을 입력합니다.
zh_cn: 在[guimenu]``区域``字段中，键入您的 VM 所在的区域。例如，如果位于西欧，则输入[path]``西欧``。

source: This is required for subscription matching to work.
ca: Això és necessari perquè la coincidència de la subscripció funcioni.
ja: これは、サブスクリプションマッチングを動作させるために必要です。
ko: 이 키는 작업과 일치하는 등록을 위해 필요합니다.
zh_cn: 要使订阅匹配功能正常工作，就必须提供此信息。

source: Assigning permissions
ca: Assignació de permisos
ja: パーミッションの割り当て
ko: 권한 할당
zh_cn: 指派权限

source: If the permissions are not set correctly, you might receive an error like this when you run [command]``virtual-host-gatherer``:
ca: Si els permisos no estan establerts correctament, és possible que rebeu un error com aquest quan executeu [command]:virtual-host-gatherer::
ja: パーミッションが正しく設定されていない場合、[command]``virtual-host-gatherer``を実行すると次のようなエラーが発生する場合があります。
ko: 권한이 올바르게 설정되지 않으면 [command]``virtual-host-gatherer``를 실행할 때 다음과 같은 오류를 수신할 수 있습니다.
zh_cn: 如果未正确设置权限，您在运行 [command]``virtual-host-gatherer`` 时可能会收到如下所示的错误：

source: General error: [AuthorizationFailed] The client 'client_name' with object id 'object_ID' does not have authorization to perform action 'Microsoft.Compute/virtualMachines/read' over scope '/subscriptions/not-very-secret-subscription-id' or the scope is invalid. If access was recently granted, please refresh your credentials.
ca: Error general: [AuthorizationFailed] El client «clientname» amb l'identificador de l'objecte «objectID» no té autorització per realitzar l'acció «Microsoft».Calcula/virtualMachines/read sobre l'àmbit «/subscriptions/not-very-secret-subscription-id» o l'àmbit no és vàlid. Si l'accés s'ha concedit recentment, actualitzeu les credencials.
ja: General error:（一般エラー:）[AuthorizationFailed] The client 'client_name' with object id 'object_ID' does not have authorization to perform action 'Microsoft.Compute/virtualMachines/read' over scope '/subscriptions/not-very-secret-subscription-id' or the scope is invalid.（[AuthorizationFailed]オブジェクトID「object_ID」のクライアント「client_name」には、アクション「Microsoft.Compute/virtualMachines/read」をスコープ「/subscriptions/not-very-secret-subscription-id」を超えて実行する権限がありません。またはスコープが無効です。）If access was recently granted, please refresh your credentials.（アクセスが最近付与された場合は、資格情報を更新してください。）
ko: 일반 오류: [AuthorizationFailed] 객체 ID가 ‘object_ID’인 'client_name' 클라이언트에 '/subscriptions/not-very-secret-subscription-id' 범위에 걸쳐 ‘Microsoft.Compute/virtualMachines/read’ 작업을 수행할 권한이 없거나 이 범위가 잘못되었습니다. 액세스가 최근에 허용되었다면 인증서를 새로 고침하시기 바랍니다.
zh_cn: 一般错误：[AuthorizationFailed] 对象 ID 为 'object_ID' 的客户端 'client_name' 无权在 '/subscriptions/not-very-secret-subscription-id' 范围执行操作 'Microsoft.Compute/virtualMachines/read'，或该范围无效。如果访问权限是最近授予的，请刷新您的身份凭证。

source: To determine the correct credentials, run this command at the prompt on the {productname} Server:
ca: Per a determinar les credencials correctes, executeu aquesta ordre a l'indicador del servidor {productname}:
ja: 正しい資格情報を判断するには、{productname}サーバのプロンプトで次のコマンドを実行します。
ko: 인증서가 올바른지 확인하려면 다음과 같이 {productname} 서버의 프롬프트에서 다음 명령을 실행하십시오.
zh_cn: 要确定正确的身份凭证，请在 {productname} 服务器上的提示符处运行以下命令：

source: virtual-host-gatherer -i input_azure.json -o out_azure.json -vvv
ca: virtual-hosteler -i inputazure.json -o outazure.json -vvvv

source: The [path]``input_azure.json`` file should contain this information:
ca: El fitxer [path]:inputazure.json contain hauria de contenir aquesta informació:
ja: [path]``input_azure.json``ファイルには次の情報が含まれています。
ko: [path]``input_azure.json`` 파일은 다음과 같은 정보를 포함해야 합니다.
zh_cn: [path]``input_azure.json`` 文件应包含以下信息：

source: [ { "id": "azure_vhm", "module": "Azure", "subscription_id": "subscription-id", "application_id": "application-id", "tenant_id": "tenant-id", "secret_key": "secret-key", "zone": "zone" } ]
ca: [ { {{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{ "id": "azurevhm", "mòdul": "Azure", "subscripció": "subscripció-id", "applicationid": "application-id", "tenantid": "tenant-id", "secretkey": "secret-key", "zona": "zona" } ]

source: Instances running on the Azure public cloud report this UUID to the {productname} Server:
ca: Instàncies que s'executen al núvol públic d'Azure informen d'aquest UUID al servidor {productname}:
ja: Azureパブリッククラウドで実行されているインスタンスは、このUUIDを{productname}サーバに報告できます。
ko: Azure 공용 클라우드에서 실행되는 인스턴스는 다음과 같이 이 UUID를 {productname} 서버에 보고합니다.
zh_cn: 在 Azure 公有云上运行的实例会向 {productname} 服务器报告如下 UUID：

source: Virtualization with Other Third Party Providers
ca: Virtualització amb altres proveïdors de tercers
ja: その他のサードパーティプロバイダを使用した仮想化
ko: 다른 타사 공급자를 통한 가상화
zh_cn: 使用其他第三方提供者虚拟化

source: If you want to use a third-party virtualization provider other than Xen, KVM, or VMware, you can import a JSON configuration file to {productname}.
ca: Si voleu utilitzar un proveïdor de virtualització de tercers que no sigui Xen, KVM o VMware, podeu importar un fitxer de configuració JSON a {productname}.
ja: Xen、KVMまたはVMware以外のサードパーティ仮想化プロバイダを使用する場合、JSON設定ファイルを{productname}にインポートできます。
ko: Xen, KVM 또는 VMware가 아닌 타사 가상화 공급자를 사용하려면 JSON 구성 파일을 {productname}로 임포트하면 됩니다.
zh_cn: 如果您要使用 Xen、KVM 或 VMware 以外的第三方虚拟化提供者，可以将 JSON 配置文件导入到 {productname} 中。

source: Similarly, if you have a VMware installation that does not provide direct access to the API, a file-based VHM provides you with some basic management features.
ca: De la mateixa manera, si teniu una instal·lació VMWare que no proporciona accés directe a l'API, una VHM basada en fitxers us proporciona algunes característiques bàsiques de gestió.

source: This option is for importing files that have been created with the [command]``virtual-host-gatherer`` tool. It is not designed for manually created files.
ca: Aquesta opció és per a importar fitxers que s'han creat amb l'eina [command].virtual-host-gatherer.. No està dissenyat per a fitxers creats manualment.
ja: このオプションは、[command]``virtual-host-gatherer``ツールを使用して作成されたファイルをインポートするためのものです。 手動で作成したファイル用には設計されていません。
ko: 이 옵션은 [command]``virtual-host-gatherer`` 도구로 생성한 파일을 임포트하기 위한 것입니다. 이 옵션은 수동으로 생성한 파일을 위해 설계된 것은 아닙니다.
zh_cn: 此选项用于导入使用 [command]``virtual-host-gatherer`` 工具创建的文件， 不可用于导入手动创建的文件。

source: Procedure: Exporting and Importing a JSON File
ca: Procediment: Exportació i importació d'un fitxer JSON
ja: プロシージャ: JSONファイルのエクスポートとインポート
ko: 절차: JSON 파일 엑스포트 및 임포트
zh_cn: 过程：导出和导入 JSON 文件

source: Export the JSON configuration file by running [command]``virtual-host-gatherer`` on the VM network.
ca: Exporta el fitxer de configuració JSON executant [command].virtual-host-gatherer on a la xarxa VM.
ja: VMネットワークで[command]``virtual-host-gatherer``を実行してJSON設定ファイルをエクスポートします。
ko: VM 네트워크에서 [command]``virtual-host-gatherer``를 실행하여 JSON 구성 파일을 엑스포트합니다.
zh_cn: 在 VM 网络上运行 [command]``virtual-host-gatherer`` 以导出 JSON 配置文件。

source: Save the produced file to a location accessible by your {productname} Server.
ca: Deseu el fitxer produït a una ubicació accessible pel vostre servidor {productname}.
ja: 生成されたファイルを{productname}サーバからアクセスできる場所に保存します。
ko: 생성한 파일을 {productname} 서버가 액세스할 수 있는 위치에 저장합니다.
zh_cn: 将产生的文件保存到 {productname} 服务器可访问的位置。

source: Click btn:[Create] and select [guimenu]``File-based``.
ca: Feu clic a btn:[Crea] i seleccioneu [guimenu].Basat en fitxers..
ja: btn:[作成]をクリックし、［[guimenu]``ファイルベース``］を選択します。
ko: btn:[생성]을 클릭하고 [guimenu]``파일 기반``을 선택합니다.
zh_cn: 单击 btn:[创建]，然后选择[guimenu]``基于文件``。

source: In the [guimenu]``Add a file-based Virtual Host Manager`` section, use these parameters:
ca: A la secció [guimenu] theAfegeix un gestor d'amfitrions virtual basat en fitxers``, utilitzeu aquests paràmetres:
ja: ［[guimenu]``Add a file-based Virtual Host Manager``］（ファイルベースの仮想ホストマネージャの追加）セクションで、次のパラメータを使用します。
ko: [guimenu]``파일 기반 가상 호스트 관리자 추가`` 섹션에서 다음과 같은 파라미터를 사용합니다.
zh_cn: 在[guimenu]``添加基于文件的虚拟主机管理器``部分，使用以下参数：

source: In the [guimenu]``Url`` field, type the path to your exported JSON configuration file.
ca: Al camp [guimenu].Url., escriviu el camí al fitxer de configuració JSON exportat.
ja: ［[guimenu]``Url``］フィールドに、エクスポートするJSON設定フィルへのパスを入力します。
ko: [guimenu]``Url`` 필드에 엑스포트한 JSON 구성 파일의 경로를 입력합니다.
zh_cn: 在 [guimenu]``URL`` 字段中，键入导出的 JSON 配置文件的路径。

source: Example: Exported JSON configuration file:
ca: Exemple: Fitxer de configuració JSON exportat:
ja: 例: エクスポートするJSON設定ファイル
ko: 예: 엑스포트한 JSON 구성 파일:
zh_cn: 例如：导出的 JSON 配置文件：

source: { "examplevhost": { "10.11.12.13": { "cpuArch": "x86_64", "cpuDescription": "AMD Opteron(tm) Processor 4386", "cpuMhz": 3092.212727, "cpuVendor": "amd", "hostIdentifier": "'vim.HostSystem:host-182'", "name": "11.11.12.13", "os": "VMware ESXi", "osVersion": "5.5.0", "ramMb": 65512, "totalCpuCores": 16, "totalCpuSockets": 2, "totalCpuThreads": 16, "type": "vmware", "vms": { "vCenter": "564d6d90-459c-2256-8f39-3cb2bd24b7b0" } }, "10.11.12.14": { "cpuArch": "x86_64", "cpuDescription": "AMD Opteron(tm) Processor 4386", "cpuMhz": 3092.212639, "cpuVendor": "amd", "hostIdentifier": "'vim.HostSystem:host-183'", "name": "10.11.12.14", "os": "VMware ESXi", "osVersion": "5.5.0", "ramMb": 65512, "totalCpuCores": 16, "totalCpuSockets": 2, "totalCpuThreads": 16, "type": "vmware", "vms": { "49737e0a-c9e6-4ceb-aef8-6a9452f67cb5": "4230c60f-3f98-2a65-f7c3-600b26b79c22", "5a2e4e63-a957-426b-bfa8-4169302e4fdb": "42307b15-1618-0595-01f2-427ffcddd88e", "NSX-gateway": "4230d43e-aafe-38ba-5a9e-3cb67c03a16a", "NSX-l3gateway": "4230b00f-0b21-0e9d-dfde-6c7b06909d5f", "NSX-service": "4230e924-b714-198b-348b-25de01482fd9" } } } }
ca: { {{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{ "examplevhost": { "10.11.12.13": { "cpuArch": "x8664", "cpuDescription": "AMD Opteron(tm) Processor 4386", "cpuMhz": 3092.212727, "cpuVendor": "amd", "hostIdentifier": "'vim.HostSystem:host-182'", "nom": "11.11.12.13", "os": "VMware ESXi", "osVersion": "5.5.0", "ramMb": 65512, «totalCpuCores»: 16, "totalCpuSockets": 2, "totalCpuThreads": 16, "type": "vmware", "vms": { "vCenter": "564d6d90-459c-2256-8f39-3cb2bd24b7b0" } }, "10.11.12.14": { "cpuArch": "x8664", "cpuDescription": "AMD Opteron(tm) Processor 4386", "cpuMhz": 3092.212639, "cpuVendor": "amd", "hostIdentifier": "'vim.HostSystem:host-183'", "nom": "10.11.12.14", "os": "VMware ESXi", "osVersion": "5.5.0", "ramMb": 65512, «totalCpuCores»: 16, "totalCpuSockets": 2, "totalCpuThreads": 16, "type": "vmware", "vms": { "49737e0a-c9e6-4ceb-aef8-6a9452f67cb5": "4230c60f-3f98-2a65-f7c3-600b26b79c22", "5a2e4e63-a957-426b-bfa8-4169302e4fdb": "42307b15-1618-0595-01f2-427ffcddd88e", "NSX-gateway": "4230d43e-aafe-38ba-5a9e-3cb67c03a16a", "NSX-l3gateway": "4230b00f-0b21-0e9d-dfde-6c7b06909d5f", "NSX-service": "4230e924-b714-198b-348b-25de01482fd9" } } } }
zh_cn: { "examplevhost": { "10.11.12.13": { "cpuArch": "x86_64", "cpuDescription": "AMD Opteron(tm) 处理器 4386", "cpuMhz": 3092.212727, "cpuVendor": "amd", "hostIdentifier": "'vim.HostSystem:host-182'", "name": "11.11.12.13", "os": "VMware ESXi", "osVersion": "5.5.0", "ramMb": 65512, "totalCpuCores": 16, "totalCpuSockets": 2, "totalCpuThreads": 16, "type": "vmware", "vms": { "vCenter": "564d6d90-459c-2256-8f39-3cb2bd24b7b0" } }, "10.11.12.14": { "cpuArch": "x86_64", "cpuDescription": "AMD Opteron(tm) 处理器 4386", "cpuMhz": 3092.212639, "cpuVendor": "amd", "hostIdentifier": "'vim.HostSystem:host-183'", "name": "10.11.12.14", "os": "VMware ESXi", "osVersion": "5.5.0", "ramMb": 65512, "totalCpuCores": 16, "totalCpuSockets": 2, "totalCpuThreads": 16, "type": "vmware", "vms": { "49737e0a-c9e6-4ceb-aef8-6a9452f67cb5": "4230c60f-3f98-2a65-f7c3-600b26b79c22", "5a2e4e63-a957-426b-bfa8-4169302e4fdb": "42307b15-1618-0595-01f2-427ffcddd88e", "NSX-gateway": "4230d43e-aafe-38ba-5a9e-3cb67c03a16a", "NSX-l3gateway": "4230b00f-0b21-0e9d-dfde-6c7b06909d5f", "NSX-service": "4230e924-b714-198b-348b-25de01482fd9" } } } }

source: For more information, see the man page on your {productname} server for [command]``virtual-host-gatherer``:
ca: Per a més informació, vegeu la pàgina del manual al vostre servidor {productname} per a [command]:virtual-host-gatherer::
ja: 詳細については、{productname}サーバの[command]``virtual-host-gatherer``の関数リファレンスを参照してください。
ko: 자세한 내용은 {productname} 서버의 사용자 지정 페이지에서 [command]``virtual-host-gatherer``를 검색하십시오.
zh_cn: 有关详细信息，请参见 {productname} 服务器上 [command]``virtual-host-gatherer`` 的手册页：

source: man virtual-host-gatherer
ca: home virtual-amfitrió-recol·lector

source: The `README` file of that package provides background information about the `type` of a hypervisor, etc.:
ca: El fitxer README d'aquest paquet proporciona informació de fons sobre el tipus d'un hipervisor, etc.:
ja: このパッケージの `README` ファイルには、ハイパーバイザの「種類」などに関する背景情報が記載されています。
ko: 이 패키지의 `README` 파일은 하이퍼바이버의 ‘유형’ 등에 대한 배경 정보를 제공합니다.
zh_cn: 该软件包的 `README` 文件提供有关超级管理程序``类型``的背景信息及其他信息：

source: The man page and the `README` file also contain example configuration files.
ca: La pàgina del manual i el fitxer .README. també contenen fitxers de configuració d'exemple.
ja: この関数リファレンスおよび `README` ファイルには、設定ファイルのサンプルも含まれています。
ko: 사용자 지정 페이지 및 ‘README’ 파일에는 예시 구성 파일도 포함되어 있습니다.
zh_cn: 手册页和 `README` 文件还包含示例配置文件。

source: Virtual Host Manager and Google Compute Engine
ca: Podeu utilitzar un gestor d'amfitrió virtual (VHM) per recollir instàncies de Google Compute Engine (GCE).

source: You can use a virtual host manager (VHM) to gather instances from Google Compute Engine (GCE).
ca: Podeu utilitzar un gestor d'amfitrió virtual (VHM) per recollir instàncies de Google Compute Engine (GCE).
ja: 仮想ホストマネージャ(VHM)を使用して、Google Compute Engine (GCE)からインスタンスを収集できます。
ko: 가상 호스트 관리자(VHM)을 사용하여 Google Compute Engine(GCE)에서 인스턴스를 수집할 수 있습니다.
zh_cn: 您可以使用虚拟主机管理器 (VHM) 收集 Google Compute Engine (GCE) 中的实例。

source: The VHM you create needs to have the correct permissions assigned to access the GCE VM.
ca: La VHM que creeu ha de tenir els permisos correctes assignats per accedir a la VM GCE.
ja: 作成したVHMは、GCE VMにアクセスするために、正しいパーミッションが割り当てられている必要があります。
ko: 사용자가 생성하는 VHM은 GCE VM에 액세스하려면 올바른 권한이 할당되어 있어야 합니다.
zh_cn: 要让您创建的 VHM 可以访问 GCE VM，需要为其指派正确的权限。

source: Log in to your Google Cloud Platform account as an administrator, and use the Cloud Identity and Access Management (IAM) tool to ensure that the service account has the appropriate roles.
ca: Inicieu sessió al vostre compte de Google Cloud Platform com a administrador, i utilitzeu l'eina Cloud Identity and Access Management (IAM) per assegurar que el compte de servei té els rols adequats.
ja: Googleクラウドプラットフォームのアカウントに管理者としてログインし、クラウドのIDおよびアクセス管理(IAM)ツールを使用して、サービスアカウントに適切なロールがあることを確認してください。
ko: Google 클라우드 플랫폼 계정에 관리자로 로그인하여 Cloud Identity and Access Management(IAM) 도구를 사용해 서비스 계정에 적절한 역할이 있는지 확인합니다.
zh_cn: 以管理员身份登录您的 Google Cloud Platform 帐户，并使用 Cloud Identity and Access Management (IAM) 工具确保服务帐户拥有适当的角色。

source: Create a GCE VHM
ca: Crea una VHM GCE
ja: GCE VHMの作成
ko: GCE VHM 생성
zh_cn: 创建 GCE VHM

source: To run a VHM, your {productname} Server needs to have port 443 open, to access the clients.
ca: Per a executar una VHM, el vostre servidor {productname} ha de tenir el port 443 obert, per a accedir als clients.
ja: VHMを実行するには、{productname}サーバでポート443がオープンになっていて、クライアントにアクセスする必要があります。
ko: VHM을 실행하려면 {productname} 서버가 포트 443을 열어 클라이언트에 액세스해야 합니다.
zh_cn: 要运行 VHM，需要打开端口 443 以使您的 {productname} 服务器可访问客户端。

source: Before you begin, log in to the GCE panel, and download a certificate file. Store this file locally on your {productname} Server, and take note of the path.
ca: Abans de començar, inicieu sessió al panell GCE i baixeu un fitxer de certificat. Emmagatzema aquest fitxer localment al vostre servidor {productname} i pren nota del camí.
ja: 開始する前に、GCEパネルにログインし、証明書ファイルをダウンロードします。 このファイルを{productname}サーバにローカルに格納し、パスをメモします。
ko: 시작하기 전에 GCE 패널에 로그인하여 인증서 파일을 다운로드합니다. 이 파일을 {productname} 서버에 로컬로 저장하고 경로를 적어 둡니다.
zh_cn: 开始前，请登录 GCE 面板并下载证书文件。将此文件存储在 {productname} 服务器本地，并记下路径。

source: Procedure: Creating a GCE VHM
ca: Procediment: Creació d'un GCE VHM
ja: プロシージャ: GCE VHMの作成
ko: 절차: GCE VHM 생성
zh_cn: 过程：创建 GCE VHM

source: Click btn:[Create] and select [guimenu]``Google Compute Engine`` from the drop-down menu.
ca: Feu clic a btn:[Crea] i seleccioneu [guimenu].Google Compute Engine from des del menú desplegable.
ja: btn:[作成]をクリックし、ドロップダウンメニューから［[guimenu]``Google Compute Engine``］を選択します。
ko: btn:[생성]을 클릭하고 드롭다운 메뉴에서 [guimenu]``Google Compute Engine``을 선택합니다.
zh_cn: 单击 btn:[创建] 并从下拉菜单中选择 [guimenu]``Google Compute Engine``。

source: In the [guimenu]``Add a Google Conpute Engine Virtual Host Manager`` section, use these parameters:
ca: A la secció [guimenu] theAfegeix un gestor d'amfitrions virtual de Google Conpute Engine:, utilitzeu aquests paràmetres:
ja: ［[guimenu]``Add a Google Compute Engine Virtual Host Manager``］（Google Compute Engineの仮想ホストマネージャの追加）セクションで、次のパラメータを使用します。
ko: [guimenu]``Google Compute Engine 가상 호스트 관리자 추가`` 섹션에서 다음과 같은 파라미터를 사용합니다.
zh_cn: 在[guimenu]``添加 Google Compute Engine 虚拟主机管理器``部分，使用以下参数：

source: In the [guimenu]``Service Account Email`` field, type the email address associated with your service account.
ca: Al camp [guimenu].Correu electrònic del compte de servei., escriviu l'adreça de correu electrònic associada al vostre compte de servei.
ja: ［[guimenu]``Service Account Email``］（サービスアカウントメール）フィールドに、サービスアカウントに関連付けられているメールアドレスを入力します。
ko: [guimenu]``서비스 계정 전자 메일`` 필드에 서비스 계정에 연결된 이메일 주소를 입력합니다.
zh_cn: 在[guimenu]``服务帐户电子邮件``字段中，键入与您的服务帐户关联的电子邮件地址。

source: In the [guimenu]``Cert Path`` field, type the local path on the {productname} Server to the key that you downloaded from the GCE panel.
ca: Al camp [guimenu].Cert Path., escriviu el camí local al servidor {productname} a la clau que heu baixat del plafó GCE.
ja: ［[guimenu]``Cert Path``］（証明書のパス）フィールドに、GCEパネルからダウンロードしたキーへの{productname}サーバのローカルパスを入力します。
ko: [guimenu]``인증서 경로`` 필드에 {productname} 서버의 로컬 경로를 GCE 패널에서 다운로드한 키에 입력합니다.
zh_cn: 在[guimenu]``证书路径``字段中，键入 {productname} 服务器上用于存储您从 GCE 面板下载的密钥的本地路径。
