Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: For information on how to add the key to installation media used for a boot from CD-ROM, see xref:client-configuration:autoinst-owngpgkey.adoc#gpg-key-cdrom[Own GPG Key in a CD-ROM].
ja: CD-ROMからのブートに使用するインストールメディアにキーを追加する方法については、xref:client-configuration:autoinst-owngpgkey.adoc#gpg-key-cdrom[CD-ROM内の独自のGPGキー]を参照してください。
ko: CD-ROM에서 부팅하기 위해 사용되는 설치 미디어에 키를 추가하는 방법은 xref:client-configuration:autoinst-owngpgkey.adoc#gpg-key- cdrom[CD-ROM에서 자체 GPG 키]를 참조하십시오.
zh_cn: 有关如何将密钥添加到用于从 CD-ROM 引导的安装媒体的信息，请参见 xref:client-configuration:autoinst-owngpgkey.adoc#gpg-key- cdrom[CD-ROM 中的自己的 GPG 密钥]。

source: Own GPG Key for PXE Boot
ja: PXEブート用の独自のGPGキー
ko: PXE 부팅을 위한 자체 GPG 키
zh_cn: 用于 PXE 引导的自己的 GPG 密钥

source: The initial RAM disk ([path]``initrd``) used by PXE boot process normally contains {suse}'s GPG key only. You must add our own key to this file, so it can be used to check the packages.
ja: PXEブートプロセスで使用される初期RAMディスク([path]``initrd``)には、通常{suse}のGPGキーのみが格納されています。 パッケージをチェックするために使用できるように、このファイルに独自のキーを追加する必要があります。
ko: PXE 부팅 프로세스에서 사용되는 초기 RAM 디스크([path]``initrd``)에는 일반적으로 {suse}의 GPG 키만 포함됩니다. 이 파일에 자체 키를 추가해야 하며, 이 키는 패키지를 확인하는 데 사용됩니다.
zh_cn: PXE 引导过程使用的初始 RAM 磁盘 ([path]``initrd``) 通常只包含 {suse} 的 GPG 密钥。您必须将自己的密钥添加到此文件中，这样就能使用它来检查软件包。

source: Procedure: Add a GPG key to the initial RAM disk
ja: 手順: 初期RAMディスクにGPGキーを追加する
ko: 절차: 초기 RAM 디스크에 GPG 키 추가
zh_cn: 过程：将 GPG 密钥添加到初始 RAM 磁盘中

source: Create a directory with a path identical to the one that is used during the boot process to find the GPG key:
ja: GPGキーを見つけるためにブートプロセス中に使用されるものと同じパスにディレクトリを作成します。
ko: GPG 키를 찾기 위해 부팅 프로세스 중 사용된 동일한 경로로 디렉토리를 생성합니다.
zh_cn: 创建一个目录，其路径与引导过程中用来查找 GPG 密钥的路径相同：

source: Copy your GPG key into this directory with the suffix [path]``.asc``:
ja: [path]``.asc``サフィックスを付けてこのディレクトリにGPGキーをコピーします。
ko: 접미사 [path]``.asc``를 추가하여 이 디렉토리에 GPG 키를 복사합니다.
zh_cn: 将您的 GPG 密钥复制到此目录中，并加上 [path]``.asc`` 后缀：

source: Inside the top level directory, package the content and append it to the [path]``initrd`` that is part of your installation media files:
ja: 最上位のディレクトリ内で、コンテンツをパッケージ化し、インストールメディアファイルの一部である[path]``initrd``に追加します。
ko: 최상위 디렉토리 내에서 컨텐트를 패키지화하고 설치 미디어 파일의 일부인 [path]``initrd``에 추가합니다.
zh_cn: 在顶层目录中，将内容打包并附加到属于安装媒体文件一部分的 [path]``initrd`` 中：

source: You can modify an installation image with the [command]``mksusecd`` utility. This utility is contained in the Development Tools module.
ja: [command]``mksusecd``ユーティリティでインストールイメージを修正できます。 このユーティリティは、Development Toolsモジュールに含まれています。
ko: [command]``mksusecd`` 유틸리티를 사용하여 설치 이미지를 수정할 수 있습니다. 이 유틸리티는 Development Tools 모듈에 포함되어 있습니다.
zh_cn: 您可以使用 [command]``mksusecd`` 实用程序修改安装映像。此实用程序包含在开发工具模块中。

source: Procedure: Add a GPG key to an Installation ISO image
ja: 手順: インストールISOイメージにGPGキーを追加する
ko: 절차: 설치 ISO 이미지에 GPG 키 추가
zh_cn: 过程：将 GPG 密钥添加到安装 ISO 映像中

source: Amend the existing ISO image with [command]``mksusecd``:
ja: [command]``mksusecd``で既存のISOイメージを修正します。
ko: [command]``mksusecd``를 사용하여 기존 ISO 이미지를 추가합니다.
zh_cn: 使用 [command]``mksusecd`` 修改现有的 ISO 映像：

source: The most important part of the profile is the "autoinstallation file." When you perform an installation manually, you must provide information to the installer, such as partitioning and networking information and user details. The autoinstallation file is a method of providing this information in a scripted form. This type of file is sometimes also referred to as an "answers file."
ja: プロファイルの最も重要な部分は、「自動インストールファイル」です。 インストールを手動で実行する場合、パーティション設定、ネットワーク情報、ユーザの詳細などの情報をインストーラに提供する必要があります。 自動インストールファイルは、スクリプト形式でこの情報を提供する方法です。 このタイプのファイルは、「回答ファイル」と呼ばれることもあります。
ko: 프로파일에서 가장 중요한 부분은 "자동 설치 파일"입니다. 수동으로 설치하는 경우 파티셔닝 및 네트워크 정보, 사용자 상세 정보와 같은 정보를 설치 프로그램에 제공해야 합니다. 자동 설치 파일은 이러한 정보를 스크립트된 형식으로 제공하는 방법입니다. 이러한 유형의 파일을 종종 "답변 파일"이라고도 합니다.
zh_cn: 配置文件最重要的部分是“自动安装文件”。手动执行安装时，必须向安装程序提供相关信息，例如分区和网络信息以及用户细节。您可以使用自动安装文件以脚本形式提供此类信息。这种类型的文件有时也称为“答案文件”。

source: For more information about {ay}, see https://doc.opensuse.org/projects/autoyast/.
ja: {ay}の詳細については、link:https://doc.opensuse.org/projects/autoyast/[]を参照してください。
ko: {ay}에 대한 자세한 내용은 https://doc.opensuse.org/projects/autoyast/[]를 참조하십시오.
zh_cn: 有关 {ay} 的详细信息，请参见 https://doc.opensuse.org/projects/autoyast/[]。

source: Variables
ja: 変数
ko: 변수
zh_cn: 变量

source: Bootstrap Repository
ja: ブートストラップリポジトリ
ko: 부트스트랩 리포지토리
zh_cn: 引导储存库

source: Prepare to Create a Bootstrap Repository
ja: ブートストラップリポジトリの作成準備
ko: 부트스트랩 리포지토리 생성 준비
zh_cn: 准备创建引导储存库

source: Options for Automatic Mode
ja: 自動モードのオプション
ko: 자동 모드를 위한 옵션
zh_cn: 自动模式的选项

source: Flush Mode::
ja: フラッシュモード::
ko: 플러시 모드::
zh_cn: 刷新模式：

source: Flush Mode
ja: フラッシュモード
ko: 플러시 모드
zh_cn: 刷新模式

source: Automatic Mode::
ja: 自動モード::
ko: 자동 모드::
zh_cn: 自动模式：

source: Automatic Mode
ja: 自動モード
ko: 자동 모드
zh_cn: 自动模式

source: Configure Bootstrap Data File
ja: ブートストラップデータファイルの設定
ko: 부트스트랩 데이터 파일 구성
zh_cn: 配置引导数据文件

source: The tool uses a data file with information about which packages are required for each distribution. The data file is stored at [path]``/usr/share/susemanager/mgr_bootstrap_data.py``. {suse} updates this file regularly. If you want to makes changes to this file, do not edit it directly. Instead, create a copy in the same directory and edit your copy:
ja: このツールは、各ディストリビューションに必要なパッケージに関する情報を含むデータファイルを使用します。 データファイルは[path]``/usr/share/susemanager/mgr_bootstrap_data.py``に保存されています。 {suse}はこのファイルを定期的に更新します。 このファイルを変更する場合、直接編集しないでください。 代わりに、同じディレクトリにコピーを作成し、コピーを編集します。
ko: 도구는 각 배포에 어떤 패키지가 필요한지에 대한 정보가 포함된 데이터 파일을 사용합니다. 이 데이터 파일은 [path]``/usr/share/susemanager/mgr_bootstrap_data.py``에 저장되어 있습니다. {suse}는 이 파일을 정기적으로 업데이트합니다. 이 파일을 변경하고 싶은 경우 직접 편집하지 마십시오. 대신, 다음과 같이 동일한 디렉토리에 사본을 생성하고 이 사본을 편집합니다.
zh_cn: 该工具使用包含有关每个发行套件所需软件包的信息的数据文件。该数据文件存储在 [path]``/usr/share/ susemanager/mgr_bootstrap_data.py``。{suse} 会定期更新此文件。如果您要更改此文件，请不要直接编辑， 而是应在同一目录中创建一份副本，然后编辑该副本：

source: Manually Generate a Bootstrap Repository
ja: ブートストラップリポジトリの手動生成
ko: 부트스트랩 리포지토리를 수동으로 생성
zh_cn: 手动生成引导储存库

source: Procedure: Generating the Bootstrap Repository for {sle}
ja: プロシージャ: {sle}のブートストラップリポジトリの生成
ko: 절차: {sle}용 부트스트랩 리포지토리 생성
zh_cn: 过程：生成 {sle} 的引导储存库

source: OPTIONAL Procedure: Specifying a Parent Channel for a Bootstrap Repository
ja: オプションのプロシージャ: ブートストラップリポジトリの親チャンネルの指定
ko: 선택 사항 절차: 부트스트랩 리포지토리에 상위 채널 지정
zh_cn: 可选过程：指定引导储存库的父通道

source: Repositories with Multiple Architectures
ja: 複数アーキテクチャを含むリポジトリ
ko: 아키텍처가 여러 개인 리포지토리
zh_cn: 包含多个体系结构的储存库

source: Bootstrap and Custom Channels
ja: ブートストラップとカスタムチャンネル
ko: 부트스트랩 및 사용자 지정 채널
zh_cn: 引导和自定义通道

source: Client Configuration Guide Overview
ja: クライアント設定ガイドの概要
ko: 클라이언트 구성 안내서 개요
zh_cn: 客户端配置指南概述

source: **Updated:** {docdate}
ja: **更新:** {docdate}
ko: **업데이트 날짜:** {docdate}
zh_cn: **更新日期：**{docdate}

source: Registering clients is the first step after installing {productname}, and most of the time you spend with {productname} is spent on maintaining those clients.
ja: クライアントの登録は、{productname}インストール後の最初の手順であり、{productname}で費やす時間のほとんどは、これらのクライアントを管理する時間です。
ko: {productname} 설치 후 수행하는 첫 단계는 클라이언트를 등록하는 일입니다. {productname}에서 등록 클라이언트를 관리하는 작업에 대부분의 시간을 소요합니다.
zh_cn: 安装 {productname} 后首先要做的就是注册客户端，您花在 {productname} 上的大部分时间都是用来维护这些客户端。

source: For a complete list of supported clients and features, see xref:client-configuration:supported-features.adoc[].
ja: サポートされているクライアントおよび機能の一覧については、xref:client-configuration:supported-features.adoc[]を参照してください。
ko: 지원되는 클라이언트 및 기능의 전체 목록은 xref:client-configuration:supported-features.adoc[]를 참조하십시오.
zh_cn: 有关支持的客户端和功能的完整列表，请参见 xref:client-configuration:supported-features.adoc[]。

source: This guide discusses how to register and configure different clients, both manually and automatically.
ja: このガイドでは、異なるクライアントを登録して設定する方法に関して手動の方法と自動の方法の両方について説明します。
ko: 이 안내서에서는 다양한 클라이언트를 수동 및 자동으로 등록하고 구성하는 방법에 대해 설명합니다.
zh_cn: 本指南介绍了如何注册以及配置不同的客户端，包括手动和自动两种方式。

source: Register Clients to a Proxy with the {webui}
ja: {webui}を使用してクライアントをプロキシに登録する
ko: {webui}로 클라이언트를 프록시에 등록
zh_cn: 使用 {webui} 将客户端注册到代理

source: Product migration allows you to upgrade SLE-based client systems from an Service Pack (SP) level to a later one. For example, you can migrate {sles}{nbsp}15{nbsp}SP1 to {sles}{nbsp}15{nbsp}SP2.
ja: 製品を移行すると、SLEベースのクライアントシステムをサービスパック(SP)レベルから最新版にアップグレードできます。 たとえば、{sles}{nbsp}15{nbsp}SP1を{sles}{nbsp}15{nbsp}SP2に移行できます。
ko: 제품 마이그레이션을 통해 SLE 기반 클라이언트 시스템을 서비스 팩(SP) 수준에서 이후 수준으로 업그레이드할 수 있습니다. 예를 들어, {sles}{nbsp}15{nbsp}SP1을 {sles}{nbsp}15{nbsp}SP2로 마이그레이트할 수 있습니다.
zh_cn: 通过产品迁移，您可以将基于 SLE 的客户端系统从服务包 (SP) 级别升级到更高级别。例如，您可以将 {sles}{nbsp}15{nbsp}SP1 升级到 {sles}{nbsp}15{nbsp}SP2。

source: You can also migrate openSUSE Leap to a later minor version or to the corresponding {sles} SP level, for example:
ja: openSUSE Leapを新しいマイナーバージョンまたは対応する{sles} SPレベルに移行することもできます。次に例を示します。
ko: 또한 openSUSE Leap을 이후 부 버전으로 또는 해당 {sles} SP 수준으로 마이그레이트할 수 있습니다. 예는 다음과 같습니다.
zh_cn: 您还可以将 openSUSE Leap 迁移到更高的次要版本或对应的 {sles} SP 级别，例如：

source: openSUSE Leap 15.5 to {sles} 15 SP5
ja: openSUSE Leap 15.5から{sles} 15 SP5
ko: openSUSE Leap 15.5에서 {sles} 15 SP5로
zh_cn: 将 openSUSE Leap 15.5 迁移到 {sles} 15 SP5

source: In {sles}{nbsp}12 and later, {suse} supports service pack skipping if {scc} provides it. For example, you can upgrade from {sles}{nbsp}15 to SP2, without installing SP1.
ja: {sles}{nbsp}12以降では、{scc}がサービスパックを提供している場合、{suse}はサービスパックのスキップをサポートしています。 たとえば、{sles}{nbsp}15からSP2にアップグレードできます。SP1はインストールされません。
ko: {scc}가 제공하는 경우 {suse}는 {sles}{nbsp}12 이상 버전에서 서비스 팩 건너뛰기를 지원합니다. 예를 들어, SP1을 설치하지 않아도 {sles}{nbsp}15에서 SP2로 업그레이드할 수 있습니다.
zh_cn: 在 {sles} 12 及更高版本中，{suse} 支持跳过服务包（如果 {scc} 提供该服务包）。例如，您可以从 {sles} 15 升级到 SP2，而无需安装 SP1。

source: <SYSTEM>
ko: <시스템>

source: Fully synchronize all channels with [command]``spacewalk-repo-sync``. In case of already defined repository URLs, continue with xref:installation-and-upgrade:proxy-uyuni.adoc#uyuni-202007-channeldupes[].
ja: [command]``spacewalk-repo-sync``を使用して、すべてのチャンネルを完全に同期します。 リポジトリのURLが定義済みの場合、xref:installation-and-upgrade:proxy-uyuni.adoc#uyuni-202007-channeldupes[]で続行します。
ko: [command]``spacewalk-repo-sync``로 모든 채널을 완전히 동기화합니다. 이미 정의된 리포지토리 URL인 경우 xref:installation-and-upgrade:proxy-uyuni.adoc#uyuni-202007-channeldupes[]로 계속합니다.
zh_cn: 使用 [command]``spacewalk-repo-sync`` 完全同步所有通道。对于已定义的储存库 URL，继续 xref:installation-and-upgrade:proxy-uyuni.adoc#uyuni-202007-channeldupes[]。

source: {alibabaclo} repository URLs are available from {scc}
ko: {alibabaclo} 리포지토리 URL은 {scc}에서 사용할 수 있습니다.
zh_cn: {alibabaclo} 储存库 URL 可从 {scc} 获取

source: {almalinux} repository URLs are available from {scc}
ko: {almalinux} 리포지토리 URL은 {scc}에서 사용할 수 있습니다.
zh_cn: {almalinux} 储存库 URL 可从 {scc} 获取

source: Packages and metadata are provided by AlmaLinux OS Foundation, not by {suse}
ja: パッケージおよびメタデータは{suse}ではなくAlmaLinux OS Foundationから提供されます。
ko: 패키지 및 메타데이터는 {suse}가 아닌 AlmaLinux OS Foundation이 제공합니다.
zh_cn: 软件包和元数据由 AlmaLinux OS Foundation 而不是 {suse} 提供

source: {amazon} repository URLs are available from {scc}
ko: {amazon} 리포지토리 URL은 {scc}에서 사용할 수 있습니다.
zh_cn: {amazon} 储存库 URL 可从 {scc} 获取

source: Packages and metadata are provided by Amazon, not by {suse}
ja: パッケージおよびメタデータは{suse}ではなくAmazonから提供されます。
ko: 패키지 및 메타데이터는 {suse}가 아닌 Amazon이 제공합니다.
zh_cn: 软件包和元数据由 Amazon 而不是 {suse} 提供

source: | OS Version | Base Channel | {amazon} 2 | amazonlinux2-core-x86_64
ko: | OS 버전 | 기본 채널 | {amazon} 2 | amazonlinux2-core-x86_64
zh_cn: | 操作系统版本 | 基础通道 | {amazon} 2 | amazonlinux2-core-x86_64

source: {centos} repository URLs are available from {scc}
ko: {centos} 리포지토리 URL은 {scc}에서 사용할 수 있습니다.
zh_cn: {centos} 储存库 URL 可从 {scc} 获取

source: Packages and metadata are provided by CentOS, not by {suse}
ja: パッケージおよびメタデータは{suse}ではなくCentOSから提供されます。
ko: 패키지 및 메타데이터는 {suse}가 아닌 CentOS에서 제공합니다.
zh_cn: 软件包和元数据由 CentOS 而不是 {suse} 提供

source: {debian} repository URLs are available from {scc}
ko: {debian} 리포지토리 URL은 {scc}에서 사용할 수 있습니다.
zh_cn: {debian} 储存库 URL 可从 {scc} 获取

source: Packages and metadata are provided by Debian, not by {suse}
ja: パッケージおよびメタデータは{suse}ではなくDebianから提供されます。
ko: 패키지 및 메타데이터는 {suse}가 아닌 Debian이 제공합니다.
zh_cn: 软件包和元数据由 Debian 而不是 {suse} 提供

source: Registering {opensuse} Leap Clients
ja: {opensuse} Leapクライアントの登録
ko: {opensuse} Leap 클라이언트 등록
zh_cn: 注册 {opensuse} Leap 客户端

source: | OS Version | Base Channel | {opensuse} Leap 15.6 | opensuse-leap-15.6-pool | {opensuse} Leap 15.5 | opensuse-leap-15.5-pool | {opensuse} Leap 15.4 | opensuse-leap-15.4-pool
ja: | OSバージョン | ベースチャンネル | {opensuse} Leap 15.6 | opensuse-leap-15.6-pool | {opensuse} Leap 15.5 | opensuse-leap-15.5-pool | {opensuse} Leap 15.4 | opensuse-leap-15.4-pool
ko: | OS 버전| 기본 채널 | {opensuse} Leap 15.6 | opensuse-leap-15.6-pool | {opensuse} Leap 15.5 | opensuse-leap-15.5-pool | {opensuse} Leap 15.4 | opensuse-leap-15.4-pool
zh_cn: | 操作系统版本 | 基础通道 | {opensuse} Leap 15.6| opensuse-leap-15.6-pool | {opensuse} Leap 15.5 | opensuse-leap-15.5-pool | {opensuse} Leap 15.4 | opensuse-leap-15.4-pool

source: {oracle} repository URLs are available from {scc}
ko: {oracle} 리포지토리 URL은 {scc}에서 사용할 수 있습니다.
zh_cn: {oracle} 储存库 URL 可从 {scc} 获取

source: Packages and metadata are provided by Oracle, not by {suse}
ja: パッケージおよびメタデータは{suse}ではなくOracleから提供されます。
ko: 패키지 및 메타데이터는 {suse}가 아닌 Oracle에서 제공합니다.
zh_cn: 软件包和元数据由 Oracle 而不是 {suse} 提供

source: {oracle} base media repositories are freely available for download from https://yum.oracle.com/
ja: {oracle}ベースメディアリポジトリはlink:https://yum.oracle.com/[]から無料でダウンロードできます。
ko: {oracle} 기본 미디어 리포지토리는 https://yum.oracle.com/[]에서 무료로 다운로드할 수 있습니다.
zh_cn: {oracle} 基础媒体储存库可从 https://yum.oracle.com/ 免费下载

source: For {redhat} 8 clients, add both the Base and AppStream channels. You require packages from both channels. If you do not add both channels, you cannot create the bootstrap repository, due to missing packages.
ja: {redhat} 8クライアントでは、ベースチャンネルとAppStreamチャンネルの両方を追加します。 両方のチャンネルのパッケージが必要です。 両方のチャンネルを追加しないと、パッケージ不足のためブートストラップリポジトリを作成できません。
ko: {redhat} 8 클라이언트의 경우 기본 채널과 AppStream 채널을 모두 추가하십시오. 사용자에게는 두 채널의 패키지가 모두 필요합니다. 두 채널을 모두 추가하지 않으면 패키지가 누락되어 부트스트랩 리포지토리를 생성할 수 없습니다.
zh_cn: 对于 {redhat} 8 客户端，请添加基础通道和 AppStream 通道。您需要来自这两个通道的软件包。如果未添加这两个通道，将会因缺少软件包而无法创建引导储存库。

source: The PAYG connection regular checks with the client to get the latest authentication data. It is important that the client stays running and is regular updated. If this does not happen, repository synchronization will fail with authentication errors at some point in time.
ja: PAYG接続は、最新の認証データを取得するために、定期的にクライアントをチェックします。 クライアントが実行され続け、定期的に更新されることが重要です。 これが行われない場合、リポジトリの同期はある時点で認証エラーにより失敗します。
ko: PAYG 연결은 클라이언트를 정기적으로 확인하여 최신 인증 데이터를 가져옵니다. 클라이언트가 계속 실행 중이고 정기적으로 업데이트하는 것이 중요합니다. 그러지 않으면 특정 시점에 인증 오류가 발생하며 리포지토리 동기화가 실패합니다.
zh_cn: PAYG 连接会定期与客户端通讯以获取最新的身份验证数据。请务必将客户端保持运行状态并定期更新。如果不这样，储存库同步有时将会失败，并显示身份验证错误。

source: {rocky} repository URLs are available from {scc}
ko: {rocky} 리포지토리 URL은 {scc}에서 사용할 수 있습니다.
zh_cn: {rocky} 储存库 URL 可从 {scc} 获取

source: Packages and metadata are provided by Rocky Enterprise Software Foundation, not by {suse}
ja: パッケージおよびメタデータは{suse}ではなくRocky Enterprise Software Foundationから提供されます。
ko: 패키지 및 메타데이터는 {suse}가 아닌 Rocky Enterprise Software Foundation에서 제공합니다.
zh_cn: 软件包和元数据由 Rocky Enterprise Software Foundation 而不是 {suse} 提供

source: For {rocky}{nbsp}8 and {rocky}{nbsp}9 clients, add both the Base and AppStream channels. You require packages from both channels. If you do not add both channels, you cannot create the bootstrap repository, due to missing packages.
ja: {rocky}{nbsp}8および{rocky}{nbsp}9クライアントでは、ベースチャンネルとAppStreamチャンネルの両方を追加します。 両方のチャンネルのパッケージが必要です。 両方のチャンネルを追加しないと、パッケージ不足のためブートストラップリポジトリを作成できません。
ko: {rocky}{nbsp}8 및 {rocky}{nbsp}9 클라이언트의 경우 기본 채널과 AppStream 채널을 모두 추가하십시오. 사용자에게는 두 채널의 패키지가 모두 필요합니다. 두 채널을 모두 추가하지 않으면 패키지가 누락되어 부트스트랩 리포지토리를 생성할 수 없습니다.
zh_cn: 对于 {rocky}{nbsp}8 和 {rocky}{nbsp}9 客户端，请添加基础通道和 AppStream 通道。您需要来自这两个通道的软件包。如果未添加这两个通道，将会因缺少软件包而无法创建引导储存库。

source: Registering {micro} Clients
ja: {micro}クライアントの登録
ko: {micro} 클라이언트 등록
zh_cn: 注册 {micro} 客户端

source: The {micro} is an ultra-reliable, lightweight operating system purpose built for edge computing. It leverages the enterprise hardened security and compliance components of SUSE Linux Enterprise and merges them with a modern, immutable, developer-friendly OS platform.
ja: {micro}は、エッジコンピューティング向けに構築された、極めて信頼性が高く軽量なオペレーティングシステムです。 SUSE Linux Enterpriseのエンタープライズレベルの強化されたセキュリティおよびコンプライアンスコンポーネントを活用し、最新の不変の開発者向けOSプラットフォームと統合します。
ko: {micro}는 에지 컴퓨팅을 위해 특별히 제작된 매우 안정적인 경량 운영 체제입니다. 그리고 SUSE Linux Enterprise의 엔터프라이즈 강화 보안 및 규정 준수 구성 요소를 활용하며, 최신의 변경 불가능하고 개발자 친화적인 OS 플랫폼과 병합합니다.
zh_cn: {micro} 是一个超级可靠的轻量级操作系统，专为边缘计算而构建。它利用了 SUSE Linux Enterprise 的强化安全性和合规组件，并将它们整合到一个对开发人员友好的现代化、不可变操作系统平台。

source: The {micro} uses transactional updates. Transactional updates are atomic (all updates are applied only if all updates succeed) and support rollbacks. They do not affect a running system as no changes are activated until after the system is rebooted. This information is displayed in the menu:Systems[Details > Overview] subtab.
ja: {micro}はトランザクション更新を使用します。 トランザクション更新はアトミックであり(すべての更新はすべての更新が成功した場合にのみ適用されます)、ロールバックをサポートします。 システムが再起動されるまで変更はアクティブ化されないため、実行中のシステムには影響しません。 この情報は、menu:システム[詳細 > 概要]サブタブに表示されます。
ko: {micro}는 트랜잭션 업데이트를 사용합니다. 트랜잭션 업데이트는 원자적(모든 업데이트가 성공한 경우에만 모든 업데이트가 적용됨)이며 롤백을 지원합니다. 시스템이 재부팅될 때까지 변경 사항이 적용되지 않으므로 실행 중인 시스템에 영향을 주지 않습니다. 이와 관련된 정보는 menu:Systems[세부 정보 > 개요] 하위 탭에 표시됩니다.
zh_cn: {micro} 使用事务更新。事务更新是原子更新（仅当所有更新都成功时，才应用所有更新）且支持回滚。它们不会影响正在运行的系统，因为在系统重引导之前，它们不会激活任何更改。此信息显示在menu:系统[细节 > 概览]子选项卡中。

source: Before you register {micro} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ja: {micro}クライアントを{productname}サーバに登録する前に、必要なソフトウェアチャンネルを追加して同期する必要があります。
ko: {micro} 클라이언트를 {productname} 서버에 등록하기 전에 필요한 소프트웨어 채널을 추가하고 이 채널을 동기화해야 합니다.
zh_cn: 将 {micro} 客户端注册到您的 {productname} 服务器之前，您需要添加所需的软件通道，并同步这些通道。

source: | OS Version | Product Name | {micro} 5.5 {x86_64} | SUSE Linux Enterprise Micro 5.5 x86_64 | {micro} 5.5 {arm64} | SUSE Linux Enterprise Micro 5.5 aarch64 | {micro} 5.5 {s390x} | SUSE Linux Enterprise Micro 5.5 s390x | {micro} 5.4 {x86_64} | SUSE Linux Enterprise Micro 5.4 x86_64 | {micro} 5.4 {arm64} | SUSE Linux Enterprise Micro 5.4 aarch64 | {micro} 5.4 {s390x} | SUSE Linux Enterprise Micro 5.4 s390x | {micro} 5.3 {x86_64} | SUSE Linux Enterprise Micro 5.3 x86_64 | {micro} 5.3 {arm64} | SUSE Linux Enterprise Micro 5.3 aarch64 | {micro} 5.3 {s390x} | SUSE Linux Enterprise Micro 5.3 s390x | {micro} 5.2 {x86_64} | SUSE Linux Enterprise Micro 5.2 x86_64 | {micro} 5.2 {arm64} | SUSE Linux Enterprise Micro 5.2 aarch64 | {micro} 5.2 {s390x} | SUSE Linux Enterprise Micro 5.2 s390x | {micro} 5.1 {x86_64} | SUSE Linux Enterprise Micro 5.1 x86_64 | {micro} 5.1 {arm64} | SUSE Linux Enterprise Micro 5.1 aarch64 | {micro} 5.1 {s390x} | SUSE Linux Enterprise Micro 5.1 s390x
ko: | OS 버전 | 제품 이름 | {micro} 5.5 {x86_64} | SUSE Linux Enterprise Micro 5.5 x86_64 | {micro} 5.5 {arm64} | SUSE Linux Enterprise Micro 5.5 aarch64 | {micro} 5.5 {s390x} | SUSE Linux Enterprise Micro 5.5 s390x | {micro} 5.4 {x86_64} | SUSE Linux Enterprise Micro 5.4 x86_64 | {micro} 5.4 {arm64} | SUSE Linux Enterprise Micro 5.4 aarch64 | {micro} 5.4 {s390x} | SUSE Linux Enterprise Micro 5.4 s390x | {micro} 5.3 {x86_64} | SUSE Linux Enterprise Micro 5.3 x86_64 | {micro} 5.3 {arm64} | SUSE Linux Enterprise Micro 5.3 aarch64 | {micro} 5.3 {s390x} | SUSE Linux Enterprise Micro 5.3 s390x | {micro} 5.2 {x86_64} | SUSE Linux Enterprise Micro 5.2 x86_64 | {micro} 5.2 {arm64} | SUSE Linux Enterprise Micro 5.2 aarch64 | {micro} 5.2 {s390x} | SUSE Linux Enterprise Micro 5.2 s390x | {micro} 5.1 {x86_64} | SUSE Linux Enterprise Micro 5.1 x86_64 | {micro} 5.1 {arm64} | SUSE Linux Enterprise Micro 5.1 aarch64 | {micro} 5.1 {s390x} | SUSE Linux Enterprise Micro 5.1 s390x
zh_cn: | 操作系统版本 | 产品名称 | {micro} 5.5 {x86_64} | SUSE Linux Enterprise Micro 5.5 x86_64 | {micro} 5.5 {arm64} | SUSE Linux Enterprise Micro 5.5 aarch64 | {micro} 5.5 {s390x} | SUSE Linux Enterprise Micro 5.5 s390x | {micro} 5.4 {x86_64} | SUSE Linux Enterprise Micro 5.4 x86_64 | {micro} 5.4 {arm64} | SUSE Linux Enterprise Micro 5.4 aarch64 | {micro} 5.4 {s390x} | SUSE Linux Enterprise Micro 5.4 s390x | {micro} 5.3 {x86_64} | SUSE Linux Enterprise Micro 5.3 x86_64 | {micro} 5.3 {arm64} | SUSE Linux Enterprise Micro 5.3 aarch64 | {micro} 5.3 {s390x} | SUSE Linux Enterprise Micro 5.3 s390x | {micro} 5.2 {x86_64} | SUSE Linux Enterprise Micro 5.2 x86_64 | {micro} 5.2 {arm64} | SUSE Linux Enterprise Micro 5.2 aarch64 | {micro} 5.2 {s390x} | SUSE Linux Enterprise Micro 5.2 s390x | {micro} 5.1 {x86_64} | SUSE Linux Enterprise Micro 5.1 x86_64 | {micro} 5.1 {arm64} | SUSE Linux Enterprise Micro 5.1 aarch64 | {micro} 5.1 {s390x} | SUSE Linux Enterprise Micro 5.1 s390x

source: When using a bootstrap script with {micro} systems, ensure that the certificate section of the script has this content:
ja: {micro}システムでブートストラップスクリプトを使用する場合は、スクリプトの証明書セクションに次のコンテンツがあることを確認します。
ko: {micro} 시스템에서 부트스트랩 스크립트를 사용할 때 스크립트의 인증서 섹션에 다음 내용이 있는지 확인하십시오.
zh_cn: 对 {micro} 系统使用引导脚本时，请确保脚本的 certificate 部分包含以下内容：

source: Reboot {micro}
ja: {micro}の再起動
ko: {micro} 재부팅
zh_cn: 重引导 {micro}

source: {micro} is a transactional system. Transactional updates in general support several reboot methods. It is recommended to use [systemitem]``systemd`` for rebooting in systems managed by {productname}. Using other methods can lead to undesired behavior.
ja: {micro}はトランザクションシステムです。 トランザクション更新は通常、いくつかの再起動方法をサポートしています。 {productname}で管理されるシステムの再起動には、[systemitem]``systemd``を使用することをお勧めします。 他の方法を使用すると、望ましくない動作が発生する可能性があります。
ko: {micro}는 트랜잭션 시스템입니다. 일반적으로 트랜잭션 업데이트는 다양한 재부팅 방법을 지원합니다. {productname}에서 관리하는 시스템에서 재부팅을 수행하려면 [systemitem]``systemd``를 사용하는 것이 좋습니다. 다른 방법을 사용하면 원하지 않은 동작이 발생할 수 있습니다.
zh_cn: {micro} 是一种事务系统。事务更新一般支持数种重引导方法。建议在 {productname} 所管理的系统中使用 [systemitem]``systemd``来进行重引导。使用其他方法可能会导致系统出现意外行为。

source: {sll} repository URLs are available from {scc}
ko: {sll} 리포지토리 URL은 {scc}에서 사용할 수 있습니다.
zh_cn: {sll} 储存库 URL 可从 {scc} 获取

source: The {sll} product is provided by {scc}. This also includes the client tools package.
ja: {sll}製品は{scc}によって提供されます。 これには、クライアントツールパッケージも含まれています。
ko: {sll} 제품은 {scc}가 제공합니다. 이 제품은 클라이언트 도구 패키지도 포함합니다.
zh_cn: {sll} 产品由 {scc} 提供。其中还包含客户端工具软件包。

source: Procedure: Adding Base Media to Custom Channels
ja: プロシージャ: ベースメディアをカスタムチャンネルに追加する
ko: 절차: 기본 미디어를 사용자 정의 채널에 추가
zh_cn: 过程：将基础媒体添加到自定义通道

source: If an Enterprise Linux (EL) client such as RHEL and all clones (like {centos}, {almalinux}, {rocky}, and {oracle}) is already registered as a minion on {productname} and users want to migrate it to {sll} they can use a re-activation key to apply the activation key that drives the migration.
ja: RHELなどのEnterprise Linux (EL)クライアントとすべてのクローン({centos}、{almalinux}、{rocky}、{oracle}など) がすでに{productname}のminionとして登録されており、ユーザがそれを{sll}に移行したい場合は、再アクティベーションキーを使用して、移行を推進するアクティベーションキーを適用できます。
ko: RHEL 및 모든 클론(예: {centos}, {almalinux}, {rocky} 및 {oracle})과 같은 Enterprise Linux(EL) 클라이언트가 이미 {productname}에 미니언으로 등록되어 있고 사용자가 이를 {sll}로 마이그레이션하려는 경우 재활성화 키를 사용하여 마이그레이션을 구동하는 활성화 키를 적용할 수 있습니다.
zh_cn: 如果某个 Enterprise Linux (EL) 客户端（例如 RHEL 以及 {centos}、{almalinux}、{rocky} 和 {oracle} 等所有克隆版本）已在 {productname} 上注册为受控端，而用户想要将其迁移到 {sll}，则可以使用重新激活密钥来应用用于驱动迁移的激活密钥。

source: This section contains information about registering clients running {nbsp}{sl-micro} operating system 6.0 {x86_64}, {arm64}, and {zsystems} (s390x).
ja: このセクションでは、{sl-micro}オペレーティングシステム 6.0 {x86_64}、{arm64}、および {zsystems} (s390x)を実行しているクライアントの登録について説明します。
ko: 이 섹션에는{nbsp}{sl-micro} 운영 체제 6.0 {x86_64}, {arm64}, and {zsystems} (s390x)를 실행하는 클라이언트를 등록하는 방법에 대한 정보가 포함되어 있습니다.
zh_cn: 本节包含有关注册运行{nbsp}{sl-micro} 操作系统 6.0 {x86_64}、{arm64} 和 {zsystems} (s390x) 的客户端的信息。
