Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: At the command prompt on the {productname} Server, as root, use the [command]``spacewalk-common-channels`` command to add the appropriate channels.
ca: A l'indicador d'ordres del servidor {productname}, com a root, utilitzeu l'ordre [command].spacewalk-common-channels. per afegir els canals adequats.
ja: {productname} サーバのコマンドプロンプトで root になり、 [command]``spacewalk-common-channels`` コマンドを特定のチャンネルに対して実行します。
ko: {productname} 서버의 명령 프롬프트에서 루트 권한으로 [command]``spacewalk-common-channels`` 명령을 사용해 적절한 채널을 추가합니다.
zh_cn: 在 {productname} 服务器上的命令提示符处，以 root 身份使用 [command]``spacewalk-common-channels`` 命令添加相应的通道。

source: Fully synchronize all channels with [command]``spacewalk-repo-sync``.
ca: Sincronitza completament tots els canals amb [ordre].spacewalk-repo-sync..

source: In the {productname} Server {webui}, navigate to menu:Software[Manage > Channels] and click the [systemitem]``Uyuni Client Tools for openSUSE Leap 15.4 (x86_64)`` channel name.
ca: Al {productname} Servidor {webui}, navegueu al menú:Software[Manage . Channels], i feu clic al canal per associar-lo.
ja: {productname}サーバの{webui}で、menu:ソフトウェア[管理 > チャンネル]に移動し、[systemitem]``Uyuni Client Tools for openSUSE Leap 15.4 (x86_64)``チャンネル名をクリックします。
ko: {productname} 서버 {webui}에서 menu:소프트웨어[관리 > 채널]로 이동하여 이름이 [systemitem]`` Uyuni Client Tools for openSUSE Leap 15.4(x86_64)``인 채널을 클릭합니다.
zh_cn: 在 {productname} 服务器 {webui} 中，导航到menu:软件[管理 > 通道]，然后单击 [systemitem]``Uyuni Client Tools for openSUSE Leap 15.4 (x86_64)`` 通道名称。

source: In the upper right corner, click btn:[Manage Channel].
ca: A la cantonada superior dreta, feu clic a btn:[Gestionar el canal].
ja: 右上隅のbtn:[チャンネルの管理]をクリックします。
ko: 오른쪽 상단에서 btn:[채널 관리]를 클릭합니다.
zh_cn: 在右上角单击 btn:[管理通道]。

source: Click the [guimenu]``Repositories`` tab, and select [systemitem]``External - Uyuni Client Tools for openSUSE Leap 15.3 (x86_64)``.
ca: Feu clic a la pestanya [guimenu].Repositoris, i seleccioneu [systemitem].Eines externes - Clients Uyuni per a openSUSE Leap 15.3 (x8664)..
ja: ［[guimenu]``リポジトリ``］タブをクリックし、［[systemitem]``External - Uyuni Client Tools for openSUSE Leap 15.3 (x86_64)``］を選択します。
ko: [guimenu]``리포지토리`` 탭을 클릭하고 [systemitem]``외부 - openSUSE Leap 15.3(x86_64)용 Uyuni 클라이언트 도구``를 선택합니다.
zh_cn: 单击[guimenu]``储存库``选项卡，然后选择[systemitem]``外部 - Uyuni Client Tools for openSUSE Leap 15.3 (x86_64)``。

source: Click btn:[Update Repositories].
ca: Feu clic a btn:[Actualitza els repositoris].
ja: btn:[Update Repositories]（リポジトリの更新）をクリックします。
ko: btn:[리포지토리 업데이트]를 클릭합니다.
zh_cn: 单击 btn:[更新储存库]。

source: Navigate to menu:Repositories[Sync] subtab, and click btn:[Sync Now].
ca: Navega al menú:Repositoris[Sincronitza] subtab, i fes clic a btn:[Sincronitza ara].
ja: menu:リポジトリ[同期]サブタブに移動し、btn:[今すぐ同期]をクリックします。
ko: menu:리포지토리[동기화] 하위 탭으로 이동하여 btn:[지금 동기화]를 클릭합니다.
zh_cn: 导航到menu:储存库[同步]子选项卡，然后单击 btn:[立即同步]。

source: Do the same with [systemitem]``openSUSE Leap 15.4 (x86_64)`` and [systemitem]``External - openSUSE Leap 15.3 (x86_64)``.
ca: Feu el mateix amb [systemitem].openSUSE Leap 15.4 (x8664). i [systemitem].Extern - openSUSE Leap 15.3 (x8664)..
ja: [systemitem]``openSUSE Leap 15.4 (x86_64)``および[systemitem]``External - openSUSE Leap 15.3 (x86_64)``で同じ操作をします。
ko: [systemitem]``openSUSE Leap 15.4(x86_64)`` 및 [systemitem]``외부 - openSUSE Leap 15.3(x86_64)``에 대해서도 동일한 작업을 합니다.
zh_cn: 对 [systemitem]``openSUSE Leap 15.4 (x86_64)`` 和[systemitem]``外部 - openSUSE Leap 15.3 (x86_64)`` 执行相同的操作。

source: Unfold [systemitem]``openSUSE Leap 15.4 (x86_64)`` to see all child channels populated with packages.
ca: Desplega [systemitem].openSUSE Leap 15.4 (x8664). per a veure tots els canals fills poblats amb paquets.
ja: [systemitem]``openSUSE Leap 15.4 (x86_64)``を展開し、パッケージが入力されているすべての子チャンネルを表示します。
ko: [systemitem]``openSUSE Leap 15.4(x86_64)``를 펼쳐 패키지로 채워져 있는 모든 하위 채널을 표시합니다.
zh_cn: 展开 [systemitem]``openSUSE Leap 15.4 (x86_64)`` 以查看填充了软件包的所有子通道。

source: To upgrade a client you replace the software repositories and update the software, and finally reboot the client.
ca: Per actualitzar un client, reemplaceu els repositoris de programari i actualitzeu el programari, i finalment torneu a arrencar el client.
ja: クライアントをアップグレードするには、ソフトウェアリポジトリを置き換え、ソフトウェアを更新し、最後にクライアントを再起動します。
ko: 클라이언트를 업그레이드하려면 소프트웨어 리포지토리를 교체하고 소프트웨어를 업데이트한 후 끝으로 클라이언트를 재부팅하십시오.
zh_cn: 要升级客户端，您需要替换软件储存库，然后更新软件，最后重引导客户端。

source: Procedure: Upgrading the Client
ca: Procediment: Aprovisionament dels Clients
ja: プロシージャ: クライアントのアップグレード
ko: 절차: 클라이언트 업그레이드
zh_cn: 过程：升级客户端

source: In the {productname} Server {webui}, navigate to menu:Systems[] and click the name of the client.
ca: Al {productname} Servidor {webui}, navegueu al menú:Sistemes[] i feu clic al nom del client.
ja: {productname}サーバの{webui}で、［menu:システム[]］に移動し、クライアントの名前をクリックします。
ko: {productname} 서버 {webui}에서 menu:시스템[]으로 이동하여 클라이언트의 이름을 클릭합니다.
zh_cn: 在 {productname} 服务器 {webui} 中，导航到menu:系统[]，然后单击客户端的名称。

source: Click menu:Software[Software Channels], and as the base channel select the openSUSE Leap {opensuse-version} channel that is listed in the [systemitem]``Customs Channels`` list.
ca: Feu clic a menu:Software[Canals de programari], i com a canal base seleccioneu el canal openSUSE Leap {opensuse-version} que es llista a la llista [systemitem].Canals de personalització..
ja: menu:ソフトウェア[ソフトウェアチャンネル]をクリックし、[systemitem]``カスタムチャンネル``一覧にリストされているopenSUSE Leap {opensuse-version}チャンネルをベースチャンネルとして選択します。
ko: menu:소프트웨어[소프트웨어 채널]을 클릭하고 [systemitem]``Customs Channels`` 목록에 나열된 openSUSE Leap {opensuse-version} 채널을 기본 채널로 선택합니다.
zh_cn: 单击menu:软件[软件通道]，选择[systemitem]``自定义通道``列表中所列的 openSUSE Leap {opensuse-version} 通道作为基础通道。

source: In the [guimenu]``Child Channels`` pane, select the {opensuse-version} child channels.
ca: A la subfinestra [guimenu].Canals antics., seleccioneu els canals fills {opensuse-version}.
ja: ［[guimenu]``子チャンネル``］ペインで、{opensuse-version}子チャンネルを選択します。
ko: [guimenu]``하위 채널`` 창에서 {opensuse-version} 하위 채널을 선택합니다.
zh_cn: 在[guimenu]``子通道``窗格中，选择 {opensuse-version} 子通道。

source: Click btn:[Next], and [guimenu]``Confirm Software Channel Change`` with btn:[Confirm].
ca: Feu clic a btn:[Següent], i [guimenu]].Confirma el canvi de canal de programari]. amb btn:[Confirma].
ja: btn:[次へ]、［[guimenu]``ソフトウェアチャンネルの変更確認``］、btn:[確認]をクリックします。
ko: btn:[다음]을 클릭하고 [guimenu]``소프트웨어 채널 변경 확인``에서 btn:[확인]을 클릭합니다.
zh_cn: 单击 btn:[下一步]，然后单击 btn:[确认] 以[guimenu]``确认软件通道更改``。

source: Click menu:Software[Packages > Upgrade], and select all the packages to be updated on the client, and then apply the selection. Click btn:[Upgrade Packages], check the details, and click btn:[Confirm] to complete the update.
ca: Feu clic a menu:Software[Packages . Upgrade], seleccioneu tots els paquets a actualitzar al client i després apliqueu la selecció. Feu clic a btn:[Actualitza els paquets], comproveu els detalls i feu clic a btn:[Confirma] per completar l'actualització.
ja: menu:ソフトウェア[パッケージ > アップグレード]をクリックし、クライアントで更新するパッケージをすべて選択してから、選択を適用します。 btn:[パッケージのアップグレード]をクリックし、詳細を確認し、btn:[確認]をクリックして更新を終了します。
ko: menu:소프트웨어[패키지 > 업그레이드]를 클릭하고 클라이언트에서 업데이트할 패키지를 모두 선택한 다음, 선택을 적용합니다. btn:[패키지 업그레이드]를 클릭하고, 상세 정보를 확인한 후 btn:[확인]을 클릭하여 업데이트를 완료합니다.
zh_cn: 单击menu:软件[软件包 > 升级]，选择客户端上要更新的所有软件包，然后应用选择。单击 btn:[升级软件包]，查看细节，然后单击 btn:[确认] 以完成更新。

source: Reboot the client.
ca: Reinicieu el client.
ja: クライアントを再起動します。
ko: 클라이언트를 재부팅합니다.
zh_cn: 重引导客户端。

source: If you need to update many clients, you can create an action chain of this command sequence on the {productname} Server. You can use the action chain to perform updates on multiple clients at the same time.
ca: Si necessiteu actualitzar molts clients, podeu crear una cadena d'acció d'aquesta seqüència d'ordres al servidor {productname}. Podeu utilitzar la cadena d'acció per a realitzar actualitzacions en múltiples clients al mateix temps.
ja: 多数のクライアントを更新する必要がある場合、{productname}サーバでこのコマンドシーケンスのアクションチェーンを作成できます。 アクションチェーンを使用して、複数のクライアントで同時に更新を実行できます。
ko: 여러 클라이언트를 업데이트해야 하는 경우 {productname} 서버에서 이 명령 시퀀스의 작업 체인을 생성하면 됩니다. 이 작업 체인을 사용해 여러 클라이언트에서 업데이트를 동시에 수행할 수 있습니다.
zh_cn: 如果需要更新许多客户端，可以在 {productname} 服务器上创建由此命令序列组成的操作链。您可以使用操作链同时对多个客户端执行更新。

source: Client Upgrades
ca: Actualitzacions del client
ja: クライアントのアップグレード
ko: 클라이언트 업그레이드
zh_cn: 客户端升级

source: Clients use the versioning system of their underlying operating system, and require regular upgrades.
ca: Els clients utilitzen el sistema de versionat del seu sistema operatiu subjacent, i requereixen actualitzacions regulars.
ja: クライアントは、基盤となるオペレーティングシステムのバージョン設定システムを使用し、定期的なアップグレードが必要です。
ko: 클라이언트는 자체 기본 운영 체제의 버전 관리 시스템을 사용하며 정기적인 업그레이드가 필요합니다.
zh_cn: 客户端采用底层操作系统的版本控制系统，需要定期升级。

source: For {scc} registered clients using {suse} operating systems, you can perform upgrades within the {productname} {webui}. For supported {sle}{nbsp}15 upgrade paths, see {sles-base-os-documentation}/cha-upgrade-paths.html
ca: Per als clients registrats {scc} que utilitzen sistemes operatius {suse}, podeu realitzar actualitzacions dins del {productname} {webui}. Per als camins d'actualització {sle}{nbsp}15 admesos, vegeu {sles-base-os-documentation}/cha-upgrade-paths.html

source: To upgrade clients running SLE{nbsp}12 to SLE{nbsp}15, the upgrade is automated, but you need to do some preparation steps before you begin. For more information, see xref:client-configuration:client-upgrades-major.adoc[].
ca: Per actualitzar els clients executant SLE{nbsp}12 a SLE{nbsp}15, l'actualització està automatitzada, però heu de fer alguns passos de preparació abans de començar. Per a més informació, vegeu xref:client-configuration:client-upgrades-major.adoc[].
ja: SLE{nbsp}12を実行しているクライアントをSLE{nbsp}15にアップグレードするには、アップグレードは自動化されていますが、アップグレードを始める前に準備手順を実行する必要があります。 詳細については、xref:client-configuration:client-upgrades-major.adoc[]を参照してください。
ko: SLE{nbsp}12를 실행하는 클라이언트를 SLE{nbsp}15로 업그레이드하는 경우 업그레이드가 자동화되지만 시작하기 전에 몇 가지 준비 단계를 수행해야 합니다. 자세한 내용은 xref:client-configuration:client-upgrades-major.adoc[]를 참조하십시오.
zh_cn: 将运行 SLE{nbsp}12 的客户端升级到 SLE{nbsp}15 的过程可自动完成，不过在开始前您需要完成一些准备步骤。有关详细信息，请参见 xref:client-configuration:client-upgrades-major.adoc[]。

source: You can also automate client upgrades using the content lifecycle manager. For more information, see xref:client-configuration:client-upgrades-lifecycle.adoc[].
ca: També pots automatitzar les actualitzacions del client utilitzant el gestor de cicle de vida de contingut. Per a més informació, vegeu xref:client-configuration:client-upgrades-lifecycle.adoc[].
ja: コンテンツライフサイクルマネージャを使用してクライアントのアップグレードを自動化することもできます。 詳細については、xref:client-configuration:client-upgrades-lifecycle.adoc[]を参照してください。
ko: 컨텐트 라이프싸이클 관리자를 사용하여 클라이언트 업그레이드를 자동화할 수도 있습니다. 자세한 내용은 xref:client-configuration:client-upgrades-lifecycle.adoc[]을 참조하십시오.
zh_cn: 您也可以使用内容生命周期管理器自动执行客户端升级。有关详细信息，请参见 xref:client-configuration:client-upgrades-lifecycle.adoc[]。

source: For more information about product migration such as service pack upgrades, openSUSE Leap minor version upgrades, or openSUSE Leap to {sle} migrations, see xref:client-configuration:client-upgrades-product-migration.adoc[].
ca: Per obtenir més informació sobre com actualitzar clients openSUSE Leap no registrats, vegeu xref:client-configuration:client-upgrades-uyuni.adoc[].

source: For more information about upgrading unregistered openSUSE Leap clients, see xref:client-configuration:client-upgrades-uyuni.adoc[].
ca: Per obtenir més informació sobre com actualitzar clients openSUSE Leap no registrats, vegeu xref:client-configuration:client-upgrades-uyuni.adoc[].
ja: 登録を取り消したopenSUSE Leapクライアントのアップグレードの詳細については、xref:client-configuration:client-upgrades-uyuni.adoc[]を参照してください。
ko: 등록되지 않은 openSUSE Leap 클라이언트를 업그레이드하는 방법에 대한 자세한 내용은 xref:client-configuration:client-upgrades-uyuni.adoc[]를 참조하십시오.
zh_cn: 有关激活密钥的详细信息，请参见 xref:client-configuration:activation-keys.adoc[]。

source: Registering {alibabaclo} Clients
ca: S'estan registrant {alibabaclo} clients
ja: {alibabaclo}クライアントの登録
ko: {alibabaclo} 클라이언트 등록
zh_cn: 注册 {alibabaclo} 客户端

source: This section contains information about registering clients running {alibabaclo} operating systems.
ca: Aquesta secció conté informació sobre el registre de clients que executen sistemes operatius {alibabaclo}.

source: {alibabaclo} repository URLs are available from {scclongform}
ca: Els URL del repositori {alibabaclo} estan disponibles des de {scclongform}

source: Packages and metadata are provided by Alibaba Cloud, not by {suse}
ca: Els paquets i les metadades són proporcionats per Alibaba Cloud, no per {suse}
ja: パッケージおよびメタデータは{suse}ではなくAlibaba Cloudから提供されます。
ko: 패키지 및 메타데이터는 {suse}가 아닌 Alibaba Cloud가 제공합니다.
zh_cn: 软件包和元数据由 Alibaba Cloud 而不是 {suse} 提供

source: For supported products, see the support table and the release notes
ca: Per als productes compatibles, vegeu la taula de suport i les notes de llançament
ja: サポートされている製品については、サポートテーブルとリリースノートを参照してください。
ko: 지원되는 제품에 대해서는 지원 테이블 및 릴리스 노트를 참조하십시오.
zh_cn: 有关支持的产品，请参见支持表格和版本说明

source: Some {alibabaclo}{nbsp}2 instances will need two tries to register successfully.
ca: Algunes {alibabaclo}{nbsp}2 instàncies necessitaran dos intents per registrar-se correctament.
ja: 一部の{alibabaclo}{nbsp}2インスタンスでは、正常に登録するために2回の試行が必要になります。
ko: 일부 {alibabaclo}{nbsp}2 인스턴스를 등록하려면 2회 시도해야 합니다.
zh_cn: 一些 {alibabaclo}{nbsp}2 实例需要尝试两次才能成功注册。

source: Add Software Channels
ca: Afegeix canals de programari
ja: ソフトウェアチャンネルの追加
ko: 소프트웨어 채널 추가
zh_cn: 添加软件通道

source: Before you register {alibabaclo} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de registrar {alibabaclo} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.
ja: {alibabaclo}クライアントを{productname}サーバに登録する前に、必要なソフトウェアチャンネルを追加して同期する必要があります。
ko: {alibabaclo} 클라이언트를 {productname} 서버에 등록하기 전에 필요한 소프트웨어 채널을 추가하고 이 채널을 동기화해야 합니다.
zh_cn: 将 {alibabaclo} 客户端注册到您的 {productname} 服务器之前，您需要添加所需的软件通道，并同步这些通道。

source: The products you need for this procedure are:
ca: Els productes que necessites per a aquest tràmit són:
ja: このプロシージャで必要な製品は次のとおりです。
ko: 이 절차에 필요한 제품은 다음과 같습니다.
zh_cn: 此过程所需的产品包括：

source: Alibaba Cloud Linux Products - WebUI
ca: Productes Alibaba Cloud Linux - WebUI
ja: Alibaba Cloud Linux製品 - WebUI
ko: Alibaba Cloud Linux 제품 - WebUI
zh_cn: Alibaba Cloud Linux 产品 - WebUI

source: | OS Version | Product Name | {alibabaclo} 2 | Alibaba Cloud Linux 2 x86_64
ca: | Versió del SO | Nom del producte | {alibabaclo} 2 | Alibaba Cloud Linux 2 x86_64
ko: | OS 버전 | 제품 이름 | {alibabaclo} 2 | Alibaba Cloud Linux 2 x86_64
zh_cn: | 操作系统版本 | 产品名称 | {alibabaclo} 2 | Alibaba Cloud Linux 2 x86_64

source: Alternatively, you can add channels at the command prompt. The channels you need for this procedure are:
ca: Alternativament, podeu afegir canals a l'indicador d'ordres. Els canals que necessites per a aquest tràmit són:
ja: または、コマンドプロンプトでチャンネルを追加できます。 このプロシージャで必要なチャンネルは次のとおりです。
ko: 또는 명령 프롬프트에서 채널을 추가할 수 있습니다. 이 절차에 필요한 채널은 다음과 같습니다.
zh_cn: 或者，您也可以在命令提示符处添加通道。此过程所需的通道包括：

source: Alibaba Cloud Linux Channels - CLI
ca: Canals Alibaba Cloud Linux - CLI
ja: Alibaba Cloud Linuxチャンネル - CLI
ko: Alibaba Cloud Linux 채널 - CLI
zh_cn: Alibaba Cloud Linux 通道 - CLI

source: | OS Version | Base Channel | {alibabaclo} 2 | alibaba-2-x86_64
ca: | Versió del SO | Canal base | {alibabaclo} 2 | alibaba-2-x86_64
ko: | OS 버전 | 기본 채널 | {alibabaclo} 2 | alibaba-2-x86_64
zh_cn: | 操作系统版本 | 基础通道 | {alibabaclo} 2 | alibaba-2-x86_64

source: The channels you need for this procedure are:
ca: Els canals que necessites per a aquest tràmit són:
ja: このプロシージャで必要なチャンネルは次のとおりです。
ko: 이 절차에 필요한 채널은 다음과 같습니다.
zh_cn: 此过程所需的通道包括：

source: | OS Version | Core Channel | Updates Channel | Client Channel | {alibabaclo} 2 | alibaba-2 | alibaba-2-updates | alibaba-2-uyuni-client
ca: Versió del SO Canal del nucli s Actualitza el canal Canal Client {alibabaclo} 2 alibaba-2 s alibaba-2-updates alibaba-2-uyuni-client
ko: | OS 버전 | Core Channel | Updates Channel | Client Channel | {alibabaclo} 2 | alibaba-2 | alibaba-2-updates | alibaba-2-uyuni-client
zh_cn: | 操作系统版本 | 核心通道 | 更新通道 | 客户端通道 | {alibabaclo} 2 | alibaba-2 | alibaba-2-updates | alibaba-2-uyuni-client

source: The client tools channel provided by [command]``spacewalk-common-channels`` is sourced from {uyuni} and not from {suse}.
ca: El canal d'eines del client proporcionat per [command]}.spacewalk-common-channels}. prové de {uyuni} i no de {suse}.
ja: [command]``spacewalk-common-channels``によって提供されるクライアントツールのチャンネルの提供元は{uyuni}です。{suse}ではありません。
ko: [command]``spacewalk-common-channels``가 제공하는 클라이언트 도구 채널은 {suse}가 아닌 {uyuni}가 공급합니다.
zh_cn: [command]``spacewalk-common-channels`` 提供的客户端工具通道来自 {uyuni} 而非 {suse}。

source: Check Synchronization Status
ca: Comprova l'estat de la sincronització
ja: 同期ステータスの確認
ko: 동기화 상태 확인
zh_cn: 检查同步状态

source: You need to create an activation key that is associated with your {alibabaclo} channels.
ca: Heu de crear una clau d'activació que estigui associada als vostres canals {alibabaclo}.
ja: {alibabaclo}チャンネルと関連付けられているアクティベーションキーを作成する必要があります。
ko: {alibabaclo} 채널에 연결된 활성화 키를 생성해야 합니다.
zh_cn: 您需要创建与您的 {alibabaclo} 通道关联的激活密钥。

source: For more information on activation keys, see xref:client-configuration:activation-keys.adoc[].
ca: Per obtenir més informació sobre les claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].
ja: アクティベーションキーの詳細については、xref:client-configuration:activation-keys.adoc[]を参照してください。
ko: 활성화 키에 대한 자세한 내용은 xref:client-configuration:activation-keys.adoc[]를 참조하십시오.
zh_cn: 有关激活密钥的详细信息，请参见 xref:client-configuration:activation-keys.adoc[]。

source: Register Clients
ca: Registra clients
ja: クライアントの登録
ko: 클라이언트 등록
zh_cn: 注册客户端

source: Some {alibabaclo}{nbsp}2 instances will fail to register on the first try. This is due to a to a known bug in the {alibabaclo}{nbsp}2 image.
ca: Algunes {alibabaclo}{nbsp}2 instàncies no es registraran en el primer intent. Això es deu a un error conegut a la imatge {alibabaclo}{nbsp}2.

source: The `python-urlgrabber3` package is provided both as a Python pip package and an RPM package, which can cause a conflict on the first attempt to register.
ca: El paquet urlpython-urlgrabber3. es proporciona tant com un paquet pip Python com un paquet RPM, el qual pot causar un conflicte en el primer intent de registrar-se.
ja: 「python-urlgrabber3」パッケージは、Python pipパッケージとRPMパッケージの両方で提供されており、最初の登録試行時に競合が発生する可能性があります。
ko: `python-urlgrabber3` 패키지는 Python pip 패키지 및 RPM 패키지로 제공되며, 이로 인해 첫 번째 등록 시도에서 충돌이 발생할 수 있습니다.
zh_cn: `python-urlgrabber3` 软件包以 Python pip 软件包和 RPM 软件包两种形式提供，这可能会导致在首次尝试注册时发生冲突。

source: If your instance is based on one of the affected image versions, the client should register correctly on the second registration attempt.
ca: Si la teva instància es basa en una de les versions d'imatge afectades, el client s'ha de registrar correctament en el segon intent de registre.
ja: インスタンスが影響を受けるいずれかのイメージバージョンに基づいている場合、クライアントは2回目の登録試行で正しく登録されます。
ko: 인스턴스가 영향을 받는 이미지 버전 중 하나에 해당하는 경우 두 번째 등록 시도에서 클라이언트가 올바르게 등록되어야 합니다.
zh_cn: 如果您的实例基于其中一个受影响的映像版本，客户端在第二次尝试注册时应该会正确注册。

source: Registering {almalinux} Clients
ca: S'estan registrant {almalinux} clients
ja: {almalinux}クライアントの登録
ko: {almalinux} 클라이언트 등록
zh_cn: 注册 {almalinux} 客户端

source: This section contains information about registering clients running {almalinux} operating systems.
ca: Aquesta secció conté informació sobre el registre de clients que executen sistemes operatius {almalinux}.

source: {almalinux} repository URLs are available from {scclongform}.
ca: Els URL del repositori {almalinux} estan disponibles des de {scclongform}.

source: Packages and metadata are provided by AlmaLinux OS Foundation, not by {suse}.
ca: Els paquets i les metadades són proporcionats per AlmaLinux OS Foundation, no per {suse}.

source: For supported products, see the release notes and the support table at xref:client-configuration:supported-features-almalinux.adoc[].
ca: Per obtenir una llista completa de clients i característiques compatibles, vegeu xref:client-configuration:supported-features.adoc[].

source: When created at AWS, {almalinux} instances always have the same `machine-id` id at `/etc/machine-id`. Make sure you regenerate the `machine-id` after the instance is created. For more information, see xref:administration:troubleshooting/tshoot-registerclones.adoc[].
ca: Quan es crea a AWS, les instàncies {almalinux} sempre tenen el mateix idmachine-id. id a ,/etc/machine-id.. Assegureu-vos de regenerar el .machine-id. després de crear la instància. Per a més informació, vegeu xref:administration:troubleshooting/tshoot-registerclones.adoc[].
ja: AWSで作成するとき、{almalinux}インスタンスには、``/etc/machine-id``で常に同じ``machine-id`` IDが割り当てられます。 インスタンスを作成した後に、必ず``machine-id``を再生成してください。 詳細については、 xref:administration:troubleshooting/tshoot-registerclones.adoc[]を参照してください。
ko: AWS에서 생성할 때 {almalinux} 인스턴스에서는 항상 ``/etc/machine-id`` 에서 ``machine-id`` 가 동일합니다. 인스턴스가 생성된 후에 ``machine-id``를 다시 생성해야 합니다. 자세한 설명은 xref:administration:troubleshooting/tshoot-registerclones.adoc[]에서 확인할 수 있습니다.
zh_cn: 如果 {almalinux} 实例是在 AWS 中创建的，则 `/etc/machine-id` 中的 `machine-id` ID 一律相同。请务必在创建实例后重新生成 `machine-id`。有关详细信息，请参见 xref:administration:troubleshooting/tshoot-registerclones.adoc[]。

source: Registering {almalinux} clients to {productname} is tested with the default SELinux configuration of ``enforcing`` with a ``targeted`` policy. You do not need to disable SELinux to register {almalinux} clients to {productname}.
ca: Registrar {almalinux} clients a {productname} es prova amb la configuració predeterminada de SELinux de .enforcing. amb una política .targeted.. No cal que desactiveu SELinux per registrar {almalinux} clients a {productname}.
ja: {almalinux}クライアントの{productname}への登録は、``ターゲット``ポリシーで``適用``されるデフォルトのSELinux設定でテストされます。 SELinuxを無効にして{almalinux}クライアントを{productname}に登録する必要があります。
ko: {almalinux} 클라이언트를 {productname}에 등록하는 기능은 ``목표`` 정책으로 ``강제``하는 기본 SELinux 구성으로 테스트됩니다. SELinux를 비활성화해야 {almalinux} 클라이언트를 {productname}에 등록할 수 있는 것은 아닙니다.
zh_cn: 我们已使用``针对性``策略并采用默认的 ``enforcing`` SELinux 配置对将 {almalinux} 客户端注册到 {productname} 的过程进行了测试。将 {almalinux} 客户端注册到 {productname} 时，您无需禁用 SELinux。

source: Before you can register {almalinux} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de poder registrar {almalinux} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.
ja: {almalinux}クライアントを{productname}サーバに登録する前に、必要なソフトウェアチャンネルを追加して同期する必要があります。
ko: {almalinux} 클라이언트를 {productname} 서버에 등록하려면 먼저 필요한 소프트웨어 채널을 추가하고 이 채널을 동기화해야 합니다.
zh_cn: 将 {almalinux} 客户端注册到您的 {productname} 服务器之前，您需要添加所需的软件通道，并同步这些通道。

source: The architectures currently supported are: `x86_64` and `aarch64`, on version 9 additionally {ppc64le} and {s390x}. For full list of supported products and architectures, see xref:client-configuration:supported-features.adoc[].
ca: Les arquitectures suportades actualment són: xx8664. i .aarch64.. Per obtenir una llista completa de productes i arquitectures compatibles, vegeu xref:client-configuration:supported-features.adoc[].
ja: 現在サポートされているアーキテクチャは、「`` x86_64``」と「 ``aarch64``」です。バージョン9では、{ppc64le}と{s390x}も追加でサポートされます。 サポートされている製品およびアーキテクチャの完全な一覧については、xref:client-configuration:supported-features.adoc[]を参照してください。
ko: 현재 지원되는 아키텍처는 ``x86_64`` 및 ``aarch64``이며, 버전 9의 경우 추가적으로 {ppc64le} 및 {s390x}가 지원됩니다. 지원되는 제품 및 아키텍처의 전체 목록은 xref:client-configuration:supported-features.adoc[]에서 확인할 수 있습니다.
zh_cn: 目前支持的系统结构有 `x86_64` 和 `aarch64`，在版本 9 上，另外还支持 {ppc64le} 和 {s390x}。有关支持的产品和体系结构的完整列表，请参见 xref:client-configuration:supported-features.adoc[]。
