Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: Before you begin, you need to ensure that you have specified which ports to use for SSH tunneling. If you have registered clients before changing the port numbers, they need to be registered again with a re-activation key.
ca: Abans de començar, heu d'assegurar-vos que heu especificat quins ports utilitzar per a la tunelització SSH. Si tens clients registrats abans de canviar els números de port, han d'estar registrats de nou amb una clau de reactivació.

source: For more information about bootstrapping, see xref:client-configuration:registration-bootstrap.adoc[].
ca: Per a més informació, vegeu xref:client-configuration:registration-bootstrap.adoc[].

source: For more information about bootstrapping, see xref:client-configuration:activation-keys.adoc#activation-keys-reactivation[].
ca: Per a més informació, vegeu xref:client-configuration:activation-keys.adoc[].

source: Example: API Access to SSH Push (with tunnel)
ca: Exemple: accés de l'API a Push via SSH

source: You can use the API to manage which contact method to use. This example Python code sets the contact method to ``ssh-push-tunnel``.
ca: Podeu utilitzar l'API per gestionar quin mètode de contacte utilitzar. Aquest exemple de codi Python estableix el mètode de contacte a thessh-push..

source: client = xmlrpclib.Server(MLM_HOST + "/rpc/api", verbose=0) key = client.auth.login(MLM_LOGIN, MLM_PASSWORD) client.system.setDetails(key, 1000012345, {'contact_method' : 'ssh-push-tunnel'})
ca: client . xmlrpclib.Servidor(MLMHOST + "/rpc/api", verbose",0) clau , client.auth.login(MLMLOGIN, MLMPASSWORD) client.system.setDetails(clau, 1000012345, {'contactmethod': 'ssh-push-tunnel'})

source: Valid values are:
ca: Els valors vàlids són:
ja: 有効な値は次のとおりです。
ko: 유효한 값은 다음과 같습니다.
zh_cn: 有效值为：

source: `ssh-push`
ca: pssh-push`

source: `ssh-push-tunnel`
ca: pssh-push-tunnel`

source: SSH Push Contact Method
ca: Mètode de contacte

source: SSH Push ([literal]``ssh-push``) is used in environments where Salt clients cannot reach the {productname} Server directly. In this environment, clients are located in a firewall-protected zone called a DMZ. No system within the DMZ is authorized to open a connection to the internal network where the {productname} Server is located.
ca: SSH Push ([literal].ssh-push.) s'utilitza en entorns on els clients Salt no poden arribar directament al servidor {productname}. En aquest entorn, els clients es troben en una zona protegida per tallafocs anomenada DMZ. Cap sistema dins de la DMZ està autoritzat a obrir una connexió a la xarxa interna on es troba el servidor {productname}.

source: SSH Push opens a tunnel only from {productname} to the client, but the reverse channel goes directly. Such a scenario might not work everywhere. Therefore also SSH Push (with tunnel) is available as contact method. That also opens a reverse tunnel and thus you can communicate through all firewalls which otherwise might block the connection from client to server.
ca: SSH Push obre un túnel només des de {productname} al client, però el canal invers va directament. Aquest escenari podria no funcionar a tot arreu. Per tant, també SSH Push (amb túnel) està disponible com a mètode de contacte. Això també obre un túnel invers i per tant es pot comunicar a través de tots els tallafocs que d'altra manera podrien bloquejar la connexió de client a servidor.

source: SSH Push is also to use if installing a daemon agent on clients is not possible.
ca: SSH Push també s'utilitza si no és possible instal·lar un agent de dimoni als clients.

source: The SSH Push method has serious limitations. It does not scale well, and consumes more Server resources and network bandwidth than the plain Salt method ([literal]``default``). The Push SSH method is not at all supported with large setups (1000 clients and more).
ca: El mètode SSH Push té serioses limitacions. No escala bé, i consumeix més recursos del servidor i l'amplada de banda de la xarxa que el mètode Salt pla ([literal]).default).). El mètode Push SSH no està suportat en absolut amb configuracions grans (1000 clients i més).

source: The server uses the SSH Push to contact the clients at regular intervals, checking in and performing scheduled actions and events.
ca: El servidor utilitza SSH per contactar amb els clients a intervals regulars, comprovant i realitzant accions i esdeveniments programats.

source: This image demonstrates the SSH Push process path. All items left of the [systemitem]``Taskomatic`` block represent processes running on the {productname} client.
ca: Aquesta imatge mostra el camí del procés SSH Push. Tots els elements que queden del bloc [systemitem].Taskomatic. representen els processos que s'executen al client {productname}.

source: To use SSH Push, you must have the SSH daemon running on the client, and reachable by the [systemitem]``salt-api`` daemon running on the {productname} Server. Additionally, the required Python version will be deployed with the {salt} Bundle on the client system.
ca: Per utilitzar SSH Push, heu de tenir el dimoni SSH funcionant al client, i accessible pel dimoni [systemitem].salt-api. executant-se al servidor {productname}. A més, la versió requerida de Python es desplegarà amb el paquet {salt} al sistema client.

source: Before beginning with the following registering procedure, define an activation key with the SSH Push contact method configured. This method expects that there is a direct connection with HTTPS to the Server.
ca: Abans de començar amb el següent procediment de registre, defineix una clau d'activació amb el mètode de contacte SSH Push configurat. Aquest mètode espera que hi hagi una connexió directa amb HTTPS al servidor.

source: You need to use the {webui} or API to register these clients with the {productname} Server. See the following procedure or example.
ca: Heu d'utilitzar el {webui} o API per registrar aquests clients amb el servidor {productname}. Vegeu el procediment o exemple següent.

source: Procedure: Registering Clients With SSH Push
ca: Procediment: Registre de clients amb la {webui}

source: In the {productname} {webui}, navigate to menu:Systems[Bootstrapping] and complete the appropriate fields.
ca: A {productname} {webui}, navegueu al menú:Systems[Bootstrapping] i completeu els camps apropiats.
ja: {productname}の{webui}で、menu:システム[ブートストラップ]に移動し、該当するフィールドに入力します。
ko: {productname} {webui}에서 menu:시스템[부트스트랩]으로 이동하여 해당 필드를 완성합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[引导]，然后填写相应的字段。

source: Select an activation key with the SSH Push contact method configured. For more information about activation keys, see xref:client-configuration:activation-keys.adoc[].
ca: Primer heu de crear una clau d'activació, per utilitzar l'script bootstrap o el mètode de la línia d'ordres. Per obtenir més informació sobre la creació de claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].

source: Check the [systemitem]``Manage system completely via SSH`` checkbox.
ca: Marqueu la casella [systemitem].Gestioneu el sistema completament mitjançant SSH..
ja: ［[systemitem]``Manage System Completely via SSH``］（SSHでシステムを完全に管理する）チェックボックスにチェックを付けます。
ko: [systemitem]``SSH를 통해 시스템을 완전히 관리`` 확인란을 선택합니다.
zh_cn: 选中[systemitem]``完全通过 SSH 管理系统``复选框。

source: Confirm that the system has been registered correctly by navigating to menu:Systems[Overview].
ca: Confirmeu que el sistema s'ha registrat correctament navegant al menú:Systems[Overview].
ja: menu:システム[概要]に移動して、システムが正しく登録されたことを確認します。
ko: menu:시스템[개요]로 이동하여 시스템이 올바르게 등록되었는지 확인합니다.
zh_cn: 导航到menu:系统[概览]，确认该系统已正确注册。

source: Example: API Access to Push via SSH
ca: Exemple: accés de l'API a Push via SSH
ja: 例: SSHでのプッシュへのAPIアクセス
ko: 예: SSH를 통한 푸시에 대한 API 액세스
zh_cn: 例如：使用 API 访问通过 SSH 推送方法

source: You can use the API to manage which contact method to use. This example Python code sets the contact method to ``ssh-push``.
ca: Podeu utilitzar l'API per gestionar quin mètode de contacte utilitzar. Aquest exemple de codi Python estableix el mètode de contacte a thessh-push..
ja: APIを使用して、使用する接続メソッドを管理できます。 このPythonコードの例では、接続メソッドが``ssh-push``に設定されます。
ko: API를 사용해 어떤 연결 방법을 사용할지 관리할 수 있습니다. 다음 Python 코드 예제에서는 연결 방법을 ``ssh-push``로 설정합니다.
zh_cn: 您可以使用 API 来管理要使用的联系方法。下面的示例 Python 代码将联系方法设为 ``ssh-push``。

source: client = xmlrpclib.Server(MLM_HOST + "/rpc/api", verbose=0) key = client.auth.login(MLM_LOGIN, MLM_PASSWORD) client.system.setDetails(key, 1000012345, {'contact_method' : 'ssh-push'})
ca: client . xmlrpclib.Servidor(MLMHOST + "/rpc/api", verbose",0) clau , client.auth.login(MLMLOGIN, MLMPASSWORD) client.system.setDetails(clau, 1000012345, {'contactmethod' : 'ssh-push'})

source: Available Parameters
ca: Paràmetres disponibles

source: When you are configuring SSH Push, you can modify parameters that are used when a system is registered, including the host, activation key, and password. The password is used only for bootstrapping, it is not saved anywhere. All future SSH sessions are authorized via a key/certificate pair. These parameters are configured in menu:Systems[Bootstrapping].
ca: Quan esteu configurant SSH Push, podeu modificar els paràmetres que s'utilitzen quan un sistema està registrat, incloent-hi l'amfitrió, la clau d'activació i la contrasenya. La contrasenya només s'utilitza per a l'arrencada, no es desa enlloc. Totes les futures sessions SSH s'autoritzen a través d'un parell de claus/certificats. Aquests paràmetres es configuren al menú:Systems[Bootstrapping].

source: You can also configure persistent parameters that are used system-wide, including the sudo user to access the system as an unprivileged user instead of as root.
ca: Per raons de seguretat, és possible que vulgueu utilitzar sudo amb SSH, per accedir al sistema com un usuari sense privilegis en lloc de com a root.

source: Ensure you have the latest [path]``spacewalk-taskomatic`` and [path]``spacewalk-certs-tools`` packages installed on the {productname} Server.
ca: Assegureu-vos que teniu els últims paquets [path].spacewalk-taskomatic and i [path].spacewalk-certs-tools. instal·lats al servidor {productname}.
ja: 最新の[path]``spacewalk-taskomatic``パッケージおよび[path]``spacewalk-certs-tools``パッケージが{productname}サーバにインストールされていることを確認してください。
ko: {productname} 서버에 최신 [path]``spacewalk-taskomatic`` 및 [path]``spacewalk-certs-tools`` 패키지가 설치되어 있는지 확인합니다.
zh_cn: 确保您已在 {productname} 服务器上安装最新的 [path]``spacewalk-taskomatic`` 和 [path]``spacewalk-certs-tools`` 软件包。

source: After changing this configuration parameter you must restart services such as [systemitem]``salt-secrets-config.service``, [systemitem]``tomcat.service``, and [systemitem]``taskomatic.service``.
ca: Després de canviar aquest paràmetre de configuració heu de reiniciar serveis com [systemitem].salt-secrets-config.service., [systemitem].tomcat.service., i [systemitem].taskomatic.service..

source: To cover all needed services, it is the best to restart the {productname} Server as root. Outside of the container, from the container host, enter:
ca: Per cobrir tots els serveis necessaris, és millor reiniciar el servidor {productname} com a root. Fora del contenidor, des de l'amfitrió del contenidor, introduïu:

source: Action Execution
ca: Execució d'acció
ja: アクションの実行
ko: 작업 실행
zh_cn: 操作的执行

source: The SSH Push feature uses taskomatic to execute scheduled actions using [command]``salt-ssh``. The taskomatic job periodically checks for scheduled actions and executes them. The SSH Push feature executes a complete [command]``salt-ssh`` call based on the scheduled action.
ca: La característica SSH Push utilitza taskomatic per a executar accions programades utilitzant [ordre].salt-ssh.. El treball taskomatic comprova periòdicament les accions programades i les executa. La funció SSH Push executa una crida completa [ordre].salt-ssh. basada en l'acció programada.

source: By default, twenty Salt SSH actions can be executed at a time. You can increase the number of actions that can be executed in parallel, by adding these lines to your configuration file, and adjusting the value of ``parallel_threads`` upwards. We recommend you keep the number of parallel actions low, to avoid problems:
ca: Per defecte, es poden executar vint accions Salt SSH alhora. Podeu augmentar el nombre d'accions que es poden executar en paral·lel, afegint aquestes línies al fitxer de configuració i ajustant el valor de .parallelthreads. cap amunt. Us recomanem mantenir baix el nombre d'accions paral·leles, per evitar problemes:
ja: デフォルトでは、20個のSalt SSHアクションを同時に実行できます。 同時実行できるアクションの個数を増やすことができます。そのためには、次の行を設定ファイルに追加し、``parallel_threads``の値を調整します。 問題の発生を回避するために、同時実行アクション数を低い値に保つことをお勧めします。
ko: 기본적으로 한 번에 20건의 Salt SSH 작업을 실행할 수 있습니다. 구성 파일에 다음과 같은 줄을 추가하고 ``parallel_threads``의 값을 상향 조정하여 병렬로 실행할 수 있는 작업의 수를 늘릴 수 있습니다. 문제를 방지하기 위해 병렬 작업의 수를 다음과 같이 낮게 유지하는 것이 좋습니다.
zh_cn: 默认可以同时执行 20 项 Salt SSH 操作。您可以在配置文件中添加下面几行，并上调 ``parallel_threads`` 的值，以增加可同时执行的操作数。建议您将并行操作数设置为较低的值，以免出现问题：

source: This adjusts the number of actions that can run in parallel on any one client and the total number of worker threads used by taskomatic. If actions needs to be run on multiple clients, actions are always executed sequentially on each client.
ca: Això ajusta el nombre d'accions que poden executar-se en paral·lel en qualsevol client i el nombre total de fils de treball utilitzats per taskomatic. Si les accions s'han d'executar en múltiples clients, les accions sempre s'executen seqüencialment en cada client.
ja: 1つのクライアントで同時実行できるアクションの個数とtaskomaticで使用されるワーカスレッドの合計数が調整されます。 複数のクライアントでアクションを実行する必要がある場合、アクションは常に各クライアントで順次実行されます。
ko: 이렇게 하여 어느 한 곳의 클라이언트에서 병렬로 실행할 수 있는 작업의 수와 Taskomatic이 사용하는 작업자 스레드의 총 개수를 조정할 수 있습니다. 작업을 여러 클라이언트에서 실행해야 하는 경우 작업은 항상 각 클라이언트에서 순차적으로 실행됩니다.
zh_cn: 这样可调整任何客户端上同时运行的操作数，以及 taskomatic 使用的工作器线程总数。如果需要在多个客户端上运行操作，则每个客户端上的操作始终按顺序执行。

source: If the clients are connected through a proxy, you need to adjust the ``MaxSessions`` settings on the proxy. In this case, set the number of parallel connections to be three times the total number of clients.
ca: Si els clients estan connectats a través d'un servidor intermediari, heu d'ajustar la configuració de .MaxSessions. al servidor intermediari. En aquest cas, establir el nombre de connexions paral·leles a tres vegades el nombre total de clients.
ja: クライアントがプロキシ経由で接続されている場合、プロキシの``MaxSessions``設定を調整する必要があります。 この場合、平行接続数を総クライアント数の3倍に設定します。
ko: 클라이언트가 프록시를 통해 연결되어 있는 경우 프록시에서 ``MaxSessions`` 설정을 조정해야 합니다. 이 경우 병렬 연결의 수를 클라이언트 총 수의 세 배로 설정합니다.
zh_cn: 如果客户端是通过代理连接的，则需要调整代理上的 ``MaxSessions`` 设置。在此情况下，请将并行连接的数量设置为客户端总数的三倍。

source: Future Features
ca: Funcions futures

source: There are some features that are not yet supported on SSH Push. These features do not work on Salt SSH clients:
ca: Hi ha algunes característiques que encara no estan suportades en SSH Push. Aquestes característiques no funcionen en clients Salt SSH:

source: OpenSCAP auditing
ca: Auditoria OpenSCAP
ja: OpenSCAPの監査
ko: OpenSCAP 감사
zh_cn: OpenSCAP 审计

source: Beacons, resulting in:
ca: Beacons, resultant en:
ja: ビーコン。次の結果になります。
ko: Beacons, 이로 인해
zh_cn: 导致以下事件的信标：

source: Installing a package on a system using [command]``zypper`` does not invoke the package refresh.
ca: Instal·lar un paquet en un sistema utilitzant [command].zypper. no invoca l'actualització del paquet.
ja: [command]``zypper``を使用してシステムのパッケージをインストールしても、パッケージ更新が呼び出されません。
ko: [command]``zypper``를 사용해 시스템에 패키지를 설치해도 패키지 새로 고침이 호출되지 않습니다.
zh_cn: 使用 [command]``zypper`` 在系统上安装软件包不会调用软件包刷新。

source: Virtual Host functions (for example, a host to guests) does not work if the virtual host system is Salt SSH-based.
ca: Les funcions d'amfitrió virtual (per exemple, un amfitrió per a convidats) no funcionen si el sistema d'amfitrió virtual està basat en Salt SSH.
ja: 仮想ホストシステムがSalt SSHベースの場合、仮想ホスト関数(たとえば、ゲストへのホスト)が動作しません。
ko: 가상 호스트 기능(예: 게스트에 대한 호스트)은 가상 호스트 시스템이 Salt SSH 기반인 경우 작동하지 않습니다.
zh_cn: 如果虚拟主机系统基于 Salt SSH，则虚拟主机功能（例如 Guest 主机）将无法正常工作。

source: For more information:
ca: Informació personalitzada del sistema

source: about Salt SSH in general, see xref:specialized-guides:salt/salt-ssh.adoc[] and https://docs.saltproject.io/en/latest/topics/ssh/.
ca: sobre Salt SSH en general, vegeu xref: Specialized-guides:salt/salt-ssh.adoc[] i https://docs.saltproject.io/en/latest/topics/ssh/.

source: about SSH key rotation, see xref:specialized-guides:salt/salt-ssh.adoc#salt.ssh.key_rotation[].
ca: Quant a la rotació de la clau SSH, vegeu xref:specialized-guides:salt/salt-ssh.adoc].salt.ssh.keyrotation[].

source: Custom System Information
ca: Informació personalitzada del sistema
ja: カスタムシステム情報
ko: 사용자 정의 시스템 정보
zh_cn: 自定义系统信息

source: You can include customized system information about your clients. System information is defined as [literal]``key:value`` pairs, which can be assigned to clients. For example, you can define a [literal]``key:value pair`` for a particular processor, then assign that key to all clients that have that processor installed. Custom system information is categorized, and can be searched using the {productname} {webui}.
ca: Pots incloure informació personalitzada del sistema sobre els teus clients. La informació del sistema es defineix com a parells [literals].clau:valor., que es poden assignar als clients. Per exemple, podeu definir un parell [literal].clau:valor. per a un processador en particular, llavors assigneu aquesta clau a tots els clients que tinguin aquest processador instal·lat. La informació personalitzada del sistema està categoritzada, i es pot cercar utilitzant el {productname} {webui}.

source: Before you begin, you need to create a key that allows you to store custom information.
ca: Abans de començar, heu de crear una clau que us permeti emmagatzemar informació personalitzada.
ja: 始める前に、カスタム情報を保存できるキーを作成する必要があります。
ko: 시작하기 전에 사용자 정의를 저장할 수 있게 허용하는 키를 생성해야 합니다.
zh_cn: 开始前，需要创建可让您存储自定义信息的键。

source: Procedure: Creating a Custom System Information Key
ca: Procediment: Creació d'una clau d'informació personalitzada del sistema
ja: プロシージャ: カスタムシステム情報のキーの作成
ko: 절차: 사용자 정의 시스템 정보 키 생성
zh_cn: 过程：创建自定义系统信息键

source: In the {productname} {webui}, navigate to menu:Systems[Custom System Info], and click btn:[Create Key].
ca: A la {productname} {webui}, navegueu al menú:Systems[Informació del sistema personalitzat], i feu clic a btn:[Crea clau].
ja: {productname}の{webui}で、menu:システム[カスタムシステム情報]に移動し、btn:[キーの作成]をクリックします。
ko: {productname} {webui}에서 menu:시스템[사용자 정의 시스템 정보]로 이동하여 btn:[키 생성]을 클릭합니다.
zh_cn: 在 {productname} {webui}中，导航到menu:系统[自定义系统信息]，然后单击 btn:[创建键]。

source: In the [guimenu]``Key Label`` field, add a name for your key. Do not use spaces. For example, ``intel-x86_64-quadcore``.
ca: Al camp [guimenu].Etiqueta de la clau., afegiu un nom per a la vostra clau. No facis servir espais. Per exemple, .intel-x8664-quadcore..
ja: ［[guimenu]``キーラベル``］フィールドにキーの名前を追加します。 スペースは使用しません。 例: ``intel-x86_64-quadcore``。
ko: [guimenu]``키 레이블`` 필드에 키의 이름을 추가합니다. 공백을 사용하면 안 됩니다. 예를 들어, ``intel-x86_64-quadcore``를 추가합니다.
zh_cn: 在[guimenu]``键标签``字段中，添加键的名称。不要使用空格。例如，``intel-x86_64-quadcore``。

source: In the [guimenu]``Description`` field, provide any additional information required.
ca: Al camp [guimenu].Descripció., proporcioneu qualsevol informació addicional requerida.
ja: ［[guimenu]``説明``］フィールドに必要な追加情報を入力します。
ko: [guimenu]``설명`` 필드에 필요한 추가 정보를 입력합니다.
zh_cn: 在[guimenu]``说明``字段中，提供任何其他所需信息。

source: Repeat for each key you require.
ca: Repeteix per a cada clau que necessitis.
ja: 必要な各キーで操作を繰り返します。
ko: 필요한 각 키에 이 작업을 반복합니다.
zh_cn: 对需要创建的每个键重复以上步骤。

source: The information is available via {salt} pillar. You can retrieve this information with a command such as:
ca: La informació està disponible a través del pilar {salt}. Podeu recuperar aquesta informació amb una ordre com:

source: salt $minionid pillar.get custom_info:key1
ca: sal $minionid pilar.get custominfo:key1

source: This command will result in an output such as:
ca: Aquesta ordre resultarà en una sortida com:
ja: このコマンドは、次のような出力になります。
ko: 이 명령을 실행한 후의 출력은 다음과 같습니다.
zh_cn: 此命令将产生类似如下的输出：

source: When you have created some custom system information keys, you can apply them to clients.
ca: Quan hàgiu creat algunes claus personalitzades d'informació del sistema, les podeu aplicar als clients.
ja: カスタムシステム情報キーを作成するとき、キーをクライアントに適用できます。
ko: 사용자 정의 시스템 정보 키를 몇 개 생성했으면 이 키를 클라이언트에 적용할 수 있습니다.
zh_cn: 创建了一些自定义系统信息键之后，您便可以将其应用到客户端。

source: Procedure: Applying Custom Information Keys to Clients
ca: Procediment: Aplicació de claus d'informació personalitzades als clients
ja: プロシージャ: カスタム情報キーをクライアントに適用する
ko: 절차: 사용자 정의 정보 키를 클라이언트에 적용
zh_cn: 过程：将自定义信息键应用到客户端

source: In the {productname} {webui}, navigate to [guimenu]``Systems``, click the client to apply custom information to, and navigate to the menu:Details[Custom Info] tab.
ca: A la {productname} {webui}, navegueu a [guimenu].Sistemes., feu clic al client per aplicar informació personalitzada i navegueu a la pestanya menú:Detalls[Informació personalitzada].
ja: {productname}の{webui}で、［[guimenu]``システム``］に移動し、カスタム情報を適用するクライアントをクリックし、menu:詳細[カスタム情報]タブに移動します。
ko: {productname} {webui}에서 [guimenu]``시스템``으로 이동하여 사용자 정의 정보를 적용할 클라이언트를 클릭하고, menu:상세 정보[사용자 정의 정보] 탭으로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到[guimenu]``系统``，单击要应用自定义信息的客户端，然后导航到menu:细节[自定义信息]选项卡。

source: Click btn:[Create Value].
ca: Feu clic a btn:[Crea valor].
ja: btn:[値の作成]をクリックします。
ko: btn:[값 생성]을 클릭합니다.
zh_cn: 单击 btn:[创建值]。

source: Locate the value you want to apply, and click the key label.
ca: Localitzeu el valor que voleu aplicar i feu clic a l'etiqueta de la clau.
ja: 適用する値を見つけ、キーラベルをクリックします。
ko: 적용하려는 값을 찾아 키 레이블을 클릭합니다.
zh_cn: 找到要应用的值，然后单击键标签。

source: In the [guimenu]``Value`` field, provide any additional information.
ca: Al camp [guimenu].Valor., proporcioneu qualsevol informació addicional.
ja: ［[guimenu]``値``］フィールドに追加情報を入力します。
ko: [guimenu]``값`` 필드에 추가 정보를 입력합니다.
zh_cn: 在[guimenu]``值``字段中，提供任何其他信息。

source: Click btn:[Update Key] to apply the custom information to the client.
ca: Feu clic a btn:[Update Key] per aplicar la informació personalitzada al client.
ja: btn:[キーの更新]をクリックしてカスタム情報をクライアントに適用します。
ko: btn:[키 업데이트]를 클릭하여 사용자 정의 정보를 클라이언트에 적용합니다.
zh_cn: 单击 btn:[更新键] 以向客户端应用自定义信息。

source: For more information about configuration management, see xref:client-configuration:configuration-management.adoc[].
ca: Per obtenir més informació sobre la gestió de la configuració, vegeu xref:client-configuration:configuration-management.adoc[].
ja: 設定管理の詳細については、xref:client-configuration:configuration-management.adoc[]を参照してください。
ko: 구성 관리에 대한 자세한 설명은 xref:client-configuration:configuration-management.adoc[]에서 참조하십시오.
zh_cn: 有关配置管理的详细信息，请参见 xref:client-configuration:configuration-management.adoc[]。

source: Client Deletion
ca: Supressió del client
ja: クライアントの削除
ko: 클라이언트 삭제
zh_cn: 客户端删除

source: If you need to remove a client from your {productname} Server, you can:
ca: Hi ha diverses maneres de registrar clients al vostre servidor {productname}.

source: use the {webui} to delete it
ca: utilitza el {webui} per suprimir-lo

source: remove a client from the command line.
ca: Elimina un client de la línia d'ordres.

source: Delete a Client with the {webui}
ca: Registra clients amb {webui}
ja: {webui}でクライアントを削除する
ko: {webui}를 사용한 클라이언트 삭제
zh_cn: 使用 {webui} 删除客户端

source: Procedure: Deleting a client
ca: Procediment: suprimir un client

source: In the {productname} {webui}, navigate to menu:Systems[System List] and select the client to delete.
ca: A {productname} {webui}, navegueu al menú:Systems[Llista de sistemes] i seleccioneu el client a suprimir.
ko: {productname} {webui}에서 menu:시스템[시스템 목록]으로 이동하여 삭제하려는 클라이언트를 선택합니다.
zh_cn: 在 {productname} {webui}中，导航到menu:系统[系统列表]，然后选择要删除的客户端。

source: Click btn:[Delete System].
ca: Feu clic a btn:[Suprimeix el sistema].
ja: btn:[システムの削除]をクリックします。
ko: btn:[시스템 삭제]를 클릭합니다.
zh_cn: 单击 btn:[删除系统]。
