Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: The contents of the uploaded file is shown in the [guimenu]``File Contents`` field.
ja: アップロードしたファイルの内容が［[guimenu]``ファイルの内容``］フィールドに表示されます。
ko: 업로드한 파일의 내용이 [guimenu]``파일 내용`` 필드에 표시됩니다.
zh_cn: [guimenu]``文件内容``字段中会显示上载的文件的内容。

source: If you need to make edits, you can do so directly.
ja: 編集する必要がある場合、直接編集できます。
ko: 편집하려면 직접할 수 있습니다.
zh_cn: 如果您需要编辑其内容，可以直接编辑。

source: Click btn:[Create] to save your changes and store the profile.
ja: btn:[作成]をクリックして変更を保存し、プロファイルを保存します。
ko: btn:[생성]을 클릭하여 변경 사항을 저장하고 프로파일을 보관합니다.
zh_cn: 单击 btn:[创建] 以保存更改并存储配置文件。

source: When you have created an autoinstallation profile, you can edit it by navigating to menu:Systems[Autoinstallation > Profiles] and selecting the profile you want to edit. Make the desired changes and save your settings by clicking btn:[Create].
ja: 自動インストールプロファイルを作成するとき、これを編集できます。そのためには、menu:システム[自動インストール > プロファイル]に移動し、編集するプロファイルを選択します。 btn:[作成]をクリックして、必要な変更を行い、設定を保存します。
ko: 자동 설치 프로파일을 생성했으면 menu:시스템[자동 설치 > 프로파일]로 이동해 편집하려는 프로파일을 선택하여 편집할 수 있습니다. 원하는 대로 변경한 후 btn:[생성]을 클릭하여 설정을 저장합니다.
zh_cn: 创建自动安装配置文件后，您可以导航到menu:系统[自动安装 > 配置文件]，然后选择要编辑的配置文件进行编辑。进行所需更改，然后单击 btn:[创建] 保存您的设置。

source: If you change the [guimenu]``Virtualization Type`` of an existing {kickstart} profile, it might also modify the bootloader and partition options, potentially overwriting any custom settings. Carefully review the [guimenu]``Partitioning`` tab to verify these settings before making changes.
ja: 既存の{kickstart}プロファイルの［[guimenu]``仮想化タイプ``］を変更する場合、ブートローダおよびパーティションのオプションも変更する場合があり、カスタム設定を上書きすることもあります。 ［[guimenu]``パーティション設定``］タブを注意深く確認して、変更前にこれらの設定を確認してください。
ko: 기존 {kickstart} 프로파일의 [guimenu]``가상화 유형``을 변경하면 부트로더 및 파티션 옵션이 수정되어 사용자 정의 설정이 덮어쓰기될 수도 있습니다. [guimenu]``파티셔닝`` 탭을 주의 깊게 검토하여 이 설정을 확인한 후에 변경하십시오.
zh_cn: 如果您更改了现有 {kickstart} 配置文件的[guimenu]``虚拟化类型``，则可能也会修改引导加载程序和分区选项，并可能重写任何自定义设置。请在更改前仔细查看[guimenu]``分区``选项卡以校验这些设置。

source: Automatically Register Guests
ja: ゲストを自動的に登録する
ko: 게스트를 자동으로 등록
zh_cn: 自动注册 Guest

source: When you install VM guests automatically, they are not registered to {productname}. If you want your guests to be automatically registered as soon as they are installed, you can add a section to the autoinstallation profile that invokes a bootstrap script, and registers the guests.
ja: VMゲストを自動的にインストールするとき、{productname}には登録されません。 ゲストをインストールしてすぐに自動的に登録する場合、ブートストラップスクリプトを呼び出してゲストを登録する自動インストールプロファイルにセクションを追加できます。
ko: VM 게스트를 자동으로 설치하는 경우 {productname}에 등록되지 않습니다. 게스트가 설치되자마자 자동으로 등록되게 하려면 부트스트랩 스크립트를 호출하고 게스트를 등록하는 자동 설치 프로파일에 섹션을 추가할 수 있습니다.
zh_cn: 自动安装 VM Guest 后，它们并不会注册到 {productname} 中。如果您希望 Guest 在安装后立即自动注册，您可以在自动安装配置文件中添加一段用于调用引导脚本并注册 Guest 的内容。

source: This section gives instructions for adding a bootstrap script to an existing {ay} profile.
ja: このセクションでは、ブートストラップスクリプトを既存の{ay}プロファイルに追加する手順について説明します。
ko: 이 섹션에서는 부트스트랩 스크립트를 기존 {ay} 프로파일에 추가하는 것에 관한 지침을 제공합니다.
zh_cn: 此部分提供向现有 {ay} 配置文件添加引导脚本的指令。

source: For more information about creating a bootstrap script, see xref:client-configuration:registration-bootstrap.adoc[]. For instructions on how to do this for {kickstart}, refer to the Red Hat documentation for your installation.
ja: ブートストラップスクリプトの作成の詳細については、xref:client-configuration:registration-bootstrap.adoc[]を参照してください。 {kickstart}でこの作業を行う方法については、Red Hatのインストール関連ドキュメントを参照してください。
ko: 부트스트랩 스크립트 생성에 대한 자세한 내용은 xref:client-configuration:registration-bootstrap.adoc[]에서 확인할 수 있습니다. {kickstart}에 대해 이 작업을 하는 방법에 대한 지침은 해당 설치에 대한 Red Hat 설명서를 참조하십시오.
zh_cn: 有关创建引导脚本的详细信息，请参见 xref:client-configuration:registration-bootstrap.adoc[]。有关如何针对 {kickstart} 执行此操作的说明，请参见适用于您的安装的 Red Hat 文档。

source: Procedure: Adding a Bootstrap Script to an {ay} Profile
ja: プロシージャ: ブートストラップスクリプトを{ay}プロファイルに追加する
ko: 절차: 부트스트랩 스크립트를 {ay} 프로파일에 추가
zh_cn: 过程：在 {ay} 配置文件中添加引导脚本

source: Ensure your bootstrap script contains the activation key for the VM guests you want to register with it, and that is located on the host at [path]``/srv/www/htdocs/pub/bootstrap_vm_guests.sh``.
ja: 登録するVMゲストのアクティベーションキーがブートストラップスクリプトに含まれていることを確認してください。これはホストの[path]``/srv/www/htdocs/pub/bootstrap_vm_guests.sh``にあります。
ko: 등록하려는 VM 게스트에 대한 활성화 키를 부트스트랩 스크립트가 포함하는지, 이 키가 [path]``/srv/www/htdocs/pub/bootstrap_vm_guests.sh``의 호스트에 있는지 확인합니다.
zh_cn: 确保引导脚本包含要注册的 VM Guest 的激活密钥，并且脚本位于主机上的 [path]``/srv/www/htdocs/pub/bootstrap_vm_guests.sh`` 中。

source: In the {productname} {webui}, navigate to menu:Systems[Autoinstallation > Profiles], and select the {ay} profile to associate this script with.
ja: {productname}の{webui}で、menu:システム[自動インストール > プロファイル]に移動し、このスクリプトを関連付ける{ay}プロファイルを選択します。
ko: {productname} {webui}에서 menu:시스템[자동 설치 > 프로파일]로 이동하여 이 스크립트를 연결할 {ay} 프로파일을 선택합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[自动安装 > 配置文件]，然后选择要与此脚本关联的 {ay} 配置文件。

source: In the [guimenu]``File Contents`` field, add this snippet at the end of the file, immediately before the closing ``</profile>`` tag.
ja: ［[guimenu]``ファイルの内容``］フィールドで、次のスニペットをファイルの末尾(``</profile>``タグの直前)に追加します。
ko: [guimenu]``파일 내용`` 필드에서 이 코드 조각을 파일 끝의 종료 태그 ``</profile>`` 바로 앞에 추가합니다.
zh_cn: 在[guimenu]``文件内容``字段中，于文件末尾的 ``</profile>`` 结束标记前面添加以下代码段。

source: Ensure you replace the example IP address [literal]``192.168.1.1`` in the snippet with the correct IP address for your {productname} Server:
ja: スニペットのIPアドレス例[literal]``192.168.1.1``を、使用中の{productname}サーバの正しいIPアドレスに置き換えてください。
ko: 아래 코드 조각의 예시 IP 주소 [literal]``192.168.1.1``을 {productname} 서버의 올바른 IP 주소로 바꿉니다.
zh_cn: 务必将代码段中的示例 IP 地址 [literal]``192.168.1.1`` 替换为 {productname} 服务器的正确 IP 地址：

source: Click menu:Update[] to save your changes.
ja: ［menu:更新[]］をクリックして変更を保存します。
ko: menu:업데이트[]를 클릭하여 변경 사항을 저장합니다.
zh_cn: 单击 menu:更新[] 保存您的更改。

source: If your {ay} profile already contains a ``<scripts>`` section, do not add a second one. Place the bootstrap snippet inside the existing ``<scripts>`` section.
ja: {ay}プロファイルに``<scripts>``セクションがすでに含まれている場合、2つ目のセクションを追加しないでください。 既存の``<scripts>``セクション内にブートストラップスニペットを配置します。
ko: {ay} 프로파일에 ``<scripts>`` 섹션이 이미 포함되어 있는 경우 이 섹션을 추가하지 마십시오. 기존 ``<scripts>`` 섹션 안에 부트스트랩 코드 조각을 배치합니다.
zh_cn: 如果 {ay} 配置文件已包含 ``<scripts>`` 部分，请勿再添加， 而是将引导代码段放在现有 ``<scripts>`` 部分内。

source: Each VM host can only install one guest at a time. If you are scheduling more than one autoinstallation, make sure you time them so that the next installation does not begin before the previous one has completed. If a guest installation starts while another one is still running, the running installation is canceled.
ja: 各VMホストが同時にインストールできるゲストは1つだけです。 複数の自動インストールをスケジュールしている場合、前のインストールが完了する前に次のインストールが始まらないようにスケジュールしてください。 ゲストのインストールが別のインストールの実行中に開始すると、実行中のインストールはキャンセルされます。
ko: 각 VM 호스트는 한 번에 한 게스트만 설치할 수 있습니다. 두 건 이상의 자동 설치 일정을 잡는 경우 이전 설치가 완료되기 전에 다음번 설치가 시작되지 않도록 시간을 안배해야 합니다. 다른 게스트 자동 설치가 아직 실행 중일 때 게스트 설치가 시작되면 실행 중인 설치가 취소됩니다.
zh_cn: 每个 VM 主机一次只能安装一个 Guest。如果您要安排多个自动安装，请务必安排合理的时间，确保下一个安装不会在现有安装完成前开始。如果某个 Guest 安装在另一个安装仍在进行时开始，则正在进行的安装可能会被取消。

source: In the {productname} {webui}, navigate to menu:Systems[Overview], and select the VM host you want to install guests on.
ja: {productname}の{webui}で、menu:システム[概要]に移動し、ゲストをインストールするVMホストを選択します。
ko: {productname} {webui}에서 menu:시스템[개요]로 이동하여 게스트를 설치하려는 VM 호스트를 선택합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[概览]，然后选择要在其中安装 Guest 的 VM 主机。

source: Select the autoinstallation profile you want to use, and specify a unique name for the guest.
ja: 使用する自動インストールプロファイルを選択し、ゲストの一意の名前を指定します。
ko: 사용하려는 자동 설치 프로파일을 선택하고, 게스트에 고유한 이름을 지정합니다.
zh_cn: 选择要使用的自动安装配置文件，并为 Guest 指定唯一的名称。

source: Choose a proxy if applicable and enter a schedule.
ja: 該当する場合にはプロキシを選択し、スケジュールを入力します。
ko: 해당되는 경우 프록시를 선택하고 일정을 입력합니다.
zh_cn: 选择代理（如果适用）并输入日程安排。

source: To change the guest's hardware profile and configuration options, click btn:[Advanced Options].
ja: ゲストのハードウェアのプロファイルおよび設定オプションを変更するには、btn:[高度なオプション]をクリックします。
ko: 게스트의 하드웨어 프로파일 및 구성 옵션을 변경하려면 btn:[고급 옵션]을 클릭합니다.
zh_cn: 要更改 Guest 的硬件配置文件和配置选项，请单击 btn:[高级选项]。

source: Click btn:[Schedule Autoinstallation and Finish] to complete.
ja: btn:[自動インストールをスケジュールしてから終了する]をクリックして完了します。
ko: btn:[자동 설치 일정 잡기 후 완료]를 클릭하여 완료합니다.
zh_cn: 单击 btn:[安排自动安装并完成] 以完成设置。

source: Manage VM Guests
ja: VMゲストの管理
ko: VM 게스트 관리
zh_cn: 管理 VM Guest

source: You can use the {productname} {webui} to manage your VM Guests, including actions like shutting down, restarting, and adjusting CPU, and memory allocations.
ja: {productname}の{webui}を使用して、CPUやメモリの割り当て調整、シャットダウン、再起動のようなアクションなど、VMゲストを管理できます。
ko: {productname} {webui}를 사용하여 종료, 재시작, CPU 및 메모리 할당 조정 등 작업과 같은 VM 게스트를 관리할 수 있습니다.
zh_cn: 您可以使用 {productname} {webui} 来管理 VM Guest，包括执行关机、重启动以及调整 CPU 和内存分配的操作。

source: In the {productname} {webui}, navigate to menu:Systems[System List], and click on the VM host for the guests you want to manage. Navigate to the [guimenu]``Virtualization`` tab to see all guests registered to this host, and access the management functions.
ja: {productname}の{webui}で、menu:システム[システム一覧]に移動し、管理するゲストのVMホストをクリックします。 ［[guimenu]``仮想化``］タブに移動し、このホストに登録されているすべてのゲストを表示し、管理機能にアクセスします。
ko: {productname} {webui}에서 menu:시스템[시스템 목록]으로 이동하여 관리하려는 게스트의 VM 호스트를 클릭합니다. [guimenu]``가상화`` 탭으로 이동하여 이 호스트에 등록된 모든 게스트를 확인하고 관리 기능에 액세스합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[系统列表]，然后单击要管理的 Guest 的 VM 主机。导航到[guimenu]``虚拟化``选项卡以查看所有注册到此主机中的 Guest，并访问管理功能。

source: Virtualization
ja: 仮想化
ko: 시각화
zh_cn: 虚拟化

source: The range of capabilities that virtualized clients have depends on the third-party virtualization provider you choose.
ja: 仮想化されたクライアントにある機能の範囲は、選択したサードパーティ仮想化プロバイダによって決まります。
ko: 가상화 클라이언트가 보유한 기능의 범위는 사용자가 선택하는 타사 가상화 공급자에 따라 달라집니다.
zh_cn: 虚拟化客户端具有的功能范围取决于您选择的第三方虚拟化提供者。

source: Xen and KVM hosts and guests can be managed directly in {productname}. This enables you to autoinstall hosts and guests using {ay} or {kickstart}, and manage guests in the {webui}.
ja: XenおよびKVMのホストおよびゲストは{productname}で直接管理できます。 そうすると、{ay}または{kickstart}を使用してホストおよびゲストを自動インストールし、{webui}でゲストを管理できます。
ko: Xen 및 KVM 호스트 및 게스트는 {productname}에서 직접 관리할 수 있습니다. 이를 통해 {ay} 또는 {kickstart}를 사용해 호스트 및 게스트를 자동 설치하고 {webui}에서 게스트를 관리할 수 있습니다.
zh_cn: 您可以直接在 {productname} 中管理 Xen 和 KVM 主机及 Guest。采用这种方式，您可以使用 {ay} 或 {kickstart} 自动安装主机和 Guest，并在 {webui} 中管理 Guest。

source: For VMWare, including VMWare vSphere, and Nutanix AHV, {productname} requires you to set up a virtual host manager (VHM) to control the VMs. This gives you control over the hosts and guests, but in a more limited way than available with Xen and KVM; {productname} cannot create or edit VMs on VMWare vSphere or Nutanix AHV.
ja: VMWare vSphere、Nutanix AHVなどのVMWareでは、{productname}は、仮想ホストマネージャ(VHM)を設定し、VMを制御する必要があります。 そうするとホストおよびゲストを制御できますが、XenおよびKVMで可能な制御方法より限定されます。 {productname}は、VMWare vSphereまたはNutanix AHVでVMを作成または編集できません。
ko: VMWare vSphere를 포함한 VMWare와 Nutanix AHV의 경우 {productname}는 가상 호스트 관리자(VHM)를 설정해 VM을 제어할 것을 사용자에게 요구합니다. 이를 통해 사용자는 호스트 및 게스트에 대한 제어권을 얻게 됩니다. 하지만 Xen 및 KVM에서보다는 더 제한적입니다. {productname}은(는) VMWare vSphere 또는 Nutanix AHV에서 VM을 생성하거나 편집할 수 없습니다.
zh_cn: 对于 VMWare（包括 VMWare vSphere）和 Nutanix AHV，{productname} 需要您设置虚拟主机管理器 (VHM) 来控制 VM。这样您便能控制主机和 Guest，但与使用 Xen 和 KVM 相比，受到的限制会更多。{productname} 无法在 VMWare vSphere 或 Nutanix AHV 上创建和编辑 VM。

source: Other third-party virtualization providers are not directly supported by {productname}. However, if your provider allows you to export a JSON configuration file for the VM, you can upload that configuration file to {productname} and manage it with a VHM.
ja: その他のサードパーティ仮想化プロバイダは{productname}では直接サポートされていません。 ただし、プロバイダでVMのJSON設定ファイルをエクスポートできる場合、その設定ファイルを{productname}にアップロードし、VHMで管理できます。
ko: 다른 타사 가상화 공급자는 {productname}가 직접 지원하지 않습니다. 하지만 공급자가 VM에 대한 JSON 구성 파일을 엑스포트하도록 허용하는 경우 이 구성 파일을 {productname}로 업로드하여 VHM으로 관리할 수 있습니다.
zh_cn: {productname} 不直接支持其他第三方虚拟化提供者。不过，如果您的提供者允许您导出 VM 的 JSON 配置文件，您可以将该配置文件上载到 {productname} 并使用 VHM 进行管理。

source: For more information about using VHMs to manage virtualization, see xref:client-configuration:vhm.adoc[].
ja: VHMを使用して仮想化を管理する方法の詳細については、xref:client-configuration:vhm.adoc[]を参照してください。
ko: VHM을 사용해 가상화를 관리하는 방법에 대한 자세한 내용은 xref:client-configuration:vhm.adoc[]을 참조하십시오.
zh_cn: 有关使用 VHM 来管理虚拟化的详细信息，请参见 xref:client-configuration:vhm.adoc[]。

source: When a client has the ``Virtualization Host`` system type, the [guimenu]``Virtualization`` tab is available in the System Details page for the client. The [guimenu]``Virtualization`` tab allows you to create and manage virtual guests, and manage storage pools and virtual networks.
ja: クライアントに［``仮想化ホスト``］システムタイプがある場合、クライアントの［システムの詳細］ページで［[guimenu]``仮想化``］タブを使用できます。 ［[guimenu]``仮想化``］タブでは、仮想ゲストを作成して管理し、ストレージプールおよび仮想ネットワークを管理できます。
ko: 클라이언트에 ``가상화 호스트`` 시스템 유형이 있는 경우 클라이언트의 시스템 정보 페이지에서 [guimenu]``가상화`` 탭을 제공합니다. [guimenu]``가상화`` 탭을 통해 가상 게스트를 생성 및 관리하고 저장소 풀 및 가상 네트워크를 관리할 수 있습니다.
zh_cn: 客户端具有``虚拟化主机``系统类型后，该客户端的“系统细节”页面中便会显示[guimenu]``虚拟化``选项卡。[guimenu]``虚拟化``选项卡可用于创建和管理虚拟 Guest，以及管理存储池和虚拟网络。

source: Create Virtual Guests
ja: 仮想ゲストの作成
ko: 가상 게스트 생성
zh_cn: 创建虚拟 Guest

source: You can add virtual guests to your virtualization hosts within the {productname} {webui}.
ja: {productname}の{webui}内で仮想ゲストを仮想化ホストに追加できます。
ko: {productname} {webui}에서 가상화 호스트에 가상 게스트를 추가할 수 있습니다.
zh_cn: 您可以在 {productname} {webui} 中向虚拟化主机添加虚拟 Guest。

source: Procedure: Creating a Virtual Guest
ja: プロシージャ: 仮想ゲストの作成
ko: 절차: 가상 게스트 생성
zh_cn: 过程：创建虚拟 Guest

source: In the {productname} {webui}, navigate to menu:Systems[Systems List], click the name of the virtualization host, and navigate to the [guimenu]``Virtualization`` tab.
ja: {productname}の{webui}で、menu:システム[システム一覧]に移動し、仮想化ホストの名前をクリックし、［[guimenu]``仮想化``］タブに移動します。
ko: {productname} {webui}에서 menu:시스템[시스템 목록]으로 이동하여 가상화 호스트의 이름을 클릭하고, [guimenu]``가상화`` 탭으로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[系统列表]，单击虚拟化主机的名称，然后导航到[guimenu]``虚拟化``选项卡。

source: In the [guimenu]``General`` section, complete these details:
ja: ［[guimenu]``全般``］セクションで、次の詳細を入力します。
ko: [guimenu]``일반`` 섹션에서 다음과 같은 상세 정보를 입력합니다.
zh_cn: 在[guimenu]``常规``部分，填写以下细节：

source: In the [guimenu]``Guests`` subtab, click btn:[Create Guest].
ja: ［[guimenu]``ゲスト``］サブタブで、btn:[Create Guest]（ゲストの作成）をクリックします。
ko: [guimenu]``게스트`` 하위 탭에서 btn:[게스트 생성]을 클릭합니다.
zh_cn: 在 [guimenu]``Guest`` 子选项卡中，单击 btn:[创建 Guest]。

source: In the [guimenu]``Name`` field, type the name of the guest.
ja: ［[guimenu]``名前``］フィールドにゲストの名前を入力します。
ko: [guimenu]``이름`` 필드에서 게스트의 이름을 입력합니다.
zh_cn: 在[guimenu]``名称``字段中，键入 Guest 的名称。

source: In the [guimenu]``Hypervisor`` field, select the hypervisor to use.
ja: ［[guimenu]``ハイパーバイザ``］フィールドで、使用するハイパーバイザを選択します。
ko: [guimenu]``하이퍼바이저`` 필드에서 사용할 하이퍼바이저를 선택합니다.
zh_cn: 在[guimenu]``超级管理程序``字段中，选择要使用的超级管理程序。

source: In the [guimenu]``Virtual Machine Type`` field, select either fully virtualized or para-virtualized.
ja: ［[guimenu]``仮想マシンのタイプ``］フィールドで、完全仮想化または部分的仮想化のいずれかを選択します。
ko: [guimenu]``가상 머신 유형`` 필드에서 완전 가상화 또는 반가상화를 선택합니다.
zh_cn: 在[guimenu]``虚拟机类型``字段中，选择全虚拟化或半虚拟化。

source: In the [guimenu]``Maximum Memory`` field, type the upper size limit for the guest disk, in MiB.
ja: ［[guimenu]``最大メモリ``］フィールドに、ゲストディスクの最大サイズ制限(MB単位)を入力します。
ko: [guimenu]``최대 메모리`` 필드에 게스트 디스크 크기의 상한을 MiB 단위로 입력합니다.
zh_cn: 在[guimenu]``最大内存``字段中，以 MiB 为单位键入 Guest 磁盘的大小上限。

source: In the [guimenu]``Virtual CPU count``, type the number of vCPUs for the guest.
ja: ［[guimenu]``仮想CPU数``］で、ゲストのvCPUの数を入力します。
ko: [guimenu]``가상 CPU 수``에서 게스트를 위한 vCPU의 수를 입력합니다.
zh_cn: 在[guimenu]``虚拟 CPU 计数``中，键入 Guest 的 vCPU 数量。

source: In the [guimenu]``Architecture`` field, select the emulated CPU architecture to use on the guest. By default, the architecture selected matches the virtual host.
ja: ［[guimenu]``アーキテクチャ``］フィールドで、ゲストで使用するエミュレートCPUアーキテクチャを選択します。 デフォルトでは、選択したアーキテクチャは仮想ホストと一致しています。
ko: [guimenu]``아키텍처`` 필드에서 게스트에서 사용할 에뮬레이트된 CPU 아키텍처를 선택합니다. 선택한 아키텍처는 기본적으로 가상 호스트와 일치합니다.
zh_cn: 在[guimenu]``体系结构``字段中，选择要在 Guest 上使用的模拟 CPU 体系结构。默认会选择与虚拟主机匹配的体系结构。

source: In the [guimenu]``Auto-installation Profile`` field, select the auto-installation tool to use to install the guest. Leave this field blank if you do not want to use auto-installation.
ja: ［[guimenu]``自動インストールプロファイル``］フィールドで、ゲストのインストールに使用する自動インストールツールを選択します。 自動インストールを使用しない場合、このフィールドを空白のままにします。
ko: [guimenu]``자동 설치 프로파일`` 필드에서 게스트를 설치하는 데 사용할 자동 설치 도구를 선택합니다. 자동 설치를 사용하지 않으려면 이 필드를 공백으로 두십시오.
zh_cn: 在[guimenu]``自动安装配置文件``字段中，选择要用于安装 Guest 的自动安装工具。如果不想使用自动安装，请将此字段留空。

source: In the [guimenu]``Disks`` section, complete the details of the virtual disk to use with the client. In the [guimenu]``Source template image URL`` field, ensure you type the path to an operating system image. If you do not do this, your guest is created with an empty disk.
ja: ［[guimenu]``ディスク``］セクションで、クライアントで使用する仮想ディスクの詳細を入力します。 ［[guimenu]``ソーステンプレートのイメージURL``］フィールドで、オペレーティングシステムのイメージへのパスを入力したことを確認してください。 これを実行しないと、ゲストのディスクは空になります。
ko: [guimenu]``디스크`` 섹션에서 클라이언트와 함께 사용할 가상 디스크의 상세 정보를 입력합니다. [guimenu]``소스 템플릿 이미지 URL`` 필드에 운영 체제 이미지의 경로를 반드시 입력해야 합니다. 입력하지 않으면 게스트가 빈 디스크로 생성됩니다.
zh_cn: 在[guimenu]``磁盘``部分，填写要用于客户端的虚拟磁盘的细节。在[guimenu]``源模板映像 URL`` 字段中，务必键入操作系统映像的路径。如果不这么做，创建的 Guest 的磁盘将会是空磁盘。

source: In the [guimenu]``Networks`` section, complete the details of the virtual network interface to use with the client. Leave the [guimenu]``MAC address`` field blank to generate a MAC address.
ko: [guimenu]``네트워크`` 섹션에서 클라이언트와 함께 사용할 가상 네트워크 인터페이스의 상세 정보를 입력합니다. MAC 주소를 생성하려면 [guimenu]``MAC 주소`` 필드를 공백으로 두십시오.
zh_cn: 在[guimenu]``网络``部分，填写要用于客户端的虚拟网络接口的细节。将 [guimenu]``MAC 地址``字段留空以生成 MAC 地址。

source: In the [guimenu]``Graphics`` section, complete the details of the graphics driver to use with the client.
ja: ［[guimenu]``グラフィックス``］セクションで、クライアントで使用するグラフィックスドライバの詳細を入力します。
ko: [guimenu]``그래픽`` 섹션에서 클라이언트와 함께 사용할 그래픽 드라이버의 상세 정보를 입력합니다.
zh_cn: 在[guimenu]``显卡``部分，填写要用于客户端的显卡驱动程序的细节。

source: Schedule a time for the guest to be created, and click btn:[Create] to create the guest.
ja: ゲストを作成する時間をスケジュールし、btn:[作成]をクリックしてゲストを作成します。
ko: 생성할 게스트의 일정을 잡고 btn:[생성]을 클릭하여 게스트를 생성합니다.
zh_cn: 安排创建 Guest 的时间，然后单击 btn:[创建] 以创建 Guest。

source: The new virtual guest starts as soon as it has successfully been created.
ja: 新しい仮想ゲストは、正常に作成されるとすぐに開始されます。
ko: 새로운 가상 게스트는 생성되자마자 시작합니다.
zh_cn: 新虚拟 Guest 在成功创建后会立即启动。

source: You can add virtual guests on a pacemaker cluster within the {productname} {webui}, too.
ja: {productname} {webui}内のペースメーカークラスタに仮想ゲストを追加することもできます。
ko: {productname} {webui} 내에서 pacemaker 클러스터에도 가상 게스트를 추가할 수 있습니다.
zh_cn: 也可以在 {productname} {webui} 中的 Pacemaker 群集上添加虚拟 Guest。

source: Follow the ``Creating a Virtual Guest`` procedure on one of the nodes of the cluster with the following additions:
ja: 次の追加項目を使用して、クラスタのノードの1つで``仮想ゲストの作成``プロシージャに従います。
ko: 다음을 추가하여 클러스터 노드 중 하나에서 ``가상 게스트 만들기`` 절차를 따르십시오.
zh_cn: 按照在群集某个节点上``创建虚拟 Guest`` 的过程操作，并遵循以下额外要求：

source: Ensure the [guimenu]``Define as a cluster resource`` field is checked.
ja: [guimenu]``クラスタリソースとして定義``フィールドがチェックされていることを確認します。
ko: [guimenu]``클러스터 리소스로 정의`` 필드가 선택되어 있는지 확인합니다.
zh_cn: 确保[guimenu]``定义为群集资源``字段处于选中状态。

source: In the [guimenu]``Path to the cluster shared folder for VM definitions`` field, type the path to a folder shared by all cluster nodes where the guest configuration will be stored.
ja: [guimenu]``VM定義のクラスタ共有フォルダーへのパス``フィールドに、ゲスト構成が保存されるすべてのクラスタノードによって共有されるフォルダーへのパスを入力します。
ko: [guimenu]``VM 정의를 위한 클러스터 공유 폴더 경로`` 필드에 게스트 구성이 저장될 모든 클러스터 노드가 공유하는 폴더의 경로를 입력합니다.
zh_cn: 在 [guimenu]``VM 定义的群集共享文件夹路径``字段中，键入由所有群集节点共享的文件夹的路径，Guest 配置将存储在该位置。

source: Make sure every disk is located on a storage pool shared by all the cluster nodes.
ja: すべてのディスクが、すべてのクラスタノードによって共有されるストレージプールに配置されていることを確認してください。
ko: 모든 클러스터 노드에서 공유하는 저장소 풀에 모든 디스크가 있는지 확인합니다.
zh_cn: 确保每个磁盘都位于由所有群集节点共享的存储池上。

source: Virtual Guests managed by a cluster can be live migrated.
ja: クラスタによって管理される仮想ゲストは、ライブマイグレーションできます。
ko: 클러스터에서 관리하는 가상 게스트는 라이브 마이그레이션이 가능합니다.
zh_cn: 可实时迁移由群集管理的虚拟 Guest。

source: cobbler buildiso --iso=/path/to/boot.iso --distro=<your-distro-label>
zh_cn: cobbler buildiso --iso=/path/to/boot.iso --distro=<发行套件标签>

source: cobbler buildiso --systems="system1 system2 system3" \ --profiles="<your-profile1-label> <your-profile2-label> <your-profile3-label> --distro=<your-distro-label>
zh_cn: cobbler buildiso --systems="系统 1 系统 2 系统 3" \ --profiles="<配置文件 1 标签> <配置文件 2 标签> <配置文件 3 标签> --distro=<发行套件标签>

source: https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST.
ja: link:https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST[]を参照してください。
zh_cn: link:https://github.com/SUSE/manager-build-profiles/tree/master/AutoYaST[]。

source: Salt Bundle
zh_cn: Salt 捆绑包

source: spacewalk-common-channels \ <base_channel_name> \ <child_channel_name_1> \ <child_channel_name_2> \ ... <child_channel_name_n>
zh_cn: spacewalk-common-channels \ <基础通道名称> \ <子通道名称 1> \ <子通道名称 2> \ ... <子通道名称 n>

source: spacewalk-common-channels \ <base_channel_label> \ <child_channel_label_1> \ <child_channel_label_2> \ ... <child_channel_label_n>
zh_cn: spacewalk-common-channels \ <基础通道标签> \ <子通道标签 1> \ <子通道标签 2> \ ... <子通道标签 n>

source: spacewalk-repo-sync -p <base_channel_label>
zh_cn: spacewalk-repo-sync -p <基础通道标签>

source: spacewalk-common-channels \ -a <architecture> \ <base_channel_name> \ <child_channel_name_1> \ <child_channel_name_2> \ ... <child_channel_name_n>
zh_cn: spacewalk-common-channels \ -a <体系结构> \ <基础通道名称> \ <子通道名称 1> \ <子通道名称 2> \ ... <子通道名称 n>

source: master: SERVER.EXAMPLE.COM
ja: マスタ: SERVER.EXAMPLE.COM
