Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: Public cloud images usually do not allow SSH login with username and password, but only SSH with a certificate. If you want to use bootstrap from the {webui}, you need to enable SSH login with username and SSH key. You can do this by navigating to menu:Systems[Bootstrapping] and changing the authentication method.
ca: Les imatges públiques al núvol normalment no permeten l'inici de sessió amb el nom d'usuari i la contrasenya, sinó només SSH amb un certificat. Si voleu utilitzar bootstrap des de {webui}, heu d'habilitar l'inici de sessió SSH amb el nom d'usuari i la clau SSH. Podeu fer-ho navegant al menú:Sistemes[Bootstrapping] i canviant el mètode d'autenticació.
ja: パブリッククラウドのイメージでは通常、ユーザ名とパスワードでSSHにログインできません。証明書でのみSSHにログインできます。 {webui}からブートストラップを使用する場合、ユーザ名とSSHキーによるSSHへのログインを有効にする必要があります。 この操作を実行するには、menu:システム[ブートストラップ]に移動し、認証メソッドを変更します。
ko: 일반적으로 공용 클라우드 이미지는 사용자 이름 및 암호를 사용한 SSH 로그인을 허용하지 않고 인증서가 있는 SSH만 허용합니다. {webui}에서 부트스트랩하려면 사용자 이름 및 SSH 키를 사용하여 SSH 로그인을 활성화해야 합니다. 이 작업은 menu:시스템[부트스트랩]으로 이동한 후 권한 부여 방법을 변경하여 수행할 수 있습니다.
zh_cn: 公有云映像通常不允许使用用户名和口令进行 SSH 登录，仅允许通过证书进行 SSH 登录。如果您要从 {webui} 中使用引导，则需启用通过用户名和 SSH 密钥进行 SSH 登录的功能。您可以通过导航到menu:系统[引导]并更改身份验证方法来启用此功能。

source: If your cloud provider is Microsoft Azure, you can log in with username and password. To do this, you need to allow the AzureUser to run commands as root without a password. To do this, open the [path]``/etc/sudoers.d/waagent`` file, and add or edit this line:
ca: Si el vostre proveïdor al núvol és Microsoft Azure, podeu iniciar sessió amb el nom d'usuari i la contrasenya. Per fer-ho, heu de permetre que l'AzureUser executi ordres com a root sense contrasenya. Per a fer-ho, obriu el fitxer [camí] the/etc/sudoers.d/waagent, i afegiu o editeu aquesta línia:
ja: クラウドプロバイダがMicrosoft Azureの場合、ユーザ名とパスワードでログインできます。 この操作を実行するには、AzureUserがrootとしてパスワードなしでコマンドを実行できる必要があります。 この操作を実行するには、[path]``/etc/sudoers.d/waagent``ファイルを開き、次の行を追加または編集します。
ko: 클라우드 공급자가 Microsoft Azure인 경우 사용자 이름 및 비밀번호를 사용하여 로그인할 수 있습니다. 이렇게 하려면 AzureUser가 비밀번호를 사용하지 않고 루트 권한으로 명령을 실행할 수 있도록 허용해야 합니다. 이 작업을 수행하려면 [path]``/etc/sudoers.d/waagent`` 파일을 열고 다음 줄을 추가하거나 편집합니다.
zh_cn: 如果您的云提供商是 Microsoft Azure，您可以通过用户名和口令登录。要实现此目的，您需要允许 AzureUser 以 root 身份无口令运行命令。为此，请打开 [path]``/etc/sudoers.d/waagent`` 文件，并添加或编辑下面一行：

source: AzureUser ALL=(ALL) NOPASSWD: ALL
ca: AzureUser ALL ALL(ALL) NOPASSWD: ALL

source: Allowing the AzureUser to run commands as root without a password carries a security risk. Use this method for testing only. Do not do this for production systems.
ca: Permetre que l'AzureUser executi ordres com a root sense contrasenya comporta un risc de seguretat. Utilitzeu aquest mètode només per a provar-lo. No ho facis per als sistemes de producció.
ja: AzureUserがrootとしてパスワードなしでコマンドを実行できると、セキュリティ上のリスクが生じます。 この方法の使用はテストのみにしてください。 運用システムでは実行しないでください。
ko: AzureUser가 암호를 사용하지 않고 루트 권한으로 명령을 실행할 수 있도록 허용하면 보안 위험이 발생합니다. 테스트 목적으로만 이 방법을 사용하십시오. 프로덕션 시스템에서는 이 기능을 사용하지 마십시오.
zh_cn: 允许 AzureUser 以 root 身份无口令运行命令会带来安全风险。请仅将此方法用于测试目的， 不要用于生产系统。

source: When the bootstrap process has completed successfully, your client is listed at menu:Systems[System List].
ca: Quan el procés d'arrencada s'ha completat correctament, el vostre client es llista al menú:Systems[Llista de sistema].
ja: ブートストラッププロセスが正常に完了したら、クライアントは［menu:システム[システム一覧]］にリストされます。
ko: 부트스트랩 프로세스가 완료된 후에는 클라이언트가 menu:시스템[시스템 목록]에 나열됩니다.
zh_cn: 引导过程成功完成时,您的客户端即会列在menu:系统[系统列表]中。

source: If you want more control over the process or have to register many clients, create a bootstrap script. For more information, see xref:client-configuration:registration-bootstrap.adoc[].
ca: Podeu utilitzar una clau de reactivació amb un script d'arrencada. Per a més informació sobre els scripts bootstrap, vegeu xref:client-configuration:registration-bootstrap.adoc[].

source: For Salt clients and even more control over the process, executing single commands on the command line can be useful. For more information, see xref:client-configuration:registration-cli.adoc[].
ca: Per als clients de Salt i encara més control sobre el procés, l'execució d'ordres individuals a la línia de comandes pot ser útil. Per a més informació, vegeu xref:client-configuration:registration-cli.adoc[].
ja: Saltクライアントで、さらに詳細にプロセスを制御するには、コマンド行でsingleコマンドを実行すると便利です。 詳細については、xref:client-configuration:registration-cli.adoc[]を参照してください。
ko: Salt 클라이언트와 프로세스에 대한 더 많은 제어 권한을 위해서는 명령줄에서 단일 명령을 실행하면 도움이 될 수 있습니다. 자세한 설명은 xref:client-configuration:registration-cli.adoc[]를 참조하십시오.
zh_cn: 如果要注册 Salt 客户端而且想更好地控制注册过程，在命令行上执行单个命令较为合适。有关详细信息，请参见 xref:client-configuration:registration-cli.adoc[]。

source: When registering clients launched from a public cloud image (for example, AWS AMI), you need to do some additional configuration to prevent them from over-writing each other. For more information about registering clones, see xref:administration:troubleshooting/tshoot-registerclones.adoc[].
ca: En registrar clients llançats des d'una imatge de núvol públic (per exemple, AWS AMI), cal fer alguna configuració addicional per evitar que es sobreescriguin entre si. Per a més informació sobre el registre de clons, vegeu xref:administration:troubleshooting/tshoot-registerclones.adoc[].
ja: パブリッククラウドイメージ(AWS AMIなど)から起動されたクライアントを登録する場合、追加の設定をして、相互に上書きしないようにする必要があります。 複製を登録する方法の詳細については、xref:administration:troubleshooting/tshoot-registerclones.adoc[]を参照してください。
ko: 공용 클라우드 이미지(예: AWS AMI)에서 실행된 클라이언트를 등록하는 경우에는 몇 가지 추가 구성을 수행하여 서로 덮어쓰지 않도록 해야 합니다. 복제 클라이언트 등록에 대한 자세한 내용은 xref:administration:troubleshooting/tshoot-registerclones.adoc[]에서 확인할 수 있습니다.
zh_cn: 注册从公有云映像（例如 AWS AMI）启动的客户端时，需要进行额外的配置以防它们彼此重写。有关注册克隆客户端的详细信息，请参见 xref:administration:troubleshooting/tshoot-registerclones.adoc[]。

source: For more on activation keys, see xref:client-configuration:activation-keys.adoc[].
ca: Per obtenir més informació sobre les claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].
ja: アクティベーションキーの詳細については、xref:client-configuration:activation-keys.adoc[]を参照してください。
ko: 활성화 키에 대한 자세한 설명은 xref:client-configuration:activation-keys.adoc[]에서 참조하십시오.
zh_cn: 有关激活密钥的详细信息，请参见 xref:client-configuration:activation-keys.adoc[]。

source: Registering {raspberrypios} Clients
ca: S'estan registrant {sle} clients

source: This section contains information about registering clients running {raspberrypios} operating systems.
ca: Aquesta secció conté informació sobre el registre de clients que executen sistemes operatius {raspberrypios}.

source: Bootstrapping can be used with {raspberrypios} clients for performing initial state runs, and for profile updates.
ca: El bootstrapping es pot utilitzar amb {debian} clients per realitzar execucions d'estat inicials i per actualitzacions de perfil.

source: {raspberrypios} repository URLs are available from {scclongform}.
ca: Les URL del repositori {raspberrypios} estan disponibles a {scclongform}.

source: Packages and metadata are provided by Raspberry Pi OS, not by {suse}.
ca: Els paquets i les metadades els proporciona Raspberry Pi OS, no {suse}.

source: Some preparation is required before you can register {raspberrypios} clients to the {productname} Server:
ca: Cal una preparació prèvia per poder registrar {debian} clients al servidor {productname}:

source: Before you register {raspberrypios} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de registrar {sle} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.

source: The architecture currently supported is {arm64}.
ca: L'arquitectura actualment compatible és {arm64}.

source: The architectures currently supported are: {arm64} and {armhf}.
ca: Les arquitectures actualment compatibles són {arm64} i {armhf}.

source: For example, when working with {arm64} architecture, you need:
ca: Per exemple, quan treballeu amb l'arquitectura {arm64}, necessiteu el següent:

source: Raspberry Pi OS - WebUI
ca: Sistema operatiu Raspberry Pi - WebUI

source: | OS Version | Product Name | {raspberrypios} 12 | Raspberry Pi OS 12 (Tech Preview)
ca: | Versió del sistema operatiu | Nom del producte | {raspberrypios} 12 | Raspberry Pi OS 12 (Vista prèvia tècnica)

source: Alternatively, you can add channels at the command prompt.
ca: Alternativament, podeu afegir canals a la línia d'ordres.

source: Raspberry Pi OS Channels - CLI
ca: Canals CentOS - CLI

source: | OS Version | Base Channel | {raspberrypios} 12 | raspberrypios-12-pool-arm64
ca: | Versió del sistema operatiu | Canal base | {raspberrypios} 12 | raspberrypios-12-pool-arm64

source: | Channel description | {arm64} | {armhf} | Base Channel | raspberrypios-12-pool-arm64-uyuni | raspberrypios-12-pool-armhf-uyuni | Client Channel | raspberrypios-12-arm64-uyuni-client | raspberrypios-12-armhf-uyuni-client | Updates Channel | raspberrypios-12-arm64-main-updates-uyuni | - | Contributions Channel | raspberrypios-12-arm64-contrib-uyuni | raspberrypios-12-armhf-contrib-uyuni | Non-Free Channel | raspberrypios-12-arm64-non-free-uyuni | raspberrypios-12-armhf-non-free-uyuni | Non-Free Firmware Channel | raspberrypios-12-arm64-non-free-firmware-uyuni | - | Raspberry Channel | raspberrypios-12-arm64-raspberry-uyuni | raspberrypios-12-armhf-raspberry-uyuni | Contribution Updates | raspberrypios-12-arm64-contrib-updates-uyuni | - | Non-Free Updates | raspberrypios-12-arm64-non-free-updates-uyuni | - | Non-Free Firmware Updates | raspberrypios-12-arm64-non-free-firmware-updates-uyuni | - | Security Main Channel | raspberrypios-12-arm64-main-security-uyuni | - | Security Contribution Channel | raspberrypios-12-arm64-contrib-security-uyuni | - | Security Non-Free Channel | raspberrypios-12-arm64-non-free-security-uyuni | - | Security Non-Free Firmware Channel | raspberrypios-12-arm64-non-free-firmware-security-uyuni | - | RPI Channel | - | raspberrypios-12-armhf-rpi-uyuni
ca: | Descripció del canal | {arm64} | {armhf} | Canal base | raspberrypios-12-pool-arm64-uyuni | raspberrypios-12-pool-armhf-uyuni | Canal client | raspberrypios-12-arm64-uyuni-client | raspberrypios-12-armhf-uyuni-client | Canal d'actualitzacions | raspberrypios-12-arm64-main-updates-uyuni | - | Canal de contribucions | raspberrypios-12-arm64-contrib-uyuni | raspberrypios-12-armhf-contrib-uyuni | Canal no gratuït | raspberrypios-12-arm64-non-free-uyuni | raspberrypios-12-armhf-non-free-uyuni | Canal de firmware no gratuït | raspberrypios-12-arm64-non-free-firmware-uyuni | - | Canal Raspberry | raspberrypios-12-arm64-raspberry-uyuni | raspberrypios-12-armhf-raspberry-uyuni | Actualitzacions de contribució | raspberrypios-12-arm64-contrib-updates-uyuni | - | Actualitzacions no gratuïtes | raspberrypios-12-arm64-non-free-updates-uyuni | - | Actualitzacions de firmware no gratuïtes | raspberrypios-12-arm64-non-free-firmware-updates-uyuni | - | Canal principal de seguretat | raspberrypios-12-arm64-main-security-uyuni | - | Canal de contribució de seguretat | raspberrypios-12-arm64-contrib-security-uyuni | - | Canal de seguretat no lliure | raspberrypios-12-arm64-non-free-security-uyuni | - | Canal de microprogramari no lliure de seguretat | raspberrypios-12-arm64-non-free-firmware-security-uyuni | - | Canal RPI | - | raspberrypios-12-armhf-rpi-uyuni

source: You need all the new channels fully synchronized before bootstrapping any {raspberrypios} client.
ca: Necessiteu tots els canals nous completament sincronitzats abans d'arrencar qualsevol client d'Ubuntu.

source: {raspberrypios} channels can be very large. Synchronization can sometimes take several hours.
ca: {sle} canals poden ser molt grans. La sincronització de vegades pot trigar diverses hores.

source: You need to create an activation key that is associated with your {raspberrypios} channels.
ca: Heu de crear una clau d'activació que estigui associada als vostres canals {centos}.

source: {raspberrypios} clients can require multiple GPG keys to be installed.
ca: {debian} clients poden requerir que s'instal·lin múltiples claus GPG.

source: When synchronizing third-party {raspberrypios} repositories, you will need to import the appropriate GPG key on the server. If the GPG key is missing, synchronization will fail.
ca: Quan sincronitzeu repositoris de tercers {raspberrypios}, haureu d'importar la clau GPG apropiada al servidor. Si falta la clau GPG, la sincronització fallarà.

source: For {raspberrypios} repositories, only the metadata is signed. Therefore importing a GPG key for the software channel is not needed. Packages will not be re-signed by {productname}.
ca: Per a {raspberrypios} repositoris, només se signen les metadades. Per tant, no cal importar una clau GPG per al canal de programari. {productname} no tornarà a signar els paquets.

source: The root user on {raspberrypios} is disabled by default for SSH access.
ca: L'usuari root de {raspberrypios} està desactivat per defecte per a l'accés SSH.

source: Registering {rhel} Clients with CDN
ca: S'estan registrant {rhel} clients amb CDN
ja: CDNで{rhel}クライアントを登録する
ko: {rhel} 클라이언트를 CDN으로 등록
zh_cn: 使用 CDN 注册 {rhel} 客户端

source: If you are running {rhel} clients directly, rather than using {sleses}, you need to use {redhat} sources to retrieve and update packages.
ca: Si esteu executant {rhel} clients directament, en lloc d'utilitzar {sleses}, heu d'utilitzar {redhat} fonts per recuperar i actualitzar paquets.

source: This section contains information about using the {redhat} content delivery network (CDN) to register clients running {rhel} operating systems.
ca: Per obtenir informació sobre com utilitzar {redhat} xarxa de lliurament de contingut (CDN), vegeu xref:client-configuration:clients-rh-cdn.adoc[].

source: For information about using {redhat} update infrastructure (RHUI) instead, see xref:client-configuration:clients-rh-rhui.adoc[].
ca: Per obtenir informació sobre l'ús de la infraestructura d'actualització de {redhat} (RHUI) vegeu xref:client-configuration:clients-rh-rhui.adoc[].
ja: 代わりに{redhat}更新インフラストラクチャ(RHUI)を使用する方法については、xref:client-configuration:clients-rh-rhui.adoc[]を参照してください。
ko: 대신에 {redhat} 업데이트 인프라(RHUI) 사용법에 대한 정보는 xref:client-configuration:clients-rh-rhui.adoc[]를 참조하십시오.
zh_cn: 而有关使用 {redhat} 更新基础结构 (RHUI) 的信息，请参见 xref:client-configuration:clients-rh-rhui.adoc[]。

source: {rhel} clients are based on {redhat} and are unrelated to {sleses}, RES, or {sles}.
ca: Els clients de {rhel} es basen en {redhat} i no estan relacionats amb {sleses}, RES o {sles}.
ja: {rhel}クライアントは{redhat}に基づいており、{sleses}、RES、または{sles}とは関係ありません。
ko: {rhel} 클라이언트는 {redhat}을 기반으로 하며 {sleses}, RES 또는 {sles}와 관련이 없습니다.
zh_cn: {rhel} 客户端基于 {redhat}，与 {sleses}、RES 或 {sles} 不相关。

source: You are responsible for arranging access to {redhat} base media repositories and {rhela} installation media, as well as connecting {productname} Server to the {redhat} content delivery network. You must obtain support from {redhat} for all your {rhela} systems. If you do not do this, you might be violating your terms with {redhat}.
ca: Sou responsable d'organitzar l'accés als repositoris multimèdia base {redhat} i als mitjans d'instal·lació {rhela}, així com de connectar el servidor {productname} a la xarxa de lliurament de contingut {redhat}. Heu d'obtenir suport de {redhat} per a tots els vostres sistemes {rhela}. Si no ho feu, és possible que violeu els vostres termes amb {redhat}.

source: Import Entitlements and Certificates
ca: Importa drets i certificats
ja: エンタイトルメントと証明書のインポート
ko: 자격 및 인증서 임포트
zh_cn: 导入权利和证书

source: {redhat} clients require a {redhat} certificate authority (CA) and entitlement certificate, and an entitlement key.
ca: {redhat} clients requereixen una autoritat de certificat {redhat} (CA) i un certificat de dret, i una clau de dret.
ja: {redhat}クライアントには、{redhat}認証局(CA)、エンタイトルメント証明書、およびエンタイトルメントキーが必要です。
ko: {redhat} 클라이언트는 {redhat} 인증 주체(CA)와 자격 인증서 및 자격 키가 있어야 합니다.
zh_cn: {redhat} 客户端需要 {redhat} 证书颁发机构 (CA) 和权利证书以及权利密钥。

source: Entitlement certificates are embedded with expiration dates, which match the length of the support subscription. To avoid disruption, you need to repeat this process at the end of every support subscription period.
ca: Els certificats de drets estan incrustats amb dates de caducitat, que coincideixen amb la durada de la subscripció de suport. Per evitar interrupcions, heu de repetir aquest procés al final de cada període de subscripció d'assistència.
ja: エンタイトルメント証明書には、有効期限が埋め込まれていて、この期限はサポートサブスクリプションの期間と一致しています。 中断を回避するには、サポートサブスクリプション期間の終わりのたびにこのプロセスを繰り返す必要があります。
ko: 자격 인증서에는 지원 구독 기간과 일치하는 만료일이 포함되어 있습니다. 중단을 방지하려면 지원 구독 기간이 종료되는 시점이 될 때마다 이 프로세스를 반복해야 합니다.
zh_cn: 权利证书内嵌失效日期，与支持订阅的期限匹配。为避免服务中断，您需要在每个支持订阅期结束时重复此过程。

source: {redhat} supplies a subscription manager tool to manage subscription assignments. It runs locally to track installed products and subscriptions. Clients must be registered with the subscription manager to obtain certificates.
ca: {redhat} proporciona una eina de gestor de subscripcions per gestionar les assignacions de subscripcions. S'executa localment per fer un seguiment dels productes i subscripcions instal·lades. Els clients han d'estar registrats al gestor de subscripcions per obtenir certificats.
ja: {redhat}には、サブスクリプション割り当てを管理するためのサブスクリプションマネージャツールが用意されています。 このツールはローカルに実行され、インストール済みの製品およびサブスクリプションを追跡します。 クライアントは、サブスクリプションマネージャで登録して証明書を取得する必要があります。
ko: {redhat}은 구독 할당을 관리할 수 있도록 구독 관리자 도구를 제공합니다. 이 도구는 로컬로 실행되어 설치된 제품 및 구독을 추적합니다. 클라이언트는 구독 관리자로 등록되어 있어야 인증서를 취득할 수 있습니다.
zh_cn: {redhat} 提供了一个订阅管理器工具，可用于管理订阅指派。此工具在本地运行，可跟踪安装的产品和订阅。客户端必须在订阅管理器中注册才能获得证书。

source: {redhat} clients use a URL to replicate repositories. The URL changes depending on where the {redhat} client is registered.
ca: {redhat} clients utilitzen un URL per replicar repositoris. L'URL canvia depenent d'on estigui registrat el client {redhat}.
ja: {redhat}クライアントは、URLを使用してリポジトリを複製します。 URLは、{redhat}クライアントを登録した場所に応じて変わります。
ko: {redhat} 클라이언트는 URL을 사용해 리포지토리를 복제합니다. URL은 {redhat} 클라이언트가 어디에 등록되었는지에 따라 달라집니다.
zh_cn: {redhat} 客户端使用 URL 来复制储存库。URL 更改取决于 {redhat} 客户端是在何处注册的。

source: {redhat} clients can be registered in three different ways:
ca: {redhat} clients es poden registrar de tres maneres diferents:
ja: {redhat}クライアントは次の3種類の方法で登録できます。
ko: {redhat} 클라이언트는 다음 세 가지 방식으로 등록할 수 있습니다.
zh_cn: {redhat} 客户端可通过三种方式注册：

source: {redhat} content delivery network (CDN) at redhat.com
ca: {redhat} xarxa de lliurament de continguts (CDN) a redhat.com
ja: redhat.comにある{redhat}コンテンツデリバリネットワーク(CDN)
ko: redhat.com의 {redhat} 컨텐트 제공 네트워크(CDN)
zh_cn: redhat.com 上的 {redhat} 内容分发网络 (CDN)

source: {redhat} Satellite Server
ca: {redhat} Servidor de satèl·lit
ja: {redhat}サテライトサーバ
ko: {redhat} Satellite 서버
zh_cn: {redhat} 从属服务器

source: {redhat} update infrastructure (RHUI) in the cloud
ca: {redhat} actualització de la infraestructura (RHUI) al núvol
ja: クラウドの{redhat}更新インフラストラクチャ(RHUI)
ko: 클라우드의 {redhat} 업데이트 인프라(RHUI)
zh_cn: 云中的 {redhat} 更新基础结构 (RHUI)

source: This guide covers clients registered to {redhat} CDN. You must have at least one system registered to the CDN, with an authorized subscription for repository content.
ca: Aquesta guia cobreix els clients registrats a {redhat} CDN. Heu de tenir almenys un sistema registrat al CDN, amb una subscripció autoritzada per al contingut del repositori.
ja: このガイドでは、{redhat}CDNに登録されるクライアントについて説明します。 リポジトリコンテンツの認可済みサブスクリプションを使用して、1つ以上のシステムがCDNに登録されている必要があります。
ko: 이 안내서에서는 {redhat} CDN에 등록된 클라이언트에 대해 설명합니다. CDN에 등록된 시스템이 최소 한 개 있어야 하고, 이와 함께 리포지토리 컨텐트에 대한 인증 구독이 있어야 합니다.
zh_cn: 本指南将介绍注册到 {redhat} CDN 的客户端。您至少须有一个注册到 CDN 的系统并拥有授权订阅，以获得储存库内容。

source: Satellite certificates for client systems require a Satellite server and subscription. Clients using Satellite certificates are not supported with {productname} Server.
ca: Els certificats de satèl·lit per als sistemes clients requereixen un servidor de satèl·lit i subscripció. Els clients que usen certificats de satèl·lit no són compatibles amb el servidor {productname}.
ja: クライアントシステムのサテライト証明書では、サテライトサーバおよびサブスクリプションが必要です。 サテライト証明書を使用するクライアントは{productname}サーバではサポートされていません。
ko: 클라이언트 시스템에 대한 Satellite 서버는 Satellite 서버 및 구독이 있어야 합니다. Satellite 인증서를 사용하는 클라이언트는 {productname} 서버에서 지원하지 않습니다.
zh_cn: 要为客户端系统使用从属证书，必须有从属服务器和订阅。{productname} 服务器不支持使用从属证书的客户端。

source: {redhat} supplies the subscription-manager tool to manage subscription assignments. It runs locally on the client system to track installed products and subscriptions. Register to redhat.com with subscription-manager, then follow this procedure to obtain certificates.
ca: {redhat} subministra l'eina de gestió de subscripcions per gestionar les assignacions de subscripcions. S'executa localment al sistema client per fer un seguiment dels productes i subscripcions instal·lades. Registra't a redhat.com amb subscription-manager i segueix aquest procediment per obtenir certificats.
ja: {redhat}には、サブスクリプション割り当てを管理するためのサブスクリプションマネージャツールが用意されています。 このツールはクライアントシステムでローカルに実行され、インストール済みの製品およびサブスクリプションを追跡します。 サブスクリプションマネージャを使用してredhat.comを登録し、このプロシージャに従って証明書を取得します。
ko: {redhat}은 구독 할당을 관리할 수 있도록 구독 관리자 도구를 제공합니다. 이 도구는 클라이언트 시스템에서 로컬로 실행되어 설치된 제품 및 구독을 추적합니다. 구독 관리자로 redhat.com에 등록한 후, 이 절차에 따라 인증서를 취득하십시오.
zh_cn: {redhat} 提供了订阅管理器工具，可用于管理订阅指派。此工具在客户端系统本地运行，可跟踪安装的产品和订阅。使用订阅管理器注册到 redhat.com，然后执行下列过程获得证书。

source: Procedure: Registering Clients to Subscription Manager
ca: Procediment: Registre de Clients al Gestor de Subscripcions
ja: プロシージャ: クライアントをサブスクリプションマネージャに登録する
ko: 절차: 클라이언트를 구독 관리자에 등록
zh_cn: 过程：将客户端注册到订阅管理器

source: On the client system, at the command prompt, register with the subscription manager tool:
ca: Al sistema client, a l'indicador de comandes, registra't amb l'eina gestor de subscripcions:
ja: クライアントシステムのコマンドプロンプトで、サブスクリプションマネージャツールを使用して登録します。
ko: 클라이언트 시스템의 명령 프롬프트에서 다음과 같이 구독 관리자 도구로 등록합니다.
zh_cn: 在客户端系统上的命令提示符处注册订阅管理器工具：

source: subscription-manager register
ca: registre de subscripcions

source: Enter your {redhat} Portal username and password when prompted.
ca: Introduïu el nom d'usuari i la contrasenya del portal {redhat} quan se us demani.
ja: プロンプトが表示されたら、{redhat}ポータルのユーザ名とパスワードを入力します。
ko: 프롬프트가 표시되면 {redhat} 포털 사용자 이름 및 비밀번호를 입력합니다.
zh_cn: 出现提示时，输入您的 {redhat} 门户用户名和口令。

source: Run command:
ca: Executa l'ordre:
ja: コマンドを実行します。
ko: 명령 실행:
zh_cn: 运行命令：

source: subscription-manager activate
ca: activa el gestor de subscripcions

source: Copy your entitlement certificate and key from the client system, to a location that the {productname} Server can access:
ca: Copieu el vostre certificat de dret i la clau del sistema client, a una ubicació a la qual el servidor {productname} pot accedir:
ja: {productname}サーバがアクセスできる場所にエンタイトルメント証明書とキーをクライアントシステムからコピーします。
ko: 다음과 같이 클라이언트 시스템에서 {productname} 서버가 액세스할 수 있는 위치로 자격 인증서 및 키를 복사합니다.
zh_cn: 将客户端系统中的权利证书和密钥复制到 {productname} 服务器可访问的位置：

source: Your entitlement certificate and key both have a file extension of [path]``.pem``. The key also has [path]``key`` in the filename.
ca: El vostre certificat de títol i la clau tenen una extensió de fitxer de [path]..pem.. La clau també té [camí].clau in al nom de fitxer.
ja: エンタイトルメント証明書とキーの両方ともファイル拡張子は[path]``.pem``です。 キーにはファイル名にも[path]``key``が含まれています。
ko: 자격 인증서 및 키에는 [path]``.pem``이라는 파일 확장자가 있습니다. 또한 키는 파일 이름에 [path]``key``가 포함되어 있습니다.
zh_cn: 您的权利证书和密钥的文件扩展名均为 [path]``.pem``。密钥的文件名中还包含 [path]``key``。

source: Copy the {redhat} CA Certificate file from the client system, to the same web location as the entitlement certificate and key:
ca: Copieu el fitxer de certificat CA {redhat} del sistema client, a la mateixa ubicació web que el certificat i la clau de títol:
ja: {redhat} CA証明書ファイルをクライアントシステムから、エンタイトルメント証明書およびキーと同じWebの場所にコピーします。
ko: 다음과 같이 클라이언트 시스템에서 자격 인증서 및 키와 동일한 웹 위치로 {redhat} CA 인증서 파일을 복사합니다.
zh_cn: 将客户端系统中的 {redhat} CA 证书文件复制到权利证书和密钥所在的相同网络位置：
