Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: | Feature | {sle}{nbsp}12 | {sle}{nbsp}15 | {sle}{nbsp}16 | {leap}{nbsp}15 | {leap}{nbsp}16 | Client | {check} | {check} | {check} | {check} | {check} | System packages | {suse} | {suse} | {suse} | {opensuse} Community | {opensuse} Community | Registration | {check} | {check} | {check} | {check} | {check} | Install packages | {check} | {check} | {check} | {check} | {check} | Apply patches | {check} | {check} | {check} | {check} | {check} | Remote commands | {check} | {check} | {check} | {check} | {check} | System package states | {check} | {check} | {check} | {check} | {check} | System custom states | {check} | {check} | {check} | {check} | {check} | Group custom states | {check} | {check} | {check} | {check} | {check} | Organization custom states | {check} | {check} | {check} | {check} | {check} | System set manager (SSM) | {check} | {check} | {check} | {check} | {check} | Product migration | {check} | {check} | {cross} | {check} | {cross} | Basic Virtual Guest Management {star} | {check} | {check} | {check} | {check} | {check} | Advanced Virtual Guest Management {star} | {check} | {check} | {check} | {check} | {check} | Virtual Guest Installation ({ay}), as Host OS | {cross} | {cross} | {cross} | {cross} | {cross} | Virtual Guest Installation (image template), as Host OS | {check} | {check} | {check} | {check} | {check} | Virtual Guest Management | {check} | {check} | {check} | {check} | {check} | System deployment (PXE/{ay}) | {check} | {check} | {check} | {check} | {check} | System redeployment ({ay}) | {check} | {check} | {check} | {check} | {check} | Contact methods | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | Works with {productname} Proxy | {check} | {check} | {check} | {check} | {check} | Action chains | {check} | {check} | {check} | {check} | {check} | Staging (pre-download of packages) | {check} | {check} | {check} | {check} | {check} | Duplicate package reporting | {check} | {check} | {check} | {check} | {check} | CVE auditing | {check} | {check} | {check} | {check} | {check} | SCAP auditing | {check} | {check} | {cross} | {check} | {cross} | Package verification | {cross} | {cross} | {cross} | {cross} | {cross} | Package locking | {check} | {check} | {check} | {check} | {check} | System locking | {cross} | {cross} | {cross} | {cross} | {cross} | Maintenance Windows | {check} | {check} | {check} | {check} | {check} | System snapshot | {cross} | {cross} | {cross} | {cross} | {cross} | Configuration file management | {check} | {check} | {check} | {check} | {check} | Package profiles | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | Power management | {check} | {check} | {check} | {check} | {check} | Monitoring server | {check} | {check} | {check} | {check} | {check} | Monitored clients | {check} | {check} | {check} | {check} | {check} | Docker buildhost | {check} | {check} | {check} | {question} | {question} | Build Docker image with OS | {check} | {check} | {check} | {check} | {check} | Kiwi buildhost | {check} | {question} | {question} | {question} | {question} | Build Kiwi image with OS | {check} | {question} | {question} | {question} | {question} | Recurring Actions | {check} | {check} | {check} | {check} | {check} | AppStreams | N/A | N/A | N/A | N/A | N/A | Yomi | {cross} | {check} | {cross} | {check} | {cross}
ca: | FCaracterística | {sle}{nbsp}12 | {sle}{nbsp}15 | {sle}{nbsp}16 | {leap}{nbsp}15 | {leap}{nbsp}16 | Client | {check} | {check} | {check} | {check} | {check} | Paquets del sistema | {suse} | {suse} | {suse} | {opensuse} Community | {opensuse} Community | Registre | {check} | {check} | {check} | {check} | {check} | Instal·lar paquets | {check} | {check} | {check} | {check} | {check} | Aplicar pedaços | {check} | {check} | {check} | {check} | {check} | Ordres remotes | {check} | {check} | {check} | {check} | {check} | Estats dels paquets del sistema | {check} | {check} | {check} | {check} | {check} | Estats personalitzats del sistema | {check} | {check} | {check} | {check} | {check} | Agrupa els estats personalitzats | {check} | {check} | {check} | {check} | {check} | Estats personalitzats de l'organització | {check} | {check} | {check} | {check} | {check} | Gestor de conjunts de sistemes (SSM) | {check} | {check} | {check} | {check} | {check} | Migració de producte | {check} | {check} | {cross} | {check} | {cross} | Gestió bàsica de convidats virtuals {star} | {check} | {check} | {check} | {check} | {check} | Gestió avançada de convidats virtuals {star} | {check} | {check} | {check} | {check} | {check} | Instal·lació de convidat virtual ({ay}), com a sistema operatiu amfitrió | {cross} | {cross} | {cross} | {cross} | {cross} | Instal·lació de convidat virtual (plantilla d'imatge), com a sistema operatiu amfitrió | {check} | {check} | {check} | {check} | {check} | Gestió de convidats virtuals | {check} | {check} | {check} | {check} | {check} | Desplegament del sistema (PXE/{ay}) | {check} | {check} | {check} | {check} | {check} | Redistribució del sistema ({ay}) | {check} | {check} | {check} | {check} | {check} | Mètodes de contacte | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | Funciona amb l'intermediari {productname} | {check} | {check} | {check} | {check} | {check} | Cadenes d'acció | {check} | {check} | {check} | {check} | {check} | Passos (predescàrrega de paquets) | {check} | {check} | {check} | {check} | {check} | Informes de paquets duplicats | {check} | {check} | {check} | {check} | {check} | Auditoria de CVE | {check} | {check} | {check} | {check} | {check} | Auditoria de SCAP | {check} | {check} | {cross} | {check} | {cross} | Verificació del paquet | {cross} | {cross} | {cross} | {cross} | {cross} | Bloqueig del paquet | {check} | {check} | {check} | {check} | {check} | Bloqueig del sistema | {cross} | {cross} | {cross} | {cross} | {cross} | Finestres de manteniment | {check} | {check} | {check} | {check} | {check} | Instantània del sistema | {cross} | {cross} | {cross} | {cross} | {cross} | Gestió de fitxers de configuració | {check} | {check} | {check} | {check} | {check} | Perfils de paquets | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | Power management | {check} | {check} | {check} | {check} | {check} | Servidor de monitoratge | {check} | {check} | {check} | {check} | {check} | Clients monitorats | {check} | {check} | {check} | {check} | {check} | Amfitrió de compilació de Docker | {check} | {check} | {check} | {question} | {question} | Crea una imatge de Docker amb el sistema operatiu | {check} | {check} | {check} | {check} | {check} | Amfitrió de construcció de kiwi | {check} | {question} | {question} | {question} | {question} | Crea una imatge de Kiwi amb el sistema operatiu | {check} | {question} | {question} | {question} | {question} | Accions recurrents | {check} | {check} | {check} | {check} | {check} | AppStreams | N/A | N/A | N/A | N/A | N/A | Yomi | {cross} | {check} | {cross} | {check} | {cross}

source: Supported {sll} Features
ca: Funcionalitats de {rhel} suportades
ja: サポートされている{sll}の機能
ko: 지원되는 {sll} 기능
zh_cn: 支持的 {sll} 功能

source: This table lists the availability of various features on {sll} clients.
ca: Aquesta taula llista la disponibilitat de diverses característiques en {oracle} clients.
ja: この表には、{sll}クライアントのさまざまな機能の使用可否がリストされています。
ko: 아래 표는 {sll} 클라이언트에서 다양한 기능의 사용 가능 여부를 정리한 것입니다.
zh_cn: 下表列出了 {sll} 客户端上各种功能的可用性。

source: {sll} clients are sometimes also called {sleses} (SLES ES), Liberty, RES or {redhat} {es}.
ca: Els clients {sll} de vegades també s'anomenen {sleses} (SLES ES), Liberty, RES o {redhat} {es}.
ja: {sll}クライアントは、{sleses} (SLES ES)、Liberty、RES、または{redhat} {es}とも呼ばれます。
ko: {sll} 클라이언트를 {sleses}(SLES ES), Liberty, RES 또는 {redhat} {es}라고도 합니다.
zh_cn: {sll} 客户端有时也称为 {sleses} (SLES ES)、Liberty、RES 或 {redhat} {es}。

source: The operating system you run on a client is supported by the organization that supplies the operating system. {sll} is supported by {suse}.
ca: El sistema operatiu que executeu en un client és compatible amb l'organització que subministra el sistema operatiu. {rhel} és compatible amb {redhat}.
ja: クライアントで実行しているオペレーティングシステムは、オペレーティングシステムを提供している組織によってサポートされています。 {sll}は{suse}でサポートされています。
ko: 클라이언트에서 실행하는 운영 체제는 운영 체제를 제공하는 조직이 지원합니다. {suse}는 {sll}을 지원합니다.
zh_cn: 客户端上运行的操作系统由提供操作系统的组织支持。{sll} 由 {suse} 支持。

source: Supported Features on {sll} Operating Systems
ca: Funcionalitats suportades en sistemes operatius {rhel}
ja: {sll}オペレーティングシステムでサポートされている機能
ko: {sll} 운영 체제에서 지원되는 기능
zh_cn: {sll} 操作系统上支持的功能

source: | Feature | {sll}{nbsp}7 | {sll}{nbsp}8 | {sll}{nbsp}9 | Client | {check} | {check} | {check} | System packages | {suse} | {suse} | {suse} | Registration | {check} | {check} | {check} | Install packages | {check} | {check} | {check} | Apply patches | {check} | {check} | {check} | Remote commands | {check} | {check} | {check} | System package states | {check} | {check} | {check} | System custom states | {check} | {check} | {check} | Group custom states | {check} | {check} | {check} | Organization custom states | {check} | {check} | {check} | System set manager (SSM) | {check} | {check} | {check} | Product migration | {check} {star} | N/A | N/A | Basic Virtual Guest Management {star}{star} | {check} | {check} | {check} | Advanced Virtual Guest Management {star}{star} | {check} | {check} | {check} | Virtual Guest Installation (Kickstart), as Host OS | {cross} | {cross} | {cross} | Virtual Guest Installation (image template), as Host OS | {check} | {check} | {check} | System deployment (PXE/Kickstart) | {check} | {check} | {check} | System redeployment (Kickstart) | {check} | {cross} | {cross} | Contact methods | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | Works with {productname} Proxy | {check} | {check} | {check} | Action chains | {check} | {check} | {check} | Staging (pre-download of packages) | {check} | {check} | {check} | Duplicate package reporting | {check} | {check} | {check} | CVE auditing | {check} | {check} | {check} | SCAP auditing | {check} | {check} | {check} | Package verification | {cross} | {cross} | {cross} | Package locking | {check} | {question} | {question} | System locking | {cross} | {cross} | {cross} | Maintenance Windows | {check} | {check} | {check} | System snapshot | {cross} | {check} | {check} | Configuration file management | {check} | {check} | {check} | Snapshots and profiles | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | Power management | {check} | {check} | {check} | Monitoring server | {cross} | {cross} | {cross} | Monitored clients | {check} | {check} | {check} | Docker buildhost | {cross} | {cross} | {cross} | Build Docker image with OS | {question} | {question} | {question} | Kiwi buildhost | {cross} | {cross} | {cross} | Build Kiwi image with OS | {cross} | {cross} | {cross} | Recurring Actions | {check} | {check} | {check} | AppStreams | N/A | {check} | {check} | Yomi | N/A | N/A | N/A
ca: Fe Característica {sll}{nbsp}7 {sll}{nbsp}8 {sll}{nbsp}9 Client {check} {check} {check} Paquets del sistema {suse} {suse} {suse} Inscripció {check} {check} {check} Instal·la paquets {check} {check} {check} es Aplica els pedaços {check} {check} {check} s Ordres remotes {check} {check} {check} Estats del paquet del sistema {check} {check} {check} Estats personalitzats del sistema {check} {check} {check} Agrupa estats personalitzats {check} {check} {check} Organització d'estats personalitzats {check} {check} {check} ) Gestor de conjunts de sistemes (SSM) {check} {check} {check} Migració de producte {check} {star} N/A N/A Gestió bàsica de convidats virtual {star}{star} {check} {check} {check} Gestió de convidats virtual avançada {star}{star} {check} {check} {check} ), Instal·lació de convidat virtual (Kickstart), com a servidor {cross} {cross} {cross} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {check} {check} {check} ) Desplegament del sistema (PXE/Kickstart) {check} {check} {check} ) Redesplegament del sistema (Kickstart) {check} {cross} {cross} Mètodes de contacte , {check} ZeroMQ, Salt-SSH , {check} ZeroMQ, Salt-SSH , {check} ZeroMQ, Salt-SSH with Funciona amb el servidor intermediari {productname} {check} {check} {check} Cadenes d'acció {check} {check} {check} ) Estadificació (pre-descàrrega de paquets) {check} {check} {check} Informe de paquets duplicat {check} {check} {check} ing Auditoria CVE {check} {check} {check} ing Auditoria SCAP {check} {check} {check} Verificació de paquets {cross} {cross} {cross} ing Bloqueig de paquets {check} {question} {question} ing Bloqueig del sistema {cross} {cross} {cross} Finestres de manteniment {check} {check} {check} Instantània del sistema {cross} {check} {check} Gestió de fitxers de configuració {check} {check} {check} and Instantànies i perfils , {check} Perfils admesos, la sincronització no és compatible , {check} Perfils admesos, la sincronització no és compatible , {check} Perfils admesos, la sincronització no és compatible Gestió d'energia {check} {check} {check} Servidor de seguiment {cross} {cross} {cross} Clients monitoritzats {check} {check} {check} Constructor Docker {cross} {cross} {cross} Construeix la imatge Docker amb el SO {question} {question} {question} Constructor de Kiwi {cross} {cross} {cross} Construeix la imatge de Kiwi amb el SO {cross} {cross} {cross} s Accions recurrents {check} {check} {check} s AppStreams N/A {check} {check} Yomi N/A N/A N/A

source: {star} to matching {sll} LTSS
ca: {star} coincideix amb {sll} LTSS

source: {opensuse} {tumbleweed} Client Features
ca: Característiques del client {tumbleweed}

source: {opensuse} {tumbleweed} is supported by the {suse} community.
ca: {opensuse} {tumbleweed} rep el suport de la comunitat {suse}.

source: Supported Features on {opensuse} {tumbleweed} Operating Systems
ca: Funcions compatibles amb els sistemes operatius {opensuse} {tumbleweed}

source: | Feature | {opensuse} {tumbleweed} | Client | {check} | Operating system packages | {check} | Registration | {check} | Install packages | {check} | Apply patches (requires CVE ID) | {check} | Remote commands | {check} | System package states | {check} | System custom states | {check} | Group custom states | {check} | Organization custom states | {check} | System set manager (SSM) | {check} | Product migration | {check} | Basic Virtual Guest Management {star} | {check} | Advanced Virtual Guest Management {star} | {check} | Virtual Guest Installation (Kickstart), as Host OS | {check} | Virtual Guest Installation (image template), as Host OS | {check} | System deployment (PXE/Kickstart) | {check} | System redeployment (Kickstart) | {check} | Contact methods | {check} ZeroMQ | Works with {productname} Proxy | {check} | Action chains | {check} | Staging (pre-download of packages) | {question} | Duplicate package reporting | {check} | CVE auditing (requires CVE ID) | {check} | SCAP auditing | {question} | Package verification | {question} | Package locking | {check} | System locking | {question} | Maintenance Windows | {question} | System snapshot | {cross} | Configuration file management | {check} | Snapshots and profiles | {check} Profiles supported, Sync not supported | Power management | {check} | Monitoring server | {cross} | Monitored clients | {check} | Docker buildhost | {cross} | Build Docker image with OS | {cross} | Kiwi buildhost | {cross} | Build Kiwi image with OS | {check} | Recurring Actions | {check} | AppStreams | N/A | Yomi | {question}
ca: | Característica | {opensuse} {tumbleweed} Client {check} Paquets de sistema operatiu {check} Inscripció {check} Instal·la paquets {check} ) Aplica els pedaços (requereix l'ID CVE) {check} s Ordres remotes {check} Estats del paquet del sistema {check} Estats personalitzats del sistema {check} Agrupa estats personalitzats {check} Organització d'estats personalitzats {check} ) Gestor de conjunts de sistemes (SSM) {check} Migració de producte {check} Gestió bàsica de convidats virtual {star} {check} Gestió de convidats virtual avançada {star} {check} ), Instal·lació de convidat virtual (Kickstart), com a servidor {check} ), Instal·lació de convidat virtual (plantilla d'imatge), com a Host OS {check} ) Desplegament del sistema (PXE/Kickstart) {check} ) Redesplegament del sistema (Kickstart) {check} Mètodes de contacte {check} ZeroMQ with Funciona amb el servidor intermediari {productname} {check} Cadenes d'acció {check} ) Estadificació (pre-descàrrega de paquets) {question} Informe de paquets duplicat {check} audit auditoria CVE (requereix l'ID CVE) {check} ing Auditoria SCAP {question} Verificació de paquets {question} ing Bloqueig de paquets {check} ing Bloqueig del sistema {question} Finestres de manteniment {question} Instantània del sistema {cross} Gestió de fitxers de configuració {check} and Instantànies i perfils , {check} Perfils admesos, la sincronització no és compatible Gestió d'energia {check} Servidor de seguiment {cross} Clients monitoritzats {check} Constructor Docker {cross} Construeix la imatge Docker amb el SO {cross} Constructor de Kiwi {cross} Construeix la imatge de Kiwi amb el SO {check} s Accions recurrents {check} s AppStreams N/A Yomi {question}

source: Supported {ubuntu} Features
ca: Característiques de {ubuntu} suportades
ja: サポートされている{ubuntu}の機能
ko: 지원하는 {ubuntu} 기능
zh_cn: 支持的 {ubuntu} 功能

source: This table lists the availability of various features on {ubuntu} clients.
ca: Aquesta taula llista la disponibilitat de diverses característiques en {ubuntu} clients.
ja: この表には、{ubuntu}クライアントのさまざまな機能の使用可否がリストされています。
ko: 아래 표는 {ubuntu} 클라이언트에서 다양한 기능의 사용 가능 여부를 정리한 것입니다.
zh_cn: 下表列出了 {ubuntu} 客户端上各种功能的可用性。

source: The operating system you run on a client is supported by the organization that supplies the operating system. {ubuntu} is supported by Canonical.
ca: El sistema operatiu que executeu en un client és compatible amb l'organització que subministra el sistema operatiu. {ubuntu} és compatible amb Canonical.
ja: クライアントで実行しているオペレーティングシステムは、オペレーティングシステムを提供している組織によってサポートされています。 {ubuntu}はCanonicalでサポートされています。
ko: 클라이언트에서 실행하는 운영 체제는 운영 체제를 제공하는 조직이 지원합니다. {ubuntu}는 Canonical이 지원합니다.
zh_cn: 客户端上运行的操作系统由提供操作系统的组织支持。{ubuntu} 由 Canonical 支持。

source: Supported Features on {ubuntu} Operating Systems
ca: Funcionalitats suportades en sistemes operatius {ubuntu}
ja: {ubuntu}オペレーティングシステムでサポートされている機能
ko: {ubuntu} 운영 체제에서 지원하는 기능
zh_cn: {ubuntu} 操作系统上支持的功能

source: | Feature | {ubuntu}{nbsp}22.04 | {ubuntu}{nbsp}24.04 | Client | {check} | {check} | System packages | {ubuntu} Community | {ubuntu} Community | Registration | {check} | {check} | Install packages | {check} | {check} | Apply patches | {check} | {check} | Remote commands | {check} | {check} | System package states | {check} | {check} | System custom states | {check} | {check} | Group custom states | {check} | {check} | Organization custom states | {check} | {check} | System set manager (SSM) | {check} | {check} | Product migration | N/A | N/A | Basic Virtual Guest Management {star} | {check} | {check} | Advanced Virtual Guest Management {star} | {check} | {check} | Virtual Guest Installation (Kickstart), as Host OS | {cross} | {cross} | Virtual Guest Installation (image template), as Host OS | {check} | {check} | System deployment (PXE/Kickstart) | {cross} | {cross} | System redeployment (Kickstart) | {cross} | {cross} | Contact methods | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | Works with {productname} Proxy | {check} | {check} | Action chains | {check} | {check} | Staging (pre-download of packages) | {check} | {check} | Duplicate package reporting | {check} | {check} | CVE auditing | {question} | {question} | SCAP auditing | {question} | {question} | Package verification | {cross} | {cross} | Package locking | {check} | {check} | Maintenance Windows | {check} | {check} | System locking | {cross} | {cross} | System snapshot | {cross} | {cross} | Configuration file management | {check} | {check} | Package profiles | {check} Profiles supported, Sync not supported | {check} Profiles supported, Sync not supported | Power management | {check} | {check} | Monitoring server | {cross} | {cross} | Monitored clients | {check} | {check} | Docker buildhost | {question} | {question} | Build Docker image with OS | {check} | {check} | Kiwi buildhost | {cross} | {cross} | Build Kiwi image with OS | {cross} | {cross} | Recurring Actions | {check} | {check} | AppStreams | N/A | N/A | Yomi | N/A | N/A
ca: | Característica | {ubuntu}{nbsp}22.04 | {ubuntu}{nbsp}24.04 | Client | {check} | {check} | Paquets del sistema | Comunitat {ubuntu} | Comunitat {ubuntu} | Registre | {check} | {check} | Instal·la paquets | {check} | {check} | Aplica pegats | {check} | {check} | Comandes remotes | {check} | {check} | Estats dels paquets del sistema | {check} | {check} | Estats personalitzats del sistema | {check} | {check} | Estats personalitzats del grup | {check} | {check} | Estats personalitzats de l'organització | {check} | {check} | Gestor de conjunts de sistemes (SSM) | {check} | {check} | Migració de productes | N/A | N/A | Gestió bàsica de convidats virtuals {star} | {check} | {check} | Gestió avançada de convidats virtuals {star} | {check} | {check} | Instal·lació de convidats virtuals (Kickstart), com a sistema operatiu amfitrió | {cross} | {cross} | Instal·lació de convidats virtuals (plantilla d'imatge), com a sistema operatiu amfitrió | {check} | {check} | Desplegament del sistema (PXE/Kickstart) | {cross} | {cross} | Redesplegament del sistema (Kickstart) | {cross} | {cross} | Mètodes de contacte | {check} ZeroMQ, Salt-SSH | {check} ZeroMQ, Salt-SSH | Funciona amb el proxy {productname} | {check} | Cadenes d'accions | {check} | {check} | Staging (predescàrrega de paquets) | {check} | {check} | Informes de paquets duplicats | {check} | {check} | Auditoria CVE | {question} | {question} | Auditoria SCAP | {pregunta} | {pregunta} | Verificació de paquets | {cross} | {cross} | Bloqueig de paquets | {check} | {check} | Finestres de manteniment | {check} | {check} | Bloqueig del sistema | {cross} | {cross} | Instantània del sistema | {cross} | {cross} | Gestió de fitxers de configuració | {check} | {check} | Perfils de paquets | {check} Perfils compatibles, sincronització no compatible | {check} Perfils compatibles, sincronització no compatible | Gestió d'energia | {check} | {check} | Servidor de monitorització | {cross} | {cross} | Clients monitoritzats | {check} | {check} | Amfitrió de compilació de Docker | {pregunta} | {pregunta} | Crea una imatge de Docker amb el sistema operatiu | {check} | {check} | Amfitrió de compilació de Kiwi | {cross} | {cross} | Crea una imatge de Kiwi amb el sistema operatiu | {cross} | {cross} | Accions recurrents | {check} | {check} | AppStreams | N/D | N/D | Yomi | N/D | N/D
