Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: Client operating system versions and SP levels must be under general support (normal or LTSS) to be supported with {productname}. For details on supported product versions, see https://www.suse.com/lifecycle.
ja: クライアントオペレーティングシステムのバージョンおよびSPレベルは、{productname}でサポートされる全般的なサポート(通常またはLTSS)の条件を基準にする必要があります。 サポートされている製品バージョンの詳細については、link:https://www.suse.com/lifecycle[]を参照してください。
ko: 클라이언트 운영 체제 버전 및 SP 수준에는 {productname}로 지원될 일반 지원(일반 또는 LTSS)이 적용되어야 합니다. 지원되는 제품 버전에 대한 상세 정보는 https://www.suse.com/lifecycle[]에서 참조하십시오.
zh_cn: 客户端操作系统的版本和 SP 级别必须享受标准支持（常规或 LTSS）才受 {productname} 的支持。有关受支持产品版本的细节，请参见 https://www.suse.com/lifecycle[]。

source: Supported Tools Packages
ja: サポートされているツールパッケージ
ko: 지원되는 도구 패키지
zh_cn: 支持的工具软件包

source: The ``spacewalk-utils`` and ``spacewalk-utils-extras`` packages can provide additional services and features.
ja: ``spacewalk-utils``パッケージおよび``spacewalk-utils-extras``パッケージは、追加のサービスおよび機能を提供できます。
ko: ``spacewalk-utils`` 및 ``spacewalk-utils-extras`` 패키지를 통해 추가 서비스 및 기능을 제공할 수 있습니다.
zh_cn: ``spacewalk-utils`` 和 ``spacewalk-utils-extras`` 软件包可提供额外的服务和功能。

source: | Tool Name | Description | Supported? | ``spacewalk-common-channels`` | Add channels not provided by {scc} | {check} | ``spacewalk-hostname-rename`` | Change the hostname of the {productname} Server | {check} | ``spacewalk-clone-by-date`` | Clone channels by a specific date | {check} | ``spacewalk-sync-setup`` | Set up ISS master and slave organization mappings | {check} | ``spacewalk-manage-channel-lifecycle`` | Manage channel lifecycles | {check}
ja: | ツール名 |説明 | サポートの有無 | ``spacewalk-common-channels`` | {scc} で提供されないチャンネルを追加します | {check} | ``spacewalk-hostname-rename`` | {productname}サーバのホスト名を変更します | {check} | ``spacewalk-clone-by-date`` |特定の日までにチャンネルを複製します | {check} | ``spacewalk-sync-setup`` | ISSマスタおよびスレーブの組織マッピングを設定します | {check} | ``spacewalk-manage-channel-lifecycle`` |チャンネルのライフサイクルを管理します | {check}
ko: | 도구 이름 | 설명 | 지원 여부 | ``spacewalk-common-channels`` | {scc} 가 제공하지 않는 채널 추가 | {check} | ``spacewalk-hostname-rename`` | {productname}의 호스트 이름 변경 | {check} | ``spacewalk-clone-by-date`` | 특정 날짜까지 채널 복제 | {check} | ``spacewalk-sync-setup`` | ISS 마스터 및 슬레이브 조직 매핑 설정 | {check} | ``spacewalk-manage-channel-lifecycle`` | 채널 라이프싸이클 관리 | {check}
zh_cn: | 工具名称 |说明 |受支持？ | ``spacewalk-common-channels`` | 添加 {scc} 不提供的通道 | {check} | ``spacewalk-hostname-rename`` | 更改 {productname} 服务器的主机名 | {check} | ``spacewalk-clone-by-date`` | 按特定日期克隆通道 | {check} | ``spacewalk-sync-setup`` | 设置 ISS 主组织和从属组织映射 | {check} | ``spacewalk-manage-channel-lifecycle`` | 管理通道生命周期 | {check}

source: The actions available for use in SSM are listed in this table. The icons in this table indicate:
ja: SSMで使用できるアクションを次の表に示します。 この表のアイコンの意味は次のとおりです。
ko: SSM에 사용할 수 있는 작업이 아래 표에 나열되어 있습니다. 이 표의 아이콘에는 다음과 같은 의미가 있습니다.
zh_cn: 下表列出了可在 SSM 中使用的操作。此表中图标的含意如下：

source: In the [guimenu]``Zone`` field, type the zone your VM is located in. This is required for subscription matching to work. For more information about setting regions and zones, see xref:client-configuration:virtualization.adoc#_susesupport_and_vm_zones[].
ja: ［[guimenu]``Zone``］（ゾーン）フィールドに、VMが存在するゾーンを入力します。 これは、サブスクリプションマッチングを動作させるために必要です。 リージョンおよびゾーンの設定の詳細については、xref:client-configuration:virtualization.adoc#_susesupport_and_vm_zones[]を参照してください。
ko: [guimenu]`` 영역`` 필드에 VM이 있는 영역을 입력합니다. 이 영역은 작업과 일치하는 구독에 필요합니다. 지역 및 영역 설정에 대한 자세한 설명은 xref:client-configuration:virtualization.adoc#_susesupport_and_vm_zones[]를 참조하십시오.
zh_cn: 在[guimenu]``区域``字段中，键入您的 VM 所在的区域。要使订阅匹配功能正常工作，就必须提供此信息。有关设置地区和区域的详细信息，请参见 xref:client-configuration:virtualization.adoc#_susesupport_and_vm_zones[]。

source: For SUSE Manager to gather the information required from AWS, the VHM needs permission to describe EC2 instances and addresses. One method to grant this is to create a new IAM user (Identity and Access Management) specific to this task, create a policy as follows and attach to the user:
ja: SUSE ManagerがAWSから必要な情報を収集するには、VHMにEC2インスタンスとアドレスを記述する許可が必要です。これを許可する1つの方法は、このタスクに固有の新しいIAMユーザ(IDおよびアクセス管理)を作成し、次のようにポリシーを作成して、ユーザにアタッチすることです。
ko: SUSE Manager가 AWS에서 필요한 정보를 수집하기 위해서는 VHM에 EC2 인스턴스 및 주소를 설명할 수 있는 권한이 필요합니다. 이러한 권한을 부여할 수 있는 한 가지 방법은 이 작업과 관련된 새 IAM 사용자(ID 및 액세스 관리)를 생성하고 다음과 같이 정책을 생성한 후 사용자에게 연결하는 것입니다.
zh_cn: 为了让 SUSE Manager 从 AWS 收集所需的信息，VHM 需要相权限来说明 EC2 实例和地址。一种收集此信息的方法是专门为此任务创建一个新的 IAM 用户 (Identity and Access Management)，创建一个如下策略并关联到该用户：

source: Similarly, if you have a VMWare installation that does not provide direct access to the API, a file-based VHM provides you with some basic management features.
ja: 同様に、APIへの直接アクセスを提供しないVMWareインストール環境の場合、ファイルベースのVHMが基本的な管理機能を提供します。
ko: 이와 마찬가지로 API에 대한 직접 액세스를 제공하지 않는 VMWare가 설치된 경우 파일 기반 VHM은 몇 가지 기본 관리 기능을 제공합니다.
zh_cn: 同样，如果您安装的 VMWare 不提供直接访问 API 的功能，基于文件的 VHM 可以为您提供基本的管理功能。

source: {suse} is a Nutanix ecosystem partner and SUSE Manager has obtained the Nutanix-ready certification in the "Nutanix AHV integrated" category.
ja: {suse}はNutanixエコシステムパートナーで、SUSE Managerは"Nutanix AHV integrated"カテゴリでNutanix対応の認証を取得しています。
ko: {suse}는 Nutanix 에코시스템 파트너이며, SUSE Manager는 \Nutanix AHV 통합\ 범주에서 Nutanix 지원 인증을 획득하였습니다.
zh_cn: {suse} 是 Nutanix 的生态系统合作伙伴，SUSE Manager 已获得 "Nutanix AHV integrated" 类别的 Nutanix Ready 认证。

source: Virtualization with VMWare
ja: VMWareによる仮想化
ko: VMWare를 이용한 가상화
zh_cn: 使用 VMWare 虚拟化

source: You can use VMWare vSphere virtual machines, including ESXi and vCenter, with {productname} by setting up a virtual host manager (VHM).
ja: {productname}では、ESXiやvCenterなどのVMWare vSphere仮想マシンを使用できます。そのためには、仮想ホストマネージャ(VHM)を設定します。
ko: 가상 호스트 관리자(VHM)를 설정하여 {productname}에서 ESXi 및 vCenter를 포함한 VMWare vSphere 가상 머신을 사용할 수 있습니다.
zh_cn: 您可以在 {productname} 中设置虚拟主机管理器 (VHM) 来使用 VMWare vSphere 虚拟机，包括 ESXi 和 vCenter。

source: To run a VHM, your {productname} Server needs to have port 443 open, to access the VMWare API.
ja: VHMを実行するには、{productname}サーバでポート443がオープンになっていて、VMWare APIにアクセスする必要があります。
ko: VHM을 실행하려면 {productname} 서버가 포트 443을 열어 VMWare API에 액세스해야 합니다.
zh_cn: 要运行 VHM，需要打开端口 443 以使您的 {productname} 服务器可访问 VMWare API。

source: VMWare hosts use access roles and permissions to control access to hosts and guests. Ensure that any VMWare objects or resources that you want to be inventoried by the VHM have at least [parameter]``read-only`` permissions. If you want to exclude any objects or resources, mark them with [parameter]``no-access``.
ja: VMWareホストは、アクセスロールとパーミッションを使用して、ホストおよびゲストへのアクセスを制御します。 VHMで評価するVMWareのオブジェクトまたはリソースに少なくとも[parameter]``read-only``パーミッションがあることを確認してください。 任意のオブジェクトまたはリソースを除外する場合、除外対象に[parameter]``no-access``というマークを付けます。
ko: VMWare 호스트는 액세스 역할 및 권한을 사용해 호스트 및 게스트에 대한 액세스를 제어합니다. VHM에 의해 목록에 포함되었으면 하는 모든 VMWare 객체 또는 리소스에 최소한 [parameter]``읽기 전용`` 권한이 있는지 확인합니다. 객체 또는 리소스를 제외하려면 해당 객체 또는 리소스를 [parameter]``no-access``로 표시하십시오.
zh_cn: VMWare 主机使用访问权限角色和权限来控制对主机和 Guest 的访问。请确保您要让 VHM 清点的任何 VMWare 对象或资源均至少具有[parameter]``只读``权限。如果您要排除任何对象或资源，请将它们标记为[parameter]``无访问权限``。

source: For more on users, roles, and permissions, see the VMWare vSphere documentation: https://docs.vmware.com/en/VMware-vSphere/index.html
ja: ユーザ、ロール、およびパーミッションの詳細については、VMWare vSphereのドキュメント(link:https://docs.vmware.com/en/VMware-vSphere/index.html[])を参照してください。
ko: 사용자, 역할 및 권한에 대한 자세한 내용은 VMWare vSphere 문서(https://docs.vmware.com/en/VMware-vSphere/index.html[])에서 참조하십시오.
zh_cn: 有关用户、角色和权限的详细信息，请参见 VMWare vSphere 文档，网址为：link:https://docs.vmware.com/en/VMware-vSphere/index.html[]

source: Procedure: Creating a VMWare VHM
ja: プロシージャ: VMWare VHMの作成
ko: 절차: VMWare VHM 생성
zh_cn: 过程：创建 VMWare VHM

source: Click btn:[Create] and select [guimenu]``VMWare-based``.
ja: btn:[作成]をクリックし、［[guimenu]``VMWareベース``］を選択します。
ko: btn:[생성]을 클릭하고 [guimenu]``VMWare 기반``을 선택합니다.
zh_cn: 单击 btn:[创建]，然后选择[guimenu]``基于 VMWare``。

source: In the [guimenu]``Add a VMWare-based Virtual Host Manager`` section, use these parameters:
ja: ［[guimenu]``Add a VMWare-based Virtual Host Manager``］（VMWareベースの仮想ホストマネージャの追加）セクションで、次のパラメータを使用します。
ko: [guimenu]``VMWare 기반 가상 호스트 관리자 추가`` 섹션에서 다음과 같은 파라미터를 사용합니다.
zh_cn: 在[guimenu]``添加基于 VMWare 的虚拟主机管理器``部分，使用以下参数：

source: Troubleshooting SSL Errors on VMWare
ko: VMWare에서 SSL 오류 문제 해결
zh_cn: 在 VMWare 上对 SSL 错误进行查错

source: If you see SSL errors while configuring your VMWare installation, you need to download the CA certificate file from VMWare, and trust it on {productname}.
ja: VMWareのインストール環境を設定中にSSLエラーが発生した場合、VMWareからCA証明書をダウンロードし、{productname}で信頼する必要があります。
ko: VMWare 설치를 구성하는 중에 SSL 오류가 발생한 경우 VMWare에서 CA 인증서 파일을 다운로드하여 {productname}에서 신뢰해야 합니다.
zh_cn: 如果您在配置安装的 VMWare 时遇到 SSL 错误，需要下载 VMWare 提供的 CA 证书文件，并在 {productname} 上信任该证书。

source: Procedure: Trusting VMWare CA Certificates
ko: 절차: VMWare CA 인증서 신뢰
zh_cn: 过程：信任 VMWare CA 证书

source: Download the CA Certificate from your VMWare installation.
ko: VMWare 설치에서 CA 인증서를 다운로드합니다.
zh_cn: 从您安装的 VMWare 中下载 CA 证书。

source: You must have a virtualization add-on subscription for each host with the Virtualization Server entitlement in {productname}.
ja: {productname}の仮想化サーバエンタイトルメントを持つホストごとに仮想化アドオンサブスクリプションが必要です。
ko: {productname}에서 가상화 서버 자격이 있는 각 호스트에 대해 가상화 애드온을 구독해야 합니다.
zh_cn: 对于 {productname} 中具有“虚拟化服务器”权利的每个主机，您必须有一个虚拟化附加订阅。

source: Virtualization with Xen and KVM
ja: XenおよびKVMを使用した仮想化
ko: Xen 및 KVM을 이용한 가상화
zh_cn: 使用 Xen 和 KVM 虚拟化

source: Xen and KVM virtualized clients can be managed directly in {productname}.
ja: XenおよびKVMの仮想化クライアントは{productname}で直接管理できます。
ko: Xen 및 KVM 가상화 클라이언트는 {productname}에서 직접 관리할 수 있습니다.
zh_cn: 您可以直接在 {productname} 中管理 Xen 和 KVM 虚拟化客户端。

source: Host setup
ja: ホストの設定
ko: 호스트 설정
zh_cn: 主机设置

source: For {rhel} operating systems, refer to the Red Hat documentation for your version.
ja: {rhel}オペレーティングシステムについては、使用バージョンに応じてRed Hatのドキュメントを参照してください。
ko: {rhel} 운영 체제의 경우 해당 버전의 Red Hat 문서를 참조하십시오.
zh_cn: 对于 {rhel} 操作系统，请参见适用于您所用版本的 Red Hat 文档。

source: The [systemitem]``Virtualization Host`` formula will help you with initializing the host. For more information, see xref:client-configuration:virt-xenkvm.adoc#virt-xenkvm-host-formula[].
ja: [systemitem]``仮想化ホスト``式は、ホストの初期化を支援します。 詳細については、xref:client-configuration:virt-xenkvm.adoc#virt-xenkvm-host-formula[]を参照してください。
ko: [systemitem]``가상화 호스트`` 수식을 사용하면 호스트를 초기화하는 데 유용합니다. 자세한 내용은 xref:client-configuration:virt-xenkvm.adoc#virt-xenkvm-host-formula[]에서 확인할 수 있습니다.
zh_cn: 借助[systemitem]``虚拟化主机``公式，您可以初始化主机。有关详细信息，请参见 xref:client-configuration:virt-xenkvm.adoc#virt-xenkvm-host-formula[]。

source: Initialize [systemitem]``Virtualization Host``
ja: [systemitem]``仮想化ホスト``の初期化
ko: [systemitem]``가상화 호스트`` 초기화
zh_cn: 初始化[systemitem]``虚拟化主机``

source: With the [systemitem]``Virtualization Host`` formula, initialize the host:
ja: [systemitem]``仮想化ホスト``式で、ホストを初期化します。
ko: [systemitem]``가상화 호스트`` 수식을 사용하여 다음과 같이 호스트를 초기화합니다.
zh_cn: 使用[systemitem]``虚拟化主机``公式初始化主机：

source: Procedure: Initializing [systemitem]``Virtualization Host``
ja: プロシージャ: [systemitem]``仮想化ホスト``の初期化
ko: 절차: [systemitem]``가상화 호스트`` 초기화
zh_cn: 过程：初始化[systemitem]``虚拟化主机``

source: In the {productname} {webui}, navigate to the [guimenu]``System Details`` page for the host, and click the [guimenu]``Formulas`` tab.
ja: {productname}の{webui}で、ホストの［[guimenu]``システムの詳細``］ページに移動し、［[guimenu]``式`` ］タブをクリックします。
ko: {productname} {webui}에서 호스트의 [guimenu]``시스템 정보`` 페이지로 이동하고 [guimenu]``수식`` 탭을 클릭합니다.
zh_cn: 在 {productname} {webui} 中，导航到主机的[guimenu]``系统细节``页面，然后单击[guimenu]``公式``选项卡。

source: Select the [systemitem]``Virtualization Host`` formula, and click btn:[Save].
ja: [systemitem]``仮想化ホスト``式を選択し、btn:[保存]をクリックします。
ko: [systemitem]``가상화 호스트`` 수식을 선택하고 btn:[저장]을 클릭합니다.
zh_cn: 选择[systemitem]``虚拟化主机``公式，然后单击 btn:[保存]。

source: Click the [systemitem]``Virtualization Host`` subtab.
ja: [systemitem]``仮想化ホスト``サブタブをクリックします。
ko: [systemitem]``가상화 호스트`` 하위 탭을 클릭합니다.
zh_cn: 单击[systemitem]``虚拟化主机``子选项卡。

source: Check the settings, and click btn:[Save Formula].
ja: 設定を確認して、btn:[式の保存]をクリックします。
ko: 설정을 확인하고 btn:[수식 저장]을 클릭합니다.
zh_cn: 选中相应设置，然后单击 btn:[保存公式]。

source: Apply the Highstate for the changes to take effect.
ja: 変更を有効にするには、Highstateを適用します。
ko: 변경 사항을 적용하려면 Highstate를 적용합니다.
zh_cn: 应用 Highstate，以使更改生效。

source: Restart the [systemitem]``salt-minion`` service to activate the new configuration:
ja: [systemitem]``salt-minion``サービスを再起動し、新しい設定を有効にします。
ko: [systemitem]``salt-minion`` 서비스를 다시 시작해 새 구성을 활성화합니다.
zh_cn: 重启动 [systemitem]``salt-minion`` 服务以激活新配置：

source: Autoinstall VM Guests
ja: VMゲストの自動インストール
ko: VM 게스트 자동 설치
zh_cn: 自动安装 VM Guest

source: You can use {ay} or {kickstart} to automatically install and register Xen and KVM guests.
ja: {ay}または{kickstart}を使用して、XenおよびKVMのゲストを自動的にインストールして登録できます。
ko: {ay} 또는 {kickstart}를 사용해 Xen 및 KVM 게스트를 자동으로 설치하고 등록할 수 있습니다.
zh_cn: 您可以使用 {ay} 或 {kickstart} 自动安装并注册 Xen 和 KVM Guest。

source: Create an Autoinstallable Distribution
ja: 自動インストール可能なディストリビューションの作成
ko: 자동 설치 가능한 배포판 생성
zh_cn: 创建可自动安装的发行套件

source: You need to create an autoinstallable distribution on the VM host to be able to autoinstall clients from {productname}. The distribution can be made available from a mounted local or remote directory, or on a loop-mounted ISO image.
ja: {productname}からクライアントを自動インストールできる自動インストール可能なディストリビューションをVMに作成する必要があります。 ディストリビューションは、マウントされたローカルディレクトリやリモートディレクトリから使用できたり、ループマウントされたISOイメージで使用できます。
ko: {productname}에서 클라이언트를 자동 설치하려면 VM 호스트에 자동 설치 가능한 배포를 생성해야 합니다. 마운트한 로컬 또는 원격 디렉토리나 루프 마운트 ISO 이미지에서 배포를 사용할 수 있는 상태로 만들 수 있습니다.
zh_cn: 您需要在 VM 主机上创建可自动安装的发行套件，才能通过 {productname} 自动安装客户端。可以在挂载的本地或远程目录提供发行套件，也可以在以循环方式挂载的 ISO 映像中提供。

source: In all cases, ensure that the base channel matches the autoinstallable distribution.
ja: すべてのケースで、ベースチャンネルが自動インストール可能なディストリビューションと一致していることを確認してください。
ko: 모든 경우 기본 채널이 자동 설치 배포와 일치하는지 확인하십시오.
zh_cn: 在所有情况下，均需确保基础通道与可自动安装的发行套件匹配。

source: In the {productname} {webui}, navigate to menu:Systems[Autoinstallation > Distributions] and click btn:[Create Distribution].
ja: {productname}の{webui}で、menu:システム[自動インストール > ディストリビューション]に移動し、btn:[ディストリビューションの作成]をクリックします。
ko: {productname} {webui}에서 menu:시스템[자동 설치 > 배포판]으로 이동한 후 btn:[배포 생성]을 클릭합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[自动安装 > 发行套件]，然后单击 btn:[创建发行套件]。

source: In the [guimenu]``Create Autoinstallable Distribution`` section, use these parameters:
ja: ［[guimenu]``自動インストール可能なディストリビューションの作成``］セクションで、次のパラメータを使用します。
ko: [guimenu]``자동 설치 가능한 배포판 생성`` 섹션에서 다음 파라미터를 사용합니다.
zh_cn: 在[guimenu]``创建可自动安装的发行套件``部分，使用以下参数：

source: In the [guimenu]``Distribution Label`` section, type a unique name for the distribution.
ja: ［[guimenu]``ディストリビューションラベル``］セクションに、ディストリビューションの固有の名前を入力します。
ko: [guimenu]``배포판 레이블`` 섹션에 배포판의 고유 이름을 입력합니다.
zh_cn: 在[guimenu]``发行套件标签``部分，键入发行套件的唯一名称。

source: Use only letters, numbers, hyphens (``-``), periods (``.``), and underscores (``_``), and ensure the name is longer than four characters.
ja: 半角の英字、数字、ハイフン(``-``)、ピリオド(``.``)、および下線(``_``)のみを使用し、5文字以上にしてください。
ko: 글자, 숫자, 하이픈(``-``), 마침표(``.``), 밑줄(``_``)만 사용하고, 이름을 구성하는 문자는 다섯 개 이상이어야 합니다.
zh_cn: 请仅使用字母、数字、连字符 (``-``)、点 (``.``) 和下划线 (``_``)，并确保名称包含四个以上字符。

source: In the [guimenu]``Tree Path`` field, type an absolute path to the installation source.
ja: ［[guimenu]``ツリーパス``］フィールドに、インストールソースへの絶対パスを入力します。
ko: [guimenu]``트리 경로`` 필드에 설치 원본의 절대 경로를 입력합니다.
zh_cn: 在[guimenu]``树路径``字段中，键入安装源的绝对路径。

source: In the [guimenu]``Base Channel`` field, select the channel that matches the installation source.
ja: ［[guimenu]``ベースチャンネル``］フィールドで、インストールソースと一致するチャンネルを選択します。
ko: [guimenu]``기본 채널`` 필드에서 설치 소스와 일치하는 채널을 선택합니다.
zh_cn: 在[guimenu]``基础通道``字段中，选择与安装源匹配的通道。

source: This channel is used as the package source for non-{suse} installations.
ja: このチャンネルは、非{suse}インストール環境用のパッケージソースとして使用されます。
ko: 이 채널은 비{suse} 설치에 대해 패키지 소스로 사용됩니다.
zh_cn: 此通道用作非 {suse} 安装的软件包源。

source: In the [guimenu]``Installer Generation`` field, select the operating system version that matches the installation source.
ja: ［[guimenu]``インストーラ生成``］フィールドで、インストールソースと一致するオペレーティングシステムのバージョンを選択します。
ko: [guimenu]``설치 프로그램 생성`` 필드에서 설치 소스와 일치하는 운영 체제 버전을 선택합니다.
zh_cn: 在[guimenu]``安装程序代系``字段中，选择与安装源匹配的操作系统版本。

source: In the [guimenu]``Kernel Options`` field, type any options to be passed to the kernel when booting for the installation.
ja: ［[guimenu]``カーネルオプション``］フィールドに、インストールでブート時にカーネルに渡すオプションを入力します。
ko: [guimenu]``커널 옵션`` 필드에는, 설치를 위해 부팅할 때 커널로 전달될 옵션을 입력합니다.
zh_cn: 在[guimenu]``内核选项``字段中，键入在安装期间引导时要传递给内核的任何选项。

source: In the [guimenu]``Post Kernel Options`` section, type any options to be passed to the kernel when booting the installed system for the first time.
ja: インストールしたシステムを初めてブートするときにカーネルに渡すオプションを［[guimenu]``カーネルの後のオプション``］セクションに入力します。
ko: [guimenu]``커널 후 옵션`` 섹션에는, 설치된 시스템을 처음 부팅할 때 커널로 전달될 옵션을 입력합니다.
zh_cn: 在[guimenu]``后内核选项``部分，键入在首次引导安装的系统时要传递给内核的任何选项。

source: Click btn:[Create Autoinstallable Distribution] to save.
ja: btn:[自動インストール可能なディストリビューションの作成]をクリックして保存します。
ko: btn:[자동 설치 가능한 배포판 생성]을 클릭하여 저장합니다.
zh_cn: 单击 btn:[创建可自动安装的发行套件] 保存设置。

source: When you have created an autoinstallable distribution, you can edit it by navigating to menu:Systems[Autoinstallation > Distributions] and selecting the distribution you want to edit.
ja: 自動インストール可能なディストリビューションを作成するとき、これを編集できます。そのためには、menu:システム[自動インストール > ディストリビューション]に移動し、編集するディストリビューションを選択します。
ko: 자동 설치 가능한 배포판을 생성했으면 menu:시스템[자동 설치 > 배포판]으로 이동하여 편집할 배포판을 선택하고 편집할 수 있습니다.
zh_cn: 创建可自动安装的发行套件后，您可以导航到menu:系统[自动安装 > 发行套件]，然后选择要编辑的发行套件进行编辑。

source: Create and Upload an Autoinstallation Profile
ja: 自動インストールプロファイルの作成およびアップロード
ko: 자동 설치 프로파일 생성 및 업로드
zh_cn: 创建并上载自动安装配置文件

source: Autoinstallation profiles contain all the installation and configuration data needed to install a system. They can also contain scripts to be executed after the installation is complete.
ja: 自動インストールプロファイルには、システムをインストールするために必要なインストールデータおよび設定データがすべて含まれています。 インストール完了後に実行するスクリプトを含めることもできます。
ko: 자동 설치 프로파일에는 시스템을 설치하는 데 필요한 모든 설치 및 구성 데이터가 포함되어 있습니다. 설치 완료 후 실행될 스크립트도 포함할 수 있습니다.
zh_cn: 自动安装配置文件包含安装系统所需的所有安装和配置数据， 还包含安装完成后需要执行的脚本。

source: {kickstart} profiles can be created using the {productname} {webui}, by navigating to menu:Systems[Autoinstallation > Profiles], clicking btn:[Create New Kickstart File], and following the prompts.
ja: {kickstart}プロファイルは{productname}の{webui}を使用して作成できます。そのためには、menu:システム[自動インストール > プロファイル]に移動し、btn:[新しいキックスタートプロファイルを作成]をクリックし、プロンプトに従って操作します。
ko: {kickstart} 프로파일은 {productname} {webui}에서 menu:시스템[자동 설치 > 프로파일]로 이동하여 btn:[새 Kickstart 파일 생성]을 클릭하고 표시되는 프롬프트에 따라 생성할 수 있습니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[自动安装 > 配置文件]，单击 btn:[创建新 Kickstart 配置文件]，然后按照提示操作即可创建 {kickstart} 配置文件。

source: You can also create {ay} or {kickstart} autoinstallation profiles by hand. {suse} provides templates of {ay} installation files that you can use as a starting point for your own custom files. You will find them at https://github.com/SUSE/manager-build-profiles.
ja: {ay}または{kickstart}の自動インストールプロファイルを手動で作成することもできます。 {suse}には、独自のカスタムファイルの雛形として使用できる{ay}インストールファイルのテンプレートが用意されています。 これは、link:https://github.com/SUSE/manager-build-profiles[]にあります。
ko: {ay} 또는 {kickstart} 자동 설치 프로파일을 수동으로 생성할 수도 있습니다. {suse}는 사용자 정의 파일의 시작점으로 사용할 수 있는 {ay} 설치 파일의 템플릿을 제공합니다. 템플릿은 link:https://github.com/SUSE/manager-build-profiles[]에서 확인할 수 있습니다.
zh_cn: 您也可以手动创建 {ay} 或 {kickstart} 自动安装配置文件。{suse} 提供了 {ay} 安装文件模板，您可以基于它们创建自己的自定义文件。您可以在 https://github.com/SUSE/manager-build-profiles 中找到这些模板。

source: If you are using {ay} to install SLES, you also need to include this snippet:
ja: {ay}を使用してSLESをインストールする場合、次のスニペットも含める必要があります。
ko: {ay}를 사용하여 SLES를 설치하는 경우 다음 코드 조각도 포함해야 합니다.
zh_cn: 如果您要使用 {ay} 安装 SLES，则还需要包含以下代码段：

source: For more on {ay}, see xref:client-configuration:autoinst-profiles.adoc#autoyast[].
ja: {ay}の詳細については、xref:client-configuration:autoinst-profiles.adoc#autoyast[]を参照してください。
ko: {ay}에 대한 설명은 xref:client-configuration:autoinst-profiles.adoc#autoyast[]를 참조하십시오.
zh_cn: 有关 {ay} 的详细信息，请参见 xref:client-configuration:autoinst-profiles.adoc#autoyast[]。

source: For more on {kickstart}, see xref:client-configuration:autoinst-profiles.adoc#kickstart[], or refer to the Red Hat documentation for your installation.
ja: {kickstart}については、xref:client-configuration:autoinst-profiles.adoc#kickstart[]を参照するか、Red Hatのインストール関連ドキュメントを参照してください。
ko: {kickstart}에 대한 자세한 설명은 xref:client-configuration:autoinst-profiles.adoc#kickstart[]를 참조하거나 해당 설치에 대한 Red Hat 문서를 참조하십시오.
zh_cn: 有关 {kickstart} 的详细信息，请参见 xref:client-configuration:autoinst-profiles.adoc#kickstart[] 或适用于您的安装的 Red Hat 文档。

source: Procedure: Uploading an Autoinstallation Profile
ja: プロシージャ: 自動インストールプロファイルのアップロード
ko: 절차: 자동 설치 프로파일 업로드
zh_cn: 过程：上载自动安装配置文件

source: In the {productname} {webui}, navigate to menu:Systems[Autoinstallation > Profiles] and click btn:[Upload Kickstart/AutoYaST File].
ja: {productname}の{webui}で、menu:システム[自動インストール > プロファイル]に移動し、btn:[キックスタート/Autoyastファイルをアップロード]をクリックします。
ko: {productname} {webui}에서 menu:시스템[자동 설치 > 프로파일]로 이동하여 btn:[Kickstart/AutoYaST 파일 업로드]를 클릭합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[自动安装 > 配置文件]，然后单击 btn:[上载 Kickstart/Autoyast 文件]。

source: In the [guimenu]``Create Autoinstallation Profile`` section, use these parameters:
ja: ［[guimenu]``自動インストールプロファイルを作成``］セクションで、次のパラメータを使用します。
ko: [guimenu]``자동 설치 프로파일 생성`` 섹션에서 다음 파라미터를 사용합니다.
zh_cn: 在[guimenu]``创建自动安装配置文件``部分，使用以下参数：

source: In the [guimenu]``Label`` field, type a unique name for the profile.
ja: ［[guimenu]``ラベル``］フィールドにプロファイルの一意の名前を入力します。
ko: [guimenu]``레이블`` 필드에 프로파일의 고유 이름을 입력합니다.
zh_cn: 在[guimenu]``标签``字段中，为配置文件键入一个唯一的名称。

source: Use only letters, numbers, hyphens (``-``), periods (``.``), and underscores (``_``), and ensure the name is longer than six characters.
ja: 半角の英字、数字、ハイフン(``-``)、ピリオド(``.``)、および下線(``_``)のみを使用し、7文字以上にしてください。
ko: 글자, 숫자, 하이픈(``-``), 마침표(``.``), 밑줄(``_``)만 사용하고, 이름을 구성하는 문자는 일곱 개 이상이어야 합니다.
zh_cn: 请仅使用字母、数字、连字符 (``-``)、点 (``.``) 和下划线 (``_``)，并确保名称包含六个以上字符。

source: In the [guimenu]``Autoinstall Tree`` field, select the autoinstallable distribution you created earlier.
ja: ［[guimenu]``自動インストールツリー``］フィールドで、前に作成した自動インストール可能なディストリビューションを選択します。
ko: [guimenu]``자동 설치 트리`` 필드에서 앞서 생성한 자동 설치 가능한 배포를 선택합니다.
zh_cn: 在[guimenu]``自动安装树``字段中，选择您之前创建的可自动安装的发行套件。

source: In the [guimenu]``Virtualization Type`` field, select the relevant Guest type (for example, [parameter]``KVM Virtualized Guest``.
ja: ［[guimenu]``仮想化タイプ``］フィールドで、関連するゲストの種類を選択します([parameter]``KVM仮想化ゲスト``など)。
ko: [guimenu]``가상화 유형`` 필드에서 해당되는 게스트 유형(예: [parameter]``KVM 가상화 게스트``)을 선택합니다.
zh_cn: 在[guimenu]``虚拟化类型``字段中，选择相关的 Guest 类型（例如 [parameter]``KVM 虚拟化 Guest``）。

source: Do not choose [guimenu]``Xen Virtualized Host`` here.
ja: ここでは、［[guimenu]``Xen仮想化ホスト``］を選択しないでください。
ko: 여기에서 [guimenu]``Xen 가상화 호스트``를 선택하지 마십시오.
zh_cn: 请勿在此处选择 [guimenu]``Xen 虚拟化主机``。

source: OPTIONAL: If you want to manually create your autoinstallation profile, you can type it directly into the [guimenu]``File Contents`` field.
ja: オプション: 自動インストールプロファイルを手動で作成する場合、［[guimenu]``ファイルの内容``］フィールドに直接入力できます。
ko: 옵션: 자동 설치 프로파일을 수동으로 생성하려면 [guimenu]``파일 내용`` 필드에 프로파일을 직접 입력할 수 있습니다.
zh_cn: 可选：如果您要手动创建自动安装配置文件，可以直接在[guimenu]``文件内容``字段中键入相应内容。

source: If you have a file already created, leave the [guimenu]``File Contents`` field blank.
ja: ファイルを作成済みの場合、［[guimenu]``ファイルの内容``］フィールドを空白のままにします。
ko: 파일을 이미 생성한 경우 [guimenu]``파일 내용`` 필드를 공백으로 두십시오.
zh_cn: 如果您已创建文件，请将[guimenu]``文件内容``字段留空。

source: In the [guimenu]``File to Upload`` field, click btn:[Choose File], and use the system dialog to select the file to upload.
ja: ［[guimenu]``アップロードするファイル``］フィールドで、btn:[Choose File]（ファイルの選択）をクリックし、システムダイアログを使用して、アップロードするファイルを選択します。
ko: [guimenu]``업로드할 파일`` 필드에서 btn:[파일 선택]을 클릭하고 시스템 대화 상자를 사용해 업로드할 파일을 선택합니다.
zh_cn: 在[guimenu]``要上载的文件``字段中，单击 btn:[选择文件]，然后使用系统对话框选择要上载的文件。

source: If the file is successfully uploaded, the filename is shown in the [guimenu]``File to Upload`` field.
ja: ファイルが正常にアップロードされると、ファイル名が［[guimenu]``アップロードするファイル``］フィールドに表示されます。
ko: 파일 업로드가 완료되면 파일 이름이 [guimenu]``업로드할 파일`` 필드에 표시됩니다.
zh_cn: 如果文件成功上载，[guimenu]``要上载的文件``字段中会显示相应文件名。
