Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: For example, when working with `x86_64` architecture, you need this product:
ca: Per exemple, quan es treballa amb l'arquitectura xx8664,, es necessita aquest producte:
ja: たとえば、「``x86_64``」アーキテクチャを使用する場合は、次の製品が必要です。
ko: 예를 들어, `x86_64` 아키텍처에서 작업 시 필요한 제품은 다음과 같습니다.
zh_cn: 例如，使用 `x86_64` 体系结构时，您需要如下产品：

source: {almalinux} Products - WebUI
ca: {almalinux} Productes - WebUI
ja: {almalinux}製品 - WebUI
ko: {almalinux} 제품 - WebUI
zh_cn: {almalinux} 产品 - WebUI

source: | OS Version | Product Name | {almalinux} 9 | {almalinux} 9 x86_64 | {almalinux} 8 | {almalinux} 8 x86_64
ca: Versió del SO Nom del producte {amazon} 2 Amazon Linux 2 x8664
ko: | OS 버전 | 제품 이름 | {almalinux} 9 | {almalinux} 9 x86_64 | {almalinux} 8 | {almalinux} 8 x86_64
zh_cn: | 操作系统版本 | 产品名称 | {almalinux} 9 | {almalinux} 9 x86_64 | {almalinux} 8 | {almalinux} 8 x86_64

source: {almalinux} Channels - CLI
ca: {almalinux} canals - CLI
ja: {almalinux} チャンネル - CLI
ko: {almalinux} 채널 - CLI
zh_cn: {almalinux} 通道 - CLI

source: | OS Version | Base Channel | {almalinux} 9 | almalinux9-x86_64 | {almalinux} 8 | almalinux8-x86_64
ca: | Versió del SO | Canal base | {amazon} 2 | amazonlinux2-core-x86_64
ko: | OS 버전 | 기본 채널 | {almalinux} 9 | almalinux9-x86_64 | {almalinux} 8 | almalinux8-x86_64
zh_cn: | 操作系统版本 | 基础通道 | {almalinux} 9 | almalinux9-x86_64 | {almalinux} 8 | almalinux8-x86_64

source: | OS Version | Base Channel | Client Channel | AppStream Channel | {almalinux} 9 | almalinux9 | almalinux9-uyuni-client | almalinux9-appstream | {almalinux} 8 | almalinux8 | almalinux8-uyuni-client | almalinux8-appstream
ca: Versió del SO Canal base Canal client Canal AppStream {almalinux} 9 almalinux9 almalinux9-uyuni-client almalinux9-appstream {almalinux} 8 almalinux8 almalinux8-uyuni-client almalinux8-appstream
ko: | OS 버전 | 기본 채널 | 클라이언트 채널 | AppStream 채널 | {almalinux} 9 | almalinux9 | almalinux9-uyuni-client | almalinux9-appstream | {almalinux} 8 | almalinux8 | almalinux8-uyuni-client | almalinux8-appstream
zh_cn: | 操作系统版本 | 基础通道 | 客户端通道 | AppStream 通道 | {almalinux} 9 | almalinux9 | almalinux9-uyuni-client | almalinux9-appstream | {almalinux} 8 | almalinux8 | almalinux8-uyuni-client | almalinux8-appstream

source: For {almalinux} 9 and {almalinux} 8 clients, add both the Base and AppStream channels. You require packages from both channels. If you do not add both channels, you cannot create the bootstrap repository, due to missing packages.
ca: Per als clients {almalinux} 9 i {almalinux} 8, afegiu tant els canals Base com AppStream. Necessiteu paquets d'ambdós canals. Si no afegiu els dos canals, no podreu crear el repositori bootstrap, a causa de la manca de paquets.
ja: {almalinux} 9および{almalinux} 8クライアントでは、ベースチャンネルとAppStreamチャンネルの両方を追加します。 両方のチャンネルのパッケージが必要です。 両方のチャンネルを追加しないと、パッケージ不足のためブートストラップリポジトリを作成できません。
ko: {almalinux} 9 및 {almalinux} 8 클라이언트의 경우 기본 채널과 AppStream 채널을 모두 추가하십시오. 사용자에게는 두 채널의 패키지가 모두 필요합니다. 두 채널을 모두 추가하지 않으면 패키지가 누락되어 부트스트랩 리포지토리를 생성할 수 없습니다.
zh_cn: 对于 {almalinux} 9 和 {almalinux} 8 客户端，请添加基础通道和 AppStream 通道。您需要来自这两个通道的软件包。如果未添加这两个通道，将会因缺少软件包而无法创建引导储存库。

source: If you are using modular channels, you must enable the Python 3.6 module stream on the {almalinux} 8 client. If you do not provide Python 3.6, the installation of the [package]``spacecmd`` package will fail.
ca: Si esteu utilitzant canals modulars, heu d'habilitar el flux del mòdul Python 3.6 al client. Si no proporcioneu Python 3.6, la instal·lació del paquet [package].spacecmd. fallarà.
ko: 모듈형 채널을 사용하는 경우 {almalinux} 8 클라이언트에서 Python 3.6 모듈 스트림을 활성화해야 합니다. Python 3.6이 제공되지 않으면 [package]``spacecmd`` 패키지의 설치가 실패합니다.
zh_cn: 如果您使用的是模块化通道，则必须在 {almalinux} 8 客户端上启用 Python 3.6 模块流。如果不提供 Python 3.6，[package]``spacecmd`` 软件包安装将会失败。

source: You might notice some disparity in the number of packages available in the AppStream channel between upstream and the {productname} channel. You might also see different numbers if you compare the same channel added at a different point in time. This is due to the way that {almalinux} manages their repositories. {almalinux} removes older version of packages when a new version is released, while {productname} keeps all of them, regardless of age.
ca: És possible que noteu una certa disparitat en el nombre de paquets disponibles al canal AppStream entre el canal de dalt i el canal {productname}. També podeu veure números diferents si compareu el mateix canal afegit en un moment diferent. Això es deu a la manera en què {almalinux} gestiona els seus repositoris. {almalinux} elimina la versió més antiga dels paquets quan es llança una versió nova, mentre que {productname} els manté tots, independentment de l'edat.
ja: 上流のチャンネルと{productname}チャンネルの間のAppStreamチャンネルで利用できるパッケージ数に不一致が発生する場合があります。 また、同時に別の場所で追加したチャンネルを比較すると、数値が異なる場合もあります。 {almalinux}でリポジトリを管理する方法が原因です。 {almalinux}では新しいバージョンがリリースされると古いバージョンのパッケージが削除されますが、{productname}では経過年数に関係なくすべてのバージョンが保持されます。
ko: AppStream 채널에서 사용할 수 있는 패키지의 수가 업스트림과 {productname} 채널 간에 서로 약간 불일치함을 알 수 있습니다. 또한 다른 시점에 추가한 동일 채널을 비교하면 그 수가 다른 것을 알 수 있습니다. 이는 {almalinux}가 리포지토리를 관리하는 방식으로 인한 것입니다. {almalinux}는 새 버전이 릴리스되면 이전 버전의 패키지를 제거하지만 {productname}는 사용 기간과 관계없이 모두 그대로 유지합니다.
zh_cn: 您可能会发现 AppStream 通道中提供的软件包数量在上游通道和 {productname} 通道之间存在一定的差异。如果您对在不同时间添加的同一通道进行比较，会发现其数量也不相同。这是由 {almalinux} 管理其储存库的方式所致。当有新版本发布时，{almalinux} 会去除软件包的较旧版本，而 {productname} 则会保留所有版本，无论新旧与否。

source: You need to create an activation key that is associated with your {almalinux} channels.
ca: Heu de crear una clau d'activació que estigui associada amb els vostres canals {almalinux}.
ja: {almalinux}チャンネルと関連付けられているアクティベーションキーを作成する必要があります。
ko: {almalinux} 채널에 연결된 활성화 키를 생성해야 합니다.
zh_cn: 您需要创建与您的 {almalinux} 通道关联的激活密钥。

source: Manage GPG Keys
ca: Gestiona els convidats de la MV
ja: GPGキーの管理
ko: GPG 키 관리
zh_cn: 管理 GPG 密钥

source: Clients use GPG keys to check the authenticity of software packages before they are installed. Only trusted software can be installed on clients.
ca: Els clients utilitzen claus GPG per comprovar l'autenticitat dels paquets de programari abans que s'instal·lin. Només es pot instal·lar programari de confiança als clients.
ja: クライアントではGPGキーを使用して、ソフトウェアパッケージをインストールする前にパッケージ認証の確認が行われます。 信頼されているソフトウェアのみクライアントにインストールできます。
ko: 클라이언트는 소프트웨어 패키지가 설치되기 전에 GPG 키를 사용해 신뢰성을 확인합니다. 신뢰할 수 있는 소프트웨어만 클라이언트에 설치할 수 있습니다.
zh_cn: 安装软件包之前，客户端会使用 GPG 密钥检查这些软件包的真实性。只有可信软件才能安装在客户端上。

source: Trusting a GPG key is important for security on clients. It is the task of the adminstrator to decide which keys are needed and can be trusted. Because a software channel cannot be used when the GPG key is not trusted, the decision of assigning a channel to a client depends on the decision of trusting the key.
ca: Confiar en una clau GPG és important per a la seguretat dels clients. És tasca de l'administrador decidir quines claus són necessàries i poden ser de confiança. Com que un canal de programari no es pot utilitzar quan la clau GPG no és de confiança, la decisió d'assignar un canal a un client depèn de la decisió de confiar en la clau.

source: For more information about GPG keys, see xref:client-configuration:gpg-keys.adoc[].
ca: Per obtenir més informació sobre les claus d'activació, vegeu xref:client-configuration:activation-keys.adoc[].
ja: GPGキーの詳細については、 xref:client-configuration:gpg-keys.adoc[]を参照してください。
ko: GPG 키에 대한 자세한 내용은 xref:client-configuration:gpg-keys.adoc[]에서 확인할 수 있습니다.
zh_cn: 有关 GPG 密钥的详细信息，请参见 xref:client-configuration:gpg-keys.adoc[]。

source: Manage Errata
ca: Gestiona l'errata
ja: エラータの管理
ko: 정오표 관리
zh_cn: 管理勘误

source: When you update {almalinux} clients, the packages include metadata about the updates.
ca: Quan actualitzeu {almalinux} clients, els paquets inclouen metadades sobre les actualitzacions.
ja: {almalinux}クライアントを更新するとき、パッケージには更新に関するメタデータが含まれています。
ko: {almalinux} 클라이언트를 업데이트할 때 패키지에는 업데이트에 대한 메타데이터가 포함됩니다.
zh_cn: 当您更新 {almalinux} 客户端时，软件包会包含有关更新的元数据。

source: Registering {amazon} Clients
ca: S'estan registrant {amazon} clients
ja: {amazon}クライアントの登録
ko: {amazon} 클라이언트 등록
zh_cn: 注册 {amazon} 客户端

source: This section contains information about registering clients running {amazon} operating systems.
ca: Aquesta secció conté informació sobre el registre de clients que executen sistemes operatius {amazon}.

source: {amazon} repository URLs are available from {scclongform}.
ca: Els URL del repositori {amazon} estan disponibles des de {scclongform}.

source: Packages and metadata are provided by Amazon, not by {suse}.
ca: Amazon proporciona paquets i metadades, no {suse}.

source: For supported products, see the release notes and the support table at xref:client-configuration:supported-features-amazon.adoc[].
ca: Per obtenir una llista completa de clients i característiques compatibles, vegeu xref:client-configuration:supported-features.adoc[].

source: When created at {aws}, {amazon} 2 instances always have the same `machine-id` id at `/etc/machine-id`. If you are creating {amazon} 2 instances, make sure you regenerate the `machine-id` after the instances are created. For more information, see xref:administration:troubleshooting/tshoot-registerclones.adoc[].
ca: Quan es crea a {aws}, {amazon} 2 instàncies sempre tenen el mateix idmachine-id. id a ,/etc/machine-id.. Si esteu creant {amazon} 2 instàncies, assegureu-vos de regenerar la .machine-id. després de crear les instàncies. Per a més informació, vegeu xref:administration:troubleshooting/tshoot-registerclones.adoc[].

source: {amazon} 2023 is not affected by this.
ca: {amazon} 2023 no es veu afectat per això.

source: Before you register {amazon} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de registrar {amazon} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.
ja: {amazon}クライアントを{productname}サーバに登録する前に、必要なソフトウェアチャンネルを追加して同期する必要があります。
ko: {amazon} 클라이언트를 {productname} 서버에 등록하기 전에 필요한 소프트웨어 채널을 추가하고 이 채널을 동기화해야 합니다.
zh_cn: 将 {amazon} 客户端注册到您的 {productname} 服务器之前，您需要添加所需的软件通道，并同步这些通道。

source: The architectures currently supported are: `x86_64` and `aarch64`. For full list of supported products and architectures, see xref:client-configuration:supported-features.adoc[].
ca: Les arquitectures suportades actualment són: xx8664. i .aarch64.. Per obtenir una llista completa de productes i arquitectures compatibles, vegeu xref:client-configuration:supported-features.adoc[].
ja: 現在サポートされているアーキテクチャは、「`` x86_64``」と「 ``aarch64``」です。 サポートされている製品およびアーキテクチャの完全な一覧については、xref:client-configuration:supported-features.adoc[]を参照してください。
ko: 현재 지원되는 아키텍처는 ``x86_64`` 및 ``aarch64``입니다. 지원되는 제품 및 아키텍처의 전체 목록은 xref:client-configuration:supported-features.adoc[]에서 참조하십시오.
zh_cn: 当前支持的系统结构为 `x86_64` 和 `aarch64`。有关支持的产品和体系结构的完整列表，请参见 xref:client-configuration:supported-features.adoc[]。

source: {amazon} Products - WebUI
ca: {almalinux} Productes - WebUI

source: | OS Version | Product Name | {amazon} 2023 | {amazon} 2023 x86_64 | {amazon} 2 | {amazon} 2 x86_64
ca: | Versió del sistema operatiu | Nom del producte | {amazon} 2023 | {amazon} 2023 x86_64 | {amazon} 2 | {amazon} 2 x86_64

source: {amazon} Channels - CLI
ca: {almalinux} canals - CLI

source: | OS Version | Base Channel | {amazon} 2 | amazonlinux2023-x86_64 | {amazon} 2 | amazonlinux2-core-x86_64
ca: | Versió del sistema operatiu | Canal base | {amazon} 2 | amazonlinux2023-x86_64 | {amazon} 2 | amazonlinux2-core-x86_64

source: | OS Version | Base Channel | Client Channel | {amazon} 2023 | amazonlinux2023 | amazonlinux2023-uyuni-client | {amazon} 2 | amazonlinux2-core | amazonlinux2-uyuni-client
ca: Versió del SO Canal del nucli s Actualitza el canal Canal Client {alibabaclo} 2 alibaba-2 s alibaba-2-updates alibaba-2-uyuni-client

source: For {amazon} 2, make sure you also add and synchronize `amazonlinux2-extra-docker` channel if you plan to use Docker at your {amazon} instances.
ca: Per a {amazon} 2, assegureu-vos que també afegiu i sincronitzeu el canal .amazonlinux2-extra-docker. si teniu previst utilitzar Docker a les vostres instàncies {amazon}.

source: For {amazon} 2023, make sure you also add and synchronize `amazonlinux2023-kernel-livepatch` channel if you plan to use Kernel Live patches at your {amazon} instances.
ca: Per a {amazon} 2023, assegureu-vos que també afegiu i sincronitzeu el canal .amazonlinux2023-kernel-livepatch. si teniu previst utilitzar els pedaços del Kernel Live a les vostres instàncies {amazon}.

source: You need to create an activation key that is associated with your {amazon} channels.
ca: Heu de crear una clau d'activació que estigui associada amb els vostres canals {amazon}.
ja: {amazon}チャンネルと関連付けられているアクティベーションキーを作成する必要があります。
ko: {amazon} 채널에 연결된 활성화 키를 생성해야 합니다.
zh_cn: 您需要创建与您的 {amazon} 通道关联的激活密钥。

source: Trusting a GPG key is important for security on clients. It is the task of the administrator to decide which keys are needed and can be trusted. Because a software channel cannot be used when the GPG key is not trusted, the decision of assigning a channel to a client depends on the decision of trusting the key.
ca: Confiar en una clau GPG és important per a la seguretat dels clients. És tasca de l'administrador decidir quines claus són necessàries i poden ser de confiança. Com que un canal de programari no es pot utilitzar quan la clau GPG no és de confiança, la decisió d'assignar un canal a un client depèn de la decisió de confiar en la clau.
ja: クライアントのセキュリティにとってGPGキーを信頼することは重要です。 必要かつ信頼できるキーを決定するのは管理者のタスクです。 GPGキーが信頼されていない場合、ソフトウェアチャンネルは使用できないため、クライアントにチャンネルを割り当てるかどうかは、キーを信頼するかどうかによって決まります。
ko: 클라이언트의 보안을 위해 GPG 키를 신뢰하는 것이 중요합니다. 어떤 키가 필요하고 신뢰할 수 있는지 결정하는 것은 관리자가 수행해야 하는 작업입니다. GPG 키를 신뢰할 수 없는 경우 소프트웨어 채널을 사용할 수 없기 때문에 채널을 클라이언트에 할당하는 결정은 키를 신뢰하는 결정에 따라 달라집니다.
zh_cn: 信任 GPG 密钥对于客户端的安全非常重要。由管理员来决定需要哪些密钥，可以信任哪些密钥。这是因为如果不信任 GPG 密钥，便无法使用软件通道，是否将通道指派给客户端取决于是否信任密钥。

source: Registering {centos} Clients
ca: S'estan registrant {centos} clients
ja: {centos}クライアントの登録
ko: {centos} 클라이언트 등록
zh_cn: 注册 {centos} 客户端

source: This section contains information about registering clients running {centos} operating systems.
ca: Aquesta secció conté informació sobre el registre de clients que executen sistemes operatius {centos}.

source: {centos} repository URLs are available from {scclongform}.
ca: Els URL del repositori {centos} estan disponibles des de {scclongform}.

source: Packages and metadata are provided by CentOS, not by {suse}.
ca: CentOS proporciona paquets i metadades, no {suse}.

source: For supported products, see the release notes and the support table at xref:client-configuration:supported-features-centos.adoc[].
ca: Per obtenir una llista completa de clients i característiques compatibles, vegeu xref:client-configuration:supported-features.adoc[].

source: {centos} clients are based on {centos} and are unrelated to {sleses}, RES, {redhat}, or {es}.
ca: {centos} clients estan basats en {centos} i no estan relacionats amb {sleses}, RES, {redhat} o {es}.

source: You are responsible for arranging access to {centos} base media repositories and {centos} installation media, as well as connecting {productname} Server to the {centos} content delivery network.
ca: Sou responsable d'organitzar l'accés a {redhat} o {centos} repositoris multimèdia base i mitjans d'instal·lació.

source: Registering {centos} clients to {productname} is tested with the default SELinux configuration of ``enforcing`` with a ``targeted`` policy. You do not need to disable SELinux to register {centos} clients to {productname}.
ca: Registrar {centos} clients a {productname} es prova amb la configuració predeterminada de SELinux de .enforcing. amb una política .targeted.. No cal que desactiveu SELinux per registrar {centos} clients a {productname}.
ja: {centos}クライアントの{productname}への登録は、``ターゲット``ポリシーで``適用``されるデフォルトのSELinux設定でテストされます。 SELinuxを無効にして{centos}クライアントを{productname}に登録する必要があります。
ko: {centos} 클라이언트를 {productname}에 등록하는 기능은 ``목표`` 정책으로 ``강제``하는 기본 SELinux 구성으로 테스트됩니다. SELinux를 비활성화해야 {centos} 클라이언트를 {productname}에 등록할 수 있는 것은 아닙니다.
zh_cn: 我们已使用``针对性``策略并采用默认的 ``enforcing`` SELinux 配置对将 {centos} 客户端注册到 {productname} 的过程进行了测试。将 {centos} 客户端注册到 {productname} 时，您无需禁用 SELinux。

source: Before you can register {centos} clients to your {productname} Server, you need to add the required software channels, and synchronize them.
ca: Abans de poder registrar {centos} clients al vostre servidor {productname}, heu d'afegir els canals de programari necessaris i sincronitzar-los.
ja: {centos}クライアントを{productname}サーバに登録する前に、必要なソフトウェアチャンネルを追加して同期する必要があります。
ko: {centos} 클라이언트를 {productname} 서버에 등록하려면 먼저 필요한 소프트웨어 채널을 추가하고 이 채널을 동기화해야 합니다.
zh_cn: 将 {centos} 客户端注册到您的 {productname} 服务器之前，您需要添加所需的软件通道，并同步这些通道。

source: For example, when working with `x86_64` architecture, you need this products:
ca: Per exemple, quan treballeu amb l'arquitectura xx8664,, necessiteu aquests productes:
ja: たとえば、「``x86_64``」アーキテクチャを使用する場合は、次の製品が必要です。
ko: 예를 들어, `x86_64` 아키텍처에서 작업 시 필요한 제품은 다음과 같습니다.
zh_cn: 例如，使用 `x86_64` 体系结构时，您需要如下产品：

source: CentOS Products - WebUI
ca: Productes CentOS - WebUI
ja: CentOS製品 - WebUI
ko: CentOS 제품 - WebUI
zh_cn: CentOS 产品 - WebUI

source: | OS Version | Product Name | {centos} 7 | CentOS 7 x86_64
ca: Versió del SO Nom del producte {amazon} 2 Amazon Linux 2 x8664
ko: | OS 버전 | 제품 이름 | {centos} 7 | CentOS 7 x86_64
zh_cn: | 操作系统版本 | 产品名称 | {centos} 7 | CentOS 7 x86_64

source: CentOS Channels - CLI
ca: Canals CentOS - CLI
ja: CentOSチャンネル - CLI
ko: CentOS 채널 - CLI
zh_cn: CentOS 通道 - CLI

source: | OS Version | Base Channel | {centos} 7 | centos7-x86_64
ca: | Versió del SO | Canal base | {amazon} 2 | amazonlinux2-core-x86_64
ko: | OS 버전 | 기본 채널 | {centos} 7 | centos7-x86_64
zh_cn: | 操作系统版本 | 基础通道 | {centos} 7 | centos7-x86_64

source: | OS Version | Base Channel | Client Channel | Updates/Appstream Channel | {centos} 7 | centos7 | centos7-uyuni-client | centos7-updates
ca: Versió del SO Canal base Canal client Actualitzacions/Canal Appstream {centos} 7 centos7 centos7-uyuni-client centos7-updates
ko: | OS 버전 | 기본 채널 | 클라이언트 채널 | 업데이트/Appstream 채널 | {centos} 7 | centos7 | centos7-uyuni-client | centos7-updates
zh_cn: | 操作系统版本 | 基础通道 | 客户端通道 | 更新/Appstream 通道 | {centos} 7 | centos7 | centos7-uyuni-client | centos7-updates

source: If you are using modular channels, you must enable the Python 3.6 module stream on the client. If you do not provide Python 3.6, the installation of the [package]``spacecmd`` package will fail.
ca: Si esteu utilitzant canals modulars, heu d'habilitar el flux del mòdul Python 3.6 al client. Si no proporcioneu Python 3.6, la instal·lació del paquet [package].spacecmd. fallarà.
ko: 모듈형 채널을 사용하는 경우 클라이언트에서 Python 3.6 모듈 스트림을 활성화해야 합니다.Python 3.6이 제공되지 않으면 [package]``spacecmd`` 패키지의 설치가 실패합니다.
zh_cn: 如果您使用的是模块化通道，则必须在客户端上启用 Python 3.6 模块流。如果不提供 Python 3.6，[package]``spacecmd`` 软件包安装将会失败。

source: You might notice some disparity in the number of packages available in the AppStream channel between upstream and the {productname} channel. You might also see different numbers if you compare the same channel added at a different point in time. This is due to the way that {centos} manages their repositories. {centos} removes older version of packages when a new version is released, while {productname} keeps all of them, regardless of age.
ca: És possible que noteu una certa disparitat en el nombre de paquets disponibles al canal AppStream entre el canal de dalt i el canal {productname}. També podeu veure números diferents si compareu el mateix canal afegit en un moment diferent. Això es deu a la manera en què {centos} gestiona els seus repositoris. {centos} elimina la versió més antiga dels paquets quan es llança una versió nova, mentre que {productname} els manté tots, independentment de l'edat.
ja: 上流のチャンネルと{productname}チャンネルの間のAppStreamチャンネルで利用できるパッケージ数に不一致が発生する場合があります。 また、同時に別の場所で追加したチャンネルを比較すると、数値が異なる場合もあります。 {centos}でリポジトリを管理する方法が原因です。 {centos}では新しいバージョンがリリースされると古いバージョンのパッケージが削除されますが、{productname}では経過年数に関係なくすべてのバージョンが保持されます。
ko: AppStream 채널에서 사용할 수 있는 패키지의 수가 업스트림과 {productname} 채널 간에 서로 약간 불일치함을 알 수 있습니다. 또한 다른 시점에 추가한 동일 채널을 비교하면 그 수가 다른 것을 알 수 있습니다. 이는 {centos}가 리포지토리를 관리하는 방식에 원인이 있습니다. {centos}는 새 버전이 릴리스되면 이전 버전의 패키지를 제거하지만 {productname}는 사용 기간과 관계없이 모두 그대로 유지합니다.
zh_cn: 您可能会发现 AppStream 通道中提供的软件包数量在上游通道和 {productname} 通道之间存在一定的差异。如果您对在不同时间添加的同一通道进行比较，会发现其数量也不相同。这是由 {centos} 管理其储存库的方式所致。当有新版本发布时，{centos} 会去除软件包的较旧版本，而 {productname} 则会保留所有版本，无论新旧与否。

source: You need to create an activation key that is associated with your {centos} channels.
ca: Heu de crear una clau d'activació que estigui associada als vostres canals {centos}.
ja: {centos}チャンネルと関連付けられているアクティベーションキーを作成する必要があります。
ko: {centos} 채널에 연결된 활성화 키를 생성해야 합니다.
zh_cn: 您需要创建与您的 {centos} 通道关联的激活密钥。

source: CentOS 7 will fail to onboard due to the fact that the [path]``/etc/yum.repos.d/CentOS-Base.repo`` has URLs enabled, and thus causing [command]``yum`` to attempt to find the repositories using fastmirror. This will cause the bootstrap to fail with the error message:
ca: El CentOS 7 fallarà la incorporació perquè el [path]``/etc/yum.repos.d/CentOS-Base.repo`` té els URL habilitats i, per tant, farà que l'ordre [command]``yum`` intenti trobar els repositoris mitjançant fastmirror. Això farà que l'arrencada falli amb el missatge d'error següent:

source: Could not resolve host: mirrorlist.centos.org; Unknown error
ca: No s'ha pogut resoldre l'amfitrió: mirrorlist.centos.org; Error desconegut

source: To avoid the issue you can remove the [path]``CentOS-Base.repo`` file with the command:
ca: Per evitar el problema, podeu eliminar el fitxer [path]``CentOS-Base.repo`` amb l'ordre següent:

source: Or, if the file needs to remain, you can add [literal]``enabled=0`` to each of the URL sections.
ca: O, si cal que el fitxer es conservi, podeu afegir [literal]``enabled=0`` a cadascuna de les seccions de l'URL.

source: In either case, then rebootstrap.
ca: En qualsevol cas, reinicieu-lo.

source: This section is only applicable to non-containerized Uyuni and it will be removed after {centos} 7 will go end-of-life.
ca: Aquesta secció només és aplicable a Uyuni no contenidor i s'eliminarà després que {centos} 7 acabi la seva vida útil.

source: When you update {centos} clients, the packages do not include metadata about the updates. You can use a third-party errata service to obtain this information.
ca: Quan actualitzeu {centos} clients, els paquets no inclouen metadades sobre les actualitzacions. Podeu utilitzar un servei d'errades de tercers per obtenir aquesta informació.
ja: {centos}クライアントを更新するとき、パッケージには更新に関するメタデータは含まれていません。 サードパーティのエラータサービスを使用してこの情報を取得できます。
ko: {centos} 클라이언트를 업데이트할 때 패키지에는 업데이트에 대한 메타데이터가 포함되지 않습니다. 타사 정오표 서비스를 사용해 이 정보를 얻을 수 있습니다.
zh_cn: 当您更新 {centos} 客户端时，软件包不包含有关更新的元数据。您可以使用第三方勘误服务来获取此信息。
