Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: In the [guimenu]``Key`` field, enter a name for the activation key. For example, ``SLES15-{sp-version}`` for {sles}{nbsp}15{nbsp}{sp-version}.
ca: Al camp [guimenu].Clau., introduïu un nom per a la clau d'activació. Per exemple, ,SLES15-{sp-version}, per a {sles}{nbsp}15{nbsp}{sp-version}.

source: Do not use commas or double quotes in the [guimenu]``Key`` field for any {suse} products. However, you *must* use commas for Red Hat Products.
ca: No utilitzeu comes al camp [guimenu].Clau. per a cap producte {suse}. No obstant això, *has d'utilitzar comes per als productes de barret vermell. Per a més informació, vegeu xref:reference:systems/activation-keys.adoc[].
ja: {suse}製品の［[guimenu]``キー``］フィールドではカンマまたは二重引用符を使用しないでください。 ただし、Red Hat製品ではカンマを使用する必要があります。
ko: {suse} 제품인 경우 [guimenu]``키`` 필드에 쉼표를 사용하지 마십시오. 하지만 Red Hat 제품인 경우 *반드시* 쉼표를 사용해야 합니다.
zh_cn: 对于任何 {suse} 产品，请不要在[guimenu]``密钥``字段中使用逗号或双引号。不过，对于 Red Hat 产品，则 *必须* 使用逗号。

source: All other characters are allowed, but `<> (){}` (this includes the space) are removed automatically.
ca: Tots els altres caràcters estan permesos, però ,<> (){}. (això inclou l'espai) s'eliminen automàticament.
ja: 他のすべての文字を使用できますが、``<>(){}``(スペースを含む)は自動的に削除されます。
ko: 기타 모든 문자는 허용되지만 `<> (){}`(공백 포함)는 자동으로 제거됩니다.
zh_cn: 所有其他字符均可使用，不过系统会自动去除 `<> (){}`（包括空格）。

source: If the field is left empty, a random string is generated.
ca: Si el camp es deixa buit, es genera una cadena aleatòria.
ja: フィールドが空のままの場合、ランダムな文字列が生成されます。
ko: 필드가 비어 있으면 임의의 스트링이 생성됩니다.
zh_cn: 如果将字段留空，系统会生成一个随机字符串。

source: In the [guimenu]``Usage`` add number of times the key can be used, or leave it blank for unlimited usage.
ca: En el [guimenu].Usage. afegeix el nombre de vegades que es pot utilitzar la clau, o deixa-la en blanc per a un ús il·limitat.

source: In the [guimenu]``Base Channels`` drop-down box, select the appropriate base software channel, and allow the relevant child channels to populate. For more information, see xref:reference:admin/setup-wizard.adoc[] and xref:administration:custom-channels.adoc[].
ca: A la llista desplegable [guimenu].Canals bàsics., seleccioneu el canal de programari base apropiat i permeteu que els canals fills pertinents s'omplin. Per a més informació, vegeu xref:reference:admin/setup-wizard.adoc[] i xref:administration:custom-channels.adoc[].

source: Select the [guimenu]``Child Channels`` you need (for example, the mandatory {susemgr} tools and updates channels).
ca: Seleccioneu els canals fills que necessiteu (per exemple, les eines obligatòries {susemgr} i els canals d'actualització).

source: Check the [guimenu]``Add-On System Types`` checkbox if you need to enable any of the options. For more information about system types, see xref:client-configuration:system-types.adoc[].
ca: Activeu la casella de selecció [guimenu].Afegeix els tipus de sistema. si necessiteu habilitar qualsevol de les opcions.

source: We recommend you leave the [guimenu]``Contact Method`` set to [guimenu]``Default``. For more information about contact methds, see xref:client-configuration:contact-methods-intro.adoc[].
ca: Les actualitzacions de paquets planificades s'instal·len utilitzant el mètode de contacte configurat per a cada client. Per a més informació, vegeu xref:client-configuration:contact-methods-intro.adoc[].

source: We recommend you leave the [guimenu]``Universal Default`` setting unchecked.
ca: Us recomanem que deixeu la configuració [guimenu].Per defecte universal. sense marcar.
ja: ［[guimenu]``汎用デフォルト``］設定には、チェックを入れないようにすることをお勧めします。
ko: [guimenu]``범용 기본값`` 설정은 확인란이 선택되지 않은 상태 그대로 두는 것이 좋습니다.
zh_cn: 建议您将[guimenu]``统一默认``设置保留未选中状态。

source: Click btn:[Create Activation Key] to create the activation key.
ca: Feu clic a btn:[Crea la clau d'activació] per a crear la clau d'activació.
ja: btn:[アクティベーションキーの作成]をクリックしてアクティベーションキーを作成します。
ko: btn:[활성화 키 생성]을 클릭하여 활성화 키를 생성합니다.
zh_cn: 单击 btn:[创建激活密钥] 以创建激活密钥。

source: After the activation key is created, the page shows additional checkbox [guimenu]``Configuration File Deployment`` below the list of [guimenu]``Add-On System Types``. To enable deploying configuration files to systems on registration, select this checkbox.
ca: Després de crear la clau d'activació, la pàgina mostra la casella de selecció addicional [guimenu].Desplegament de fitxers de configuració the sota la llista de [guimenu].Afegeix els tipus de sistema.. Per a habilitar el desplegament de fitxers de configuració als sistemes en registrar-se, seleccioneu aquesta casella de selecció.

source: Click btn:[Update Activation Key] to save the change.
ca: Feu clic a btn:[Crea la clau d'activació] per a crear la clau d'activació.

source: When the activation key creation is completed, additional tabs appear at the top of the page. Use them to check and set additional features. These tabs are:
ca: Quan s'hagi completat la creació de la clau d'activació, apareixeran pestanyes addicionals a la part superior de la pàgina. Utilitzeu-los per comprovar i establir característiques addicionals. Aquestes pestanyes són:

source: [guimenu]``Packages``
ca: Feu clic a la pestanya [guimenu].Estadístiques..

source: [guimenu]``Configuration``
ca: Feu clic a la pestanya [guimenu].Canals de configuració..

source: [guimenu]``Activated Systems``
ca: Feu clic a la pestanya [guimenu].Estadístiques..

source: [guimenu]``AppStreams`` (available whenever a modular channel is associated with the activation key)
ca: [guimenu] theAppStreams the (disponible sempre que un canal modular estigui associat amb la clau d'activació)

source: Reactivation Keys
ca: Tecles de reactivació
ja: 再アクティベーションキー
ko: 활성화 키
zh_cn: 重新激活密钥

source: Reactivation keys can be used once only to re-register a client and regain all {productname} settings. Reactivation keys are client-specific, and include the system ID, history, groups, and channels.
ca: Les claus de reactivació només es poden utilitzar una vegada per tornar a registrar un client i recuperar tots els paràmetres de {productname}. Les claus de reactivació són específiques del client i inclouen l'identificador del sistema, l'historial, els grups i els canals.
ja: クライアントを再登録してすべての{productname}設定を再取得するために、再アクティベーションキーを1回だけ使用できます。 再アクティベーションキーはクライアント固有で、システムID、履歴、グループ、およびチャンネルが含まれています。
ko: 클라이언트를 다시 등록하고 모든 {productname} 설정을 다시 확보하기 위한 목적으로 재활성화 키를 한 번만 사용할 수 있습니다. 재활성화 키는 클라이언트 전용이며 시스템 ID, 이력, 그룹 및 채널을 포함합니다.
zh_cn: 重新激活密钥可用来重新注册客户端并重新获得所有 {productname} 设置，但只能使用一次。重新激活密钥为客户端特定密钥，包含系统 ID、历史记录、组和通道。

source: To create a reactivation key, navigate to [guimenu]``Systems``, click the client to create a reactivation key for, and navigate to the menu:Details[Reactivation] tab. Click btn:[Generate New Key] to create the reactivation key. Record the details of the key for later use. Unlike typical activation keys, which are not associated with a specific system ID, keys created here do not show up on the menu:Systems[Activation Keys] page.
ca: Per a crear una clau de reactivació, navegueu a [guimenu].Sistemes., feu clic al client per a crear una clau de reactivació i navegueu a la pestanya menú:Detalls[Reactivació]. Feu clic a btn:[Generar clau nova] per a crear la clau de reactivació. Enregistra els detalls de la clau per al seu ús posterior. A diferència de les claus d'activació típiques, que no estan associades amb un identificador de sistema específic, les claus creades aquí no es mostren a la pàgina menú:Systems[Claus d'activació].
ja: 再アクティベーションキーを作成するには、［[guimenu]``システム``］に移動し、再アクティベーションキーを作成するクライアントをクリックし、menu:詳細[再アクティベーション]タブに移動します。 btn:[新しいキーの生成]をクリックして再アクティベーションキーを作成します。 後で使用できるようにキーの詳細を書き留めます。 特定のシステムIDに関連付けられていない通常のアクティベーションキーと異なり、ここで作成されるキーは、menu:システム[アクティベーションキー]ページに表示されません。
ko: 재활성화 키를 생성하려면 [guimenu]``시스템``으로 이동한 후 클라이언트를 클릭하여 재활성화 키를 생성하고, menu:상세 정보[재활성] 탭으로 이동하십시오. btn:[새 키 생성]을 클릭하여 재활성화 키를 생성합니다. 나중에 사용할 수 있도록 키의 상세 정보를 기록해 둡니다. 특정 시스템 ID와 연결되지 않은 일반적인 활성화 키와 달리 여기에서 생성한 키는 menu:시스템[활성화 키] 페이지에 표시되지 않습니다.
zh_cn: 要创建重新激活密钥，请导航到[guimenu]``系统``，单击要为其创建重新激活密钥的客户端，然后导航到menu:细节[重新激活]选项卡。单击 btn:[生成新密钥] 以创建重新激活密钥。记录密钥细节以供日后使用。与未与特定系统 ID 关联的典型激活密钥不同，此处创建的密钥不会显示在menu:系统[激活密钥]页面中。

source: After you have created a reactivation key, you can use it as the ``management_key`` grain in [path]``/etc/salt/minion.d/susemanager.conf``. For example:
ca: Després d'haver creat una clau de reactivació, podeu utilitzar-la com el gra themanagementkey. a [path]./etc/salt/minion.d/susemanager.conf.. Per exemple:

source: grains: susemanager: management_key: "re-1-daf44db90c0853edbb5db03f2b37986e"
ca: grans: gestor de sus: managementkey: "re-1-daf44db90c0853edbb5db03f2b37986e"

source: Restart the [command]``venv-salt-minion`` or [command]``salt-minion`` process to apply the reactivation key.
ca: Reinicia el procés [ordre].venv-salt-minion. o [ordre].salt-minion. per a aplicar la clau de reactivació.

source: You can use a reactivation key with a bootstrap script. For more information about bootstrap scripts, see xref:client-configuration:registration-bootstrap.adoc[].
ca: Podeu utilitzar una clau de reactivació amb un script d'arrencada. Per a més informació sobre els scripts bootstrap, vegeu xref:client-configuration:registration-bootstrap.adoc[].
ja: ブートストラップスクリプトで再アクティベーションキーを使用できます。 ブートストラップスクリプトの詳細については、xref:client-configuration:registration-bootstrap.adoc[]を参照してください。
ko: 재활성화 키를 부트스트랩 스크립트와 함께 사용할 수 있습니다. 부트스트랩 스크립트에 대한 자세한 내용은 xref:client-configuration:registration-bootstrap.adoc[]을 참조하십시오.
zh_cn: 您可以结合引导脚本来使用重新激活密钥。有关引导脚本的详细信息，请参见 xref:client-configuration:registration-bootstrap.adoc[]。

source: If you autoinstall a client with its existing {productname} profile, the profile uses the reactivation key to re-register the system and restore its settings. Do not regenerate, delete, or use this key while a profile-based autoinstallation is in progress. Doing so causes the autoinstallation to fail.
ca: Si instal·leu automàticament un client amb el seu perfil {productname} existent, el perfil utilitza la clau de reactivació per tornar a registrar el sistema i restaurar la seva configuració. No regeneris, eliminis o utilitzis aquesta clau mentre hi hagi una autoinstal·lació basada en el perfil en curs. Fer-ho fa que l'autoinstal·lació falli.
ja: 既存の{productname}プロファイルでクライアントを自動インストールすると、そのプロファイルは、再アクティベーションキーを使用して、システムを再登録し、その設定を復元します。 プロファイルベースの自動インストール実行中は、このキーを再生成、削除、または使用しないでください。 このような操作を実行すると、自動インストールは失敗します。
ko: 클라이언트를 기존 {productname} 프로파일과 함께 자동 설치하는 경우 프로파일은 재활성화 키를 사용해 시스템을 다시 등록하고 설정을 복원합니다. 프로파일 기반 자동 설치가 진행 중일 때는 이 키를 재생성, 삭제 또는 사용하지 마십시오. 그러면 자동 설치에 실패하게 됩니다.
zh_cn: 如果您使用客户端现有的 {productname} 配置文件自动安装客户端，该配置文件会使用重新激活密钥来重新注册系统并恢复其设置。请勿在正在进行基于配置文件的自动安装时重新生成、删除或使用此密钥， 否则会导致自动安装失败。

source: Activation Key Best Practices
ca: Millors pràctiques de la clau d'activació
ja: アクティベーションキーのベストプラクティス
ko: 활성화 키 모범 사례
zh_cn: 激活密钥最佳实践

source: Default Parent Channel
ca: Canal pare per defecte
ja: デフォルトの親チャンネル
ko: 기본 상위 채널
zh_cn: 默认父通道

source: Avoid using the [systemitem]``{productname} Default`` parent channel. This setting forces {productname} to choose a parent channel that best corresponds to the installed operating system, which can sometimes lead to unexpected behavior. Instead, we recommend you create activation keys specific to each distribution and architecture.
ca: Eviteu utilitzar el canal pare [systemitem].SUSE Manager Default.. Aquest paràmetre força a {productname} a triar un canal pare que es correspongui millor amb el sistema operatiu instal·lat, el qual de vegades pot conduir a un comportament inesperat. En canvi, et recomanem crear claus d'activació específiques per a cada distribució i arquitectura.

source: Bootstrapping With Activation Keys
ca: Arrencada amb claus d'activació

source: If you are using bootstrap scripts, consider creating an activation key for each script. This helps you align channel assignments, package installation, system group memberships, and configuration channel assignments. You also need less manual interaction with your system after registration.
ca: Si utilitzeu scripts bootstrap, considereu crear una clau d'activació per a cada script. Això us ajuda a alinear les assignacions de canals, la instal·lació de paquets, les pertinences de grups del sistema i les assignacions de canals de configuració. També necessites menys interacció manual amb el teu sistema després del registre.
ja: ブートストラップスクリプトを使用している場合、各スクリプトにアクティベーションキーを作成することを検討してください。 作成によって、チャンネルの割り当て、パッケージのインストール、システムグループメンバーシップ、および設定チャンネルの割り当ての整合性を取ることができます。 登録後にシステムで手動操作する必要も減ります。
ko: 부트스트랩 스크립트를 사용 중인 경우 각 스크립트에 대해 활성화 키를 생성하는 것을 고려하십시오. 이렇게 하면 채널 할당, 패키지 설치, 시스템 그룹 구성원, 구성 채널 할당을 조정하는 데 도움이 됩니다. 또한 등록 후 시스템에 대한 수동 개입이 덜 필요합니다.
zh_cn: 如果您要使用引导脚本，请考虑为每个脚本创建一个激活密钥。这有助于您调整通道指派、软件包安装、系统组成员资格和配置通道指派。注册后，您需要与系统手动交互的情形也会减少。

source: Bootstrapping LTSS Clients
ca: Arrencada amb claus d'activació

source: If you are boostrapping clients with LTSS subscription, include the LTSS channels during activation key creation.
ca: Si sou clients de boostrapping amb subscripció LTSS, incloeu els canals LTSS durant la creació de la clau d'activació.
ja: LTSSサブスクリプションでクライアントをブーストラッピングする場合は、アクティベーションキーの作成中にLTSSチャンネルを含めます。
ko: LTSS 구독을 사용하여 클라이언트를 부스트랩하는 경우 활성화 키 생성 중에 LTSS 채널을 포함시켜야 합니다.
zh_cn: 如果您要引导订阅了 LTSS 的客户端，请在创建激活密钥期间包含 LTSS 通道。

source: Bandwidth Requirements
ca: Requisits d'amplada de banda
ja: 帯域幅の要件
ko: 대역폭 요구사항
zh_cn: 带宽要求

source: Using activation keys might result in automatic downloading of software at registration time, which might not be desirable in environments where bandwidth is constrained.
ca: L'ús de claus d'activació pot resultar en la descàrrega automàtica de programari en el moment del registre, la qual cosa pot no ser desitjable en entorns on l'amplada de banda està restringida.
ja: アクティベーションキーを使用すると、登録時にソフトウェアが自動ダウンロードされることがあります。この動作は、帯域幅に制約がある環境では望ましくない場合があります。
ko: 활성화 키를 사용하면 등록 시점에 소프트웨어가 자동으로 다운로드될 수 있는데, 대역폭이 제한된 환경에서는 바람직하지 않을 수 있습니다.
zh_cn: 使用激活密钥可能导致在注册时自动下载软件，这对于存在带宽限制的环境来说可能并不适宜。

source: These options create bandwidth usage:
ca: Aquestes opcions creen l'ús de l'amplada de banda:
ja: 次のオプションによって帯域幅使用条件が作成されます。
ko: 이러한 옵션은 대역폭 사용량을 생성합니다.
zh_cn: 下列选择会产生带宽用量：

source: Assigning a SUSE Product Pool channel results in the automatic installation of the corresponding product descriptor package.
ca: L'assignació d'un canal SUSE Product Pool dona com a resultat la instal·lació automàtica del paquet descriptor de producte corresponent.
ja: SUSE Product Poolチャンネルを割り当てると、対応する製品ディスクリプタパッケージが自動インストールされます。
ko: SUSE 제품 풀 채널을 할당하면 해당 제품 설명자 패키지가 자동으로 설치됩니다.
zh_cn: 指派 SUSE Product Pool 通道会导致自动安装相应的产品描述符软件包。

source: Any package in the [guimenu]``Packages`` section is installed.
ca: Qualsevol paquet de la secció [guimenu].Packages. està instal·lat.
ja: ［[guimenu]``パッケージ``］セクションのパッケージがインストールされます。
ko: 섹션의 모든 패키지가 [guimenu]``Packages`` 설치됩니다.
zh_cn: 安装[guimenu]``软件包``部分中的所有软件包。

source: Any Salt state from the [guimenu]``Configuration`` section might trigger downloads depending on its contents.
ca: Qualsevol estat de sal de la secció [guimenu].Configuració. pot activar baixades en funció del seu contingut.
ja: ［[guimenu]``設定``］セクションのSaltの状態によっては、その内容に応じてダウンロードがトリガされる場合があります。
ko: [guimenu]``구성`` 섹션의 모든 Salt 상태가 그 내용에 따라 다운로드를 트리거할 수 있습니다.
zh_cn: [guimenu]``配置``部分中的任何 Salt 状态都可能会触发下载，具体视其内容而定。

source: Key Label Naming
ca: Nom de l'etiqueta de clau
ja: キーラベルの命名
ko: 키 레이블 명명
zh_cn: 密钥标签命名

source: If you do not enter a human-readable name for your activation keys, the system automatically generates a number string, which can make it difficult to manage your keys.
ca: Si no introduïu un nom llegible per a les vostres claus d'activació, el sistema genera automàticament una cadena numèrica, la qual cosa pot dificultar la gestió de les vostres claus.
ja: 読んで理解しやすい名前をアクティベーションキーに入力しないと、システムが数値の文字列を自動生成するため、キーの管理が困難になる場合があります。
ko: 활성화 키에 대해 읽을 수 있는 이름을 입력하지 않으면 시스템이 수 스트링을 자동으로 생성하므로 키를 관리하기 어려울 수 있습니다.
zh_cn: 如果您没有为激活密钥输入直观易懂的名称，系统会自动生成一串数字字符串，这会使得您的密钥难以管理。

source: Consider a naming scheme for your activation keys to help you keep track of them. Creating names which are associated with your organization's infrastructure makes it easier for you when performing more complex operations.
ca: Considereu un esquema de noms per a les vostres claus d'activació per ajudar-vos a fer un seguiment d'elles. La creació de noms associats a la infraestructura de la teva organització us facilita la realització d'operacions més complexes.
ja: キーを追跡できるようにアクティベーションキーの命名規則を検討してください。 組織のインフラストラクチャに関係がある名前を付けておくと、複雑な操作の実行も簡単になります。
ko: 키를 추적하는 데 도움이 되는 활성화 키 명명 스키마를 고려하십시오. 조직의 인프라와 관련이 있는 이름을 생성하면 더 복잡한 작업을 더 쉽게 수행할 수 있습니다.
zh_cn: 请考虑为您的激活密钥使用一种命名模式，以方便您进行跟踪。设计与您组织的基础结构相关的名称有助于您更轻松地执行较复杂的操作。

source: When creating key labels, consider these tips:
ca: En crear etiquetes de claus, considereu aquests consells:
ja: キーラベルを作成する場合、次のヒントを考慮してください。
ko: 키 레이블을 생성할 때 다음과 같은 팁을 참고하십시오.
zh_cn: 在创建密钥标签时，请考虑以下提示：

source: OS naming (mandatory): Keys should always refer to the OS they provide settings for
ca: Nom del sistema operatiu (obligatori): Les claus sempre haurien de referir-se al sistema operatiu per al qual proporcionen la configuració
ja: OSの名前(必須): キーには、設定を指定するOS名を必ず含める必要があります。
ko: OS 명명(필수): 키는 항상 자신이 설정을 제공하는 대상인 OS를 참조해야 합니다.
zh_cn: 操作系统命名（必需）：密钥应始终代表提供的设置所适用的操作系统

source: Architecture naming (recommended): Unless your company is running on one architecture only, for example x86_64, then providing labels with an architecture type is a good idea.
ca: Nom de l'arquitectura (recomanat): Tret que la vostra empresa estigui funcionant només en una arquitectura, per exemple x8664, llavors proporcionar etiquetes amb un tipus d'arquitectura és una bona idea.
ja: アーキテクチャ名(推奨): 会社で稼働しているアーキテクチャ(たとえば、x86_64)が複数ある場合、アーキテクチャの種類をラベルに含めることをお勧めします。
ko: 아키텍처 명명(권장): 귀사가 단 하나의 아키텍처(예: x86_64)만 운영하고 있지 않다면 레이블에 아키텍처 유형을 제공하는 것이 좋습니다.
zh_cn: 体系结构命名（建议）：除非您的公司仅在一个体系结构上运行（例如 x86_64），否则最好提供含体系结构类型的标签。

source: Server type naming: What is this server being used for?
ca: Nom del tipus de servidor: Per a què s'està utilitzant aquest servidor?
ja: サーバの種類の名前: このサーバの使用目的。
ko: 서버 유형 명명: 이 서버를 어떤 목적으로 사용 중입니까?
zh_cn: 服务器类型命名：此服务器的用途是什么？

source: Location naming: Where is the server located? Room, building, or department?
ca: Nom de la ubicació: On es troba el servidor? Habitació, edifici o departament?
ja: 場所名: サーバの配置場所(部屋、ビル、部署)。
ko: 위치 명명: 서버가 어디에 있습니까? 서버룸, 건물 또는 부서 내?
zh_cn: 位置命名：服务器位于何处？机房、建筑物或部门？

source: Date naming: Maintenance windows, quarter, etc.
ca: Nom de la data: Finestres de manteniment, trimestre, etc.
ja: 日付: 保守期間(四半期など)。
ko: 날짜 명명: 유지보수 기간, 분기 등
zh_cn: 日期命名：维护时段、季度等。

source: Custom naming: What naming scheme suits your organizations needs?
ca: naming personalitzat: Quin esquema de naming s'adapta a les necessitats de les teves organitzacions?
ja: カスタム名: 組織のニーズに合う命名規則。
ko: 사용자 정의 명명: 어떤 명명 스키마가 조직의 필요에 적합합니까?
zh_cn: 自定义命名：哪种命名模式符合您组织的需求？

source: Example activation key label names:
ca: Exemple de noms d'etiqueta de la clau d'activació:
ja: アクティベーションキーラベルの名前の例:
ko: 활성화 키 레이블 이름의 예:
zh_cn: 激活密钥标签名称示例：

source: Included Channels
ca: Canals inclosos
ja: 含めるチャンネル
ko: 포함된 채널
zh_cn: 包含的通道

source: When creating activation keys you also need to keep in mind which software channels are associated with it. Keys should have a specific base channel assigned to them. Using the default base channel is not recommended. For more information, see the client operating system you are installing at xref:client-configuration:registration-overview.adoc[].
ca: A l'hora de crear claus d'activació també cal tenir en compte quins canals de programari hi estan associats. Les claus han de tenir assignat un canal base específic. No es recomana utilitzar el canal base per defecte. Per a més informació, consulteu el sistema operatiu client que esteu instal·lant a xref:client-configuration:registration-overview.adoc[].
ja: アクティベーションキーを作成するときは、このキーに関連付けられているソフトウェアチャンネルも考慮する必要があります。 キーには、特定のベースチャンネルを割り当てる必要があります。 デフォルトのベースチャンネルの使用はお勧めしません。 詳細については、xref:client-configuration:registration-overview.adoc[]でインストールしているクライアントオペレーティングシステムを参照してください。
ko: 활성화 키를 생성할 때는 어떤 소프트웨어 채널이 연결되어 있는지도 기억해 두어야 합니다. 키에는 할당된 특정 기본 채널이 있어야 합니다. 기본값으로 설정된 기본 채널은 사용하지 않는 것이 좋습니다. 자세한 내용은 xref:client-configuration:registration-overview.adoc[]에서 설치하려는 클라이언트 운영 체제를 참조하십시오.
zh_cn: 在创建激活密钥时，您还需要注意哪些软件通道与其关联。应为密钥指派特定的基础通道， 不建议使用默认基础通道。有关详细信息，请在 xref:client-configuration:registration-overview.adoc[] 中查看您要安装的客户端操作系统。

source: AppStream Modules
ca: Mòduls d'AppStream

source: If you are managing a client that is subscribed to an AppStream channel, {productname} will filter packages available to the client depending on its currently enabled set of AppStream modules.
ca: Si gestioneu un client que està subscrit a un canal d'AppStream, {productname} filtrarà els paquets disponibles per al client en funció del conjunt actualment habilitat de mòduls d'AppStream.

source: Install via a CD-ROM or a USB Key
ca: Instal·la a través d'un CD-ROM o una clau USB
ja: CD-ROMまたはUSBメモリを使用してインストールする
ko: CD-ROM 또는 USB 키를 통한 설치
zh_cn: 通过 CD-ROM 或 USB 密钥安装

source: For clients that are not yet registered to {productname}, and if network boot over PXE is not an option, a bootable CD-ROM or USB key can be used to install the system.
ca: Per als clients que encara no estan registrats a {productname}, i si l'arrencada de xarxa a través de PXE no és una opció, es pot utilitzar una clau CD-ROM o USB arrencable per instal·lar el sistema.
ja: {productname}にまだ登録されていないクライアントで、PXEを通じたネットワークブートを選択できない場合は、ブート可能なCD-ROMまたはUSBメモリを使用してシステムをインストールできます。
ko: {productname}에 등록되지 않고 PXE를 통한 네트워크 부팅을 사용할 수 없는 클라이언트의 경우 부팅 가능한 CD-ROM 또는 USB 키를 사용하여 시스템을 설치할 수 있습니다.
zh_cn: 对于尚未注册到 {productname} 的客户端，如果无法通过 PXE 进行网络引导，可以使用可引导 CD-ROM 或 USB 密钥来安装系统。

source: One option to prepare such a removable medium is to use {cobbler}. For information about using {cobbler} to prepare an ISO image, see xref:client-configuration:autoinst-cdrom.adoc#build-iso-with-cobbler[Build an ISO Image With {cobbler}].
ca: Una opció per preparar aquest mitjà extraïble és utilitzar {cobbler}. Per obtenir informació sobre com utilitzar {cobbler} per preparar una imatge ISO, vegeu xref:client-configuration:autoinst-cdrom.adoc].build-iso-with-cobbler[Build an ISO Image With {cobbler}].
ko: 해당 이동식 매체를 준비하기 위한 한 가지 옵션은 {cobbler}를 사용하는 것입니다. {cobbler}를 사용한 ISO 이미지 준비에 대한 설명은 xref:client-configuration:autoinst-cdrom.adoc#build-iso-with-cobbler[{cobbler}를 사용한 ISO 이미지 빌드]를 참조하십시오.
zh_cn: 准备此类可移动媒体的其中一个方法是使用 {cobbler}。有关使用 {cobbler} 准备 ISO 映像的信息，请参见xref:client- configuration:autoinst-cdrom.adoc#build-iso-with-cobbler[使用 {cobbler} 构建 ISO 映像]。

source: For {suse} systems, it is often recommended to prepare an ISO image using KIWI. For more information, see xref:client-configuration:autoinst-cdrom.adoc#build-iso-with-kiwi[Build a SUSE ISO Image With KIWI].
ca: Podeu extreure els fitxers necessaris d'una imatge de DVD. Per obtenir informació, vegeu xref:client-configuration:autoinst-distributions.adoc].based-on-iso-image[Distribució basada en una imatge ISO].
ja: {suse}システムでは、多くの場合、KIWIを使用してISOイメージを準備することが推奨されます。 詳細については、xref:client-configuration:autoinst-cdrom.adoc#build-iso-with-kiwi[KIWIでSUSE ISOイメージを構築する]を参照してください。
ko: {suse} 시스템의 경우 KIWI를 사용하여 ISO 이미지를 준비하는 것이 권장되는 경우가 많습니다. 자세한 내용은 xref:client-configuration:autoinst-cdrom.adoc#build-iso-with-kiwi[KIWI를 사용한 SUSE ISO 이미지 빌드]를 참조하십시오.
zh_cn: 对于 {suse} 系统，通常建议使用 KIWI 来准备 ISO 映像。有关详细信息，请参见xref:client-configuration:autoinst-cdrom.adoc#build-iso-with-kiwi[使用 KIWI 构建 SUSE ISO 映像]。

source: In all cases, you use the resulting image to burn a CD-ROM or prepare a USB key.
ca: En tots els casos, utilitzeu la imatge resultant per a gravar un CD-ROM o preparar una clau USB.
ja: いずれの場合も、生成されたイメージをCD-ROMまたはUSBメモリに書き込みます。
ko: 모든 경우에 결과 이미지를 CD-ROM으로 굽거나 USB 키를 준비해야 합니다.
zh_cn: 在所有情况下，您都需要使用生成的映像刻录 CD-ROM 或准备 USB 密钥。

source: Build an ISO Image With {cobbler}
ca: Construeix una imatge ISO SUSE amb KIWI
ko: {cobbler}를 사용한 ISO 이미지 빌드
zh_cn: 使用 {cobbler} 构建 ISO 映像
