Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/client-configuration/*.po
Languages: ca, ja, ko, zh_cn

source: {cobbler} can create ISO boot images that contain a set of distributions, kernels, and a menu that works in a similar way to a PXE installation.
ca: {cobbler} pot crear imatges d'arrencada ISO que contenen un conjunt de distribucions, nuclis i un menú que funciona de manera similar a una instal·lació PXE.
ko: {cobbler}는 PXE 설치와 유사한 방식으로 작동하는 배포 세트, 커널 및 메뉴가 포함된 ISO 부팅 이미지를 생성할 수 있습니다.
zh_cn: {cobbler} 可创建包含一组发行套件、内核和菜单的 ISO 引导映像。该映像的工作方式与 PXE 安装类似。

source: Building ISOs with {cobbler} is not supported on {ibmz}.
ca: La construcció d'ISO amb {cobbler} no està suportada a {ibmz}.
ko: {ibmz}에서는 {cobbler}를 사용한 ISO 빌드를 지원하지 않습니다.
zh_cn: {ibmz} 上不支持使用 {cobbler} 构建 ISO。

source: In order to prepare an ISO image with {cobbler}, you need to prepare a distribution and a profile, similar to using network boot over PXE. For information about creating a distribution, see xref:client-configuration:autoinst-distributions.adoc[Autoinstallable Distributions]. For information about creating a profile, see xref:client-configuration:autoinst-profiles.adoc[Autoinstallation Profiles].
ca: Per reinstal·lar un client registrat en el lloc, heu de definir una distribució autoinstal·lable i un perfil d'autoinstal·lació. Per obtenir informació, vegeu xref:client-configuration:autoinst-distributions.adoc[Autoinstallable Distributions] i xref:client-configuration:autoinst-profiles.adoc[Autoinstallation Profiles].
ko: {cobbler}를 사용하여 ISO 이미지를 준비하려면 PXE를 통한 네트워크 부팅을 사용하는 것과 유사하게 배포 및 프로파일을 준비해야 합니다. 배포판 생성에 대한 설명은 xref:client-configuration:autoinst-distributions.adoc[자동 설치 가능한 배포판]을 참조하십시오. 프로파일 생성에 대한 설명은 xref:client-configuration:autoinst-profiles.adoc[자동 설치 프로파일]을 참조하십시오.
zh_cn: 与通过 PXE 进行网络引导类似，为了使用 {cobbler} 准备 ISO 映像，您需要准备发行套件和配置文件。有关创建发行套件的信息，请参见 xref:client-configuration :autoinst-distributions.adoc[可自动安装的发行套件]。有关创建配置文件的信息，请参见 xref:client-configuration:autoinst- profiles.adoc[自动安装配置文件]。

source: The {cobbler} [command]``buildiso`` command takes parameters to define the name and output location of the boot ISO. Specifying the distribution with [option]``--distro`` is mandatory when running [command]``buildiso`` command. [option]``--iso`` is the output location:
ca: L'ordre {cobbler} [ordre].buildiso. pren paràmetres per definir el nom i la ubicació de sortida de l'ISO d'arrencada. Especificar la distribució amb [option].--distro. és obligatori quan s'executa l'ordre [command].buildiso.. [option] the--iso the és la ubicació de sortida:

source: mgrctl exec -- cobbler buildiso --iso=/path/to/boot.iso --distro=<your-distro-label>
ca: mgrctl exec -- cobbler buildiso --iso//camí/a/boot.iso --distro=<your-distro-label>

source: You must use distribution and profile labels as listed by {cobbler}, and not simply as shown in the {webui}. To list the names of distributions and profiles stored by {cobbler}, run the commands:
ca: Heu d'utilitzar les etiquetes de distribució i de perfil com les llista {cobbler}, i no simplement com es mostra a {webui}. Per llistar els noms de les distribucions i els perfils emmagatzemats per {cobbler}, executeu les ordres:

source: The boot ISO includes all profiles and systems by default. You can limit which profiles and systems are used with the [option]``--profiles`` and [option]``--systems`` options:
ca: L'ISO d'arrencada inclou tots els perfils i sistemes per defecte. Podeu limitar quins perfils i sistemes s'utilitzen amb les opcions [option].--profiles. i [option].--systems.. Per exemple:

source: With [option]``--esp`` you can enable the built boot ISOs with Secure Boot. You explicitly specify the EFI System Partition (ESP). By default, {cobbler} generates the ESP partition, which disables Secure Boot.
ca: Amb [option].--esp. podeu habilitar les ISO d'arrencada construïdes amb arrencada segura. Especifiqueu explícitament la partició del sistema EFI (ESP). Per defecte, {cobbler} genera la partició ESP, que desactiva l'arrencada segura.

source: mgrctl exec -- cobbler buildiso \ --esp="/usr/share/tftpboot-installation/SLE-15-SP6-x86_64/boot/x86_64/efi" \ --iso=/path/to/boot.iso --distro=<your-distro-label>
ca: mgrctl exec -- cobbler buildiso \ --esp""/usr/share/tftpboot-installation/SLE-15-SP6-x8664/boot/x8664/efi" \ --iso//camí/a/boot.iso --distro=<your-distro-label>

source: Procedure: Finding [literal]``efi``
ca: Procediment: Construir una imatge

source: On the container host, execute the following command to get the [option]``distro`` name:
ca: Al servidor contenidor, executeu l'ordre següent per a obtenir el nom [option] thedistro::

source: This command outputs strings such as [literal]``sles15-sp6:1:SUSE``.
ca: Aquesta ordre produeix cadenes com [literal].sles15-sp6:1:SUSE..

source: On the container host, execute the following command to get information about the [option]``distro`` files location:
ca: Al servidor contenidor, executeu la següent ordre per obtenir informació sobre la ubicació dels fitxers [option] thedistro::

source: This command outputs a report such as the following:
ca: Aquesta ordre emet un informe com el següent:

source: Name : sles15-sp6:1:SUSE Architecture : x86_64 ...output omitted... Initrd : /usr/share/tftpboot-installation/SLE-15-SP6-x86_64/boot/x86_64/loader/initrd Kernel : /usr/share/tftpboot-installation/SLE-15-SP6-x86_64/boot/x86_64/loader/linux ...output omitted...
ca: Nom: sles15-sp6:1:SUSE Arquitectura: x8664 ...sortida omesa... Initrd : /usr/share/tftpboot-installation/SLE-15-SP6-x8664/boot/x8664/loader/initrd Kernel : /usr/share/tftpboot-installation/SLE-15-SP6-x8664/boot/x8664/loader/linux ...sortida omesa...

source: See the contents of the boot directory. In the example above, the boot partition is the [path]``/usr/share/tftpboot-installation/SLE-15-SP6-x86_64/boot/x86_64/efi`` file, but this can differ based on the ISO distributor.
ca: Vegeu el contingut del directori d'arrencada. En l'exemple anterior, la partició d'arrencada és el fitxer [path]./usr/share/tftpboot-installation/SLE-15-SP6-x8664/boot/x8664/efi., però això pot diferir en funció del distribuïdor ISO.

source: If you cannot write an ISO image to a public [path]``tmp`` directory, check your systemd settings in [path]``/usr/lib/systemd/system/cobblerd.service``.
ca: Si no podeu escriure una imatge ISO a un directori públic [path].tmp., comproveu la configuració del systemd a [path] in/usr/lib/systemd/system/cobblerd.service..
ja: ISOイメージをパブリック[path]``tmp``ディレクトリに書き込むことができない場合、[path]``/usr/lib/systemd/system/cobblerd.service``でsystemd設定を確認してください。
ko: ISO 이미지를 공용 [path]``tmp`` 디렉토리에 쓸 수 없는 경우 [path]``/usr/lib/systemd/system/cobblerd.service``에서 systemd 설정을 확인하십시오.
zh_cn: 如果您无法将 ISO 映像写入到公共 [path]``tmp`` 目录,请检查 [path]``/usr/lib/systemd/system/cobblerd.service`` 中的 systemd 设置。

source: Build a SUSE ISO Image With KIWI
ca: Construeix una imatge ISO SUSE amb KIWI
ja: KIWIでSUSE ISOイメージを構築する
ko: KIWI를 사용한 SUSE ISO 이미지 빌드
zh_cn: 使用 KIWI 构建 SUSE ISO 映像

source: KIWI is an image creation system. You can use KIWI to create a bootable ISO image to be used by the target system for installation of a {suse} system. When the system is rebooted or switched on, it boots from the image, loads the {ay} configuration from your {productname}, and installs {sles} according to the {ay} profile.
ca: KIWI és un sistema de creació d'imatges. Podeu utilitzar el KIWI per crear una imatge ISO d'arrencada per ser utilitzada pel sistema de destinació per a la instal·lació d'un sistema {suse}. Quan el sistema es reinicia o s'activa, arrenca des de la imatge, carrega la configuració {ay} des del vostre {productname} i instal·la {sles} segons el perfil {ay}.
ja: KIWIはイメージ作成システムです。 KIWIを使用して、{suse}システムのインストール用にターゲットシステムで使用するブート可能なISOイメージを作成することができます。 システムを再起動または電源オンするとき、このイメージからブートし、{ay}設定を{productname}から読み込み、{ay}プロファイルに応じて{sles}をインストールします。
ko: KIWI는 이미지 생성 시스템입니다. KIWI를 사용하여 {suse} 시스템을 설치하기 위한 대상 시스템에서 사용되는 부팅 가능한 ISO 이미지를 생성할 수 있습니다. 시스템은 재부팅되거나 켜질 때 이 이미지로 부팅되고, {productname}에서 {ay} 구성을 로드하며, {ay} 프로파일에 따라 {sles}를 설치합니다.
zh_cn: KIWI 是一个映像创建系统。您可以使用 KIWI 创建供目标系统用于安装 {suse} 系统的可引导 ISO 映像。重引导或打开系统时，它会从映像引导，从 {productname} 装载 {ay} 配置，并根据 {ay} 配置文件安装 {sles}。

source: To use the ISO image, boot the system and type `autoyast` at the prompt (assuming you left the label for the {ay} boot as ``autoyast``). Press kbd:[Enter] to begin the {ay} installation.
ca: Per utilitzar la imatge ISO, arrenqueu el sistema i escriviu ).autoyast). a l'indicador (assumint que heu deixat l'etiqueta per a l'arrencada {ay} com a ).autoyast).). Premeu kbd:[Retorn] per a començar la instal·lació de {ay}.
ja: ISOイメージを使用するには、システムをブートし、プロンプトに``autoyast``と入力します({ay}ブートのラベルを``autoyast``のままにしていることを想定しています)。 kbd:[Enter]キーを押して{ay}のインストールを開始します。
ko: ISO 이미지를 사용하려면 시스템을 부팅하고 프롬프트에 ``autoyast``를 입력하십시오({ay} 부팅을 위한 레이블을 ``autoyast`` 상태로 두었다고 가정함). kbd:[Enter] 키를 눌러 {ay} 설치를 시작합니다.
zh_cn: 要使用 ISO 映像，请引导系统并在提示符处键入 `autoyast`（假设您将 {ay} 引导的标签保留为 ``autoyast``）。按 kbd: [Enter] 开始 {ay} 安装。

source: For more information about KIWI, see http://doc.opensuse.org/projects/kiwi/doc/.
ca: Per a més informació sobre KIWI, consulteu http://doc.opensuse.org/projects/kiwi/doc/.
ja: KIWIの詳細については、link:http://doc.opensuse.org/projects/kiwi/doc/[]を参照してください。
ko: KIWI에 대한 자세한 정보는 http://doc.opensuse.org/projects/kiwi/doc/[]에서 참조하십시오.
zh_cn: 有关 KIWI 的详细信息，请参见 http://doc.opensuse.org/projects/kiwi/doc/[]。

source: Build a Red Hat ISO Image With {cobbler}
ca: Construeix una imatge ISO SUSE amb KIWI
ko: {cobbler}를 사용한 Red Hat ISO 이미지 빌드
zh_cn: 使用 {cobbler} 构建 Red Hat ISO 映像

source: For more information, see xref:client-configuration:autoinst-cdrom.adoc#build-iso-with-cobbler[].
ca: Per a més informació, vegeu xref:client-configuration:autoinst-profiles.adoc[].
ja: 詳細については、xref:client-configuration:autoinst-cdrom.adoc#build-iso-with-cobbler[]を参照してください。
ko: 자세한 내용은 xref:client-configuration:autoinst-cdrom.adoc#build-iso-with-cobbler[]에서 확인할 수 있습니다.
zh_cn: 有关详细信息，请参见 xref:client-configuration:autoinst-cdrom.adoc#build-iso-with-cobbler[]。

source: Autoinstallable Distributions
ca: Distribucions autoinstal·lables
ja: 自動インストールのディストリビューション
ko: 자동 설치 가능한 배포판
zh_cn: 可自动安装的发行套件

source: The autoinstallation process relies on an several files to initiate the installation. These files include the Linux kernel, an initial RAM disk, and other files required to boot the operating system in installation mode.
ca: El procés d'autoinstal·lació es basa en diversos fitxers per iniciar la instal·lació. Aquests fitxers inclouen el nucli Linux, un disc RAM inicial i altres fitxers necessaris per arrencar el sistema operatiu en mode d'instal·lació.
ja: 自動インストールプロセスでは、インストールを開始するために複数のファイルが必要です。 必要なファイルには、Linuxカーネル、初期RAMディスク、およびインストールモードでオペレーティングシステムをブートするために必要なその他のファイルが含まれます。
ko: 자동 설치 프로세스에서는 여러 파일을 사용하여 설치를 시작합니다. 이러한 파일에는 Linux 커널, 초기 RAM 디스크 및 설치 모드에서 운영 체제를 부팅하기 위해 필요한 기타 파일이 포함됩니다.
zh_cn: 自动安装过程依赖于几个文件来启动安装。这些文件包括 Linux 内核、初始 RAM 磁盘和在安装模式下引导操作系统所需的其他文件。

source: {productname} uses the [systemitem]``mgradm`` tool to copy the installation file from the source to the server container.
ca: {productname} utilitza l'eina [systemitem].mgradm. per copiar el fitxer d'instal·lació des de l'origen al contenidor del servidor.

source: You can extract the needed files from a DVD image. For information, see xref:client-configuration:autoinst-distributions.adoc#based-on-iso-image[Distribution Based on an ISO Image].
ca: Podeu extreure els fitxers necessaris d'una imatge de DVD. Per obtenir informació, vegeu xref:client-configuration:autoinst-distributions.adoc].based-on-iso-image[Distribució basada en una imatge ISO].
ja: DVDイメージから必要なファイルを抽出できます。 詳細については、xref:client-configuration:autoinst-distributions.adoc#based-on-iso-image[ISOイメージに基づくディストリビューション]を参照してください。
ko: 필요한 파일을 DVD 이미지에서 추출할 수 있습니다. 관련 정보는 xref:client-configuration:autoinst-distributions.adoc#based-on-iso-image[ ISO 이미지 기반 배포]를 참조하십시오.
zh_cn: 您可以从 DVD 映像中提取所需的文件。有关信息，请参见 xref:client-configuration:autoinst-distributions.adoc#based-on-iso-image[基于 ISO 映像的发行套件]。

source: Alternatively, you can install the [package]``tftpboot-installation`` package. For information, see xref:client-configuration:autoinst-distributions.adoc#based-on-rpm-package[Distribution Based on a RPM Package].
ca: Podeu extreure els fitxers necessaris d'una imatge de DVD. Per obtenir informació, vegeu xref:client-configuration:autoinst-distributions.adoc].based-on-iso-image[Distribució basada en una imatge ISO].
ja: または、[package]``tftpboot-installation``パッケージをインストールすることもできます。 詳細については、xref:client-configuration:autoinst-distributions.adoc#based-on-rpm-package[RPMパッケージに基づくディストリビューション]を参照してください。
ko: 또는 [package]``tftpboot-installation`` 패키지를 설치할 수 있습니다. 관련 정보는 xref:client-configuration:autoinst-distributions.adoc#based-on-rpm-package[RPM 패키지 기반 배포]를 참조하십시오.
zh_cn: 或者，您也可以安装 [package]``tftpboot-installation`` 软件包。有关信息，请参见xref:client-configuration:autoinst-distributions.adoc#based-on-rpm-package[基于 RPM 软件包的发行套件]。

source: You must also have a base channel synchronized on your {productname} Server for the same operating system version as those files.
ca: També heu de tenir un canal base sincronitzat al vostre servidor {productname} per a la mateixa versió del sistema operatiu que aquests fitxers.
ja: また、これらのファイルと同じオペレーティングシステムバージョン用に、{productname}サーバでベースチャンネルを同期させておく必要があります。
ko: 또한 해당 파일과 운영 체제 버전이 동일한 {productname} 서버에서 동기화된 기본 채널이 있어야 합니다.
zh_cn: 对于与这些文件相同的操作系统版本，您还必须在 {productname} 服务器上同步基础通道。

source: When you have the files ready, and the base channel synchronized, you need to declare the distribution. This operation associates the installation files to the base channel. The distribution can be referred to by one or more installation profiles. For information, see xref:client-configuration:autoinst-distributions.adoc#declare-distribution[Declare an Autoinstallable Distribution].
ca: Quan tingueu els fitxers llestos i el canal base sincronitzat, haureu de declarar la distribució. Aquesta operació associa els fitxers d'instal·lació al canal base. La distribució es pot referir a un o més perfils d'instal·lació. Per obtenir informació, vegeu xref:client-configuration:autoinst-distributions.adoc].declare-distribution[Declare an Autoinstallable Distribution].
ja: ファイルの準備が整い、ベースチャンネルを同期したら、ディストリビューションを宣言する必要があります。 この操作により、インストールファイルがベースチャンネルに関連付けられます。 ディストリビューションは、1つ以上のインストールプロファイルによって参照されることがあります。 詳細については、xref:client-configuration:autoinst-distributions.adoc#declare-distribution[自動インストールのディストリビューションを宣言する]を参照してください。
ko: 파일이 준비되고 기본 채널이 동기화되면 배포를 선언해야 합니다. 이 작업은 기본 채널에 설치 파일을 연결합니다. 배포는 1개 이상의 설치 프로파일에 의해 참조될 수 있습니다. 관련 정보는 xref:client-configuration:autoinst-distributions.adoc#declare-distribution[자동 설치 가능 배포판 선언]을 참조하십시오.
zh_cn: 当您准备好文件并已同步基础通道时，您需要声明发行套件。此操作会将安装文件关联到基础通道。发行套件可能会由一个或多个安装配置文件引用。有关信息，请参见xref:client-configuration:autoinst-distributions.adoc#declare-distribution[声明可自动安装的发行套件]。

source: Distribution Based on an ISO Image
ca: Distribució basada en una imatge ISO
ja: ISOイメージに基づくディストリビューション
ko: ISO 이미지 기반 배포
zh_cn: 基于 ISO 映像的发行套件

source: This method assumes you have installation media for the operating system you want to install on the clients. This is usually a DVD [path]``.iso`` image that contains the Linux kernel, an [path]``initrd`` file, and other files required to boot the operating system in installation mode.
ca: Aquest mètode suposa que teniu mitjans d'instal·lació per al sistema operatiu que voleu instal·lar als clients. Normalment es tracta d'una imatge DVD [path]..iso. que conté el nucli Linux, un fitxer [path].initrd. i altres fitxers necessaris per arrencar el sistema operatiu en mode d'instal·lació.
ja: この方法では、クライアントにインストールするオペレーティングシステムのインストールメディアがあることを前提としています。 このメディアは通常DVD [path]``.iso``イメージです。これには、Linuxカーネル、[path]``initrd``ファイル、およびインストールモードでオペレーティングシステムをブートするために必要なその他のファイルが含まれています。
ko: 이 방법에서는 클라이언트에 설치하려는 운영 체제의 설치 미디어가 있는 경우를 가정합니다. 일반적으로 Linux 커널, [path]``initrd`` 파일 및 설치 모드에서 운영 체제를 부팅하는 데 필요한 기타 파일을 포함하는 DVD [path]``.iso`` 이미지입니다.
zh_cn: 此方法假设您有要在客户端上安装的操作系统的安装媒体。这通常是 DVD [path]``.iso`` 映像，其中包含 Linux 内核、[path]``initrd`` 文件和在安装模式下引导操作系统所需的其他文件。

source: Procedure: Importing Files from Installation Media
ca: Procediment: Importació de fitxers des del medi d'instal·lació
ja: 手順: インストールメディアからのファイルのインポート
ko: 절차: 설치 미디어에서 파일 임포트
zh_cn: 过程：从安装媒体导入文件

source: Use [command]``mgradm`` to import installation data from the ISO image:
ca: Utilitzeu [command] themgradm the per a importar dades d'instal·lació des de la imatge ISO:

source: # mgradm distribution copy <image_name>.iso <image_name>
ca: còpia de distribució mgradm <imagename>.iso <imagename>

source: Take a note of the distribution path reported by [command]``mgradm``. You will need it when you declare the distribution to {productname}.
ca: Preneu nota del camí de distribució informat per [ordre].mgradm.. El necessitareu quan declareu la distribució a {productname}.

source: Distribution autodetection and registration
ca: registre basat en l'aprovisionador d'execució remota

source: [systemitem]``mgradm`` is able to automatically detect distribution name and register it to the server. Provided ISO image needs to contain a [path]``.treeinfo`` file.
ca: [systemitem].mgradm to és capaç de detectar automàticament el nom de la distribució i registrar-lo al servidor. La imatge ISO ha de contenir un fitxer [path]..treeinfo..

source: Procedure: Import distribution file with autodetection and registration
ca: Procediment: Importa un fitxer de distribució amb autodetecció i registre

source: Use [command]``mgradm``:
ca: Usa [ordre]:mgradm::

source: Distribution Based on a RPM Package
ca: Distribució basada en un paquet RPM
ja: RPMパッケージに基づくディストリビューション
ko: RPM 패키지 기반 배포
zh_cn: 基于 RPM 软件包的发行套件

source: This method works on {suse} systems. It is simpler than importing contents from an installation media, because it uses prepackaged files for your installation system.
ca: Aquest mètode funciona en sistemes {suse}. És més senzill que importar continguts d'un mitjà d'instal·lació, perquè utilitza fitxers preempaquetats per al vostre sistema d'instal·lació.
ja: この方法は、{suse}システムで動作します。 インストールシステム用にあらかじめパッケージされたファイルを使用するため、インストールメディアからコンテンツをインポートするよりも簡単です。
ko: 이 방법은 {suse} 시스템에 적용됩니다. 설치 시스템에서 미리 패키지화된 파일을 사용하므로 설치 미디어에서 컨텐트를 임포트하는 것보다 단순합니다.
zh_cn: 此方法适用于 {suse} 系统。它比从安装媒体导入内容更简单，因为它使用的是安装系统的预打包文件。

source: Procedure: Extracting Files from an Installation Package
ca: Procediment: Extreure fitxers d'un paquet d'instal·lació
ja: 手順: インストールパッケージからファイルを抽出する
ko: 절차: 설치 패키지에서 파일 추출
zh_cn: 过程：从安装软件包提取文件

source: On the {productname} Server, install the package whose name starts with [package]``tftpboot-installation``. You can determine its exact name with the command [command]``zypper se tftpboot-installation``
ca: Al servidor {productname}, instal·leu el paquet el nom del qual comença amb [package].tftpboot-installation.. Podeu determinar el seu nom exacte amb l'ordre [command] thezypper se tftpboot-installation the
ja: {productname}サーバに、名前が[package]``tftpboot-installation``で始まるパッケージをインストールします。 このパッケージの正確な名前は、[command]``zypper se tftpboot-installation``コマンドで確認できます。
ko: {productname} 서버에서 이름이 [package]``tftpboot-installation``으로 시작하는 패키지를 설치합니다. 정확한 이름은 [command]``zypper se tftpboot-installation`` 명령으로 확인할 수 있습니다.
zh_cn: 在 {productname} 服务器上，安装名称以 [package]``tftpboot-installation`` 开头的软件包。您可以通过 [command]``zypper se tftpboot-installation`` 命令确定它的确切名称

source: You can install the package to different root to avoid need for restart using following command:
ca: Podeu instal·lar el paquet a una arrel diferent per evitar la necessitat de reiniciar utilitzant la següent ordre:

source: Find the installation files with the command [command]``ls -d /opt/tftpinstall/usr/share/tftpboot-installation/*``.
ca: Troba els fitxers d'instal·lació amb l'ordre [ordre].ls -d /opt/tftpinstall/usr/share/tftpboot-installation/*..

source: Copy installation files using [command]``mgradm``:
ca: Copia els fitxers d'instal·lació utilitzant [ordre]:mgradm::

source: Take a note of the distribution path reported by [systemitem]``mgradm`` tool. You will need it when you declare the distribution to {productname}.
ca: Preneu nota del camí de distribució informat per l'eina [systemitem].mgradm.. El necessitareu quan declareu la distribució a {productname}.

source: After [systemitem]``mgradm`` tool finishes, you can remove [path]``/opt/tftpinstall`` directory.
ca: Després que acabi l'eina [systemitem].mgradm,, podeu eliminar el directori [path]./opt/tftpinstall..

source: This procedure prepares the installation of the same operating system version as the one that powers your {productname} Server. If you want to install a different operating system or version on the client, you need to manually get the package [package]``tftpboot-installation-*`` from the distribution it belongs to. In the [menu]``Package Search`` input box {productname}, search the packages whose names start with [package]``tftpboot-installation``, then look at the package's details. They show the local path below [path]``/var/spacewalk/``.
ca: Aquest procediment prepara la instal·lació de la mateixa versió del sistema operatiu que la que engega el vostre servidor {productname}. Si voleu instal·lar un sistema operatiu o una versió diferent al client, heu d'obtenir manualment el paquet [paquet].tftpboot-installation-*. de la distribució a la qual pertany. En el quadre d'entrada [menu].Cerca de paquets { {productname}, cerqueu els paquets els noms dels quals comencen amb [package].tftpboot-installation. i, a continuació, mireu els detalls del paquet. Mostren el camí local sota [camí]./var/spacewalk/..
ja: この手順では、{productname}サーバに搭載されているものと同じバージョンのオペレーティングシステムをインストールする準備をします。 クライアントに異なるオペレーティングシステムやバージョンをインストールする場合は、[package]``tftpboot-installation-*``パッケージを、これが属するディストリビューションから手動で取得する必要があります。 {productname}の［[menu]``パッケージ検索``］入力ボックスで、名前が[package]``tftpboot-installation``で始まるパッケージを検索し、そのパッケージの詳細を確認します。ここには、[path]``/var/spacewalk/``以下のローカルパスが表示されます。
ko: 이 절차를 통해 {productname} 서버와 버전이 동일한 운영 체제를 설치하도록 준비할 수 있습니다. 클라이언트에 다른 운영 체제 또는 버전을 설치하려면 해당 배포에서 [package]``tftpboot-installation-*`` 패키지를 수동으로 가져와야 합니다. {productname}의 [menu]``패키지 검색`` 입력 상자에서 이름이 [package]``tftpboot-installation``으로 시작하는 패키지를 검색한 후 패키지의 세부 정보를 확인합니다. 해당 정보는 [path]``/var/spacewalk/`` 아래의 로컬 경로에 표시됩니다.
zh_cn: 此过程将准备安装与驱动 {productname} 服务器的操作系统版本相同的操作系统版本。如果您想在客户端上安装不同的操作系统或版本，需要从其所属的发行套件手动获取 [package]``tftpboot-installation-*`` 软件包。在 {productname} 的[menu]``软件包搜索``输入框中，搜索名称以 [package]``tftpboot-installation`` 开头的软件包，然后查看软件包的细节。[path]``/var/spacewalk/`` 下会显示本地路径。

source: Declare an Autoinstallable Distribution
ca: Declara una distribució autoinstal·lable
ja: 自動インストールのディストリビューションを宣言する
ko: 자동 설치 가능한 배포판 선언
zh_cn: 声明可自动安装的发行套件

source: The next step after extracting the autoinstallation files is to declare an autoinstallable distribution.
ca: El següent pas després d'extreure els fitxers d'autoinstal·lació és declarar una distribució autoinstal·lable.
ja: 自動インストールファイルを抽出した後の次の手順は、自動インストールのディストリビューションの宣言です。
ko: 자동 설치 파일을 추출한 후의 단계는 자동 설치 가능한 배포판을 선언하는 것입니다.
zh_cn: 提取自动安装文件后，接下来要声明可自动安装的发行套件。

source: Procedure: Declaring an Autoinstallable Distribution
ca: Procediment: Declaració d'una distribució autoinstal·lable
ja: 手順: 自動インストールのディストリビューションの宣言
ko: 절차: 자동 설치 가능한 배포판 선언
zh_cn: 过程：声明可自动安装的发行套件

source: In the {productname} {webui}, navigate to menu:Systems[Autoinstallation > Distributions].
ca: A {productname} {webui}, navegueu al menú:Systems[Autoinstallation ]. Distributions].
ja: {productname}の{webui}で、menu:システム[自動インストール > ディストリビューション]に移動します。
ko: {productname} {webui}에서 menu:시스템[자동 설치 > 배포]로 이동합니다.
zh_cn: 在 {productname} {webui} 中，导航到menu:系统[自动安装 > 发行套件]。

source: Click [guimenu]``Create Distribution``, and complete these fields:
ca: Feu clic a [guimenu]:Crea la distribució`` i completeu aquests camps:
ja: ［[guimenu]``ディストリビューションの作成``］をクリックし、次のフィールドに入力します。
ko: [guimenu]``배포 생성``을 클릭하고 다음 필드를 입력합니다.
zh_cn: 单击[guimenu]``创建发行套件``，并填写以下字段：
