Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/large-deployments/*.po
Languages: cs

source: xref:large-deployments-overview.adoc[Large Deployments Guide]
cs: xref:large-deployments-overview.adoc[Průvodce rozsáhlým nasazením]

source: xref:hardware-reqs.adoc[Hardware Requirements]
cs: xref:hardware-reqs.adoc[Požadavky na hardware]

source: xref:single-server.adoc[Single Server]
cs: xref:single-server.adoc[Jediný server]

source: xref:operation-reqs.adoc[Operation Requirements]
cs: xref:operation-reqs.adoc[Požadavky na provoz]

source: xref:multi-server.adoc[Multiple Servers with Hub]
cs: xref:multi-server.adoc[více serverů a rozbočovač]

source: xref:hub-reqs.adoc[Hub Operation Requirements]
cs: xref:hub-reqs.adoc[Požadavky na provoz rozbočovače]

source: xref:hub-install.adoc[Hub Installation]
cs: xref:hub-install.adoc[Instalace rozbočovače]

source: xref:hub-api.adoc[Hub API]
cs: xref:hub-api.adoc[API rozbočovače]

source: xref:hub-namespaces.adoc[Hub Namespaces]
cs: xref:hub-namespaces.adoc[Prostor názvů rozbočovače]

source: xref:hub-auth.adoc[Hub Authentication]
cs: xref:hub-auth.adoc[Authentizace rozbočovače]

source: xref:retail-large-scale.adoc[Large Retail Environments]
cs: xref:retail-large-scale.adoc[Velká maloobchodní prostředí]

source: xref:tuning.adoc[Tuning Large Installations]
cs: xref:tuning.adoc[Ladění rozsáhlých instalací]

source: Hardware Requirements
cs: Požadavky na hardware

source: Not all problems can be solved with better hardware, but choosing the right hardware is an absolute necessity for large scale deployments.
cs: Ne všechny problémy lze vyřešit lepším hardwarem, ale výběr správného hardwaru je pro nasazení ve velkém měřítku absolutní nutností.

source: The minimum requirements for the {productname} Server are:
cs: Minimální požadavky na {productname} Server jsou:

source: Eight or more recent {x86_64} CPU cores.
cs: Osm nebo více nejnovějších procesorových jader {x86_64}.

source: 32{nbsp}GiB RAM.
cs: 32{nbsp}GB RAM.

source: For installations with thousands of clients, use 64{nbsp}GB or more.
cs: Pro instalace s tisíci klienty použijte 64{nbsp}GB nebo více.

source: Fast I/O storage devices, such as locally attached SSDs.
cs: Rychlá vstup/výstupní úložná zařízení, jako jsou lokálně připojené SSD.

source: For PostgreSQL data directories, we recommend locally attached RAID-0 SSDs.
cs: Pro datové adresáře PostgreSQL doporučujeme lokálně připojené disky RAID-0 SSD.

source: If the {productname} Server is virtualized, enable the `elevator=noop` kernel command line option, for the best input/output performance. You can check the current status with [command]``cat /sys/block/<DEVICE>/queue/scheduler``. This command will display a list of available schedulers with the currently active one in brackets. To change the scheduler before a reboot, use [command]``echo noop > /sys/block/<DEVICE>/queue/scheduler``.
cs: Pokud je {productname} Server virtualizovaný, povolte volbu příkazového řádku jádra `elevator=noop`, abyste dosáhli nejlepšího vstup/výstupního výkonu. Aktuální stav můžete zkontrolovat pomocí příkazu [command]``cat /sys/block/<DEVICE>/queue/scheduler``. Tento příkaz zobrazí seznam dostupných plánovačů s aktuálně aktivním v závorkách. Chcete-li změnit plánovač před restartem, použijte příkaz [command]``echo noop > /sys/block/<DEVICE>/queue/scheduler``.

source: The minimum requirements for the {productname} Proxy are:
cs: Minimální požadavky na {productname} Proxy jsou:

source: One {productname} Proxy per 500-1000 clients, depending on available network bandwidth.
cs: Jeden {productname} Proxy na 500–1000 klientů, v závislosti na dostupné šířce pásma sítě.

source: Two or more recent {x86_64} CPU cores.
cs: Dvě nebo více nejnovějších procesorových jader {x86_64}.

source: 16{nbsp}GB RAM, and sufficient storage for caching.
cs: 16{nbsp}GB RAM a dostatečné úložiště pro ukládání do mezipaměti.

source: Clients should never be directly attached to the {productname} Server in production systems.
cs: Klienti provozních systémů by nikdy neměli být přímo připojeni k {productname} Serveru.

source: In large scale installations, the {productname} Proxy is used primarily as a local cache for content between the server and clients. Using proxies in this way can substantially reduce download time for clients, and decrease Server egress bandwidth use.
cs: Ve velkých instalacích se {productname} Server používá především jako lokální mezipaměť obsahu mezi serverem a klienty. Použití proxy serverů zde může podstatně zkrátit dobu stahování pro klienty a snížit vytížení šířky pásma na výstupu serveru.

source: The number of clients per proxy will affect the download time. Always take network structure and available bandwidth into account.
cs: Počet klientů každého proxy bude mít vliv na dobu stahování. Vždy berte v úvahu strukturu sítě a dostupnou šířku pásma.

source: We recommend you estimate the download time of typical usage to determine how many clients to connnect to each proxy. To do this, you will need to estimate the number of package upgrades required in every patch cycle. You can use this formula to calculate the download time:
cs: Doporučujeme vám odhadnout dobu stahování typického využití, abyste určili, kolik klientů se má připojit ke každému serveru proxy. K tomu budete muset odhadnout počet upgradů balíčků požadovaných v každém cyklu oprav. K výpočtu doby stahování můžete použít tento vzorec:

source: Size of updates * Number of clients / Theoretical download speed / 60
cs: Velikost aktualizací * Počet klientů / Teoretická rychlost stahování / 60

source: For example, the total time needed to transfer 400{nbsp}MB of upgrades through a physical link speed of 1{nbsp}GB/s to 3000 clients:
cs: Celkový čas potřebný k přenosu 400{nbsp}MB upgradů prostřednictvím fyzické rychlosti linky 1{nbsp}GB/s na 3000 klientů:

source: Using the Hub API
cs: Použití API rozbočovače

source: Make sure the ``hub-xmlrpc-api`` service is started:
cs: Zajistěte spuštění služby ``hub-xmlrpc-api``:

source: Once it is running, connect to the service at port 2830 using any XMLRPC-compliant client libraries.
cs: Po spuštění se připojte ke službě na portu 2830 pomocí libovolných klientských knihoven kompatibilních s XMLRPC.

source: For examples, see xref:large-deployments:hub-auth.adoc[].
cs: Příklady viz xref:large-deployments:hub-auth.adoc[].

source: Logs are saved in ``/var/log/hub/hub-xmlrpc-api.log``. Logs are rotated weekly, or when the log file size reaches the specified limit. By default, the log file size limit is 10{nbsp}MB.
cs: Záznamy jsou uloženy ve ``/var/logs/hub/hub-xmlrpc-api.log``. Záznamy recyklují týdně, nebo dosáhne-li velikost jejich souboru stanovenou mez (standardně 10{nbsp}MB).

source: Hub XMLRPC API Authentication Modes
cs: Ověřovací režimy API centra XMLRPC

source: The Hub XMLRPC API supports three different authentication modes:
cs: Centrální API XMLRPC podporuje tři různé režimy ověřování:

source: Manual mode (default): API credentials must be explicitly provided for each server.
cs: Manuální režim (výchozí): Přihlašovací údaje API musí být výslovně stanoveny pro každý server.

source: Relay mode: the credentials used to authenticate with the Hub are also used to authenticate to each server.
cs: Režim relace: Přihlašovací údaje používané k centrálnímu ověření se také používají k ověření každému serveru.

source: You must provide a list of servers to connect to.
cs: Musíte poskytnout seznam serverů, k nimž se má připojovat.

source: Auto-connect mode: credentials are reused for each server, and any peripheral server you have access to is automatically connected.
cs: Režim automatického připojení: Přihlašovací údaje jsou znovu použity pro každý server; jakýkoli periferní server, ke kterému máte přístup, je automaticky připojen.

source: Authentication Examples
cs: Příklady ověřování

source: This section provides examples of each authentication method.
cs: Tato sekce poskytuje příklady každé metody ověřování.

source: Example: Manual Authentication
cs: Příklad ručního ověřování

source: In manual mode, credentials have to be explicitly provided for each peripheral server before you can connect to it.
cs: V ručním režimu musí být pověření explicitně poskytnuta pro každý periferní server dříve, než se k němu můžete připojit.

source: A typical workflow for manual authentication is:
cs: Typický pracovní postup pro ruční ověřování je:

source: Credentials for the Hub are passed to the ``login`` method, and a session key for the Hub is returned (``hubSessionKey``).
cs: Přihlašovací údaje pro centrum jsou předány metodě ``login``a je vrácen klíč relace pro centrum (``hubSessionKey``).

source: Using the session key from the previous step, {productname} Server IDs are obtained for all the peripheral servers attached to the Hub via the ``hub.listServerIds`` method.
cs: Použitím klíče relace z předchozího kroku jsou získány ID {productname} Serveru všech periferních serverů připojených k centru metodou ``hub.listServerIds``.

source: Credentials for each peripheral server are provided to the ``attachToServers`` method.
cs: Přihlašovací údaje pro každý periferní server jsou poskytnuty metodě ``attachToServers``.

source: This performs authentication against each server's XMLRPC API endpoint.
cs: To provede ověření v koncovém bodu XMLRPC API každého serveru.

source: A ``multicast`` call is performed on a set of servers.
cs: Na sadě serverů se provede volání ``multicast``.

source: This is defined by ``serverIds``, which contains the IDs of the servers to target. In the background, ``system.list_system`` is called on each server's XMLRPC API
cs: To je definováno v ``serverIds``, které obsahují ID cílových serverů. Na pozadí je volán ``system.list_system`` na API XMLRPC každého serveru

source: Hub aggregates the results and returns the response in the form of a ``map``.
cs: Centrum shromáždí výsledky a vrátí odpověď ve formě ``mapy``.

source: The map has two entries:
cs: Mapa má dvě položky:

source: ``Successful``: list of responses for those peripheral servers where the call succeeded.
cs: ``Úspěšný``: seznam odpovědí pro ty periferní servery, kde se volání podařilo.

source: ``Failed``: list of responses for those peripheral servers where the call failed.
cs: ``Selhalo``: seznam odpovědí pro ty periferní servery, kde volání selhalo.

source: If you want to call a method on just one {productname} Server, then Hub API also provides a ``unicast`` namespace. In this case, the response will be a single value and not a map, in the same way as if you called that {productname} server's API directly.
cs: Pokud chcete zavolat metodu pouze na jednom {productname} Serveru, pak centrální API také poskytuje jmenné prostory ``Unicast``. V tom případě bude odpověď jedinou hodnotou, nikoli mapou, jako byste volali přímo API {productname} Serveru.

source: Example Python Script for Manual Authentication:
cs: Příklad Python skriptu pro manuální ověřování:

source: HUB_XMLRPC_API_URL = "<HUB_XMLRPC_API_URL>" HUB_USERNAME = "<USERNAME>" HUB_PASSWORD = "<PASSWORD>"
cs: HUB_XMLRPC_API_URL = "<URL_centrálního_API_XMLRPC>" HUB_USERNAME = "<uživ._jméno>" HUB_PASSWORD = "<heslo>"

source: # Get the server IDs serverIds = client.hub.listServerIds(hubSessionKey)
cs: # Získat ID serverů serverIds = client.hub.listServerIds(hubSessionKey)

source: # For simplicity, this example assumes you are using the same username and password here, as on the hub server. # However, in most cases, every server has its own individual credentials. usernames = [HUB_USERNAME for s in serverIds] passwords = [HUB_PASSWORD for s in serverIds]
cs: # Pro jednoduchost tento příklad předpokládá, že zde používáte stejné uživatelské jméno a heslo, jako na centrálním serveru. # Zpravidla však má každý server svá přihlašovací pověření. usernames = [HUB_USERNAME for s in serverIds] passwords = [HUB_PASSWORD for s in serverIds]

source: # Each server uses the credentials set above, client.hub.attachToServers needs # them passed as lists with as many elements as there are servers. client.hub.attachToServers(hubSessionKey, serverIds, usernames, passwords)
cs: # Každý server používá výše nastavená pověření; client.hub.attachToServers # je potřebuje dostat jako seznamy s tolika položkami, kolik je serverů. client.hub.attachToServers(hubSessionKey, serverIds, usernames, passwords)

source: # Perform the operation systemsPerServer = client.multicast.system.list_systems(hubSessionKey, serverIds) successfulResponses = systemsPerServer["Successful"]["Responses"] failedResponses = systemsPerServer["Failed"]["Responses"]
cs: # Provedení operace systemsPerServer = client.multicast.system.list_systems(hubSessionKey, serverIds) successfulResponses = systemsPerServer["Successful"]["Responses"] failedResponses = systemsPerServer["Failed"]["Responses"]

source: #logout client.hub.logout(hubSessionKey)
cs: # odhlášení client.hub.logout(hubSessionKey)

source: Example: Relay Authentication
cs: Příklad: ověření relace

source: In relay authentication mode, the credentials used to sign in to the Hub API are also used to sign in into the APIs of the peripheral servers the user wants to work with. In this authentication mode, it is assumed that the same credentials are valid for every server, and that they correspond to a user with appropriate permissions.
cs: V režimu ověřování relace jsou pověření, použitá pro přihlášení k centrálnímu rozhraní API, používána také k přihlášení do AP rozhraní periferních serverů, s nimiž chce uživatel pracovat. V tomto režimu ověřování se předpokládá, že stejné pověření platí pro každý server, a že příslušejí uživateli s příslušnými oprávněními.

source: After signing in, you must call the ``attachToServers`` method. This method defines the servers to target in all subsequent calls.
cs: Po přihlášení musíte vyvolat metodu ``attachToServers`` Tato metoda definuje servery jako cíle všech následných volání.

source: A typical workflow for relay authentication is:
cs: Typický pracovní postup pro ověřování relace:

source: Credentials for the Hub are passed to the ``loginWithAuthRelayMode`` method, and a session key for the Hub is returned (``hubSessionKey``).
cs: Pověření pro centrum jsou předána metodě ``loginWithAuthRelayMode`` a je vrácen klíč relace pro centrum (``hubSessionKey``).

source: Using the session key from the previous step, {productname} Server IDs are obtained for all the peripheral servers attached to the Hub via the ``hub.listServerIds`` method
cs: Použitím klíče relace z předchozího kroku získá {productname} Server IDy pro všechny periferní servery připojené k centru pomocí metody ``hub.listServerIds``

source: A call to `attachToServers` is made, and the same credentials used to sign in to the Hub are passed to each server.
cs: Je vyvoláno `attachToServers` a pověření použitá pro přihlášení k centrále jsou předána každému serveru.

source: This is defined by ``serverIds``, which contains the IDs of the servers to target. In the background, ``system.list_system`` is called on each server's XMLRPC API.
cs: To je definováno v ``serverIds``, který obsahuje IDy cílových serverů. Na pozadí je volán ``system.list_system`` pro XMLRPC API každého serveru.

source: ``Failed``: list of responses for those peripheral servers the call failed.
cs: ``Failed``: Seznam odpovědí těch periferních serverů, kde volání selhalo.

source: Example Python Script for Relay Authentication:
cs: Příklad Python scriptu pro ověřování relace:

source: #Get the server IDs serverIds = client.hub.listServerIds(hubSessionKey)
cs: #Získání IDů serverů serverIds = client.hub.listServerIds(hubSessionKey)

source: #authenticate those servers(same credentials will be used as of hub to authenticate) client.hub.attachToServers(hubSessionKey, serverIds)
cs: # ověření u těchto serverů (k ověření se použijí tatáž pověření jako pro centrum / hub) client.hub.attachToServers(hubSessionKey, serverIds)

source: # perform the needed operation systemsPerServer = client.multicast.system.list_systems(hubSessionKey, serverIds) successfulResponses = systemsPerServer["Successful"]["Responses"] failedResponses = systemsPerServer["Failed"]["Responses"]
cs: # provede potřebné operace systemsPerServer = client.multicast.system.list_systems(hubSessionKey, serverIds) successfulResponses = systemsPerServer["Successful"]["Responses"] failedResponses = systemsPerServer["Failed"]["Responses"]

source: Example: Auto-Connect Authentication
cs: Příklad: Ověřování Auto-connect

source: Auto-connect mode is similar to relay mode, it uses the Hub credentials to sign in in to all peripheral servers. However, there is no need to use the ``attachToServers`` method, as auto-connect mode connects to all available peripheral servers. This occurs at the same time as you sign in to the Hub.
cs: Režim Auto-connect je podobný režimu relace, používá centrální pověření pro přihlášení ke všem periferním serverům. Není však třeba použít metodu ``attachToServers`` - auto-connect režim se připojuje ke všem dostupným periferním serverům současně s přihlášením k centru.

source: A typical workflow for auto-connect authentication is:
cs: Typický pracovní postup pro ověřování auto-connect je:

source: Credentials for the Hub are passed to the ``loginWithAutoconnectMode`` method, and a session key for the Hub is returned (``hubSessionKey``).
cs: Přihlašovací údaje pro centrum jsou předány metodě ``loginWithAutoconnectMode`` a ta vrátí klíč relace pro centrum (``hubSessionKey``).

source: Example Python Script for Auto-Connect Authentication:
cs: Příklad Python skriptu pro ověřování Auto-Connect:

source: loginResponse = client.hub.loginWithAutoconnectMode(HUB_USERNAME, HUB_PASSWORD) hubSessionKey = loginResponse["SessionKey"]
cs: loginResponse = client.hub.loginWithAutoconnectMode(HUB_USERNAME, HUB_PASSWORD) hubSessionKey = loginResponse["SessionKey"] # ["klíč relace"]

source: Hub Installation
cs: Instalace Centra

source: Before you begin, you need to install the ``hub-xmlrpc-api`` package, and configure the Hub Server to use the API.
cs: Než začnete, musíte instalovat balíček ``hub-xmlrpc-api`` a konfigurovat centrální server (hub) pro použití API.

source: Procedure: Installing and Configuring the Hub XMLRPC API
cs: Postup: Instalace a konfigurace centrálního rozhraní Hub XMLRPC API

source: On the Hub Server, or on a host that has access to all peripheral servers' XMLRPC APIs, install the ``hub-xmlrpc-api`` package.
cs: Na centrálním serveru (Hub) nebo na hostiteli, který má přístup ke XMLRPC API všech periferních serverů, nainstalujte balíček ``hub-xmlrpc-api``.

source: The package is available in the {productname} {productnumber} repositories.
cs: Balíček je v úložišti {ProductName} {ProductNumber}.

source: OPTIONAL: Set the Hub XMLRPC API service to start automatically at boot time, and start it immediately: ---
cs: Volitelné: Nastavte službu centra XMLRPC API na automatické spuštění při zavádění systému a spusťte ji okamžitě: ---

source: OPTIONAL: Check that these parameters in the [path]``/etc/hub/hub.conf`` configuration file are correct:
cs: Volitelné: Zkontrolujte, zda jsou správné tyto parametry v konfiguračním souboru [path]``/etc/hub/hub.conf``:

source: ``HUB_API_URL``: URL to the Hub Server XMLRPC API endpoint.
cs: ``HUB_API_URL``: URL na endpoint centrálního (Hub) serveru XMLRPC API.

source: Use the default value if you are installing `hub-xmlrpc-api` on the Hub Server.
cs: Instalujete-li `hub-xmlrpc-api` na centrální server, použijte výchozí hodnotu.

source: ``HUB_CONNECT_TIMEOUT``: the maximum number of seconds to wait for a response when connecting to a Server.
cs: ``HUB_CONNECT_TIMEOUT``: maximální počet sekund čekání na odpověď při připojení k serveru.

source: Use the default value in most cases.
cs: Ve většině případů použijete výchozí hodnotu.

source: ``HUB_REQUEST_TIMEOUT``: the maximum number of seconds to wait for a response when calling a Server method.
cs: ``HUB_REQUEST_TIMEOUT``: maximální počet sekund čekání na odpověď při volání metody serveru.

source: ``HUB_CONNECT_USING_SSL``: use HTTPS instead of HTTP for communicating with peripheral Servers.
cs: ``HUB_CONNECT_USING_SSL``: použít https místo http pro komunikaci s periferními servery.

source: Recommended for a secure environment.
cs: Doporučeno pro bezpečné prostředí.

source: Restart services to pick up configuration changes.
cs: Restartujte služby pro uplatnění změn konfigurace.

source: To use HTTPS to connect to peripheral Servers, you must set the ``HUB_CONNECT_USING_SSL`` parameter to ``true``, and ensure that the SSL certificates for all the peripheral Servers are installed on the machine where the ``hub-xmlrpc-api`` service runs. Do this by copying the ``RHN-ORG-TRUSTED-SSL-CERT`` certificate file from each peripheral Server's [path]``http://<server-url>/pub/`` directory to [path]``/etc/pki/trust/anchors/``, and run [command]``update-ca-certificates``.
cs: Chcete-li použít HTTPS pro připojení k periferním serverům, musíte nastavit parametr ``HUB_CONNECT_USING_SSL`` na ``true``, a zajistit, aby certifikáty SSL pro všechny periferní servery byly nainstalovány na stroji, kde běží služba ``hub-xmlrpc- api``. Uděláte to zkopírováním souboru certifikátu "RHN-ORG-TRUSTED-SSL-CERT" z adresáře [path]``http://<server-url>/pub/`` každého periferního serveru do [path]``/etc/pki/trust/anchors/`` a spuštěním [command]``update-ca-certificates``.

source: Hub XMLRPC API Namespaces
cs: Prostor názvů centrálního XMLRPC API

source: The Hub XMLRPC API operates in a similar way to the {productname} API. For {productname} API documentation, see https://documentation.suse.com/suma.
cs: Centrální XMLRPC API pracuje podobně jako {productname} API. Dokumentaci {productname} API viz https://documentation.suse.com/suma.

source: The Hub XMLRPC API exposes the same methods that are available from the server's XMLRPC API, with a few differences in parameter and return types. Additionally, the Hub XMLRPC API supports some Hub-specific end points which are not available in the {productname} API.
cs: Centrální XMLRPC API vystavuje stejné metody, jaké jsou dostupné u XMLRPC API serveru, s několika rozdíly v typech parametrů a návratů. Navíc podporuje některé koncové body specifické pro centrum, které nejsou dostupné v {productname} API.

source: The Hub XMLRPC API supports three different namespaces:
cs: Centrální XMLRPC API podporuje tři různé prostory názvů:

source: The ``hub`` namespace is used to target the Hub XMLRPC API Server.
cs: Obor názvů centra ``hub`` se používá pro API XMLRPC centrálního (hub) serveru.

source: It supports Hub-specific XMLRPC endpoints which are primarily related to authentication.
cs: Podporuje koncové (přípojné) body XMLRPC specifické pro centrální server (hub) primárně se týkající ověření.

source: The ``unicast`` namespace is used to target a single server registered in the hub.
cs: Obor názvů ``unicast`` se používá pro jednotlivé servery registrované v centru (hubu).

source: It redirects any call transparently to one specific server and returns any value as if the server's XMLRPC API endpoint was used directly.
cs: Transparentně přesměruje volání na určitý server a vrátí takovou hodnotu, jako by byl použit přímo koncový bod XMLRPC API toho serveru.

source: The ``multicast`` namespace is used to target multiple peripheral servers registered in the hub.
cs: Pole ``multicast`` se používá k zacílení více periferních serverů registrovaných v centrálním hubu.

source: It redirects any call transparently to all the specified servers and returns the results in the form of a ``map``.
cs: Přesměruje volání transparentně na všechny zadané servery a vrátí výsledek formou ``map``.
