Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/large-deployments/*.po
Languages: cs

source: If you do not specify a namespace, all calls are transparently redirected to the underlying {productname} Server XMLRPC API of the Hub Server.
cs: Nezadáte-li obor názvů, všechna volání jsou transparentně přesměrována na XMLRPC API centrálního (hub) serveru základního {productname} Serveru.

source: This allows you to call all available methods on the {productname} Server XMLRPC API.
cs: To vám umožní volat všechny metody dostupné na rozhraní API XMLRPC {productname} Serveru.

source: Methods called without specifying any of the above namespaces will be forwarded to the normal XMLRPC API of the hub. This is the API exposed on ports 80 and 443.
cs: Metody volané bez určení některého z výše uvedených oborů názvů budou předány normálnímu XMLRPC API centra (hubu). Takové je API vystavené na portech 80 a 443.

source: Some important considerations for hub namespaces:
cs: Některé důležité vlastnosti názvových prostorů centra (hubu):

source: Individual server IDs can be obtained using ``client.hub.listServerIds(hubSessionKey)``.
cs: IDy jednotlivých serverů lze získat použitím ``client.hub.listServerIds(hubSessionKey)``.

source: The ``unicast`` namespace assumes all methods receive ``hubSessionKey`` and serverID as their first two parameters, then any other parameter as specified by the regular Server API.
cs: Obor názvů ``unicast`` předpokládá, že všechny metody obdrží ``hubSessionKey`` a serverID jako první dva parametry, pak teprve další parametry specifikované normálním API serveru.

source: client.unicast.[namespace].[methodName](hubSessionKey, serverId, param1, param2)
cs: client.unicast.[oborNázvů].[názevMetody](hubSessionKey, serverId, parametr1, parametr2)

source: The ``hubSessionKey`` can be obtained using different authentication methods.
cs: ``hubSessionKey`` lze získat použitím odlišných metod ověření.

source: For more information, see xref:large-deployments:hub-auth.adoc[].
cs: Další údaje viz xref:large-deployments:hub-auth.adoc[].

source: The ``multicast`` namespace assumes all methods receive ``hubSessionKey``, a list of ``ServerID`` values, then lists of per-server parameters as specified by the regular server XMLRPC API.
cs: Obor názvů ``multicast`` předpokládá, že všechny metody obdrží ``hubSessionKey``, seznam hodnot ``ServerID`` a pak postupně seznamy parametrů serverů, jak jsou specifikovány normálním API XMLRPC každého serveru.

source: The return value is a ``map``, with ``Successful`` and ``Failed`` entries for each server involved in the call.
cs: Návratová hodnota je mapa (``map``) s položkami ``Successful`` (úspěch) a ``Failed`` (neúspěch) pro každý volaný server.

source: client.multicast.[namespace].[methodname](hubSessionKey, [serverId1, serverId2], [param1_s1, param1_s2], [param2_s1, param2_s2])
cs: client.multicast.[oborNázvů].[názevMetody](hubSessionKey, [serverId1, serverId2], [parametr1_s1, parametr1_s2], [parametr2_s1, parametr2_s2])

source: Hub Requirements
cs: Požadavky na centrální server (hub)

source: To set up a Hub installation, you require:
cs: Pro instalaci centrálního serveru potřebujete:

source: One central {productname} Server, which acts as the Hub Server.
cs: Jeden centrální {productname} Server, který bude fungovat jako hub server.

source: One or more additional {productname} Servers, registered to the Hub as Salt clients.
cs: Jeden nebo více dalších {productname} Serverů registrovaných v centru (hubu) jako klienty Salt.

source: This document refers to these as peripheral servers.
cs: V tomto dokumentu se nazývají periferní servery.

source: Any number of clients registered to the peripheral servers.
cs: Potřebný počet klientů registrovaných u periferních serverů.

source: Ensure the Hub Server and all peripheral servers are running {productname}{nbsp}4.1 or higher.
cs: Zajistěte {productname}{nbsp} verze 4.1 nebo vyšší jak pro centrální, tak pro periferní servery.

source: The Hub Server must not have clients registered to it. Clients should only be registered to the peripheral servers.
cs: Centrální server (hub) nesmí mít zaregistrované klienty. Klienty by měli být registrovány pouze na periferní servery.

source: Peripheral Servers
cs: Periferní servery

source: Peripheral servers must be registered to the Hub Server as Salt clients. When you register the peripheral servers, assign them the appropriate ``SUSE Manager Server`` software channel as their base channel. Additionally, they must be registered to the Hub Server directly, do not use a proxy.
cs: Periferní servery musí být registrovány do centrálního serveru jako klienty Salt. Při registraci periferních serverů je přiřaďte příslušnému softwarovému kanálu ``SUSE Manager Server`` jako jejich základnímu kanálu. Kromě toho musí být registrovány přímo u centrálního serveru bez použití proxy.

source: For more information about registering clients, see xref:client-configuration:registration-webui.adoc[].
cs: Další informace o registrování klientů viz xref:client-configuration:registration-webui.adoc[].

source: You need credentials to access the XMLRPC APIs on each server, including the Hub Server.
cs: Potřebujete pověření pro přístup k rozhraní API XMLRPC na každém serveru včetně centrálního.

source: Large Deployments Guide Overview
cs: Přehled průvodce rozsáhlých instalací

source: **Updated:** {docdate}
cs: **Aktualizováno:** {docdate}

source: {productname} is designed by default to work on small and medium scale installations. For installations with more than 1000 clients per {productname} Server, adequate hardware sizing and parameter tuning must be performed.
cs: {productname} je navržen ve výchozím nastavení tak, aby pracoval na instalacích malého a středního rozsahu. Pro instalace s více než 1000 klienty na {productname} Server musí být provedeno odpovídající dimenzování hardwaru a úprava parametrů.

source: There is no hard maximum number of supported systems. Many factors can affect how many clients can reliably be used in a particular installation. Factors can include which features are used, and how the hardware and systems are configured.
cs: Pevný maximální počet podporovaných systémů neexistuje. Mnohé faktory mohou ovlivnit, kolik klientů lze spolehlivě použít v určité instalaci, které funkce se používají a jak jsou konfigurovány hardwary a systémy.

source: Large installations require standard Salt clients. These instructions cannot be used in environments using traditional clients or Salt SSH minions.
cs: Rozsáhlé instalace vyžadují standardní klienty Salt. Tento návod nelze použít v prostředích, kde se používají tradiční klienty nebo následníci Salt SSH.

source: There are two main ways to manage large scale deployments. You can manage them with a single {productname} Server, or you can use multiple servers in a hub. Both methods are described in this book.
cs: Existují dva hlavní způsoby, jak spravovat rozsáhlé nasazení velkého měřítka. Můžete je spravovat jediným {productname} Serverem nebo můžete použít více serverů v centru (hubu). Obě metody jsou popsány v této knize.

source: Additionally, if you are operating within a Retail environment, you can use {productname} {smr} to manage large deployments of point-of-service terminals. There is an introduction to {productname} {smr} in this book.
cs: Kromě toho, pokud pracujete v rámci maloobchodního prostředí, můžete použít {productname} {smr} řídit rozsáhlé nasazení terminálů point-of-service (místa obsluhy). V této knize je uveden úvod do {productname} {smr}.

source: Tuning and monitoring large scale deployments can differ from smaller installations. This book contains guidance for both tuning and monitoring within larger installations.
cs: Ladění a monitorování se mohou lišit u rozsáhlých nasazení a u menších instalací. Tato kniha obsahuje pokyny pro ladění i monitorování ve rozsáhlejších instalacích.

source: Monitoring Large Scale Deployments
cs: Monitorování rozsáhlých instalací

source: You can monitor your {productname} environment using Prometheus and Grafana. {productname} Server and Proxy are able to provide self-health metrics. You can also install and manage a number of Prometheus exporters on Salt clients.
cs: Můžete sledovat prostředí {productname} systémy Prometheus a Grafana. {productname} Server a Proxy jsou schopné poskytovat měření správnosti vlastní funkce. Můžete také nainstalovat a spravovat řadu exportérů Prometheus na klienty Salt.

source: {sle}{nbsp}12, {sle}{nbsp}15, {centos}{nbsp} 6, {centos}{nbsp} 7, {centos}{nbsp} 8 and openSUSE 15.x.
cs: {sle}{nbsp}12, {sle}{nbsp}15, {centos}{nbsp} 6, {centos}{nbsp} 7, {centos}{nbsp} 8 a openSUSE 15.x.

source: You need to install Prometheus and Grafana on a machine separate from the {productname} Server. We recommend you use a managed Salt client as your monitoring server.
cs: Je třeba instalovat systémy Prometheus a Grafana na stroji odděleném od {productname} Serveru. Doporučujeme používat spravovaný klient Salt jako monitorovací server.

source: For more information on monitoring, see xref:administration:monitoring.adoc[].
cs: Další informace o monitorování viz xref:administration:monitoring.adoc[].

source: Using Multiple Servers to Manage Large Scale Deployments
cs: Použití vícera serverů pro správu rozsáhlých instalací

source: If you need to manage a large number of clients, in most cases you can do so with a single {productname} Server, tuned appropriately. However, if you need to manage tens of thousands of clients, you might find it easier to use multiple {productname} Servers, in a hub, to manage them.
cs: Pokud potřebujete spravovat velký počet klientů, ve většině případů k tomu postačí jeden vhodně naladěný {productname} Server. Pokud však potřebujete spravovat desítky tisíc klientů, můžete to usnadnit používáním více {productname} Serverů spojených do centra (hubu) k jejich správě.

source: {productname} Hub helps you manage very large deployments. The typical Hub topology looks like this:
cs: {productname} centrum (hub) pomáhá spravovat velmi rozsáhlou instalaci. Typická topologie centra vypadá takto:

source: Operation Recommendations
cs: Doporučení k provozu

source: This section contains a range of recommendations for large scale deployments.
cs: Tato sekce obsahuje řadu doporučení pro rozsáhlé instalace.

source: Always start small and scale up gradually. Monitor the server as you scale to identify problems early.
cs: Vždy začněte v malém a postupně přidávejte. Sledujte přitom server, abyste brzy zjistili možné problémy.

source: Salt Client Onboarding Rate
cs: Rychlost přidávání klientů Salt

source: The rate at which {productname} can onboard clients is limited and depends on hardware resources. Onboarding clients at a faster rate than {productname} is configured for will build up a backlog of unprocessed keys. This slows down the process and can potentially exhaust resources. We recommend that you limit the acceptance key rate programmatically. A safe starting point would be to onboard a client every 15 seconds. You can do that with this command:
cs: Rychlost, jíž může {productname} přibírat klienty, je omezena a závisí na hardwarových prostředcích. Rychlejší přidávání klientů než je {productname} nakonfigurován, vytvoří záznam nezpracovaných klíčů. To zpomaluje proces a může i vyčerpat zdroje. Doporučujeme omezit rychlost tvorby akceptačního klíče programově. Bezpečný výchozí bod by byl přibrat klienta každých 15 sekund. Můžete toho dosáhnout tímto příkazem:

source: Salt Clients and the RNG
cs: Klienty Salt a RNG

source: All communication to and from Salt clients is encrypted. During client onboarding, Salt uses asymmetric cryptography, which requires available entropy from the Random Number Generator (RNG) facility in the kernel. If sufficient entropy is not available from the RNG, it will significantly slow down communications. This is especially true in virtualized environments. Ensure enough entropy is present, or change the virtualization host options.
cs: Všechna komunikace do a z klientů Salt je šifrována. Během přibírání klienta používá Salt asymetrickou kryptografii, která vyžaduje dostupnou entropii z generátoru náhodných čísel (RNG) v jádru. Není-li z RNG dostupná dostatečná entropie, výrazně to zpomalí komunikaci. To platí zejména ve virtualizovaných prostředích. Zajistěte dostatek entropie, nebo změňte možnosti hostitele virtualizace.

source: You can check the amount of available entropy with the [command]``cat /proc/sys/kernel/random/entropy_avail``. It should never be below 100-200.
cs: Můžete zkontrolovat množství dostupné entropie příkazem [command]``cat /proc/sys/kernel/random/entropy_avail``. Nemělo by klesnout pod 100-200.

source: Clients Running with Unaccepted Salt Keys
cs: Klienty běžící s neakceptovanými klíči Salt

source: Idle clients which have not been onboarded, that is clients running with unaccepted Salt keys, consume more resources than idle clients that have been onboarded. Generally, this consumes about an extra 2.5 Kb/s of inbound network bandwidth per client. For example, 1000 idle clients will consume about 2.5 Mb/s extra. This consumption will reduce almost to zero when onboarding has been completed for all clients. Limit the number of non-onboarded clients for optimal performance.
cs: Nečinné klienty, které nebyly připojeny, tj. klienty běžící s neakceptovanými klíči Salt, spotřebovávají více zdrojů než nečinné klienty, které byly připojeny. Obecně platí, že se tím spotřebuje přibližně 2,5 kb/s příchozí šířky pásma sítě na klienta. Například 1000 nečinných klientů spotřebovává přibližně 2,5 Mb/s navíc. Tato spotřeba se sníží téměř na nulu, když bylo připojení všech klientů dokončeno. Pro optimální výkon omezte počet nepřipojených klientů.

source: Disabling the Salt Mine
cs: Deaktivace Salt Mine

source: In older versions, {productname} used a tool called Salt mine to check client availability. The Salt mine would cause clients to contact the server every hour, which created significant load. With the introduction of a more efficient mechanism in {productname}{nbsp}3.2, the Salt mine is no longer required. Instead, the {productname} Server uses Taskomatic to ping only the clients that appear to have been offline for twelve hours or more, with all clients being contacted at least once in every twenty four hour period by default. You can adjust this by changing the [systemitem]``web.system_checkin_threshold`` parameter in [path]``rhn.conf``. The value is expressed in days, and the default value is [literal]``1``.
cs: Ve starších verzích používal {productname} nástroj nazývaný Salt Mine ke kontrole dostupnosti klienta. Salt Mine nutil klienty kontaktovat server každou hodinu, což vytvořilo výrazné zatížení. Se zavedením efektivnějšího mechanismu v {productname}{nbsp}3.2 již není nástroj Salt Mine potřebný. Místo toho používá {productname} Server Taskomatic k pingu pouze těch klientů, které se jeví offline dvanáct hodin nebo více; ve výchozím nastavení jsou všechny klienty kontaktovány alespoň jednou za dvacet čtyři hodin. To můžete upravit změnou parametru [systemitem]``web.system_checkin_threshold``v souboru [path]``rhn.conf``. Hodnota je zadána ve dnech, výchozí hodnota je [literal]``1``.

source: Newly registered Salt clients will have the Salt mine disabled by default. If the Salt mine is running on your system, you can reduce load by disabling it. This is especially effective if you have a large number of clients.
cs: Nově registrované klienty Salt budou mít Salt Mine standardně vypnutý. Běží-li na Vašem systému Salt Mine, můžete snížit zátěž systému jeho vypnutím. Je to zvláště účinné při mnoha klientech.

source: Disable the Salt mine by running this command on the server:
cs: Salt Mine vypnete na serveru tímto příkazem:

source: This will restart the clients and generate some Salt events to be processed by the server. If you have a large number of clients, handling these events could create excessive load. To avoid this, you can execute the command in batch mode with this command:
cs: Tím se restartují klienty a generují se některé události Salt, které mají být zpracovány serverem. Pokud máte velký počet klientů, manipulace s těmito událostmi by mohly vytvořit nadměrné zatížení. Chcete-li se tomu vyhnout, můžete provést příkaz v dávkovém režimu:

source: You will need to wait for this command to finish executing. Do not end the process with kbd:[Ctrl+C].
cs: Budete muset počkat, než se tento příkaz dokončí. Neukončujte proces klávesovou kombinací kbd:[Ctrl+C].

source: Disable Unnecessary Taskomatic jobs
cs: Vypnout nepotřebné úkoly Taskomatic

source: To minimize wasted resources, you can disable non-essential or unused Taskomatic jobs.
cs: Pro minimalizaci plýtvání prostředky můžete vypnout podružné či neužívané úkoly Taskomatic.

source: You can see the list of Taskomatic jobs in the {productname} {webui}, at menu:Admin[Task Schedules].
cs: Seznam úloh Taskomatic můžete vidět v {productname} {webui}, v menu:Admin[Task Schedules].

source: To disable a job, click the name of the job you want to disable, select [guimenu]``Disable Schedule``, and click btn:[Update Schedule].
cs: Úkol vypnete kliknutím jeho názvu a volbou [guimenu]``Disable Schedule`` (vypnout plán), a pak tlačítkem btn:[Update Schedule] (aktualizovat plán).

source: To delete a job, click the name of the job you want to delete, and click btn:[Delete Schedule].
cs: Úkol zrušíte kliknutím jeho názvu a pak tlačítkem btn:[Delete Schedule] (smazat plán).

source: We recommend disabling these jobs:
cs: Doporučujeme vypnout tyto úkoly:

source: Daily comparison of configuration files: [systemitem]``compare-configs-default``
cs: Každodenní srovnání konfiguračních souborů: [systemitem]``compare-configs-default``

source: Hourly synchronization of Cobbler files: [systemitem]``cobbler-sync-default``
cs: Synchronizace souborů Cobbler každou hodinu: [systemitem]``cobbler-sync-default``

source: Daily gatherer and subscription matcher: [systemitem]``gatherer-matcher-default``
cs: Každodenní získání a porovnání předplatných: [systemitem]``gatherer-matcher-default``

source: Do not attempt to disable any other jobs, as it could prevent {productname} from functioning correctly.
cs: Nezkoušejte vypínat jiné úkoly, neboť by pak {productname} nemusel fungovat správně.

source: Swap and Monitoring
cs: Přepnutí a monitorování

source: It is especially important in large scale deployments that you keep your {productname} Server constantly monitored and backed up.
cs: V rozsáhlých instalacích je obzvlášť důležité udržovat {productname} Server neustále monitorovaný a zálohovaný.

source: Swap space use can have significant impacts on performance. If significant non-transient swap usage is detected, you can increase the available hardware RAM.
cs: Použití odkládacího prostoru může mít významné dopady na výkon. Je-li zjištěno významné a ne jen dočasné použití odkládacího prostoru, můžete zvýšit dostupnou paměť RAM v hardwaru.

source: You can also consider tuning the Server to consume less memory. For more information on tuning, see xref:salt:large-scale-tuning.adoc[].
cs: Můžete také zvážit nastavení serveru na menší spotřebu paměti. Více o vyladění serveru viz xref:salt:large-scale-tuning.adoc[].

source: AES Key Rotation
cs: Rotace klíče AES

source: Communications from the Salt Master to clients is encrypted with a single AES key. The key is rotated when:
cs: Komunikace z hlavního centra Salt ke klientům je šifrována jediným klíčem AES. Klíč rotuje, když:

source: The ``salt-master`` process is restarted, or
cs: Proces ``salt-master`` je restartován, nebo

source: Any minion key is deleted (for example, when a client is deleted from {productname})
cs: je smazán kterýkoli sledující klíč (například když je klient {productname} odstraněn)

source: After the AES key has been rotated, all clients must re-authenticate to the master. By default, this happens next time a client receives a message. If you have a large number of clients (several thousands), this can cause a high CPU load on the {productname} Server. If the CPU load is excessive, we recommend that you delete keys in batches, and in off-peak hours if possible, to avoid overloading the server.
cs: Po rotaci klíče AES musí všichni klienti znovu ověřovat u hlavního serveru (masteru). Ve výchozím nastavení se to stane, až klient obdrží příští zprávu. Pokud máte velký počet klientů (několik tisíc), může to způsobit vysokou zátěž CPU na {productname} serveru. Pokud je zatížení CPU nadměrné, doporučujeme odstranit klíče dávkově v době, kdy je slabý provoz, aby se zabránilo přetížení serveru.

source: For more information, see:
cs: Další informace viz:

source: Managing Large Scale Deployments in a Retail Environment
cs: Správa rozsáhlých instalací v maloobchodním prostředí

source: {productname} {smr} {productnumber} is an open source infrastructure management solution, optimized and tailored specifically for the retail industry. It uses the same technology as {susemgr}, but is customized to address the needs of retail organizations.
cs: {productname} {smr} {productnumber} je řešení pro správu infrastruktury open source optimalizované a přizpůsobené speciálně pro maloobchodní průmysl [kusovou výrobu]. Využívá stejnou technologii jako {susemgr}, ale je přizpůsobeno potřebám maloobchodních organizací.

source: {productname} {smr} is designed for use in retail situations where customers can use point-of-service terminals to purchase or exchange goods, take part in promotions, or collect loyalty points. In addition to retail installations, it can also be used for novel purposes, such as maintaining student computers in an educational environment, or self-service kiosks in banks or hospitals.
cs: {productname} {smr} je určen pro použití v maloobchodních prostředích, kde zákazníci mohou používat obslužné terminály k nákupu nebo výměně zboží, zúčastnit se propagačních akcí nebo sbírat věrnostní body. Kromě maloobchodních instalací může být také použit pro mimořádné úkoly, jako je údržba studentských počítačů ve vzdělávacím prostředí, nebo samoobslužné kiosky např. v bankách či nemocnicích.

source: {productname} {smr} is intended for use in installations that include servers, workstations, point-of-service terminals, and other devices. It allows administrators to install, configure, and update the software on their servers, and manage the deployment and provisioning of point-of-service machines.
cs: {ProductName} {SMR} je určen pro použití v instalacích, které obsahují servery, pracovní stanice, terminály point-of-service a další zařízení. Umožňuje správcům instalovat, konfigurovat a aktualizovat software na jejich serverech a spravovat nasazování a vybavování strojů point-of-servis.

source: Point-of-Service (POS) terminals can come in many different formats, such as point-of-sale terminals, kiosks, digital scales, self-service systems, and reverse-vending systems. Every terminal, however, is provided by a vendor, who set basic information about the device in the firmware. {productname} {smr} accesses this vendor information to determine how best to work with the terminal in use.
cs: Může přijít mnoho různých typů terminálů Point-of-Service (POS), jako jsou pokladní terminály (Point-of-Sale), kiosky, digitální váhy, samoobslužné systémy a systémy reverzního prodeje. Každý terminál je však poskytován dodavatelem, který uvede základní informace o zařízení ve firmwaru. {productname} {smr} přistoupí k těmto informacím prodejce pro určení, jak v provozu nejlépe pracovat terminálem.
