Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/large-deployments/*.po
Languages: cs

source: | Description | The maximum number of allowed client connections that have started but not concluded the opening process. If more than this number of clients connects in a very short time frame, connections are dropped and clients experience a delay re-connecting. | Tune when | xref:client-count[Client count] increases significantly and very many clients reconnect in a short time frame, TCP connections to the `salt-master` process get dropped by the kernel. | Value default | 1000 | Value recommendation | 1000-5000 | Location | [path]``/etc/salt/master.d/tuning.conf`` | Example | `zmq_backlog: 2000` | More information | https://docs.saltstack.com/en/latest/ref/configuration/master.html#zmq-backlog, http://api.zeromq.org/3-0:zmq-getsockopt (`ZMQ_BACKLOG`)
cs: | Popis | Maximální počet povolených připojení klienta, která byla zahájena, ale nedokončila proces otevírání. Pokud se více než tento počet klientů připojí ve velmi krátkém časovém rámci, připojení se zruší a klienti se připojí znovu se zpožděním. | Vylaďte, když | xref: client-count [Client count] významně vzroste a velmi mnoho klientů se znovu připojí v krátkém časovém rámci, takže jádro zruší TCP spojení s procesem `salt-master`. | Výchozí hodnota | 1000 | Doporučená hodnota | 1000-5000 | Poloha | [path]``/etc/salt/master.d/tuning.conf`` | Příklad | `zmq_backlog: 2000` | Více informací | https://docs.saltstack.com/en/latest/ref/configuration/master.html#zmq-backlog, http://api.zeromq.org/3-0:zmq-getsockopt (`ZMQ_BACKLOG`)

source: Memory Usage
cs: Využití paměti

source: Adjusting some of the parameters listed in this section can result in a higher amount of RAM being used by various components. It is important that the amount of hardware RAM is adequate after any significant change.
cs: Nastavení některých parametrů uvedených v této sekci může mít za následek, že různé složky využívají více paměti RAM. Je důležité, aby hardwarová RAM byla dostatečná i po jakékoli významné změně.

source: To determine how RAM is being used, you will need to check each process that consumes it.
cs: Chcete-li zjistit, jak se RAM používá, budete muset zkontrolovat každý proces, který ji potřebuje.

source: Operating system
cs: Operační systém

source: Stop all {productname} services and inspect the output of [command]``free -h``.
cs: Zastavte všechny služby {productname} a zkontrolujte výstup [command]``free -h``.

source: Java-based components
cs: Složky založené na Java

source: This includes Taskomatic, Tomcat, and `rhn-search`. These services support a configurable memory cap.
cs: Jsou to zvláště Taskomatic, Tomcat a `rhn-search`. Těmto službám lze konfigurovat limit paměti.

source: The {productname} Server
cs: {productname} Server

source: Depends on many factors and can only be estimated. Measure PostgreSQL reserved memory by checking xref:shared-buffers[`shared_buffers`], permanently. You can also multiply xref:work-mem[`work_mem`] and xref:max-connections[`max_connections`], and multiply by three for a worst case estimate of per-query RAM. You will also need to check the operating system buffers and caches, which are used by PostgreSQL to host copies of database data. These often automatically occupy any available RAM.
cs: Závisí na mnoha faktorech a lze jej pouze odhadnout. Změřte vyhrazenou paměť PostgreSQL kontrolou xref:shared-buffers[`shared_buffers`], trvale. Můžete také vynásobit xref:work-mem[`work_mem`] a xref:max-connections[` max_connections`] a vynásobit třemi pro nejhorší odhad potřeby RAM pro dotaz. Budete také muset zkontrolovat vyrovnávací paměti a mezipaměti operačního systému, které používá PostgreSQL k hostování kopií databázových dat. Ty často automaticky zabírají jakoukoli dostupnou RAM.

source: It is important that the {productname} Server has sufficient RAM to accommodate all of these processes, especially OS buffers and caches, to have reasonable PostgreSQL performance. We recommend you keep several gigabytes available at all times, and add more as the database size on disk increases.
cs: Je důležité, aby {productname} Server měl dostatek paměti RAM pro všechny tyto procesy, zejména vyrovnávací paměti OS a mezipaměti, aby měl PostgreSQL přiměřený výkon. Doporučujeme vám mít neustále k dispozici několik gigabajtů a přidávat další, jak se zvětšuje velikost databáze na disku.

source: Whenever the expected amount of memory available for OS buffers and caches changes, update the `effective_cache_size` parameter to have PostgreSQL use it correctly. You can calculate the total available by finding the total RAM available, less the expected memory usage.
cs: Kdykoli se změní očekávané množství paměti dostupné pro vyrovnávací paměti a mezipaměti OS, aktualizujte parametr `effective_cache_size`, aby jej PostgreSQL správně používal. Celkovou dostupnou velikost můžete vypočítat zjištěním celkové dostupné paměti RAM, snížené o očekávané využití paměti.

source: To get a live breakdown of the memory used by services on the {productname} Server, use this command:
cs: Chcete-li získat aktuální rozdělení paměti využívané službami na {productname} Serveru, použijte tento příkaz:

source: This command will save a copy of displayed data in the `pidstat-memory.log` file for later analysis.
cs: Tento příkaz uloží kopii zobrazených dat do souboru `pidstat-memory.log` pro pozdější analýzu.
