Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/large-deployments/*.po
Languages: cs

source: | Description | Whenever content is changed in a software channel, its metadata needs to be recomputed before clients can use it. Channel-altering operations include the addition of a patch, the removal of a package or a repository synchronization run. This parameter specifies the maximum number of Taskomatic threads that {productname} will use to recompute the channel metadata. Channel metadata computation is both CPU-bound and memory-heavy, so raising this parameter and operating on many channels simultaneously could cause Taskomatic to consume significant resources, but channels will be available to clients sooner. | Tune when | xref:channel-count[Channel count] increases significantly (more than 50), or more concurrent operations on channels are expected. | Value default | 2 | Value recommendation | 2-10 | Location | [path]``/etc/rhn/rhn.conf`` | Example | `java.taskomatic_channel_repodata_workers = 4` | After changing | Check xref:taskomatic-java-maxmemory[`taskomatic.java.maxmemory`] for adjustment, as every new thread will consume memory | More information | `man rhn.conf`
cs: | Popis | Kdykoli je obsah v softwarovém kanálu změněn, musí být přepočítána jeho metadata dříve, než je klienti mohou použít. Operace měnící kanály zahrnují přidání záplaty, odstranění balíčku nebo spuštění synchronizace úložiště. Tento parametr určuje maximální počet vláken Taskomatic, která bude {ProductName} používat k přepočtení metadat kanálu. Výpočet metadat kanálů závisí na CPUa je také náročný na paměť, takže tento parametr a současný provoz na mnoha kanálech může způsobit, že Taskomatic konzumuje značné množství zdrojů, ale kanály budou k dispozici klientům dříve. | Vyladit, když | xref:channel-count[Channel count] se výrazně zvýší (o více než 50) nebo se očekává více souběžných operací na kanálech. | Výchozí hodnota | 2. | Doporučená hodnota | 2-10. | Umístění | [path]``/etc/rhn/rhn.conf`` | Příklad | `java.taskomatic_channel_repodata_workers = 4` | Po změně | Zkontrolujte xref:taskomatic-java-maxmemory[`taskomatic.java.maxmemory`] pro úpravu, protože každé nové vlákno bude spotřebovávat paměť | Více informací | `man rhn.conf`

source: | Description | The maximum amount of memory Taskomatic can use. Generation of metadata, especially for some OSs, can be memory-intensive, so this parameter might need raising depending on the managed xref:os-mix[OS mix]. | Tune when | xref:java-taskomatic-channel-repodata-workers[`java.taskomatic_channel_repodata_workers`] increases, OSs are added to {productname} (particularly {rhel} or {ubuntu}), or `OutOfMemoryException` errors appear in `/var/log/rhn/rhn_taskomatic_daemon.log`. | Value default | 4096 MiB | Value recommendation | 4096-16384 MiB | Location | [path]``/etc/rhn/rhn.conf`` | Example | `taskomatic.java.maxmemory = 8192` | After changing | Check xref:memory-usage[memory usage]. | More information | `man rhn.conf`
cs: | Popis | Maximální množství paměti, které může Taskomatic použít. Generování metadat, zejména pro některé OS, může být náročné na paměť, takže tento parametr může vyžadovat zvýšení v závislosti na spravovaném xref:os-mix[OS mix]. | Vyladit, když | se zvýší xref:java-taskomatic-channel-repodata-workers[`java.taskomatic_channel_repodata_workers`], do {ProductName} jsou přidány OS (zejména {RHEL} nebo {Ubuntu}) nebo se ve `/var/log/rhn/rhn_taskomatic_daemon.log`zobrazí chyby ` outofmemoryException` . | Výchozí hodnota | 4096 MB. | Doporučená hodnota | 4096-16384 MB. | Umístění | [path]``/etc/rhn/rhn.conf`` | Příklad | `taskomatic.java.maxmemory = 8192` | Po změně | Zkontrolujte xref:memory-usage[memory usage]. | Více informací | `man rhn.conf`

source: | Description | The number of Taskomatic worker threads. Increasing this value allows Taskomatic to serve more clients in parallel. | Tune when | xref:client-count[Client count] increases significantly | Value default | 20 | Value recommendation | 20-200 | Location | [path]``/etc/rhn/rhn.conf`` | Example | `org.quartz.threadPool.threadCount = 100` | After changing | Check xref:hibernate-c3p0-max-size[`hibernate.c3p0.max_size`] and xref:thread-pool[`thread_pool`] for adjustment | More information | http://www.quartz-scheduler.org/documentation/2.4.0-SNAPSHOT/configuration.html
cs: | Popis | Počet pracovních podprocesů Taskomatic. Zvýšení této hodnoty umožňuje, aby Taskomatic obsloužil více klientů paralelně. | Vyladit, když | xref:client-count[Client count] increases significantly | Výchozí hodnota | 20. | Doporučená hodnota | 20-200. | Umístění | [path]``/etc/rhn/rhn.conf`` | Příklad | `org.quartz.threadPool.threadCount = 100 ' | Po změně | Zkontrolujte nastavení xref:hibernate-c3p0-max-size[`hibernate.c3p0.max_size`] a xref:thread-pool[`thread_pool`] | Více informací | http://www.quartz-scheduler.org/documentation/2.4.0-SNAPSHOT/configuration.html

source: | Description | Cycle time for Taskomatic. Decreasing this value lowers the latency of Taskomatic. | Tune when | xref:client-count[Client count] is in the thousands. | Value default | 5000 ms | Value recommendation | 1000-5000 ms | Location | [path]``/etc/rhn/rhn.conf`` | Example | `org.quartz.scheduler.idleWaitTime = 1000` | More information | http://www.quartz-scheduler.org/documentation/2.4.0-SNAPSHOT/configuration.html
cs: | Popis | Doba cyklu pro Taskomatic. Snížení této hodnoty snižuje latenci Taskomatic. | Vyladit, když | xref:client-count[Client count] je v tisících. | Výchozí hodnota | 5000 ms. | Doporučená hodnota | 1000-5000 ms. | Umístění | [path]``/etc/rhn/rhn.conf`` | Příklad | `org.quartz.scheduler.idleWaitTime = 1000 ' | Více informací | http://www.quartz-scheduler.org/documentation/2.4.0-SNAPSHOT/configuration.html.

source: | Description | Number of Taskomatic threads dedicated to sending commands to Salt clients as a result of actions being executed. | Tune when | xref:client-count[Client count] is in the thousands. | Value default | 1 | Value recommendation | 1-10 | Location | [path]``/etc/rhn/rhn.conf`` | Example | `taskomatic.com.redhat.rhn.taskomatic.task.MinionActionExecutor.parallel_threads = 10`
cs: | Popis | Počet vláken Taskomatic určených pro odesílání příkazů do klientů Salt jako výsledku prováděných akcí. | Vyladit, když | xref:client-count[Client count] je v tisících. | Výchozí hodnota | 1. | Doporučená hodnota | 1-10. | Umístění | [path]``/etc/rhn/rhn.conf`` | Příklad | `taskomatic.com.redhat.rhn.taskomatic.task.MinionActionExececutor.parallel_threads = 10`

source: | Description | Number of Taskomatic threads dedicated to sending commands to Salt SSH clients as a result of actions being executed. | Tune when | xref:client-count[Client count] is in the hundreds. | Value default | 20 | Value recommendation | 20-100 | Location | [path]``/etc/rhn/rhn.conf`` | Example | `taskomatic.com.redhat.rhn.taskomatic.task.SSHMinionActionExecutor.parallel_threads = 40`
cs: | Popis | Počet vlákenTaskomatic určených pro odesílání příkazů klientům Salt SSH jako výsledku prováděných akcí. | Vyladit, když | xref:client-count[Client count] je ve stovkách. | Výchozí hodnota | 20. | Doporučená hodnota | 20-100. | Umístění | [path]``/etc/rhn/rhn.conf`` | Příklad | `taskomatic.com.redhat.rhn.taskomatic.task.SSHMinionActionExecutor.parallel_threads = 40`

source: | Description | Maximum number of PostgreSQL connections simultaneously available to both Tomcat and Taskomatic. If any of those components requires more concurrent connections, their requests will be queued. | Tune when | xref:java-message-queue-thread-pool-size[`java.message_queue_thread_pool_size`] or xref:max-threads[`maxThreads`] increase significantly, or when xref:org-quartz-threadPool-threadCount[`org.quartz.threadPool.threadCount`] has changed significantly. Each thread consumes one connection in Taskomatic and Tomcat, having more threads than connections might result in starving. | Value default | 20 | Value recommendation | 100 to 200, higher than the maximum of xref:java-message-queue-thread-pool-size[`java.message_queue_thread_pool_size`] + xref:max-threads[`maxThreads`] and xref:org-quartz-threadPool-threadCount[`org.quartz.threadPool.threadCount`] | Location | [path]``/etc/rhn/rhn.conf`` | Example | `hibernate.c3p0.max_size = 100` | After changing | Check xref:max-connections[`max_connections`] for adjustment. | More information | https://www.mchange.com/projects/c3p0/#maxPoolSize
cs: | Popis | Maximální počet spojení PostgreSQL současně dostupných jak pro Tomcat, tak pro Taskomatic. Pokud některá z těchto komponent vyžaduje více souběžných spojení, půjdou jejich požadavky do fronty. | Vyladit, když | se xref:java-message-queue-thread-pool-size[`java.message_queue_thread_pool_size`] nebo xref:max-threads[`maxThreads`] výrazně zvýší, nebo když se xref:org-quartz-threadPool-threadCount[`org.quartz.threadPool.threadCount`] významně změní. Každý podproces spotřebovává jedno spojení v Taskomatic a Tomcat, a je-li více vláken než spojení, může dojít k "vyhladovění". | Výchozí hodnota | 20. | Doporučená hodnota | 100 až 200, vyšší než maximum z xref:java-message-queue-thread-pool-size[`java.message_queue_thread_pool_size`] + xref:max-threads[`maxThreads`] a xref:org-quartz-threadPool-threadCount[`org.quartz.threadPool.threadCount`] | Umístění | [path]``/etc/rhn/rhn.conf`` | Příklad | `hibernate.c3p0.max_size = 100` | Po změně | Zkontrolujte xref:max-connections[`max_connections`], nepotřebuje-li nastavit. | Více informací | https://www.mchange.com/projects/c3p0/#maxPoolSize

source: | Description | The maximum amount of memory that the `rhn-search` service can use. | Tune when | xref:client-count[Client count] increases significantly, and `OutOfMemoryException` errors appear in `journalctl -u rhn-search`. | Value default | 512 MiB | Value recommendation | 512-4096 MiB | Location | [path]``/etc/rhn/rhn.conf`` | Example | `rhn-search.java.maxmemory = 4096` | After changing | Check xref:memory-usage[memory usage].
cs: | Popis | Maximální množství paměti, kterou může použít služba `rhn-search`. | Vyladit, když | se xref:client-count[Client count] výrazně zvýší a v `journalctl -u rhn-search se objevují chyby `OutOfMemoryException`. | Výchozí hodnota | 512 MIB. | Doporučená hodnota | 512-4096 MB. | Umístění | [path]``/etc/rhn/rhn.conf`` | Příklad | `rhn-search.java.maxmemory = 4096` | Po změně | Zkontrolujte xref:memory-usage[memory usage].

source: | Description | The amount of memory reserved for PostgreSQL shared buffers, which contain caches of database tables and index data. | Tune when | RAM changes | Value default | 25% of total RAM | Value recommendation | 25-40% of total RAM | Location | [path]``/var/lib/pgsql/data/postgresql.conf`` | Example | `shared_buffers = 8192MB` | After changing | Check xref:memory-usage[memory usage]. | More information | https://www.postgresql.org/docs/10/runtime-config-resource.html#GUC-SHARED-BUFFERS
cs: | Popis | Množství paměti vyhrazené pro sdílené vyrovnávací paměti PostgreSQL, které obsahují mezipaměti databázových tabulek a data indexů. | Vyladit, když | se změní velikost paměti RAM | Výchozí hodnota | 25% celkové paměti RAM | Hodnota doporučení | 25-40% celkové paměti RAM | Umístění | [path]``/var/lib/pgsql/data/postgresql.conf`` | Příklad | `shared_buffers = 8192MB` | Po změně | Zkontrolujte xref:memory-usage[memory usage]. | Více informací | https://www.postgresql.org/docs/10/runtime-config-resource.html#GUC-SHARED-BUFFERS

source: | Description | Maximum number of PostgreSQL connections available to applications. More connections allow for more concurrent threads/workers in various components (in particular Tomcat and Taskomatic), which generally improves performance. However, each connection consumes resources, in particular xref:work-mem[`work_mem`] megabytes per sort operation per connection. | Tune when | xref:hibernate-c3p0-max-size[`hibernate.c3p0.max_size`] changes significantly, as that parameter determines the maximum number of connections available to Tomcat and Taskomatic | Value default | 400 | Value recommendation | 2 * xref:hibernate-c3p0-max-size[hibernate.c3p0.max_size] + 50, if less than 1000 | Location | [path]``/var/lib/pgsql/data/postgresql.conf`` | Example | `max_connections = 250` | After changing | Check xref:memory-usage[memory usage]. Monitor memory usage closely before and after the change. | More information | https://www.postgresql.org/docs/10/runtime-config-connection.html#GUC-MAX-CONNECTIONS
cs: | Popis | Maximální počet spojení PostgreSQL k dispozici pro aplikace. Více spojení umožňuje více souběžných vláken/podprocesů (zejména v Tomcat a Taskomatic), což obecně zlepšuje výkon. Každé připojení však spotřebovává zdroje, zejména xref:work-mem[`work_mem`] megabytů na třídicí operaci na připojení. | Vyladit, když | se xref:hibernate-c3p0-max-size[`hibernate.c3p0.max_size`] výrazně změní, protože tento parametr určuje maximální počet připojení k dispozici pro Tomcat a Taskomatic | Výchozí hodnota | 400. | Doporučená hodnota | 2 * xref:hibernate-c3p0-max-size[hibernate.c3p0.max_size] + 50, pokud je menší než 1000 | Umístění | [path]``/var/lib/pgsql/data/postgresql.conf`` | Příklad | `max_connections = 250` | Po změně | Zkontrolujte xref:memory-usage[memory usage]. Sledujte využití paměti těsně před a po změně. | Více informací | https://www.postgresql.org/docs/10/runtime-config-connection.html#GUC-MAX-CONNECTIONS

source: | Description | The amount of memory allocated by PostgreSQL every time a connection needs to do a sort or hash operation. Every connection (as specified by xref:max-connections[`max_connections`]) might make use of an amount of memory equal to a multiple of `work_mem`. | Tune when | Database operations are slow because of excessive temporary file disk I/O. To test if that is happening, add ``log_temp_files = 5120`` to [path]``/var/lib/pgsql/data/postgresql.conf``, restart PostgreSQL, and monitor the PostgreSQL log files. If you see lines containing ``LOG: temporary file:`` try raising this parameter's value to help reduce disk I/O and speed up database operations. | Value recommendation | 2-20 MB | Location | [path]``/var/lib/pgsql/data/postgresql.conf`` | Example | `work_mem = 10MB` | After changing | check if the {productname} Server might need additional RAM. | More information | https://www.postgresql.org/docs/10/runtime-config-resource.html#GUC-WORK-MEM
cs: | Popis | Množství paměti,které si PostgreSQL přidělí pokaždé, když připojení musí provést třídicí nebo hash operaci. Každé připojení (jak je specifikováno xref:max-connections[`max_connections`]) může využít paměť rovnou násobku `work_mem`. | Vyladit, když | jsou databázové operace pomalé z důvodu nadměrné zatížení disku I/O operacemi dočasného souboru. Chcete-li otestovat, zda se to děje, přidejte ``log_temp_files = 5120``k souboru [path]``/var/lib/pgsql/data/postgresql.conf``, restartovat PostgreSQL a monitorovat soubory protokolu PostgreSQL. Vidíte-li řádky obsahující ``LOG: temporary file:``, zkuste zvýšit hodnotu log_temp_files pro snížení I/O disku a urychlení databázových operací. | Doporučená hodnota | 2-20 MB. | Umístění | [path]``/var/lib/pgsql/data/postgresql.conf`` | Příklad | `work_mem = 10MB` | Po změně: | Zkontrolujte, zda server {productname} potřebuje další RAM. | Více informací | https://www.postgresql.org/docs/10/runtime-config-resource.html#GUC-WORK-MEM

source: | Description | Estimation of the total memory available to PostgreSQL for caching. It is the explicitly reserved memory (xref:shared-buffers[`shared_buffers`]) plus any memory used by the kernel as cache/buffer. | Tune when | Hardware RAM or memory usage increase significantly | Value recommendation | Start with 75% of total RAM. For finer settings, use xref:shared-buffers[`shared_buffers`] + free memory + buffer/cache memory. Free and buffer/cache can be determined via the `free -m` command (`free` and `buff/cache` in the output respectively) | Location | [path]``/var/lib/pgsql/data/postgresql.conf`` | Example | `effective_cache_size = 24GB` | After changing | Check xref:memory-usage[memory usage] | Notes | This is an estimation for the query planner, not an allocation. | More information | https://www.postgresql.org/docs/10/runtime-config-query.html#GUC-EFFECTIVE-CACHE-SIZE
cs: | Popis | Odhad celkové paměti dostupné PostgreSQL po ukládání do mezipaměti. Je to explicitně rezervovaná paměť (xref:shared-buffers[`shared_buffers`]) plus libovolná paměť používaná jádrem jako mezipaměť / vyrovnávací paměť. | Vyladit, když | Hardwarová RAM nebo využití paměti významně vzroste. | Hodnota doporučení | Začněte s 75% celkové paměti RAM. Pro jemnější nastavení použijte xref:shared-buffers[`shared_buffers`] + volná paměť + vyrovnávací paměť / mezipaměť. Volnou a vyrovnávací paměť / mezipaměť lze určit příkazem `free -m` (`free` a `buff/cache` ve výstupu) | Umístění | [path]``/var/lib/pgsql/data/postgresql.conf`` | Příklad | `effective_cache_size = 24GB` | Po změně | Zkontrolujte xref:memory-usage[memory usage] | Poznámky | Jde o odhad plánovače dotazu, nikoli alokace. | Více informací | https://www.postgresql.org/docs/10/runtime-config-query.html#GUC-EFFECTIVE-CACHE-SIZE

source: | Description | The number of worker threads serving Salt API HTTP requests. A higher number can improve parallelism of {productname} Server-initiated Salt operations, but will consume more memory. | Tune when | xref:java-message-queue-thread-pool-size[`java.message_queue_thread_pool_size`] or xref:org-quartz-threadPool-threadCount[`org.quartz.threadPool.threadCount`] are changed. Starvation can occur when there are more Tomcat or Taskomatic threads making simultaneous Salt API calls than there are Salt API worker threads. | Value default | 100 | Value recommendation | 100-500, but should be higher than the sum of xref:java-message-queue-thread-pool-size[`java.message_queue_thread_pool_size`] and xref:org-quartz-threadPool-threadCount[`org.quartz.threadPool.threadCount`] | Location | [path]``/etc/salt/master.d/susemanager.conf``, in the `rest_cherrypy` section. | Example | `thread_pool: 100` | After changing | Check xref:worker-threads[`worker_threads`] for adjustment. | More information | https://docs.saltstack.com/en/latest/ref/netapi/all/salt.netapi.rest_cherrypy.html#performance-tuning
cs: | Popis | Počet pracovních podprocesů obsluhujících požadavky Salt API HTTP. Vyšší číslo může zlepšit paralelnost operací Salt zahájených {productname} Serverem, ale bude spotřebovávat více paměti. | Vyladit, když | se změní xref:java-message-queue-thread-pool-size[`java.message_queue_thread_pool_size`] nebo xref:org-quartz-threadPool-threadCount[`org.quartz.threadPool.threadCount`]. "Hladovění" může nastat, je-li více vláken Tomcat nebo Taskomatic simultánně volajících Salt API, než je pracovních vláken Salt API. | Výchozí hodnota | 100 | Doporučená hodnota | 100-500, ale mělo by být vyšší než součet xref:java-message-queue-thread-pool-size[`java.message_queue_thread_pool_size`] a xref:org-quartz-threadPool-threadCount[`org.quartz.threadPool.threadCount`] | Umístění | [path]``/etc/salt/master.d/susemanager.conf``, v sekci `rest_cherrypy`. | Příklad | `thread_pool: 100` | Po změně | Zkontrolujte nastavení xref:worker-threads[`worker_threads`]. | Více informací | https://docs.saltstack.com/en/latest/ref/netapi/all/salt.netapi.rest_cherrypy.html#performance-tuning

source: | Description | The number of `salt-master` worker threads that process commands and replies from minions and the Salt API. Increasing this value, assuming sufficient resources are available, allows Salt to process more data in parallel from minions without timing out, but will consume significantly more RAM (typically about 70 MiB per thread). | Tune when | xref:client-count[Client count] increases significantly, xref:thread-pool[`thread_pool`] increases significantly, or `SaltReqTimeoutError` or `Message timed out` errors appear in `/var/log/salt/master`. | Value default | 8 | Value recommendation | 8-200 | Location | [path]``/etc/salt/master.d/tuning.conf`` | Example | `worker_threads: 50` | After changing | Check xref:memory-usage[memory usage]. Monitor memory usage closely before and after the change. | More information | https://docs.saltstack.com/en/latest/ref/configuration/master.html#worker-threads
cs: | Popis | Počet pracovních vláken "salt-master`, která zpracovávají příkazy a odpovědi z "přisluhovačů" (minions) a Salt API. Zvýšení této hodnoty, za předpokladu, že jsou k dispozici dostatečné zdroje, umožňuje Salt, aby zpracovával více dat od "přisluhovačů" (minions) paralelně bez vypršení času, ale bude spotřebovávat podstatně více RAM (typicky asi 70 MB na vlákno). | Vyladit, když | se výrazně zvýší xref:client-count[Client count] nebo xref:thread-pool[`thread_pool`], nebo se objevují chyby `SaltReqTimeoutError` nebo `Message timed out` v souboru `/var/log/salt/master`. | Výchozí hodnota | 8 | Doporučená hodnota | 8-200 | Umístění | [path]``/etc/salt/master.d/tuning.conf`` | Příklad | `worker_threads: 50` | Po změně: | Zkontrolujte xref:memory-usage[memory usage]. Sledujte využití paměti těsně před a po změně. | Více informací | https://docs.saltstack.com/en/latest/ref/configuration/master.html#worker-threads

source: | Description | The maximum number of outstanding messages sent by `salt-master`. If more than this number of messages need to be sent concurrently, communication with clients slows down, potentially resulting in timeout errors during load peaks. | Tune when | xref:client-count[Client count] increases significantly and ``Salt request timed out. The master is not responding.`` errors appear when pinging minions during a load peak. | Value default | 1000 | Value recommendation | 10000-100000 | Location | [path]``/etc/salt/master.d/tuning.conf`` | Example | `pub_hwm: 10000` | More information | https://docs.saltstack.com/en/latest/ref/configuration/master.html#pub-hwm, https://zeromq.org/socket-api/#high-water-mark
cs: | Popis | Maximální počet mimořádných zpráv odeslaných `salt-master`. Je-li třeba zaslat více než tento počet zpráv souběžně, komunikace s klienty se zpomaluje, což potenciálně vede k chybám vypršení časového limitu během špiček zátěže. | Vyladit, když | se výrazně zvýší xref:client-count[Client count] a po pingu následníků (minions) během špičky zátěže nastane chyba ``Salt request timed out. The master is not responding.``. | Výchozí hodnota | 1000 | Doporučená hodnota | 10000-100000 | Umístění | [path]``/etc/salt/master.d/tuning.conf`` | Příklad | `pub_hwm: 10000` | Více informací | https://docs.saltstack.com/en/latest/ref/configuration/master.html#pub-hwm, https://zeromq.org/socket-api/#high-water-mark
