Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/large-deployments/*.po
Languages: cs

source: In most cases, different terminals will require a different operating system (OS) image to ensure they work correctly. For example, an information kiosk has a high-resolution touchscreen, where a cashier terminal might only have a very basic display. While both of these terminals require similar processing and network functionality, they will require different OS images. The OS images ensure that the different display mechanisms work correctly.
cs: Ve většině případů budou různé terminály vyžadovat jiný obraz operačního systému (OS), aby bylo zajištěno správné fungování. Například informační kiosek má dotykovou obrazovku s vysokým rozlišením, ale pro pokladní terminál postačuje pouze zcela základní zobrazení. I když oba tyto terminály vyžadují podobné funkce pro zpracování a práci v síti, budou vyžadovat různé obrazy OS, které zařídí, aby různé mechanismy zobrazení fungovaly správně.

source: For more information about setting up and using {productname} {smr}, see xref:retail:retail-overview.adoc[].
cs: Další informace o nastavení a používání {productname} {smr} viz xref:retail:retail-overview.adoc[].

source: Using a Single Server to Manage Large Scale Deployments
cs: Použití jediného serveru ke správě rozsáhlé instalace

source: This section discusses how to set up a single {productname} Server to manage a large number of clients. It contains some recommendations for hardware and networking, and an overview of the tuning parameters that you need to consider in a large scale deployment.
cs: Tato část popisuje, jak nastavit jediný {productname} Server pro správu velkého počtu klientů. Jsou zde některá doporučení pro hardware, tvorbu sítí a přehled parametrů ladění, které potřebujete u rozsáhlých instalací vzít v úvahu.

source: Tuning Large Scale Deployments
cs: Vyladění rozsáhlých instalací

source: The instructions in this section can have severe and catastrophic performance impacts when improperly used. In some cases, they can cause {productname} to completely cease functioning. Always test changes before implementing them in a production environment. During implementation, take care when changing parameters. Monitor performance before and after each change, and revert any steps that do not produce the expected result.
cs: Pokyny v této části mohou mít při nesprávném používání závažné až katastrofické dopady na výkonnost. V některých případech mohou způsobit, že {productname} zcela přestane fungovat. Před implementací v provozním prostředí vždy otestujte změny. Během implementace měňte parametry pečlivě a opatrně. Sledujte výkon před a po každé změně a vraťte všechny kroky, které nedávají očekávaný výsledek.

source: We strongly recommend that you contact SUSE Consulting for assistance with tuning.
cs: Důrazně doporučujeme kontaktovat SUSE Consulting a vyžádat si asistenci při ladění.

source: SUSE will not provide support for catastrophic failure when these advanced parameters are modified without consultation.
cs: SUSE neposkytne podporu při katastrofálním selhání, jsou-li tyto citlivé parametry modifikovány bez konzultace.

source: Tuning is not required on installations of fewer than 1000 clients. Do not perform these instructions on small or medium scale installations.
cs: Ladění není nutné pro instalace s méně než 1000 klienty. Tyto pokyny nerealizujte na malých nebo středních instalacích.

source: The Tuning Process
cs: Postup vyladění

source: Any {productname} installation is subject to a number of design and infrastructure constraints that, for the purposes of tuning, we call environmental variables. Environmental variables can include the total number of clients, the number of different operating systems under management, and the number of software channels.
cs: Každá instalace {productname} podléhá řadě konstrukčních a infrastrukturních omezení, která pro účely ladění nazýváme proměnné prostředí. Může zde být celkový počet klientů, počet různých operačních systémů ve správě a počet kanálů softwaru.

source: Environmental variables influence, either directly or indirectly, the value of most configuration parameters. During the tuning process, the configuration parameters are manipulated to improve system performance.
cs: Proměnné prostředí ovlivňují, ať přímo nebo nepřímo, hodnotu většiny konfiguračních parametrů. Během procesu ladění budete manipulovat s konfiguračními parametry s cílem zlepšit výkon systému.

source: Before you begin tuning, you will need to estimate the best setting for each environment variable, and adjust the configuration parameters to suit.
cs: Než začnete ladit, potřebujete odhadnout nejlepší nastavení pro každou proměnnou prostředí a nastavit vyhovující konfigurační parametry.

source: To help you with the estimation process, we have provided you with a dependency graph. Locate the environmental variables on the dependency graph to determine how they will influence other variables and parameters.
cs: Abychom Vám pomohli s procesem odhadu, poskytli jsme vám graf závislosti. Najděte proměnné prostředí v grafu závislosti, abyste určili, jak ovlivňují jiné proměnné a parametry.

source: Environmental variables are represented by graph nodes in a rectangle at the top of the dependency graph. Each node is connected to the relevant parameters that might need tuning. Consult the relevant sections in this document for more information about recommended values.
cs: Proměnné prostředí jsou zastoupeny grafickými uzly v obdélníku v horní části grafu závislosti. Každý uzel je připojen k příslušným parametrům, které by mohly být vyladěny. Další informace o doporučených hodnotách najdete v příslušných sekcích.

source: Tuning one parameter might require tuning other parameters, or changing hardware, or the infrastructure. When you change a parameter, follow the arrows from that node on the graph to determine what other parameters might need adjustment. Continue through each parameter until you have visited all nodes on the graph.
cs: Vyladění jednoho parametru může vyžadovat ladění dalších parametrů nebo změnu hardwaru nebo infrastruktury. Když změníte parametr, postupujte podle šipek z příslušného uzlu grafu, abyste určili, jaké další parametry mohou potřebovat úpravu. Pokračujte pro každý parametr, dokud nenavštívíte všechny uzly grafu.

source: Tuning dependency graph
cs: Graf závislosti ladění

source: Key to the Dependency Graph
cs: Klíč ke grafu závislosti

source: 3D boxes are hardware design variables or constraints
cs: Plasticky vynesené (3D) bloky jsou hardwarové konstrukční proměnné nebo omezení

source: Oval-shaped boxes are software or system design variables or constraints
cs: Oválné bloky jsou proměnné nebo omezení softwarového nebo systémového návrhu

source: Rectangle-shaped boxes are configurable parameters, color-coded by configuration file:
cs: Obdélníkové bloky jsou konfigurovatelné parametry, barevně kódované konfiguračním souborem:

source: Red: Apache `httpd` configuration files
cs: Červená: konfigurační soubory Apache `httpd`

source: Blue: Salt configuration files
cs: Modrá: konfigurační soubory Salt

source: Brown: Tomcat configuration files
cs: Hnědá: konfigurační soubory Tomcat

source: Grey: PostgreSQL configuration files
cs: Šedá: konfigurační soubory PostgreSQL

source: Purple: `/etc/rhn/rhn.conf`
cs: Fialová: `/etc/rhn/rhn.conf`

source: Dashed connecting lines indicate a variable or constraint that might require a change to another parameter
cs: Přerušované spojnice označují proměnnou nebo omezení, která by mohla vyžadovat změnu jiného parametru

source: Solid connecting lines indicate that changing a configuration parameter requires checking another one to prevent issues
cs: Plné spojnice označují, že změna konfiguračního parametru vyžaduje zkontrolovat jiný, aby nenastaly problémy

source: After the initial tuning has been completed, you will need to consider tuning again in these cases:
cs: Po dokončení počátečního ladění budete muset zvážit nové ladění v těchto případech:

source: If your tuning inputs change significantly
cs: vaše ladicí vstupy se výrazně změnily

source: If special conditions arise that require a certain parameter to be changed.
cs: vznikly zvláštní podmínky vyžadující změnu určitého parametru.

source: For example, if specific warnings appear in a log file.
cs: Například, když se v souboru protokolu zobrazí konkrétní varování.

source: If performance is not satisfactory
cs: je-li výkonnost neuspokojivá

source: To re-tune your installation, you will need to use the dependency graph again. Start from the node where significant change has happened.
cs: Chcete-li vyladit instalaci znovu, budete muset znovu použít graf závislosti. Začněte od uzlu, kde nastala významná změna.

source: Environmental Variables
cs: Proměnné prostředí

source: This section contains information about environmental variables (inputs to the tuning process).
cs: Tato sekce obsahuje informace o proměnných prostředí (vstupech do procesu ladění).

source: Network Bandwidth
cs: Šířka pásma sítě

source: A measure of the typically available egress bandwith from the {productname} Server host to the clients or {productname} Proxy hosts. This should take into account network hardware and topology as well as possible capacity limits on switches, routers, and other network equipment between the server and clients.
cs: Míra typicky dostupné výstupní šířky pásma z hostitele {ProductName} Serveru ke klientům nebo k hostiteli {ProductName} proxy. Vezměte v úvahu síťový hardware a topologii sítě, dále možné kapacitní limity přepínačů, směrovačů a dalších síťových zařízení mezi serverem a klienty.

source: Channel count
cs: Počet kanálů

source: The number of expected channels to manage. Includes any vendor-provided, third-party, and cloned or staged channels.
cs: Počet očekávaných kanálů, které se mají spravovat. Zahrnuje všechny kanály poskytované dodavatelem, třetí stranou a klonované nebo fázované kanály.

source: Client count
cs: Počet klientů

source: The total number of actual or expected clients. It is important to tune any parameters in advance of a client count increase, whenever possible.
cs: Celkový počet skutečných nebo očekávaných klientů. Je důležité naladit jakékoli parametry před zvýšením počtu klientů, kdykoli je to možné.

source: The number of distinct operating system versions that managed clients have installed. This is ordered by family ({sle}, openSUSE, {rhel}, or {ubuntu} based). Storage and computing requirements are different in each case.
cs: Počet různých verzí operačního systému, které mají spravovaní klienti nainstalované. Jsou seřazeny podle rodiny (založené na {sle}, openSUSE, {rhel} nebo {ubuntu}). Požadavky na úložiště a výpočetní techniku se v každé rodině liší.

source: User count
cs: Počet uživatelů

source: The expected maximum amount of concurrent users interacting with the {webui} plus the number of programs simultaneously using the XMLRPC API. Includes `spacecmd`, `spacewalk-clone-by-date`, and similar.
cs: Očekávané maximální množství souběžných uživatelů interagujících s {Webui} plus počet programů současně používajících API XMLRPC. Zahrnuje `spacecmd`,`spacewalk-clone-by-date` a podobné parametry.

source: Parameters
cs: Parametry

source: This section contains information about the available parameters.
cs: Tato sekce obsahuje informace o dostupných parametrech.

source: | Description | The maximum number of HTTP requests served simultaneously by Apache httpd. Proxies, {webui}, and XMLRPC API clients each consume one. Requests exceeding the parameter will be queued and might result in timeouts. | Tune when | xref:user-count[User count] and proxy count increase significantly and this line appears in [path]``/var/log/apache2/error_log``: [systemitem]``[...] [mpm_prefork:error] [pid ...] AH00161: server reached MaxRequestWorkers setting, consider raising the MaxRequestWorkers setting``. | Value default | 150 | Value recommendation | 150-500 | Location | [path]``/etc/apache2/server-tuning.conf``, in the `prefork.c` section | Example | `MaxClients = 200` | After changing | Immediately change xref:server-limit[`ServerLimit`] and check xref:max-threads[`maxThreads`] for possible adjustment. | Notes | This parameter was renamed to `MaxRequestWorkers`, both names are valid. | More information | https://httpd.apache.org/docs/2.4/en/mod/mpm_common.html#maxrequestworkers
cs: | Popis | Maximální počet požadavků HTTP současně obsluhovaných službou Apache httpd. Klienti Proxy, {Webui} a XMLRPC API spotřebují každý jeden. Žádosti překračující parametr budou ve frontě a mohou mít za následek vypršení časových limitů. | Vyladit, když | xref:user-count [počet uživatelů] a počet proxy se výrazně zvýší a tento řádek se zobrazí v [path] ``/var/log/apache2/error_log``: [systemitem]``[...] [mpm_prefork:error] [pid ...] AH00161: server dosáhl nastavení MaxRequestWorkers, zvážit zvýšení MaxRequestworkers``. | Výchozí hodnota | 150. | Hodnota doporučení | 150-500. | Umístění | [path] ``/etc/apache2/server-tuning.conf``, v sekci` prefork.c` | Příklad | `Maxclients = 200` | Po změně | Okamžitě změnit xref:server-limit [`ServerLimit`] a zkontrolujte xref:max-threads[`maxThreads`] pro možné úpravy. | Poznámky | Tento parametr byl přejmenován na `MaxRequestWorkers`, obě jména jsou platná. | Více informací | https://httpd.apache.org/docs/2.4/en/mod/mpm_common.html#maxrequestworkers.

source: | Description | The number of Apache httpd processes serving HTTP requests simultaneously. The number must equal xref:max-clients[`MaxClients`]. | Tune when | xref:max-clients[`MaxClients`] changes | Value default | 150 | Value recommendation | The same value as xref:max-clients[`MaxClients`] | Location | [path]``/etc/apache2/server-tuning.conf``, in the `prefork.c` section | Example | `ServerLimit = 200` | More information | https://httpd.apache.org/docs/2.4/en/mod/mpm_common.html#serverlimit
cs: | Popis | Počet procesů Apache httpd současně obsluhujících požadavky HTTP. Číslo se musí rovnat xref:max-clients[`MaxClients`]. | Vyladit, když | xref:max-clients[`MaxClients`] změny | Výchozí hodnota | 150. | Doporučená hodnota | Stejná hodnota jako xref:max-clients[`MaxClients`] | Umístění | [path] ``/etc/apache2/server-tuning.conf``, v sekci `prefork.c` | Příklad | `Serverlimit = 200` | Více informací | https://httpd.apache.org/docs/2.4/en/mod/mpm_common.html#serverlimit.

source: | Description | The number of Tomcat threads dedicated to serving HTTP requests | Tune when | xref:max-clients[`MaxClients`] changes. `maxThreads` must always be equal or greater than xref:max-clients[`MaxClients`] | Value default | 150 | Value recommendation | The same value as xref:max-clients[`MaxClients`] | Location | [path]``/etc/tomcat/server.xml`` | Example | `<Connector port="8009" protocol="AJP/1.3" redirectPort="8443" URIEncoding="UTF-8" address="127.0.0.1" maxThreads="200" connectionTimeout="20000"/>` | More information | https://tomcat.apache.org/tomcat-9.0-doc/config/http.html
cs: | Popis | Počet vláken Tomcat určených pro sloučení požadavků HTTP | Vyladit když | se změní xref:max-clients[`MaxClients`]. `maxThreads` musí být vždy rovno nebo vyšší než xref:max-clients[`MaxClients`] | Výchozí hodnota | 150. | Doporučená hodnota | Stejná hodnota jako xref:max-clients[`MaxClients`] | Umístění | [path] ``/etc/tomcat/server.xml`` | Příklad |` <Connector port ="8009"protocol="AJP/1.3" redirectPort="8443" URIEncoding="UTF-8" address="127.0.0.1" maxThreads ="200" connectionTimeout="20000"/>` ` | Více informací | https://tomcat.apache.org/tomcat-9.0-doc/config/http.html

source: | Description | The number of milliseconds before a non-responding AJP connection is forcibly closed. | Tune when | xref:client-count[Client count] increases significantly and ``AH00992``, ``AH00877``, and ``AH01030`` errors appear in Apache error logs during a load peak. | Value default | 900000 | Value recommendation | 20000-3600000 | Location | [path]``/etc/tomcat/server.xml`` | Example | `<Connector port="8009" protocol="AJP/1.3" redirectPort="8443" URIEncoding="UTF-8" address="127.0.0.1" maxThreads="200" connectionTimeout="1000000" keepAliveTimeout="300000"/>` | More information | https://tomcat.apache.org/tomcat-9.0-doc/config/http.html
cs: | Popis | Počet milisekund, než je nereagující AJP spojení násilně uzavřeno. | Vyladit, když | se významně zvýší xref:client-count [Client count] a zobrazí se chyby ``AH00992``, AH00877`` a ``AH01030`` v chybovém protokolu Apache při špičkovém zatížení. | Výchozí hodnota | 900000. | Doporučená hodnota | 20000-3600000. | Umístění | [path]``/etc/tomcat/server.xml`` | Příklad |` <Connector port="8009" protocol="AJP/1.3" redirectPort="8443" URIEncoding="UTF-8" address="127.0.0.1" maxThreads="200" connectionTimeout="1000000" keepAliveTimeout="300000"/> ` | Více informací | https://tomcat.apache.org/tomcat-9.0-doc/config/http.html.

source: | Description | The number of milliseconds without data exchange from the JVM before a non-responding AJP connection is forcibly closed. | Tune when | xref:client-count[Client count] increases significantly and ``AH00992``, ``AH00877``, and ``AH01030`` errors appear in Apache error logs during a load peak. | Value default | 300000 | Value recommendation | 20000-600000 | Location | [path]``/etc/tomcat/server.xml`` | Example | `<Connector port="8009" protocol="AJP/1.3" redirectPort="8443" URIEncoding="UTF-8" address="127.0.0.1" maxThreads="200" connectionTimeout="1000000" keepAliveTimeout="400000"/>` | More information | https://tomcat.apache.org/tomcat-9.0-doc/config/http.html
cs: | Popis | Počet milisekund ztráty přenosu dat z JVM, než je násilně uzavřeno nereagující připojení AJP. | Vylaďte, když | se významně zvýší xref:client-count[Client count] a v protokolech chyb Apache se během špičky zatížení objevují chyby ``AH00992``, ``AH00877`` a ``AH01030``. | Výchozí hodnota | 300 000 | Doporučená hodnota | 20000-600000 | Umístění | [path]``/etc/tomcat/server.xml`` | Příklad | ` <Connector port="8009" protocol="AJP/1.3" redirectPort="8443" URIEncoding="UTF-8" address="127.0.0.1" maxThreads="200" connectionTimeout="1000000" keepAliveTimeout="400000"/> ` | Více informací | https://tomcat.apache.org/tomcat-9.0-doc/config/http.html

source: Tomcat's `-Xmx`
cs: `-Xmx` v Tomcatu

source: | Description | The maximum amount of memory Tomcat can use | Tune when | xref:java-message-queue-thread-pool-size[`java.message_queue_thread_pool_size`] is increased or `OutOfMemoryException` errors appear in `/var/log/rhn/rhn_web_ui.log` | Value default | 1{nbsp}GiB | Value recommendation | 4-8{nbsp}GiB | Location | [path]``/etc/sysconfig/tomcat`` | Example | `JAVA_OPTS="... -Xmx8G ..."` | After changing | Check xref:memory-usage[memory usage] | More information | https://docs.oracle.com/javase/8/docs/technotes/tools/windows/java.html
cs: | Popis | Maximální množství paměti, které může Tomcat využít | Vylaďte, když | se zvětší zásobník (pool) xref:java-message-queue-thread-pool-size[`java.message_queue_thread_pool_size`] nebo se v souboru `/var/log/rhn/rhn_web_ui.log` objeví chyby `OutOfMemoryException` | Výchozí hodnota | 1{nbsp}GB | Doporučená hodnota | 4-8{nbsp}GB | Poloha | [path]``/etc/sysconfig/tomcat`` | Příklad | `JAVA_OPTS =" ... -Xmx8G ... "` | Po změně | Zkontrolujte xref:memory-usage[memory usage] | Více informací | https://docs.oracle.com/javase/8/docs/technotes/tools/windows/java.html

source: | Description | The maximum number of minions concurrently executing a scheduled action. | Tune when | xref:client-count[Client count] reaches several thousands and actions are not executed quickly enough. | Value default | 200 | Value recommendation | 200-500 | Location | [path]``/etc/rhn/rhn.conf`` | Example | `java.salt_batch_size = 300` | After changing | Check xref:memory-usage[memory usage]. Monitor memory usage closely before and after the change. | More information | xref:salt:salt-rate-limiting.adoc[Salt Rate Limiting]
cs: | Popis | Maximální počet "přisluhovačů" současně provádějících plánovanou akci. | Vylaďte, když | xref:client-count[Client count] dosahuje několika tisíc a akce se neprovádějí dostatečně rychle. | Výchozí hodnota | 200 | Hodnota doporučení | 200-500 | Umístění | [path] ``/etc/rhn/rhn.conf`` | Příklad | `java.salt_batch_size = 300` | Po změně | Zkontrolujte xref:memory-usage[memory usage]. Pozorně sledujte využití paměti před a po změně. | Více informací | xref:salt:salt-rate-limiting.adoc[Salt Rate Limiting]

source: | Description | Before any action is executed on a client, a presence ping is executed to make sure the client is reachable. After xref:java-salt-presence-ping-timeout[`java.salt_presence_ping_timeout`] seconds have elapsed without a response, a second command (`find_job`) is sent to the client for a final check. This parameter sets the number of seconds after the second command after which the client is definitely considered offline. Having many clients typically means some will respond faster than others, so this timeout could be raised to accommodate for the slower ones. | Tune when | xref:client-count[Client count] increases significantly, or some clients are responding correctly but too slowly, and {productname} excludes them from calls. This line appears in [path]``/var/log/rhn/rhn_web_ui.log``: [systemitem]``"Got no result for <COMMAND> on minion <MINION_ID> (minion did not respond in time)"`` | Value default | 1 second | Value recommendation | 1-100 seconds | Location | [path]``/etc/rhn/rhn.conf`` | Example | `java.salt_presence_ping_gather_job_timeout = 10` | More information | xref:salt:salt-timeouts.adoc[Salt Timeouts]
cs: | Popis | Před provedením jakékoli akce na klientu je proveden test Ping, aby se ověřilo, že je klient dosažitelný. Po xref:java-salt-presence-ping-timeout[`java.salt_presence_ping_timeout`] sekundách uplynulých bez odpovědi je odeslán klientovi druhý příkaz (`find_job`) pro konečnou kontrolu. Tento parametr nastaví počet sekund po druhém příkazu, po nichž je klient určitě považován za offline. Mít mnoho klientů typicky znamená, že někteří bude reagovat rychleji než jiní, takže tento časový limit by mohl být zvýšen tak, aby vyhověl i nejpomalejším. | Vyladit, když | se výrazně zvýší xref:client-count[Client count] nebo někteří klienti reagují sice správně, ale příliš pomalu a {productname} je vylučuje je z volání. V [path]``/var/log/rhn/rhn_web_ui.log``: [systemitem]`` se zobrazí tento řádek: "Nemáte žádný výsledek pro <příkaz> na "následníka" <minion_id> (následník neodpověděl včas) "` ` | Výchozí hodnota | 1 sekunda | Doporučená hodnota | 1-100 sekund | Umístění | [path]``/etc/rhn/rhn.conf`` | Příklad | `java.salt_presence_ping_gather_job_timeout = 10` | Více informací | xref:salt:salt-timeouts.adoc[Salt Timeouts]
