Repository: uyuni-project/uyuni-docs
Catalog: l10n-weblate/quickstart-sap/*.po
Languages: cs

source: xref:qs-sap-overview.adoc[Quick Start: SAP]
cs: xref:qs-sap-overview.adoc[Quick Start: SAP] (Rychlý stert: SAP)

source: xref:prepare-server.adoc[Prepare Server]
cs: xref:prepare-server.adoc[Prepare Server] (Příprava serveru)

source: xref:prepare-clients.adoc[Prepare Clients]
cs: xref:prepare-clients.adoc[Prepare Clients] (Příprava klientů)

source: xref:configure.adoc[Configuration]
cs: xref:configure.adoc[Configuration] (Konfigurace)

source: Configure Clients
cs: Konfigurovat klienty

source: {productname} uses formulas with forms to configure your SAP clients. There are two formulas that you need to use:
cs: {productname} používá vzorce s formuláři ke konfiguraci vašich klientů SAP. Musíte použít dva vzorce:

source: ``Hana`` to configure the HANA database
cs: ``Hana`` pro konfiguraci databáze HANA

source: ``Cluster`` to configure the clients into a cluster
cs: ``Cluster`` pro konfiguraci klientů do klastru

source: The formulas are provided by packages that you can download with your package manager. You need to install the formulas on the {productname} Server. When you have installed the package, you can use the {productname} {webui} to enable and configure the formulas. As you go through the formula configuration process, provide details of the clients that contain your SAP cluster, to set them up appropriately.
cs: Vzorce jsou dodávány v balíčcích, které si můžete stáhnout správcem balíčků. Vzorce je třeba instalovat na server {productname}. Když jste nainstalovali balíček, můžete použít {productname} {webui} k povolení a konfiguraci vzorců. Při procházení procesem konfigurace vzorce uveďte podrobnosti o klientech obsažených ve Vašem clusteru SAP, abyste je mohli správně nastavit.

source: To install the formulas on the {productname} Server, use your package manager to install these packages:
cs: Chcete-li nainstalovat vzorce na server {productname}, použijte správce balíčků k instalaci těchto balíčků:

source: The order that you enable and configure the formulas is important. You must enable, configure, and apply the HANA formula first. Then you can enable, configure, and apply the cluster formula. If you perform these steps in the wrong order, your SAP installation fails.
cs: Pořadí, v němž povolíte a nakonfigurujete vzorce, je důležité. Nejprve musíte povolit, nakonfigurovat a použít vzorec HANA. Potom můžete povolit, nakonfigurovat a použít vzorec clusteru. Provedete-li tyto kroky v nesprávném pořadí, instalace SAP se nezdaří.

source: Enable and Configure the HANA Formula
cs: Povolit a nakonfigurovat vzorec HANA

source: In the {productname} {webui}, navigate to menu:Systems[System List] and click the client to use as the primary client in the cluster.
cs: V {productname} {webui} přejděte do menu:Systems[System List] (Systémy[Seznam systémů] a klikněte na klienta, který má být použit jako primární klient klastru.

source: Navigate to the [guimenu]``Formulas`` tab, locate the ``Sap Hana Deployment`` heading, and check the ``Saphanabootstrap`` formula in the list. Click btn:[Save] and apply the highstate to activate the formula.
cs: Přejděte na kartu [guimenu]``Formulas`` (vzorce), vyhledejte nadpis ``Sap Hana Deployment``(Nasazení aplikace Sap Hana) a v seznamu zaškrtněte vzorec ``Saphanabootstrap``. Stiskněte btn:[Save] (Uložit) a k aktivaci vzorce použijte highstate.

source: When the formula is activated, navigate to the menu:Formulas[Hana] tab, and complete the details in the form.
cs: Když je vzorec aktivován, přejděte na kartu menu:Formulas[Hana] (Vzorce[Hana]) a vyplňte podrobnosti ve formuláři.

source: Make sure you check [guimenu]``Install required packages`` to install everything you need on the client. In the [guimenu]``Nodes`` sections, type the hostname of the client to install the HANA database, and provide details for the installation.
cs: Nezapomeňte zaškrtnout [guimenu]``Install required packages`` (Instalovat požadované balíčky) a nainstalovat na klienta vše, co potřebujete. V sekcích [guimenu]``Nodes`` (Uzly) zadejte název hostitele klienta pro instalaci databáze HANA a uveďte podrobnosti instalace.

source: Complete the remaining details according to your environment, click btn:[Save], and apply the highstate. When the highstate is complete, you can go on to apply the cluster formula.
cs: Vyplňte zbývající podrobnosti podle svého prostředí, stiskněte btn:[Save] (Uložit) a použijte highstate. Když je highstate dokončen, můžete pokračovat v použití vzorce klastru.

source: Enable and Configure the Cluster Formula
cs: Povolte a nakonfigurujte vzorec clusteru

source: Navigate to the [guimenu]``Formulas`` tab, locate the ``Cluster`` heading, and check the ``Habootstrap`` formula in the list. Click btn:[Save] and apply the highstate to activate the formula.
cs: Přejděte na kartu [guimenu]``Formulas`` (Vzorce), vyhledejte nadpis ``Cluster`` a v seznamu zkontrolujte vzorec ``Habootstrap``. Stiskněte btn:[Save] (Uložit) a použijte highstate k aktivaci vzorce.

source: When the formula is activated, navigate to the menu:Formulas[Cluster] tab, and complete the details in the form.
cs: Když je vzorec aktivován, přejděte do karty menu:Formulas[Cluster] (Vzorce [Klastr]) a ve formuláři vyplňte podrobnosti.

source: Make sure you check [guimenu]``Install required packages`` to install everything you need on the client. Give your cluster a name, and specify the hostname of the primary client in the cluster.
cs: Nezapomeňte zaškrtnout [guimenu]``Install required packages`` (Instalovat požadované balíčky) a nainstalovat na klienta vše, co potřebujete. Pojmenujte svůj klastr a zadejte název hostitele - primárního klienta klastru.

source: Complete the remaining details according to your environment, click btn:[Save], and apply the highstate.
cs: Vyplňte zbývající podrobnosti podle svého prostředí, stiskněte btn:[Save] (Uložit) a použijte highstate.

source: Preparing Clients
cs: Příprava klientů

source: Your SAP cluster requires several client systems. Prepare your clients on physical or virtual hardware, and ensure you have {sles}{nbsp}15 for SAP installation media ready. You cannot create an SAP cluster without the {sles} SAP extension, as it provides tooling specific to SAP.
cs: Váš cluster SAP vyžaduje několik klientských systémů. Připravte své klienty na fyzickém nebo virtuálním hardwaru a ujistěte se, že máte připraveno {sles}{nbsp}15 pro instalační média SAP. Klastr SAP nemůžete vytvořit bez rozšíření {sles} SAP, které poskytuje nástroje specifické pro SAP.

source: One of the key features of SAP is high availability of the cluster. Every component within an SAP cluster has redundancy and failover protection. When you are preparing your clients, ensure you have enough hardware and infrastructure to allow for this. For more information about hardware requirements, see https://documentation.suse.com/sles-sap/15-SP2/html/SLES-SAP-quick/cha-plan.html#sec-hardware[].
cs: Jednou z klíčových funkcí systému SAP je vysoká dostupnost klastru. Každá součást klastru SAP má redundanci a ochranu před selháním. Při přípravě svých klientů se ujistěte, že máte dostatek hardwaru a infrastruktury, aby to bylo možné. Další informace o požadavcích na hardware viz https://documentation.suse.com/sles-sap/15-SP2/html/SLES-SAP-quick/cha-plan.html#sec-hardware[].

source: For more information about the clients you need to set up for an SAP cluster, see https://documentation.suse.com/sbp/all[].
cs: Další informace o klientech, které potřebujete nastavit pro cluster SAP, viz https://documentation.suse.com/sbp/all[].

source: Register Clients to the {SCC}
cs: Zaregistrujte klienty u {SCC}

source: Each client within your SAP cluster must be registered with the {scc}. To obtain your registration code, navigate to https://scc.suse.com/login in your web browser. Log in to your SCC account, or follow the prompts to create a new account. Click the btn:[Subscriptions] tab to see the registration code. When you install {sles}{nbsp}15 for SAP the Unified Installer prompts you for the code.
cs: Každý klient ve vašem klastru SAP musí být registrován u {scc}. Chcete-li získat registrační kód, přejděte ve svém webovém prohlížeči na https://scc.suse.com/login. Přihlaste se ke svému účtu SCC nebo podle pokynů vytvořte nový účet. Kliknutím na kartu btn:[Subscriptions] (Předplatná) zobrazíte registrační kód. Když nainstalujete aplikaci {sles}{nbsp}15 pro SAP, Jednotný instalátor (Unified Installer) vás vyzve k zadání kódu.

source: For more information about registering {productname} with {scc}, see xref:installation:general-requirements.adoc[].
cs: Další informace o registraci {productname} u {scc} najdete na xref:installation:general-requirements.adoc [].

source: Configure the Clients for Clustering
cs: Konfigurujte klienty pro práci v klastru

source: Every client system must have all the other client systems listed in their [path]``/etc/hosts`` file. Open the [path]``/etc/hosts`` file on each client, and add the hostname for each of the other clients.
cs: Každý klientský systém musí mít všechny ostatní klientské systémy uvedené v souboru [path]``/etc/hosts``. Otevřete soubor [path]``/etc/hosts`` na každém klientu a přidejte názvy hostitelů všech ostatních klientů.

source: Create a Shared Storage Device
cs: Vytvořte sdílené úložné zařízení

source: Each of the clients needs to be able to access a shared disk. The shared disk can be physical hardware connected by ethernet, or you can set up a virtual disk and access it with iSCSI.
cs: Každý klient musí mít přístup ke sdílenému disku. Sdílený disk může být fyzický hardware připojený na ethernet, nebo můžete nastavit virtuální disk a přistupovat k němu pomocí iSCSI.

source: If you use a virtual disk, consider hosting it on a separate system. Do not use a client machine to host the shared storage disk.
cs: Používáte-li virtuální disk, zvažte jeho hostování v odděleném systému. K hostování sdíleného úložného disku nepoužívejte klientský počítač.

source: Download the SAP Installation Software
cs: Stáhněte si instalační software SAP

source: Download the SAP installation media and save a copy on each client. The software that you require differs depending on your environment. For example, if you are using HANA, you need the SAP HANA platform. If you are using Netweaver, you need different packages. These software packages are provided by SAP, not by {suse}.
cs: Stáhněte si instalační médium SAP a uložte kopii na každý klient. Software, který požadujete, se liší podle vašeho prostředí. Například používáte-li HANA, potřebujete platformu SAP HANA. Používáte-li Netweaver, potřebujete odlišné balíčky, které poskytuje společnost SAP, nikoli {suse}.

source: Ensure you have saved the installation software in the same file system location on each client. Alternatively, save it to a shared NFS drive.
cs: Ujistěte se, že jste u každého klienta uložili instalační software v systému souborů ve stejném umístění. Případně ho uložte na sdílenou jednotku NFS.

source: Configure Clients to Use Latest ``module.run``
cs: Nakonfigurujte klienty na použití nejnovějšího ``module.run``

source: Each client needs to be configured to use the latest version of ``module.run``. On each of the client machines, open the ``/etc/salt/minion`` configuration file and add or edit this line:
cs: Každý klient musí být nakonfigurován tak, aby používal nejnovější verzi ``module.run``. Na každém klientském počítači otevřete konfigurační soubor ``/etc/salt/minion`` a přidejte nebo upravte tento řádek:

source: Restart the ``salt-minion`` process to enable the changes:
cs: Restartujte proces ``salt-minion``, aby se změny projevily:

source: Install Additional Disks for HANA
cs: Instalujte další disky pro HANA

source: For the clients that are going to run the HANA database, you require an additional storage device. This device is used to store files required by HANA, which are located in the [path]``/hana/`` directory.
cs: Pro klienty, kteří budou spouštět databázi HANA, potřebujete další úložné zařízení. Toto zařízení se používá k ukládání souborů požadovaných HANA, které jsou umístěny v adresáři [path]``/hana/``.

source: We recommend that this storage device be at least 20{nbsp}GB. For some installations, you might require more, and it is possible to use multiple disks to provide this storage. For comprehensive hardware requirements, see https://documentation.suse.com/sbp/all[].
cs: Doporučujeme, aby toto úložné zařízení mělo alespoň 20{nbsp}GB. U některých instalací možná budete potřebovat více místa; ke zřízení tohoto úložiště je možno použít více disků. Úplné hardwarové požadavky najdete na https://documentation.suse.com/sbp/all[].

source: Register Clients to the Server
cs: Zaregistrujte klienty na serveru

source: First of all, make sure you have an activation key that is associated with the ``SLE-Product-SLES_SAP15`` base channel. For more information about activation keys, see xref:client-configuration:activation-keys.adoc[].
cs: Nejprve se ujistěte, že máte aktivační klíč, který je přidružen k základnímu kanálu ``SLE-Product-SLES_SAP15``. Další informace o aktivačních klíčích viz xref:client-configuration:activation-keys.adoc[].

source: In the {productname} {webui}, navigate to menu:Systems[Bootstrapping]. Fill in the appropriate details, and make sure you check the [guimenu]``Manage System Completely via SSH`` checkbox. In the [guimenu]``Activation Key`` field, select the SLES for SAP activation key.
cs: V {productname} {webui} přejděte do menu:Systems[Bootstrapping] (Systémy[Zavádění]). Vyplňte příslušné podrobnosti a nezapomeňte zaškrtnout [guimenu]``Manage System Completely via SSH`` (Úplná správa systému přes SSH). V poli [guimenu]``Activation Key`` (Aktivační klíč) vyberte aktivační klíč SLES pro SAP.

source: For more information about registering, see xref:client-configuration:registration-webui.adoc[].
cs: Další informace o registraci viz xref:client-configuration:registration-webui.adoc [].

source: Prepare Server
cs: Připravte server

source: Before you start you need to install the {productname} Server. The method for installing the {productname} Server varies depending on your hardware and environment.
cs: Než začnete, musíte nainstalovat server {productname}. Způsob instalace serveru {productname} se liší v závislosti na hardwaru a prostředí.

source: {productname} is installed using the {sles}{nbsp}15 unified installer. During the installation process, when you are prompted for which product to install, select {productname} Server. The server does not need to have the {sles}{nbsp}15 with SAP product installed. For more information about installing the {productname} Server, see xref:installation:install-server-unified.adoc[].
cs: {productname} se instaluje pomocí jednotného instalačního programu {sles}{nbsp}15. Když se během instalace zobrazí výzva, který produkt chcete nainstalovat, vyberte {productname} Server. Server nemusí mít nainstalovaný {sles}{nbsp}15 s produktem SAP. Další informace o instalaci serveru {productname} viz xref: installation:install-server-unified.adoc[].

source: When the {productname} Server is installed, set it up by running the [command]``yast2 susemanager_setup`` command from the command prompt. The setup script prompts you to complete additional details about your server, and give you the URL to use to access the {webui}. For more information about setup, see xref:installation:server-setup.adoc[].
cs: Když je nainstalován {productname} Server, nastavte jej příkazem [command]``yast2 susemanager_setup`` z příkazového řádku. Instalační skript vás vyzve k doplnění dalších podrobností o vašem serveru a zadání adresy URL, která se má použít pro přístup k {webui}. Další informace o nastavení najdete na xref:installation:server-setup.adoc[].

source: You need to do some configuration to set up the {productname} {webui}. In your browser, navigate to the URL of the server, and configure your administration access to the {webui}. For more information about setting up the {webui}, see xref:installation:webui-setup.adoc[].
cs: Chcete-li nastavit {productname} {webui}, musíte provést určitou konfiguraci. Ve svém prohlížeči přejděte na adresu URL serveru a nakonfigurujte přístup pro správu na {webui}. Další informace o nastavení {webui} viz xref:installation:webui-setup.adoc[].

source: Now you can use the {webui} to prepare software channels and activation keys for your clients.
cs: Nyní můžete pomocí {webui} připravit softwarové kanály a aktivační klíče pro své klienty.

source: On the {productname} Server, add the appropriate SAP channels: From the {webui}, add [systemitem]``SUSE Linux Enterprise Server 15 for SAP``.
cs: Na {productname} Server přidejte příslušné kanály SAP: Z {webui} přidejte [systemitem]``SUSE Linux Enterprise Server 15 for SAP``.

source: Synchronize the {productname} Server with the {SCC}. You can do this using the {webui}. Add the new channel to your activation key.
cs: Synchronizujte {productname} Server se {SCC}. Můžete to udělat pomocí {webui}. Přidejte nový kanál do svého aktivačního klíče.

source: To check if a channel has finished synchronizing navigate to menu:Admin[Setup Wizard] and select the [guimenu]``Products`` tab. This dialog displays a completion bar for each product when they are being synchronized.
cs: Chcete-li zkontrolovat, zda je synchronizace kanálu dokončena, přejděte do menu:Admin[Setup Wizard] (Správce[Průvodce nastavením]) a vyberte kartu [guimenu]``Products`` (Produkty). Toto dialogové okno zobrazuje postupovou lištu pro každý právě synchronizovaný produkt.

source: Software channels can be very large. The initial channel synchronization can sometimes take up to several hours.
cs: Softwarové kanály mohou být velmi rozsáhlé. Počáteční synchronizace kanálu může někdy trvat až několik hodin.

source: When the initial synchronization is complete, we recommended you clone the channel before you work with it. This gives you a backup of the original synchronization data.
cs: Když je počáteční synchronizace dokončena, doporučujeme Vám klonovat kanál, než s ním budete pracovat. Získáte tak zálohu původních synchronizačních dat.

source: Quick Start: SAP Overview
cs: Rychlý start: Přehled SAP

source: **Updated:** {docdate}
cs: **Aktualizováno:** {docdate}

source: This guide shows you how to use {productname} to install and configure an SAP cluster. It guides you through setting up a single {productname} Server, preparing your client systems, and configuring the cluster using formulas.
cs: Tato příručka ukazuje, jak používat {productname} k instalaci a konfiguraci clusteru SAP. Provede vás nastavením jednoho {productname} Serveru, přípravou vašich klientských systémů a konfigurací klastru pomocí vzorců.

source: For more information about SAP, see the SAP documentation at https://documentation.suse.com/sles-sap.
cs: Další informace o SAP najdete v dokumentaci SAP na https://documentation.suse.com/sles-sap.

source: For more information about {productname}, see the {productname} documentation at https://documentation.suse.com/suma.
cs: Další informace o produktu {productname} najdete v dokumentaci {productname} na https://documentation.suse.com/suma.
