Repository: uyuni-project/uyuni-docs
Catalog: l10n/po/*/installation/nav-installation-guide.po
Languages: es

source: Installation Guide: {productname} {productnumber}
es: {productname} {productnumber}: Guía de instalación

source: xref:general-requirements.adoc[Requirements]
es: xref:general-requirements.adoc[Requisitos]

source: xref:hardware-requirements.adoc[Hardware Requirements]
es: xref:hardware-requirements.adoc[Requisitos de hardware]

source: xref:uyuni-install-requirements.adoc[Requirements]
es: xref:uyuni-install-requirements.adoc[Requisitos]

source: xref:network-requirements.adoc[Network Requirements]
es: xref:network-requirements.adoc[Requisitos de red]

source: xref:ports.adoc[Required Network Ports]
es: xref:ports.adoc[Puertos de red requeridos]

source: xref:client-requirements.adoc[Client Requirements]
es: xref:client-requirements.adoc[Requisitos del cliente]

source: xref:pubcloud-requirements.adoc[Public Cloud Requirements]
es: xref:pubcloud-requirements.adoc[Requisitos en Nube Pública]

source: xref:install-server-unified.adoc[Install Server]
es: xref:install-server-unified.adoc[Instalar Server]

source: xref:install-proxy-unified.adoc[Install Proxy]
es: xref:install-proxy-unified.adoc[Instalar Proxy]

source: xref:install-vm.adoc[Install Server in a Virtual Machine with JeOS]
es: xref:install-vm.adoc[Instalar Server en una máquina virtual con JeOS]

source: xref:install-uyuni.adoc[Install Uyuni Server with openSUSE]
es: xref:install-uyuni.adoc[Instalar Uyuni Server con openSUSE]

source: xref:install-proxy-uyuni.adoc[Install Uyuni Proxy with openSUSE]
es: xref:install-proxy-uyuni.adoc[Instalar Uyuni Proxy con openSUSE]

source: xref:install-proxy.adoc[Install Proxy from Packages]
es: xref:install-proxy.adoc[Instalar Proxy desde paquetes]

source: xref:install-ibmz.adoc[Install on IBM Z]
es: xref:install-ibmz.adoc[Instalar en IBM Z]

source: xref:server-setup.adoc[Server Setup]
es: xref:server-setup.adoc[Configuración de Server]

source: xref:uyuni-server-setup.adoc[Uyuni Server Setup]
es: xref:uyuni-server-setup.adoc[Configuración de Uyuni Server]

source: xref:proxy-registration.adoc[Proxy Registration]
es: xref:proxy-registration.adoc[Registro de Proxy]

source: xref:proxy-setup.adoc[Proxy Setup]
es: xref:proxy-setup.adoc[Configuración de Proxy]

source: xref:uyuni-proxy-registration.adoc[Uyuni Proxy Registration]
es: xref:uyuni-proxy-registration.adoc[Registro de Uyuni Proxy]

source: xref:uyuni-proxy-setup.adoc[Uyuni Proxy Setup]
es: xref:uyuni-proxy-setup.adoc[Configuración de Uyuni Proxy]

source: xref:webui-setup.adoc[Web Interface Setup]
es: xref:webui-setup.adoc[Configuración de inferfaz web]

source: xref:pubcloud-setup.adoc[Public Cloud Setup]
es: xref:pubcloud-setup.adoc[Configuración en Nube Pública]

source: xref:setup-wizard.adoc[Setup Wizard]
es: xref:setup-wizard.adoc[Asistente de configuración]
